Arquivotheca/solaris11/usr/man/man/usr/share/man/man2/pset_setattr.2
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH pset_setattr 2 "28 Jun 2004" "SunOS 5.11" "System Calls"
.SH NAME
pset_setattr, pset_getattr \- set or get processor set attributes
.SH SYNOPSIS
.LP
.nf
#include <sys/pset.h>

\fBint\fR \fBpset_setattr\fR(\fBpsetid_t\fR \fIpset\fR, \fBuint_t\fR \fIattr\fR);
.fi

.LP
.nf
\fBint\fR \fBpset_getattr\fR(\fBpsetid_t\fR \fIpset\fR, \fBuint_t *\fR\fIattr\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpset_setattr()\fR function sets attributes of the processor set specified by \fIpset\fR.  The bitmask of attributes to be set or cleared is specified by \fIattr\fR.
.sp
.LP
The pset_getattr function returns attributes of the processor set specified by \fIpset\fR. On successful return, \fIattr\fR will contain the bitmask of attributes for the specified processor set.
.sp
.LP
The value of the \fIattr\fR argument is the bitwise inclusive-OR of these attributes, defined in <\fBsys/pset.h\fR>:
.sp
.ne 2
.mk
.na
\fB\fBPSET_NOESCAPE\fR\fR
.ad
.RS 17n
.rt  
Unbinding of LWPs from the processor set with this attribute requires the {\fBPRIV_SYS_RES_CONFIG\fR} privilege to be asserted in the effective set of the calling process.
.RE

.sp
.LP
The binding of LWPs and processes to processor sets is controlled by \fBpset_bind\fR(2). When the \fBPSET_NOESCAPE\fR attribute is cleared, a process calling \fBpset_bind()\fR can clear the processor set binding of any LWP whose real or effective user ID matches its own real of effective user ID.  Setting \fBPSET_NOESCAPE\fR attribute forces \fBpset_bind()\fR to requires the {\fBPRIV_SYS_RES_CONFIG\fR} privilege to be asserted in the effective set of the calling process.
.SH RETURN VALUES
.sp
.LP
Upon successful completion, these functions return 0. Otherwise, -1 is returned and \fBerrno\fR is set to indicate the error.
.SH ERRORS
.sp
.LP
These function will fail if:
.sp
.ne 2
.mk
.na
\fB\fBEFAULT\fR\fR
.ad
.RS 11n
.rt  
The location pointed to by \fIattr\fR was not writable by the user.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 11n
.rt  
An invalid processor set ID was specified.
.sp
The caller is in a non-global zone, the pools facility is active, and the processor is not a member of the zone's pool's processor set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOTSUP\fR\fR
.ad
.RS 11n
.rt  
The pools facility is active. See \fBpooladm\fR(1M) and \fBpool_set_status\fR(3POOL) for information about enabling and disabling the pools facility.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
\fBpooladm\fR(1M), \fBpooladm\fR(1M), \fBpsrset\fR(1M), \fBzoneadm\fR(1M), \fBpset_bind\fR(2), \fBpool_set_status\fR(3POOL), \fBattributes\fR(5)
