Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/iocblk.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.TH iocblk 9S "13 Nov 1996" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
iocblk \- STREAMS data structure for the M_IOCTL message type
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h> 
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH DESCRIPTION
.sp
.LP
The \fBiocblk\fR data structure is used for passing \fBM_IOCTL\fR messages.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
int         ioc_cmd;      /* ioctl command type */
cred_t      *ioc_cr;      /* full credentials */
uint_t      ioc_id;       /* ioctl id */
uint_t      ioc_flag;     /* ioctl flags */
uint_t      ioc_count;    /* count of bytes in data field */
int         ioc_rval;     /* return value */
int         ioc_error;    /* error code */
.fi
.in -2

.SH SEE ALSO
.sp
.LP
\fISTREAMS Programming Guide\fR 
