Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/mac_ring_info.9s
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH mac_ring_info 9S "16 Jun 2011" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
mac_ring_info \- ring information data structure
.SH SYNOPSIS
.LP
.nf
#include <sys/mac_provider.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBmac_ring_info\fR structure is used by a network device driver to describe it's RX and TX rings. The structure is used as an argument to the \fBmr_rget\fR(9E) driver entry point when querying the ring.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
mac_ring_driver_t       mri_driver;
mac_ring_start_t        mri_start;
mac_ring_stop_t         mri_stop;
mac_intr_enable_t       mri_intr_enable;
mac_intr_disable_t      mri_intr_disable;
mac_intr_handle_t       mri_intr_handle;
ddi_intr_handle_t       mri_intr_ddi_handle;
mac_intr_t              mri_intr;
mac_ring_send_t         mri_tx;
mac_ring_pool_t         mri_poll;
mac_ring_stat_t         mri_stat;
uint_t                  mri_flags;
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fImri_driver\fR\fR
.ad
.RS 23n
.rt  
Filled by the driver as handle to the driver's ring structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_start\fR\fR
.ad
.RS 23n
.rt  
The driver entry point for starting a driver's ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_stop\fR\fR
.ad
.RS 23n
.rt  
The driver entry point for stopping a driver ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_intr\fR\fR
.ad
.RS 23n
.rt  
The interrupt description for the driver ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_stat\fR\fR
.ad
.RS 23n
.rt  
The driver entry point for getting statistics for ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_txmri_tx\fR\fR
.ad
.RS 23n
.rt  
The driver entry point for transmitting packet for TX rings.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_poll\fR\fR
.ad
.RS 23n
.rt  
The driver entry point for polling RX ring for packets.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_flags\fR\fR
.ad
.RS 23n
.rt  
A set of flags for describing ring behavior.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_intr_ddi_handle\fR\fR
.ad
.RS 23n
.rt  
The DDI interrupt handle associated with the interrupt for this ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_intr_handle\fR\fR
.ad
.RS 23n
.rt  
The driver specific handle for this driver ring.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_intr_enable\fR\fR
.ad
.RS 23n
.rt  
For RX rings, this driver entry point will enable interrupts again and transition the driver polling to interrupt mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fImri_intr_disable\fR\fR
.ad
.RS 23n
.rt  
For RX rings, this driver entry point will disable interrupts and place the driver into polling mode.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/header
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBmr_rget\fR(9E), \fBmac_capab_rings\fR(9E), \fBmac_group_info\fR(9E), \fBddi_intr_alloc\fR(9F)\fBmac_register\fR(9S)
