Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/mac_group_info.9s
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH mac_group_info 9S "16 Jun 2011" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
mac_group_info \- group Information data structure
.SH SYNOPSIS
.LP
.nf
#include <sys/mac_provider.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBmac_group_info\fR structure is used by a network device driver to describe its ring groups and the groups capabilities. The structure is used as the argument to the \fBmr_gget\fR(9E) driver entry point when querying the group and its capabilities.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
mac_group_driver_t              mgi_driver;
mac_group_start_t               mgi_start;
mac_group_stop_t                mgi_stop;
uint_t                          mgi_count;
mac_intr_t                      mgi_intr;
mac_group_flags_t               mgi_flags;
mac_group_add_macaddr_t         mgi_addmac;
mac_group_rem_macaddr_t         mgi_remmac;
mac_group_add_vlan_filter_t     mgi_add_vlanfilter;
mac_group_rem_vlan_filter_t     mgi_rem_vlanfilter;
mac_group_set_mtu_t             mgi_setmtu;
mac_group_sriov_info_t          mgi_getsriov_info;
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fImgi_driver\fR\fR
.ad
.RS 22n
.rt  
Filled by the driver as handle to the driver's group structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_start\fR\fR
.ad
.RS 22n
.rt  
The driver entry point for starting a driver's ring group.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_stop\fR\fR
.ad
.RS 22n
.rt  
The driver entry point for stopping a driver ring group.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_count\fR\fR
.ad
.RS 22n
.rt  
The number of rings that are members of this ring group.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_intr\fR\fR
.ad
.RS 22n
.rt  
Optional per-group interrupt.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_flags\fR\fR
.ad
.RS 22n
.rt  
Set by the driver to indicate various ring group capabilities including whether the group is the default ring group for the interface, whether the group is a pool of non-active rings, whether the group implements tagging/stripping for all VLANs, or implements transparent VLANs.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_addmac\fR\fR
.ad
.RS 22n
.rt  
The driver entry point to program a MAC address into the driver's hardware for this ring group. This entry is only for RX ring groups. For SRIOV-capable devices, the \fBMAC_GROUP_MACADDR_PRIMARY\fR flag will be used to identify which of the MAC addressed for the group is the primary MAC address of the VF.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_remmac\fR\fR
.ad
.RS 22n
.rt  
The driver entry point to remove a previously programmed MAC address.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_add_vlanfilter\fR\fR
.ad
.RS 22n
.rt  
The driver entry point to add a VLAN filter to the ring group. The \fBMAC_VLAN_FILTER_TAG_ENABLE\fR flag will be set if the group is to provide tagging/stripping offload.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_rem_vlanfilter\fR\fR
.ad
.RS 22n
.rt  
The driver entry point to remove a VLAN filter.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_setmtu\fR\fR
.ad
.RS 22n
.rt  
The driver entry point for the MAC layer to set the MTU for the ring group.
.RE

.sp
.ne 2
.mk
.na
\fB\fImgi_getsriov_info\fR\fR
.ad
.RS 22n
.rt  
The driver entry point to get the SRIOV information associated with this group.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/header
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBmac_capab_rings\fR(9E), \fBmac_group_info\fR(9E), \fBmr_gget\fR(9E), \fBmac_register\fR(9S)
