Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/modlmisc.9s
'\" te
.\"  Copyright (c) 2007 Sun Microsystems, Inc.,  All Rights Reserved
.TH modlmisc 9S "6 Nov 2007" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modlmisc \- linkage structure for loadable miscellaneous modules
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The \fBmodlmisc\fR structure is used by miscellaneous modules to export module specific information to the kernel.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct mod_ops      *misc_modops;        
char                *misc_linkinfo;     
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBmisc_modops\fR\fR
.ad
.RS 17n
.rt  
Must always be initialized to the address of \fBmod_miscops\fR. This member identifies the module as a loadable miscellaneous module.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmisc_linkinfo\fR\fR
.ad
.RS 17n
.rt  
Can be any string up to \fBMODMAXNAMELEN\fR characters (including the terminating \fBNULL\fR characters), and is used to describe the module, but can also contain other information (such as a version number).
.RE

.SH SEE ALSO
.sp
.LP
\fBmodload\fR(1M), \fBmodlinkage\fR(9S)
