Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/modlinkage.9s
'\" te
.\"  Copyright (c) 2000, Sun Microsystems, Inc.,  All Rights Reserved
.TH modlinkage 9S "18 Sep 1992" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modlinkage \- module linkage structure
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h> 
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBmodlinkage\fR structure is provided by the module writer to the routines that install, remove, and retrieve information from a module. See \fB_init\fR(9E), \fB_fini\fR(9E), and \fB_info\fR(9E). 
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
int    ml_rev
void   *ml_linkage[4];
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBml_rev\fR \fR
.ad
.RS 15n
.rt  
Is the revision of the loadable modules system.  This must have the value \fBMODREV_1\fR .
.RE

.sp
.ne 2
.mk
.na
\fB\fBml_linkage\fR \fR
.ad
.RS 15n
.rt  
Is a null-terminated array of pointers to linkage structures. Driver modules have only one linkage structure.
.RE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fB_fini\fR(9E), \fB_info\fR(9E), \fB_init\fR(9E), \fBmodldrv\fR(9S), \fBmodlstrmod\fR(9S) 
.sp
.LP
\fIWriting Device Drivers\fR 
