Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/modldrv.9s
'\" te
.\"  Copyright (C) 2001, Sun Microsystems, Inc., All Rights Reserved
.TH modldrv 9S "5 Mar 2001" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modldrv \- linkage structure for loadable drivers
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h> 
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBmodldrv\fR structure is used by device drivers to export driver specific information to the kernel.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct mod_ops    *drv_modops;     
char              *drv_linkinfo; 
struct dev_ops    *drv_dev_ops;
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBdrv_modops\fR \fR
.ad
.RS 17n
.rt  
Must always be initialized to the address of \fBmod_driverops\fR. This member identifies the module as a loadable driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdrv_linkinfo\fR \fR
.ad
.RS 17n
.rt  
Can be any string up to \fBMODMAXNAMELEN\fR characters (including the terminating NULL character), and is used to describe the module and its version number. This is usually the name of the driver and module version information, but can contain other information as well.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdrv_dev_ops\fR \fR
.ad
.RS 17n
.rt  
Pointer to the driver's \fBdev_ops\fR(9S) structure.
.RE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fBdev_ops\fR(9S), \fBmodlinkage\fR(9S) 
.sp
.LP
\fIWriting Device Drivers\fR 
