Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/net_instance_t.9s
'\" te
.\"  Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved
.TH net_instance_t 9S "1 May 2008" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
net_instance_t \- packet event structure passed through to hooks
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The \fBnet_instance_t\fR data structure defines a collection of instances to be called when relevant events happen within \fBIP\fR. The value returned by the \fBnin_create()\fR function is stored internally and passed back to both the \fBnin_destroy()\fR and \fBnin_shutdown()\fR functions as the second argument. The \fBnetid_t\fR passed through to each function can be used to uniquely identify each instance of \fBIP\fR.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
    char    *nin_name;
     void    *(*nin_create)(const netid_t);
     void    (*nin_destroy)(const netid_t, void *);
     void    (*nin_shutdown)(const netid_t, void *);
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBnin_name\fR\fR
.ad
.RS 16n
.rt  
Name of the owner of the instance.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnin_create\fR\fR
.ad
.RS 16n
.rt  
Function to be called when a new instance of \fBIP\fR is created.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnin_destroy\fR\fR
.ad
.RS 16n
.rt  
Function to be called when an instance of \fBIP\fR is being destroyed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnin_shutdown\fR\fR
.ad
.RS 16n
.rt  
Function to be called when an instance of \fBIP\fR is being shutdown. \fBnin_shutdown()\fR is called before \fBnin_destroy()\fR is called.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnetinfo\fR(9F), \fBattributes\fR(5)
