Arquivotheca/solaris11/usr/man/man/usr/share/man/man9s/usb_dev_qlf_descr.9s
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.TH usb_dev_qlf_descr 9S "5 Jan 2004" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
usb_dev_qlf_descr \- USB device qualifier descriptor
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h> 
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The device qualifier descriptor \fBusb_dev_qlf_descr_t\fR defines how fields of a high speed device's device descriptor would look if that device is run at a different speed.  If a high-speed device is running currently at full/high speed, fields of this descriptor reflect how device descriptor fields would look if speed was changed to high/full. Please refer to section \fI9.6.2\fR of the \fIUSB 2.0\fR specification. The \fIUSB 2.0\fR specification is available at \fIwww.usb.org\fR. 
.sp
.LP
A device descriptor contains the following fields:
.sp
.in +2
.nf
uint8_t     bLength             Size of this descriptor.

uint8_t     bDescriptorType     Set to USB_DESCR_TYPE_DEV_QLF.

uint16_t    bcdUSB              USB specification release
                                number in binary coded decimal.

uint8_t     bDeviceClass        Device class code. 
                                (See \fBusb_dev_descr(9s)\fR.)

uint8_t     bDeviceSubClass     Device subclass code.(See
                                USB 2.0 specification of
                                applicable device class for
                                information.)

uint8_t     bDeviceProtocol     Protocol code.(See
                                USB 2.0 specification of
                                applicable device class for
                                information.)

uint8_t     bMaxPacketSize0     Maximum packet size of
                                endpoint 0.

uint8_t     bNumConfigurations  Number of available
                                configurations.

uint8_t     bReserved           Reserved.
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface StabilityCommitted
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusb_get_alt_if\fR(9F), \fBusb_get_cfg\fR(9F), \fBusb_get_dev_data\fR(9F), \fBusb_get_string_descr\fR(9F). \fBusb_parse_data\fR(9F), \fBusb_ctrl_request\fR(9S), \fBusb_cfg_descr\fR(9S), \fBusb_dev_descr\fR(9S), \fBusb_ep_descr\fR(9S), \fBusb_if_descr\fR(9S), \fBusb_other_speed_cfg_descr\fR(9S), \fBusb_string_descr\fR(9S)
