Arquivotheca/solaris11/usr/man/man/usr/share/man/man7ipp/flowacct.7ipp
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH flowacct 7ipp "21 Mar 2011" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
flowacct \- Flow Accouting module
.SH DESCRIPTION
.sp
.LP
The flow accounting module \fBflowacct\fR enables you to record flow details. You use flow details to gather statistics and/or for billing purposes. Accounting consists of recording flow details in a location you designate and in a format that you can retrieve at a later stage. IPQoS accounting relies on the exacct mechanism to store and retrieve flow information.
.sp
.LP
A flow is defined by the 5-tuple - saddr, sport, daddr, dport and protocol.
.sp
.LP
Typically, the accounting module is the last datapath element in a sequence of actions. Flow attributes include ToS/DS, user id, project id, creation time (time the flow was created), last seen (when pkts for the flow were last seen), action name (instance that recorded the flow information), nbytes and npackets. Attributes are split into groups entitled \fBbasic\fR and \fBextended\fR. The basic group records only the nbytes, npackets and action name, while the extended group is a superset of the basic group and records all attributes. The attributes to be recorded, in addition to the accounting file that contains flow details, are selected using \fBacctadm\fR(1M). The \fBflowacct\fR module does not provide a mechanism to retrieve flow information from the accounting file nor to interpret the retrieved information.
.SS "Statistics"
.sp
.LP
The flowacct module exports the following statistics available through kstat:
.sp
.in +2
.nf
module: flowacct                   instance: <action id>
  name: Flowacct statistics        class <action name>
        bytes_in_tbl               <bytes in the flow table>
        epackets                   <packets in error>
        flows_in_tbl               <flow records in the flow table>
        nbytes                     <number of bytes through this instance>
        npackets                   <number of packets>
        usedmem                    <memory, in bytes, used by the flow table> 
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/ipqos
.TE

.SH SEE ALSO
.sp
.LP
\fBipqosconf\fR(1M), \fBacctadm\fR(1M), \fBlibexacct3LIB\fR, \fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp), \fBipqos\fR(7ipp), \fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp), \fBtswtclmt\fR(7ipp)
