Arquivotheca/solaris11/usr/man/man/usr/share/man/man7ipp/ipgpc.7ipp
'\" te
.\" Copyright (c) 2004, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ipgpc 7ipp "12 Apr 2010" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
ipgpc \- IP Generic Packet Classifier
.SH DESCRIPTION
.sp
.LP
The IP Generic Packet Classifier (\fBipgpc\fR) module provides packet classification at the Solaris IP layer. \fBipgpc\fR is an implementation of the Multi-Field (MF) classifier as described in \fIRFC2475: An Architecture for Differentiated Services\fR.
.sp
.LP
The classifier is configured, at startup or dynamically, using a set of "filters." Filters describe selectors that are matched against input packets that are processed by the classifier. Some selectors feature exact matching data points, while others utilize non-exact or wildcard data points.
.sp
.LP
Each filter is associated with a class describing the next actions to process a packet. There is a many-to-one (M-to-1) mapping relationship between filters and a class. Additionally, each class is aware of which filters are associated with it. A class is configured with a class name and a next action.
.sp
.LP
Unlike traditional classifiers used in edge routers, \fBipgpc\fR is designed for a host or server device. A host-based classifier provides access to more resources and data than edge routers. User, project, and interface information are available at the host.
.SS "Statistics"
.sp
.LP
The \fBipgpc\fR module exports global and per-class statistics (available through kstat:)
.sp
.LP
Global statistics:
.sp
.in +2
.nf
module: ipgpc                           instance:<action id>
name:   ipgpc global stats              class: <action name>
        crtime                          
        snaptime                        
        nbytes                          <number of classified bytes>
        nclasses                        <number of classes>
        nfilters                        <number of filters>
        npackets                        <number of classified packets>
        epackets                        <number of packets in error>
.fi
.in -2

.sp
.LP
Per-class statistics:
.sp
.in +2
.nf
module: ipgpc                           instance:<action id>
name:   <class name>                    class: <action name>
        crtime                          
        snaptime                        
        last match                      <time of last match>
        nbytes                          <number of classified bytes>
        npackets                        <number of classified packets>
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/ipqos/ipqos-config 
.TE

.SH SEE ALSO
.sp
.LP
\fBipqosconf\fR(1M), \fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp), \fBflowacct\fR(7ipp), \fBipqos\fR(7ipp), \fBtokenmt\fR(7ipp), \fBtswtclmt\fR(7ipp)
.sp
.LP
\fIRFC 2475, An Architecture for Differentiated Services\fR S. Blake, D. Black, M. Carlson, E. Davies, Z. Wang, W. Weiss, The Internet Society, 1998.
