Arquivotheca/solaris11/usr/man/man/usr/share/man/man7ipp/tswtclmt.7ipp
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tswtclmt 7ipp "21 Mar 2011" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
tswtclmt \- Time Sliding Window Three Conformance Level Meter
.SH DESCRIPTION
.sp
.LP
The Time Sliding Window Three Conformance level meter (\fBtswtcl\fR) meters a traffic stream and determines the conformance level of its packets.
.sp
.LP
Packets are deemed to belong to one of the three levels, Red, Yellow or Green, depending on the committed and peak rate.
.sp
.LP
The meter provides an estimate of the running average bandwidth. It takes into account burstiness and smoothes out its estimate to  approximate the longer-term measured sending rate of the traffic  stream. 
.sp
.LP
The estimated bandwidth approximates the running average bandwidth of the traffic stream over a specific window (time interval). \fBtswtcl\fR estimates the average bandwidth using a time-based estimator. When a packet arrives for a class, \fBtswtcl\fR re-computes the average rate by using the rate in the last window (time interval) and the size of the arriving packet. The window is then slid to start at the current time (the packet arrival time). If the computed rate is less than the committed configuration parameter, the packet is deemed Green; else if the rate is less than the peak rate, it is Yellow; else Red. To avoid dropping multiple packets within a TCP window, \fBtswtcl\fR probabilistically assigns one of the three conformance level to the packet.
.SS "Statistics"
.sp
.LP
The \fBtswtcl\fR module exports global and per-class statistics through \fBkstat\fR:
.sp
.LP
Global statistics:
.sp
.in +2
.nf
module: tswtclmt                         instance: <action id>
  name: tswtclmt statistics              class <action name>
        green_bits                      <number of bit in green>
        green_packets                   <number of packets in green>
        red_bits                        <number of bits in red>
        red_packets                     <number of packets in red>
        yellow_bits                     <number of bits in yellow>
        yellow_packets                  <number of packets in yellow>
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/ipqos
.TE

.SH SEE ALSO
.sp
.LP
\fBipqosconf\fR(1M), \fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp), \fBflowacct\fR(7ipp), \fBipqos\fR(7ipp), \fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp)
.sp
.LP
\fIRFC 2859, A Time Sliding Window Three Color Marker (TSWTCM)\fR W. Fang, N. Seddigh, B. Nandy, The Internet Society, 2000.
