Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man1m/acpihpd.1m
'\" te
.\" Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
.TH acpihpd 1M "29 Mar 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
acpihpd \- ACPI hot plug daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/platform/i86pc/lib/acpihpd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The ACPI hot plug daemon, \fBacpihpd\fR, is a daemon process that runs on x86 platforms. The daemon is started by the service management facility. It communicates with the \fBsyseventd\fR(1M) and \fBcfgadm\fR(1M) subsystems to handle ACPI events from hotpluggable devices.
.sp
.LP
The service FMRI for \fBacpihpd\fR is:
.sp
.in +2
.nf
svc:/platform/i86pc/acpihpd:default
.fi
.in -2
.sp

.sp
.LP
Note that \fBacpihpd\fR is a private interface.
.SH OPTIONS
.sp
.LP
The \fBacpihpd\fR daemon does not support any options.
.SH ERRORS
.sp
.LP
\fBacpihpd\fR uses \fBsyslog\fR(3C) to report status and error messages. All of the messages are logged with the \fBLOG_DAEMON\fR facility.
.sp
.LP
Error messages are logged with the \fBLOG_ERR\fR and \fBLOG_NOTICE\fR priorities, and informational messages are logged with the \fBLOG_DEBUG\fR priority. The default entries in the \fB/etc/syslog.conf\fR file log all of the error messages to the \fB/var/adm/messages\fR log.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
system/kernel/dynamic-reconfiguration/i86pc
T}
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBcfgadm\fR(1M), \fBinetadm\fR(1M), \fBsvcadm\fR(1M), \fBsyseventd\fR(1M), \fBsyslog\fR(3C), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBacpihpd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/platform/i86pc/acpihpd:default
.fi
.in -2
.sp

