Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man1m/lms.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.TH lms 1M "3 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
lms \- allow applications to access the Intel Active Management Technology
.SH SYNOPSIS
.LP
.nf
\fBlms\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Local Manageability Service, \fBlms\fR, allows applications to access the Intel Active Management Technology (Intel AMT) ME (Management Engine) using the local HECI interface. LMS is dependent on the HECI driver.
.sp
.LP
To use \fBlms\fR, ensure that the Intel AMT Manageability Interface driver is installed and connected to the ME.
.sp
.LP
\fBlms\fR is intended to be run as a daemon. Messages from the service are sent to the \fBsyslog\fR. LMS messages are marked with a source of \fB"LMS"\fR. 
.sp
.LP
For an example of how to enable the LMS service using SMF, see \fBEXAMPLES\fR.
.SH EXAMPLES
.LP
\fBExample 1 \fREnabling the LMS service using SMF
.sp
.LP
The following example enables the LMS service using SMF:

.sp
.in +2
.nf
svcadm enable network/lms
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitysystem/management/intel-amt
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBsmf\fR(5)
