Arquivotheca/solaris11/usr/man/man/usr/share/man/man9p/pm.9p
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pm 9P "30 Jun 2011" "SunOS 5.11" "Kernel Properties for Drivers"
.SH NAME
pm \- Power Management properties
.SH DESCRIPTION
.sp
.LP
The \fBpm-hardware-state\fR property can be used to influence the behavior of the Power Management framework. Its syntax and interpretation is described below.
.sp
.LP
Note that this property is only interpreted by the system immediately after the device has successfully attached. Changes in the property made by the driver after the driver has attached will not be recognized.
.sp
.LP
\fBpm-hardware-state\fR is a string-valued property. The existence of the \fBpm-hardware-state\fR property indicates that a device needs special handling by the Power Management framework with regard to its hardware state.
.sp
.LP
If the value of this property is \fBneeds-suspend-resume\fR, the device has a hardware state that cannot be deduced by the framework. The framework definition of a device with hardware state is one with a \fBreg\fR property. Some drivers, such as \fBSCSI\fR disk and tape drivers, have no \fBreg\fR property but manage devices with "remote" hardware. Such a device must have a \fBpm-hardware-state\fR property with a value of \fBneeds-suspend-resume\fR for the system to identify it as needing a call to its \fBdetach\fR(9E) entry point with command \fBDDI_SUSPEND\fR when system is suspended, and a call to \fBattach\fR(9E) with command \fBDDI_RESUME\fR when system is resumed. For devices using original Power Management interfaces (which are now obsolete) \fBdetach\fR(9E) is also called with \fBDDI_PM_SUSPEND\fR before power is removed from the device, and \fBattach\fR(9E) is called with \fBDDI_PM_RESUME\fR after power is restored. 
.sp
.LP
A value of \fBno-suspend-resume\fR indicates that, in spite of the existence of a \fBreg\fR property, a device has no hardware state that needs saving and restoring. A device exporting this property will not have its \fBdetach()\fR entry point called with command \fBDDI_SUSPEND\fR when system is suspended, nor will its \fBattach()\fR entry point be called with command \fBDDI_RESUME\fR when system is resumed. For devices using the original (and now obsolete) Power Management interfaces, \fBdetach\fR(9E) will not be called with \fBDDI_PM_SUSPEND\fR command before power is removed from the device, nor \fBattach\fR(9E) will be called with \fBDDI_PM_RESUME\fR command after power is restored to the device.
.sp
.LP
A value of \fBparental-suspend-resume\fR indicates that the device does not implement the \fBdetach\fR(9E) \fBDDI_SUSPEND\fR semantics, nor the \fBattach()\fR \fBDDI_RESUME\fR semantics, but that a call should be made up the device tree by the framework to effect the saving and/or restoring of hardware state for this device. For devices using original Power Management interfaces (which are now obsolete), it also indicates that the device does not implement the \fBdetach\fR(9E) \fBDDI_PM_SUSPEND\fR semantics, nor the \fBattach\fR(9E) \fBDDI_PM_RESUME\fR semantics, but that a call should be made up the device tree by the framework to effect the saving and/or restoring the hardware state for this device.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBpm\fR(7D), \fBattach\fR(9E), \fBdetach\fR(9E), \fBpm_busy_component\fR(9F), \fBpm_idle_component\fR(9F), \fBpm-components\fR(9P)
.sp
.LP
\fIWriting Device Drivers\fR 
