Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/lms.1m
'\" te
.\" 版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利。
.TH lms 1M "2009 年 3 月 3 日" "SunOS 5.11" "系统管理命令"
.SH 名称
lms \- 允许应用程序访问 Intel 主动管理技术
.SH 用法概要
.LP
.nf
\fBlms\fR
.fi

.SH 描述
.sp
.LP
本地管理服务 \fBlms\fR 允许应用程序使用本地 HECI 接口访问 Intel 主动管理技术 (Intel Active Management Technology, Intel AMT) ME（Management Engine，管理引擎）。LMS 依赖于 HECI 驱动程序。
.sp
.LP
要使用 \fBlms\fR，请确保已安装 Intel AMT 管理接口驱动程序，并已将其连接至 ME。
.sp
.LP
\fBlms\fR 将作为一个守护进程运行。来自该服务的消息被发送至 \fBsyslog\fR。LMS 消息被标记为以 \fB"LMS"\fR 为来源。 
.sp
.LP
有关如何使用 SMF 启用 LMS 服务的示例，请参见\fB\fR"示例"部分。
.SH 示例
.LP
\fB示例 1 \fR使用 SMF 启用 LMS 服务
.sp
.LP
以下示例使用 SMF 启用 LMS 服务：

.sp
.in +2
.nf
svcadm enable network/lms
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
体系结构x86
_
可用性system/management/intel-amt
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBattributes\fR(5)、\fBsmf\fR(5)
