Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/mkntfs.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可条款，或许可的第二版，或任何更新的版本（根据您的选择）来再发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH mkntfs 1M "2009 年 5 月 27 日" "SunOS 5.11" "系统管理命令"
.SH 名称
mkntfs \- 创建 NTFS 文件系统
.SH 用法概要
.LP
.nf
\fBmkntfs\fR [\fIoptions\fR] \fIdevice\fR [\fInumber_of_sectors\fR]
.fi

.LP
.nf
\fBmkntfs\fR [\fB-C\fR] [\fB-c\fR \fIcluster-size\fR] [\fB-F\fR] [\fB-f\fR] [\fB-H\fR \fIheads\fR] [\fB-h\fR] [\fB-I\fR]
     [\fB-L\fR \fIvolume-label\fR] [\fB-l\fR] [\fB-n\fR] [\fB-p\fR \fIpart-start-sect\fR] [\fB-Q\fR] [\fB-q\fR]
     [\fB-S\fR \fIsectors-per-track\fR] [\fB-s\fR \fIsector-size\fR] [\fB-T\fR] [\fB-V\fR] [\fB-v\fR]
     [\fB-z\fR \fImft-zone-multiplier\fR] [\fB--debug\fR] \fIdevice\fR [\fInumber-of-sectors\fR]
.fi

.SH 描述
.sp
.LP
\fBmkntfs\fR 实用程序用于在设备上（通常是磁盘分区或文件）创建 NTFS 文件系统。\fIdevice\fR 操作数是对应于设备的特殊文件，例如 \fB/dev/dsk/c0d0p0\fR。\fInumber-of-sectors\fR 操作数是设备上的块的数目。如果省略，则 \fBmkntfs\fR 将自动计算文件系统大小。
.SH 选项
.sp
.LP
下面列出了支持的选项。大多数选项都有单字母和全名两种形式。不接受参数的单字母选项可以多个组合到一起。例如，\fB-fv\fR 等效于 \fB-f\fR \fB-v\fR。全名选项可以缩写为其名称的唯一前缀。
.sp
.LP
选项划分为基本选项、高级选项、输出选项和帮助选项，如下所列。
.SS "基本选项"
.sp
.ne 2
.mk
.na
\fB\fB-C\fR、\fB--enable-compression\fR\fR
.ad
.sp .6
.RS 4n
在卷上启用压缩。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--fast\fR 或 \fB-q\fR、\fB--quick\fR\fR
.ad
.sp .6
.RS 4n
执行快速格式化。此选项会跳过卷的零位调整和坏扇区检查。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR、\fB--label\fR \fIstring\fR\fR
.ad
.sp .6
.RS 4n
将文件系统的卷标签设置为 \fIstring\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR、\fB--no-action\fR\fR
.ad
.sp .6
.RS 4n
使 \fBmkntfs\fR 不实际创建文件系统，但显示它创建文件系统时将执行的工作。将执行所有格式化步骤，只是不实际写入到磁盘。
.RE

.SS "高级选项"
.sp
.ne 2
.mk
.na
\fB\fB-c\fR、\fB--cluster-size\fR \fIbytes\fR\fR
.ad
.sp .6
.RS 4n
以字节为单位指定簇的大小。有效的簇大小值是 2 的幂，最小值为 256 且最大值为 65536 字节/簇。如果省略，则 \fBmkntfs\fR 使用 4096 字节作为缺省的簇大小。
.sp
请注意，缺省簇大小设置为至少等于扇区大小，因为一个簇不能小于一个扇区。另请注意，大于 4096 的值有负面影响，即会在卷上禁用压缩。这是由 Windows 使用的 NTFS 压缩算法的局限性导致的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
强制 \fBmkntfs\fR 运行，即使指定的设备不是块特殊设备或者看起来是挂载的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR、\fB--heads\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
指定头的数量。最大值为 65535 (0xffff)。如果省略，\fBmkntfs\fR 会尝试自动确定头的数量。如果该尝试失败，则使用缺省值 0。请注意，要想使 Windows 能够从所创建的卷引导，必须指定 \fInum\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR、\fB--no-indexing\fR\fR
.ad
.sp .6
.RS 4n
在卷上禁用内容索引。此选项仅在 Windows 2000 和更高版本上有意义。Windows NT 4.0 和更早的版本会忽略此选项，因为它们没有实现内容索引。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR、\fB--partition-start\fR \fIsector\fR\fR
.ad
.sp .6
.RS 4n
指定分区开始扇区。最大值为 4294967295 (2^32-1)。如果省略，\fBmkntfs\fR 会尝试自动确定 \fIsector\fR。如果该尝试失败，则使用缺省值 0。请注意，要想使 Windows 能够从所创建的卷引导，必须指定 \fIsector\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR、\fB--sectors-per-track\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
指定每个磁轨的扇区数。最大值为 65535 (0xffff)。如果省略，mkntfs 会尝试自动确定 sectors-per-track 的数目；如果该尝试失败，则使用缺省值 0。请注意，要想使 Windows 能够从所创建的卷引导，必须指定 sectors-per-track。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR、\fB--sector-size\fR \fIbytes\fR\fR
.ad
.sp .6
.RS 4n
以字节为单位指定扇区的大小。有效的扇区大小值为 256、512、1024、2048 和 4096。如果省略，\fBmkntfs\fR 会尝试自动确定 sector-size。如果该尝试失败，则使用每扇区 512 字节这一缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR、\fB--zero-time\fR\fR
.ad
.sp .6
.RS 4n
将时间伪造为 1970 年 1 月 1 日 00:00:00 UTC，而不使用当前的系统时间。这对于调试可能比较有用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR、\fB--mft-zone-multiplier\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
设置主文件表 (master file table, MFT) 区域乘数，它决定了要在卷上使用的 MFT 区域的大小。MFT 区域是在卷的开头为 MFT 保留的区域，它存储着盘上 inode（MFT 记录）。值得注意的是，小文件完全存储在 inode 内；因此，如果您期望将卷用于存储大量非常小的文件，则将区域倍数设置为一个较高的值比较有用。虽然 MFT 区域在 NTFS 驱动程序的运行过程中会根据需要动态调整大小，但是选择一个最佳值可以减少碎片。有效值为 \fB1\fR、\fB2\fR、\fB3\fR 和 \fB4\fR。这些值的含义如下所示：
.sp
.in +2
.nf
MFT zone        MFT zone size
multiplier      (% of volume size)
1       12.5% (default)
2       25.0%
3       37.5%
4       50.0%
.fi
.in -2
.sp

.RE

.SS "输出选项"
.sp
.ne 2
.mk
.na
\fB\fB--debug\fR\fR
.ad
.sp .6
.RS 4n
包括来自 \fB-v\fR 选项的详细输出，以及对于调试 \fBmkntfs\fR 有用的其他输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
以详细模式执行。错误将写入到 stderr，不会向 stdout 写入任何输出。如果在脚本中运行 \fBmkntfs\fR，则此选项比较有用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
以详细模式执行。
.RE

.SS "帮助选项"
.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示选项的列表及每个选项的简要说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR、\fB--license\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBmkntfs\fR 许可信息并退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBmkntfs\fR 版本号并退出。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBntfsprogs\fR(1M)、\fBntfsresize\fR(1M)、\fBntfsundelete\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
\fBmkntfs\fR 是由 Anton Altaparmakov、Richard Russon、Erik Sornes 和 Szabolcs Szakacsits 编写的。
