Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/ntfsprogs.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可第 2 版或（根据您的选择）任何更高版本的条款重新发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsprogs 1M "2009 年 5 月 28 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ntfsprogs \- NTFS 工具列表
.SH 用法概要
.LP
.nf
\fBntfsprogs\fR
.fi

.SH 描述
.sp
.LP
\fBntfsprogs\fR 是基于共享库的一套 NTFS 实用程序的名称。这些工具可以免费使用，并提供完整的源代码。下面列出了这些工具。
.sp
.ne 2
.mk
.na
\fB\fBmkntfs\fR(1M)\fR
.ad
.sp .6
.RS 4n
创建 NTFS 文件系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscat\fR(1M)\fR
.ad
.sp .6
.RS 4n
将文件内容转储至标准输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsclone\fR(1M)\fR
.ad
.sp .6
.RS 4n
有效克隆、备份、恢复或挽救 NTFS。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscluster\fR(1M)\fR
.ad
.sp .6
.RS 4n
找到使用指定扇区或簇的文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscmp\fR(1M)\fR
.ad
.sp .6
.RS 4n
比较两个 NTFS 文件系统并报告差异。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscp\fR(1M)\fR
.ad
.sp .6
.RS 4n
将文件复制到 NTFS 卷。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsfix\fR(1M)\fR
.ad
.sp .6
.RS 4n
检查和修复一些常见错误，清除日志文件并在下次引导操作系统时执行全面检查。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsinfo\fR(1M)\fR
.ad
.sp .6
.RS 4n
显示有关 NTFS 或其中一个文件或目录的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfslabel\fR(1M)\fR
.ad
.sp .6
.RS 4n
显示或设置 NTFS 文件系统的卷标签。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsls\fR(1M)\fR
.ad
.sp .6
.RS 4n
列出有关驻留在 NTFS 上的目录中的文件的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsmount(1M)\fR（非 SunOS 手册页）\fR
.ad
.sp .6
.RS 4n
读写 NTFS 用户空间驱动程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsresize\fR(1M)\fR
.ad
.sp .6
.RS 4n
在不丢失数据的情况下调整 NTFS 的大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsundelete\fR(1M)\fR
.ad
.sp .6
.RS 4n
恢复 NTFS 中的已删除文件。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBparted\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
这些工具由 Anton Altaparmakov、Carmelo Kintana、Cristian Klein、Erik Sornes、Giang Nguyen、Holger Ohmacht、Lode Leroy、Matthew J. Fanto、Per Olofsson、Richard Russon、Szabolcs Szakacsits、Yura Pakhuchiy 和 Yuval Fledel 编写。
