Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/ntfsls.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可第 2 版或（根据您的选择）任何更高版本的条款重新发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsls 1M "2009 年 5 月 28 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ntfsls \- 列出 NTFS 文件系统中的目录内容
.SH 用法概要
.LP
.nf
\fBntfsls\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 描述
.sp
.LP
\fBntfsls\fR 实用程序可列出由 \fBPATH\fR 选项（缺省情况下为根目录）指定的文件的相关信息。\fIdevice\fR（请参见"用法概要"部分）是对应于设备（例如，\fB/dev/dsk/c0d0p0\fR\fI num\fR）的特殊文件或 NTFS 映像文件。
.SH 选项
.sp
.LP
下面列出了支持的选项。大多数选项都有单字母和全名两种形式。不接受参数的单字母选项可以多个组合到一起。例如，\fB-fv\fR 等效于 \fB-f\fR \fB-v\fR。全名选项可以缩写为其名称的唯一前缀。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR，\fB--all\fR\fR
.ad
.sp .6
.RS 4n
显示所有文件。如果未指定此选项，将不显示 POSIX 名称空间中的文件名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR，\fB--classify\fR\fR
.ad
.sp .6
.RS 4n
将下面所示的指示符之一附加到条目中。
.sp
.in +2
.nf
* / = @ |
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR，\fB--force\fR\fR
.ad
.sp .6
.RS 4n
强制执行。例如，在存储于正常文件的 NTFS 分区中运行时需要此选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR，\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示用法信息并退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR，\fB--inode\fR\fR
.ad
.sp .6
.RS 4n
显示每个文件的 inode 编号。这是 NTFS 术语中的 MFT 参考号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR，\fB--long\fR\fR
.ad
.sp .6
.RS 4n
使用长列表格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR，\fB--path\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
要列出其内容的目录或要显示其相关信息的文件（包括路径）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR，\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
抑制某些调试、警告和错误消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR，\fB--recursive\fR\fR
.ad
.sp .6
.RS 4n
显示指定目录下的所有目录的内容。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR，\fB--system\fR\fR
.ad
.sp .6
.RS 4n
除非指定此选项，否则将不会全部列出以美元符号开头的文件，因为这些文件通常是系统文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR，\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示更多调试、警告和错误消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR，\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBntfsls\fR 版本号并退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR，\fB--dos\fR\fR
.ad
.sp .6
.RS 4n
显示短文件名（即 DOS 名称空间中的文件），而不是长文件名（即 WIN32 名称空间中的文件）。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBntfsprogs\fR(1M)、\fBparted\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
此版本的 \fBntfsls\fR 由 Lode Leroy、Anton Altaparmakov、Richard Russon、Carmelo Kintana 和 Giang Nguyen 编写。
