Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/ntfscat.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可第 2 版或（根据您的选择）任何更高版本的条款重新发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscat 1M "2009 年 5 月 28 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ntfscat \- 在标准输出中显示 NTFS 文件和流
.SH 用法概要
.LP
.nf
\fBntfscat\fR [\fIoptions\fR] \fIdevice\fR [\fIfile\fR]
.fi

.SH 描述
.sp
.LP
\fBntfscat\fR 命令读取 NTFS 卷中的文件或流，并在标准输出中显示内容。
.sp
.LP
传递给 \fBntfscat\fR 的文件名将忽略大小写。
.SH 选项
.sp
.LP
下面列出了支持的选项。大多数选项都有单字母和全名两种形式。不接受参数的单字母选项可以多个组合到一起。例如，\fB-fv\fR 等效于 \fB-f\fR \fB-v\fR。全名选项可以缩写为其名称的唯一前缀。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR，\fB--attribute\fR \fItype\fR\fR
.ad
.sp .6
.RS 4n
显示特定属性类型的内容。缺省情况下，将显示未命名的 \fB$DATA\fR 属性。可使用十进制或十六进制格式的编号或者名称指定属性。
.sp
.in +2
.nf
Hex     Decimal Name
0x10    16      "$STANDARD_INFORMATION"
0x20    32      "$ATTRIBUTE_LIST"
0x30    48      "$FILE_NAME"
0x40    64      "$OBJECT_ID"
0x50    80      "$SECURITY_DESCRIPTOR"
0x60    96      "$VOLUME_NAME"
0x70    112     "$VOLUME_INFORMATION"
0x80    128     "$DATA"
0x90    144     "$INDEX_ROOT"
0xA0    160     "$INDEX_ALLOCATION"
0xB0    176     "$BITMAP"
0xC0    192     "$REPARSE_POINT"
0xD0    208     "$EA_INFORMATION"
0xE0    224     "$EA"
0xF0    240     "$PROPERTY_SET"
0x100   256     "$LOGGED_UTILITY_STREAM"
.fi
.in -2
.sp

指定属性名称时可以不带首位上的美元符号 (\fB$\fR)。如果使用 \fB$\fR 符号，必须将名称放在引号内以禁止 shell 解释该名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR，\fB--force\fR\fR
.ad
.sp .6
.RS 4n
覆盖一些明显的缺省值，如不使用挂载的卷。请谨慎使用此选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR，\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示选项列表，其中包含每个选项的简短说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR，\fB--inode\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
通过 inode 编号而不是名称指定文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR，\fB--attribute-name\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
显示由 \fIname\fR 标识的属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR，\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
抑制某些调试、警告和错误消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR，\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示版本号、版权和许可信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR，\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示更多调试、警告和错误消息。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示根目录中的文件的内容
.sp
.LP
以下命令显示 NTFS 卷的根目录中的文件内容。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 boot.ini\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR显示子目录中的文件的内容
.sp
.LP
以下命令显示 NTFS 卷的子目录中的文件内容。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 /winnt/system32/drivers/etc/hosts\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR显示属性的内容
.sp
.LP
以下命令显示根目录 (inode 5) 的 \fB$INDEX_ROOT\fR 属性的内容。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 -a INDEX_ROOT -i 5\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBntfsls\fR(1M)、\fBntfsprogs\fR(1M)、\fBparted\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
\fBntfscat\fR 由 Richard Russon、Anton Altaparmakov 和 Szabolcs Szakacsits 编写。
