Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/ntfscmp.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可第 2 版或（根据您的选择）任何更高版本的条款重新发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscmp 1M "2009 年 5 月 28 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ntfscmp \- 比较两个 NTFS 文件系统并报告差异
.SH 用法概要
.LP
.nf
\fBntfscmp\fR [\fIoptions\fR] \fIdevice1\fR \fIdevice2\fR
.fi

.SH 描述
.sp
.LP
\fBntfscmp\fR 实用程序可比较两个 NTFS 文件系统的所有方面，并报告其发现的所有差异。文件系统可位于块设备中，也可位于映像文件中。\fBntfscmp\fR 可用于卷验证。但其主要目的是成为一种有效的开发工具，用于快速定位、标识和检查对 NTFS 所做的元数据更改的正确性。
.sp
.LP
如果仅关注 NTFS 元数据更改，则比较通过使用 \fBntfsclone\fR(1M) 的 \fB--metadata\fR 选项创建的元数据映像会更方便，因为这样可以消除通常并不感兴趣的时间戳更改。
.sp
.LP
\fBntfscmp\fR 的扼要输出是有意的，因为所提供的信息足以确定确切的差异。通过使用 \fBdiff\fR(1) 可获取更多输出，以比较每个报告的 inode 的 \fBntfsinfo\fR(1M) 的详细输出。
.SH 选项
.sp
.LP
下面列出了支持的选项。这些选项具有单字母形式和全名形式。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR，\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示帮助并退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR，\fB--no-progress-bar\fR\fR
.ad
.sp .6
.RS 4n
不显示进度指示条。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR，\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示更多调试、警告和错误消息。
.RE

.SH 退出状态
.sp
.LP
成功时退出码为 \fB0\fR，否则为非零值。
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBdiff\fR(1)、\fBntfscat\fR(1M)、\fBntfsclone\fR(1M)、\fBntfsinfo\fR(1M)、\fBntfsprogs\fR(1M)、\fBparted\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
\fBntfscmp\fR 由 Szabolcs Szakacsits 编写。
