Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/zh_CN.UTF-8/man1m/ntfscluster.1m
'\" te
.\" 部分版权所有 (c) 2009，Oracle 和/或其附属公司。保留所有权利
.\" 版权所有 (c) 2002-2006 Szabolcs Szakacsits
.\" 版权所有 (c) 2002-2005 Anton Altaparmakov
.\" 版权所有 (c) 2002-2003 Richard Russon
.\" 版权所有 (c) 2007 Yura Pakhuchiy
.\" 本程序是自由软件，您可以遵照自由软件基金会发布的 GNU 通用公共许可第 2 版或（根据您的选择）任何更高版本的条款重新发布和/或修改本程序。本程序本着为用户提供帮助的目的而发布，但不承担任何担保；即使是对适销性或特定用途适用性的暗示担保也不承担。有关详细信息，请参见 GNU 通用公共许可。您应当已随本程序接收到 GNU 通用公共许可的一份副本（在 Linux-NTFS 分发的主目录下的 COPYING 文件中）；如果没有，请致函：Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscluster 1M "2009 年 5 月 28 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ntfscluster \- 标识 NTFS 卷的指定区域中的文件
.SH 用法概要
.LP
.nf
\fBntfscluster\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 描述
.sp
.LP
\fBntfscluster\fR 实用程序具有三种操作模式：\fBinfo\fR、\fBsector\fR 和 \fBcluster\fR，如下所述。
.sp
.ne 2
.mk
.na
\fB\fBInfo\fR\fR
.ad
.sp .6
.RS 4n
缺省模式 \fBinfo\fR 当前尚未实现。实现后它将显示 NTFS 卷的一般信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSector\fR\fR
.ad
.sp .6
.RS 4n
\fBsector\fR 模式显示在指定扇区范围内具有数据的文件的列表。此模式通过 \fB--sector\fR 选项实现。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCluster\fR\fR
.ad
.sp .6
.RS 4n
\fBcluster\fR 模式显示在指定簇范围内具有数据的文件的列表。当簇大小是一个扇区时，等同于 \fBsector\fR 操作模式。此模式通过 \fB--cluster\fR 选项实现。
.RE

.SH 选项
.sp
.LP
下面列出了支持的选项。大多数选项都有单字母和全名两种形式。不接受参数的单字母选项可以多个组合到一起。例如，\fB-fv\fR 等效于 \fB-f\fR \fB-v\fR。全名选项可以缩写为其名称的唯一前缀。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR，\fB--cluster\fR \fIrange\fR\fR
.ad
.sp .6
.RS 4n
显示其数据位于此簇范围内的任何文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR，\fB--filename\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
显示有关 \fIfilename\fR 的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR，\fB--force\fR\fR
.ad
.sp .6
.RS 4n
覆盖一些明显的缺省值，如不使用挂载的卷。请谨慎使用此选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR，\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示选项列表，其中包含每个选项的简短说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR，\fB--inode\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
显示有关此 inode 的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR，\fB--info\fR\fR
.ad
.sp .6
.RS 4n
此选项尚未实现。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR，\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
抑制某些调试、警告和错误消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR，\fB--sector\fR \fIrange\fR\fR
.ad
.sp .6
.RS 4n
显示其数据位于此扇区范围内的任何文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR，\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示版本号、版权和许可信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR，\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示更多调试、警告和错误消息。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示有关卷的信息
.sp
.LP
以下命令将显示有关卷 \fB/dev/dsk/c0d0p1\fR 的信息。

.sp
.in +2
.nf
# \fBntfscluster /dev/dsk/c0d0p1\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR显示簇范围内的文件列表
.sp
.LP
以下命令将在 \fB/dev/dsk/c0d0p1\fR 的前 500 个簇中查找文件。

.sp
.in +2
.nf
# \fBntfscluster -c 0-500 /dev/dsk/c0d0p1\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBntfsinfo\fR(1M)、\fBntfsprogs\fR(1M)、\fBparted\fR(1M)、\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 作者
.sp
.LP
\fBntfscluster\fR 由 Richard Russon 编写，并包含 Anton Altaparmakov 所做的贡献。
