Arquivotheca/solaris11/usr/man/man/usr/share/man/man9e/audio_engine_count.9e
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_engine_count 9E "16 Apr 2010" "SunOS 5.11" "Driver Entry Points"
.SH NAME
audio_engine_count \- return the sample count for an audio engine
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

uint64_t prefix_count(void *\fIstate\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIstate\fR\fR
.ad
.RS 9n
.rt  
pointer to driver supplied soft state
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_engine_count()\fR function returns the frame count of the engine, which is the number of frames transferred by the engine since it was last opened with \fBaudio_engine_open\fR(9E).
.sp
.LP
For recording, this frame count will be the total number of frames that the engine has written into the buffer. For playback, it will be the number of frames that the engine has read from the buffer. This value is monotonically increasing and does not wrap.
.sp
.LP
The \fBaudio_engine_open()\fR function, however, will reset the frame count to 0.
.sp
.LP
The frame count for the engine is related to the offset of the data in the buffer. Both normally increase as the engine makes progress, but the engine index wraps when it reaches the end of the buffer or when the device is stopped and restarted with \fBaudio_engine_stop\fR(9E) and \fBaudio_engine_start\fR(9E).
.SH RETURN VALUES
.sp
.LP
The \fBaudio_engine_count()\fR function returns the number of frames transferred by the engine since \fBaudio_engine_open()\fR was called.
.SH CONTEXT
.sp
.LP
This function may be called from user or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_engine_open\fR(9E), \fBaudio_engine_start\fR(9E), \fBaudio_engine_stop\fR(9E), \fBaudio_engine_ops\fR(9S)
