Arquivotheca/solaris11/usr/man/man/usr/share/man/man9e/audio_engine_start.9e
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_engine_start 9E "16 Apr 2010" "SunOS 5.11" "Driver Entry Points"
.SH NAME
audio_engine_start, audio_engine_stop \- start or stop an audio engine
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

int prefix_start(void *\fIstate\fR);
.fi

.LP
.nf
void prefix_stop(void *\fIstate\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIstate\fR\fR
.ad
.RS 9n
.rt  
pointer to driver supplied soft state
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_engine_start()\fR function starts an audio engine that has been initialized with \fBaudio_engine_open\fR(9E). This initiates actual playback or recording of audio. The data transfer must start at the first frame in the engine's buffer.
.sp
.LP
The \fBaudio_engine_stop()\fR function stops an audio engine that was previously started with \fBaudio_engine_start()\fR and resets the frame index back to 0. The master frame counter for the engine is not reset.
.sp
.LP
Once \fBaudio_engine_stop()\fR returns, the engine must not perform any further data transfers to or from the audio buffer. Furthermore, actual play back or capture of audio associated with the engine shall have ceased.
.SH RETURN VALUES
.sp
.LP
The \fBaudio_engine_start()\fR function returns 0 on success or an error number on failure.
.SH CONTEXT
.sp
.LP
These functions may be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_engine_open\fR(9E), \fBaudio_engine_ops\fR(9S)
