Arquivotheca/solaris11/usr/man/man/usr/share/man/man9e/audio_engine_playahead.9e
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_engine_playahead 9E "16 Apr 2010" "SunOS 5.11" "Driver Entry Points"
.SH NAME
audio_engine_playahead \- return the play-ahead sample count for an audio engine
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

uint_t prefix_playahead(void *\fIstate\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIstate\fR\fR
.ad
.RS 9n
.rt  
pointer to driver supplied soft state.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_engine_playahead()\fR function returns a driver-supplied hint indicating how many frames the framework should queue up to the device to avoid device underruns. This entry point is optional and \fINULL\fR may be supplied, in which case the framework will assume a default that is reasonable for most devices.
.sp
.LP
This entry point is most appropriate for devices with inconsistent scheduling, such as emulated devices or devices backed by user programs. For these devices, this entry point allows the driver to supply a larger value than the normal default.
.SH RETURN VALUES
.sp
.LP
The \fBaudio_engine_playahead()\fR function returns the number of frames the framework should queue for playback.
.SH USAGE
.sp
.LP
This function is only called after the device is first opened; the dynamically changing values are not supported.
.SH CONTEXT
.sp
.LP
This function may be called from user or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_engine_ops\fR(9S)
