Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/dsbitmap.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH dsbitmap 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
dsbitmap \- 计算 Availability Suite 位图卷的大小
.SH 用法概要
.LP
.nf
\fBdsbitmap\fR \fB-h\fR
.fi

.LP
.nf
\fBdsbitmap\fR \fB-p\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.LP
.nf
\fBdsbitmap\fR \fB-r\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.SH 描述
.sp
.LP
\fBdsbitmap\fR 命令计算需要与指定数据卷一起使用的 Availability Suite 位图卷的大小。
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
列出 \fBdsbitmap\fR 命令的用法消息
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fB\fIdata_volume\fR\fR \fB[\fIbitmap_volume\fR]\fR\fR
.ad
.sp .6
.RS 4n
对于给定的 \fIdata_volume\fR，\fBdsbitmap\fR 计算并显示相关 Availability Suite Point in Time 位图卷的所需大小。显示所有可能的 Availability Suite Point in Time 集配置的位图卷大小。这些配置包括独立投影、完整大小依赖投影和紧凑型依赖投影。如果提供可选的 \fIbitmap_volume\fR 参数，\fBdsbitmap\fR 将确定该卷是否足够大，以用作 \fIdata_volume\fR 的位图卷。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fB\fIdata_volume\fR\fR \fB[\fIbitmap_volume\fR]\fR\fR
.ad
.sp .6
.RS 4n
对于给定的 \fIdata_volume\fR，\fBdsbitmap\fR 计算并显示相关 Availability Suite Remote Mirror 位图卷的所需大小。显示所有可能的 Availability Suite Remote Mirror 集配置的位图卷大小。这些配置包括与内存队列、磁盘队列和 32 位引用计数的同步复制和异步复制。如果提供可选的 \fIbitmap_volume\fR 参数，\fBdsbitmap\fR 将确定该卷是否足够大，以用作 \fIdata_volume\fR 的位图卷。
.RE

.SH 用法
.sp
.LP
通常，系统管理员在配置 Sun StorageTek Availability Suite 软件的初始阶段使用 \fBdsbitmap\fR，以便确定所需的位图卷大小，然后检查已创建的位图卷是否合适。
.SH 退出状态
.sp
.LP
将返回下列退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
成功完成。如果指定了位图卷的名称，则该卷足够大以供所有潜在用途。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
出现错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 13n
.rt  
命令行上提供了一个无效选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 13n
.rt  
如果指定的位图卷要作为 Availability Suite Remote Mirror 位图来用于磁盘队列的异步集，则不足够大，但是如果要用于所有其他 Remote Mirror 集配置，则足够大。
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 13n
.rt  
指定的位图卷不够大，不能作为 Availability Suite Remote Mirror 位图用于任何 Remote Mirror 集配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 13n
.rt  
指定的位图卷不够大，不能作为 Availability Suite Remote Mirror 位图用于任何 Remote Mirror 集配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 13n
.rt  
如果指定的位图卷要作为 Availability Suite Point in Time 位图来用于紧凑型依赖投影，则不足够大，但是如果要用于所有其他 Point in Time 集配置，则足够大。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-cache-management
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBiiadm\fR(1M)、\fBsndradm\fR(1M)、\fBattributes\fR(5)
