Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/dscfg.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH dscfg 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
dscfg \- Sun StorageTek Availability Suite 软件的配置工具
.SH 用法概要
.LP
.nf
\fBdscfg\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-L\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-h\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-i\fR [\fB-p\fR \fIparser_config_file\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-a\fR \fIconfig_file\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR] \fB-s\fR \fIconfig_location\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-D\fR \fIdgname\fR
.fi

.SH 描述
.sp
.LP
\fBdscfg\fR 命令通过提供用于初始化、列出、格式化、恢复配置数据库的工具来控制 Availability Suite 配置。 
.SH 选项
.sp
.LP
如果没有指定选项，\fBdscfg\fR 将显示当前本地配置位置。\fBdscfg\fR 命令支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
显示用于控制对配置数据库的访问权限的锁的状态。如果配置数据库被锁定，则锁的类型（读取或写入）将随持有锁的进程的进程 ID 一起显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBdscfg\fR 命令的用法消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
初始化配置数据库。此选项删除之前或当前的配置信息时，将在继续操作之前提示您确认该删除操作。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIparser_config_file\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-i\fR 选项一起使用时，\fBdscfg\fR 将解析器配置文件装入持久性配置，它将重新格式化配置数据库。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
将指定的 \fIconfig_file\fR 恢复到配置中。此选项不会对该文件执行任何错误检查。使用此选项将使配置文件无效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
以适合 \fB-a\fR 选项的格式列出当前配置数据库的内容。与 \fB-s\fR 选项结合使用时，它将显示传递给 \fB-s\fR 选项的位置中存储的内容，但不设置配置位置。
.RE

.sp
.LP
以下选项仅适用于 Sun Cluster 配置的系统。\fIgroup\fR 可以是 Sun Cluster 设备组或者是表示本地设备的 '-'。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIgroup\fR\fR
.ad
.sp .6
.RS 4n
显示群集配置数据库的位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-i\fR\fR
.ad
.sp .6
.RS 4n
初始化仅与指定组相关的配置数据库条目。此选项删除之前或当前的配置信息时，将在继续操作之前提示您确认该删除操作。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-p\fR\ \fIparser_config_file\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-i\fR 选项一起使用时，\fBdscfg\fR 将解析器配置文件装入持久性配置，它将重新格式化仅与指定组相关的配置数据库条目。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \ \fIgroup\fR\ \fB-a\fR\ \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
将指定的 \fIconfig_file\fR 恢复到仅与指定组相关的配置数据库条目。此选项不会对该文件执行任何错误检查。使用此选项将使配置文件无效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-l\fR\fR
.ad
.sp .6
.RS 4n
列出与指定资源组相关的当前配置数据库的内容。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \ \fIgroup\fR\ \fB-s\fR\ \fIconfig_file_location\fR\fR
.ad
.sp .6
.RS 4n
指定 Sun Cluster 配置数据库所驻留的位置，该位置应该是 DID 设备。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIdevice_group\fR\fR
.ad
.sp .6
.RS 4n
检查指定的 \fIdevice_group\fR 是否被 Sun Cluster 已知以及在该节点上是否可用。它显示表明设备组状态的信息并返回以下值， 
.sp
（使用回显 $? 检索返回值）： 
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
设备组位于 Sun Cluster 中，且在该节点上处于活动状态； 
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
设备组位于 Sun Cluster 中，但在其他节点上处于活动状态； 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.RS 13n
.rt  
设备组不位于 Sun Cluster 中。
.RE

.RE

.SH 用法
.sp
.LP
\fBdscfg\fR 命令通常从其他脚本（如软件包安装脚本）和 \fBdscfgadm\fR(1M) 运行。它不适用于常规使用。对于 \fBdscfgadm\fR 不包含的 \fBdscfg\fR 的用法，请参见《\fIAvailability Suite Troubleshooting Guide\fR》。
.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_format\fR\fR
.ad
.sp .6
.RS 4n
解析器配置文件
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_local\fR\fR
.ad
.sp .6
.RS 4n
没有群集标记的所有条目的配置位置
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_cluster\fR\fR
.ad
.sp .6
.RS 4n
指定 Sun Cluster 配置数据库的位置的引用文件。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-cache-management
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdscfgadm\fR(1M)、\fBiiadm\fR(1M)、\fBscmadm\fR(1M)、\fBsndradm\fR(1M)、\fBsvadm\fR(1M)、\fBds.log\fR(4)、\fBattributes\fR(5)
