Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/dscfgadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH dscfgadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
dscfgadm \- Availability Suite 配置位置和服务的管理命令
.SH 用法概要
.LP
.nf
\fBdscfgadm\fR \fB-i\fR
.fi

.LP
.nf
\fBdscfgadm\fR \fB-e\fR [\fB-r\fR] [\fB-p\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-d\fR [\fB-r\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-s\fR
.fi

.SH 描述
.sp
.LP
\fBdscfgadm\fR 命令通过提供用于设置配置位置并启用和禁用 Availability Suite 服务的工具，来控制 Availability Suite 配置位置和服务。
.SH 选项
.sp
.LP
如果没有为 \fBdscfgadm\fR 命令指定任何参数，实用程序将交互式逐步完成设置配置位置并启动服务的过程。初始化配置位置以进行使用之前，将验证该位置以确保其满足大小和文件类型等标准。
.sp
.LP
\fBdscfgadm\fR 命令支持以下选项。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR [\fB-r\fR ]\fR
.ad
.sp .6
.RS 4n
禁用 Availability Suite SMF 服务。包括停止守护进程和暂停当前在 Availability Suite 软件下启用的任何 Point-in-Time Copy 或 Remote Mirror 集。不与其他选项一起执行时，\fB-d\fR 选项将禁用所有 Availability Suite 服务。系统引导过程中一直保持该设置。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
传递给 \fB-d\fR 或 \fB-e\fR 选项时，仅对 Remote Mirror 服务起作用。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR [\fB-r\fR ] [\fB-p\fR]\fR
.ad
.sp .6
.RS 4n
启用 Availability Suite SMF 服务。包括启动守护进程和恢复之前已在 Availability Suite 软件下配置的任何 Point-in-Time Copy 或 Remote Mirror 集。不与其他选项一起执行时，\fB-e\fR 选项将启用所有 Availability Suite 服务。系统引导过程中一直保持该设置。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
传递给 \fB-d\fR 或 \fB-e\fR 选项时，仅对 Remote Mirror 服务起作用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
传递给 \fB-e\fR 选项时，仅启用 Point-in-Time Copy 服务。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
显示有关 Availability Suite SMF 服务的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
允许您设置包含特定于 Sun Cluster 配置的信息的配置数据库的位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
执行程序时，显示详细调试信息。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-cache-management
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdscfg\fR(1M)、\fBiiadm\fR(1M)、\fBscmadm\fR(1M)、\fBsndradm\fR(1M)、\fBsvadm\fR(1M)、\fBattributes\fR(5)
