Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/hal-get-property.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates.保留所有权利。
.TH hal-get-property 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
hal-get-property, hal-set-property \-  获取和设置 HAL 设备属性
.SH 用法概要
.LP
.nf
\fBhal-get-property\fR \fB--udi\fR \fIudi\fR \fB--key\fR \fIkey\fR [\fB--help\fR] [\fB--verbose\fR]
 [\fB--version\fR]
.fi

.LP
.nf
\fBhal-set-property\fR  \fB--udi\fR \fIudi\fR \fB--key\fR \fIkey\fR {\fB--int\fR \fIvalue\fR |  \fB--uint64\fR \fIvalue\fR
 |  \fB--string\fR \fIvalue\fR |  \fB--bool\fR \fIvalue\fR |  \fB--strlist-pre\fR \fIvalue\fR
 |  \fB--strlist-post\fR \fIvalue\fR |  \fB--strlist-rem\fR \fIvalue\fR |  \fB--double\fR \fIvalue\fR
 |  \fB--remove\fR \fIvalue\fR} [\fB--help\fR] [\fB--version\fR]
.fi

.SH 描述
.sp
.LP
硬件抽象层 (Hardware Abstraction Layer, HAL) 提供了连接到系统的各种硬件的视图。当硬件配置通过热插拔或其他机制发生更改时，此视图也将随之进行动态更新。HAL 将硬件表示为设备对象。设备对象由唯一标识符进行标识并带有一组键/值对，这些键/值对称为设备属性。有些属性源自实际硬件，有些属性由设备信息文件（\fB\&.fdi\fR 文件）合并而来，有些属性与实际设备配置相关。
.sp
.LP
可以使用 \fBhal-get-property\fR 和 \fBhal-set-property\fR 命令获取和设置符合 HAL 规范的硬件的属性。
.SH 选项
.sp
.LP
所支持的选项如下： 
.sp
.ne 2
.mk
.na
\fB\fB--udi\fR \fIudi\fR\fR
.ad
.sp .6
.RS 4n
唯一设备 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--key\fR \fIkey\fR\fR
.ad
.sp .6
.RS 4n
要设置的属性的键。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--int\fR\fR
.ad
.sp .6
.RS 4n
将值设置为一个整数。接受前缀为 \fB0x\fR 或 \fBx\fR 的十进制或十六进制值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--uint64\fR\fR
.ad
.sp .6
.RS 4n
将值设置为一个整数。接受前缀为 \fB0x\fR 或 \fBx\fR 的十进制或十六进制值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--string\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
将值设置为一个字符串。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--double\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
将值设置为一个浮点数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--boolean\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
将值设置为一个布尔值，即 true 或 false
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-pre\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
将一个字符串附加到列表的开头。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-post\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
将一个字符串附加到列表的末尾。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-rem\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
从列表中删除一个字符串。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--remove\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指示应删除的属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示版本并退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示选项列表并退出
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/hal
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBhald\fR(1M)、\fBattributes\fR(5)、\fBhal\fR(5)
