Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/halt.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH halt 1M "2011 年 6 月 25 日" "SunOS 5.11" "系统管理命令"
.SH 名称
halt, poweroff \- 停止处理器
.SH 用法概要
.LP
.nf
\fB/usr/sbin/halt\fR [\fB-dlnqy\fR]
.fi

.LP
.nf
\fB/usr/sbin/poweroff\fR [\fB-dlnqy\fR]
.fi

.SH 描述
.sp
.LP
\fBhalt\fR 和 \fBpoweroff\fR 实用程序将所有待处理信息写入磁盘，然后停止处理器。如果可能，\fBpoweroff\fR 实用程序会关闭计算机电源。
.sp
.LP
\fBhalt\fR 和 \fBpoweroff\fR 实用程序通常将系统关机信息记录到系统日志守护进程 \fBsyslogd\fR(1M) 中，并且会在登录记帐文件 \fB/var/adm/wtmpx\fR 中放置一条关机记录。如果提供了 \fB-n\fR 或 \fB-q\fR 选项，则会禁止这些操作。
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
强制在重新引导前执行系统故障转储。有关配置系统故障转储的信息，请参见 \fBdumpadm\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
禁止向系统日志守护进程 \fBsyslogd\fR(1M) 发送有关谁执行了 \fBhalt\fR 的消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
阻止在停止前执行 \fBsync\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
快速停止。没有尝试正常关机。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.RS 6n
.rt  
停止系统，即使是通过拨号终端停止。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.RS 18n
.rt  
有关用户访问和管理信息的历史记录。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBdumpadm\fR(1M)、\fBinit\fR(1M)、\fBreboot\fR(1M)、\fBshutdown\fR(1M)、\fBsync\fR(1M)、\fBsyslogd\fR(1M)、\fBinittab\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBhalt\fR 和 \fBpoweroff\fR 实用程序不会完全关闭 \fBsmf\fR(5) 服务，不执行 \fB/etc/rc\fInum\fR.d\fR 中的脚本，也不执行 \fBinittab\fR(4) 中的关机操作。要确保完全关闭系统服务，请使用 \fBshutdown\fR(1M) 或 \fBinit\fR(1M) 重新引导 Solaris 系统。
