Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/idmapd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH idmapd 1M "2007 年 6 月 5 日" "SunOS 5.11" "系统管理命令"
.SH 名称
idmapd \- 本机身份映射服务守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/idmapd\fR
.fi

.SH 描述
.sp
.LP
\fBidmapd\fR 守护进程可以将 Windows 安全标识符 (Security Identifier, SID) 映射到 POSIX 标识符 (UID/GID)，或者进行反向映射。
.sp
.LP
\fBidmap\fR(1M) 实用程序提供了 \fBidmapd\fR 守护进程的前端。
.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/var/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
用于存储本地的基于名称的 ID 映射规则的数据库。该数据库的内容是专用的。不应该直接访问或修改该数据库。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
用于缓存由临时 ID 映射和基于名称的映射生成的 ID 映射的数据库。该数据库的内容是专用的。不应该直接访问或修改该数据库。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性请参见下文。
.TE

.sp
.LP
这些组件的接口稳定性如下所述：
.sp
.ne 2
.mk
.na
\fB\fBsvc:/system/idmap\fR\fR
.ad
.sp .6
.RS 4n
Committed（已确定）
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
Project Private（项目专用）
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
Project Private（项目专用）
.RE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBidmap\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBdefaultdomain\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBidmapd\fR 服务由服务管理工具 (service management facility, SMF) 管理。\fBidmapd\fR 服务的服务标识符是 \fBsvc:/system/idmap\fR。
.sp
.LP
使用 \fBsvcadm\fR 命令执行此服务的管理操作，如启用、禁用或重新启动服务。这些操作需要 \fBsolaris.smf.manage.idmap\fR 授权。使用 \fBsvcs\fR 命令查询服务状态。
.sp
.LP
在将来的 Solaris 操作系统发行版中，该守护进程的功能可能会更改。
