Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/installgrub.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH installgrub 1M "2011 年 3 月 31 日" "SunOS 5.11" "系统管理命令"
.SH 名称
installgrub \- 在磁盘分区中安装 GRUB
.SH 用法概要
.LP
.nf
\fB/usr/sbin/installgrub\fR [\fB-fm\fR] \fIstage1\fR \fIstage2\fR \fIraw-device\fR
.fi

.SH 描述
.sp
.LP
\fBinstallgrub\fR 命令是一个仅适用于 x86 的程序。GRUB 代表 GRand Unified Bootloader。
.sp
.LP
\fBinstallgrub\fR 在磁盘分区的引导区域上安装 GRUB 阶段 1 和阶段 2 文件。如果指定了 \fB-m\fR 选项，则 \fBinstallgrub\fR 将在磁盘的主引导扇区上安装阶段 1 文件。
.SH 选项
.sp
.LP
\fBinstallgrub\fR 命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
覆盖主引导扇区时抑制交互。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
以交互方式在主引导扇区上安装 GRUB \fIstage1\fR。如果 Solaris 安装在扩展分区上，则必须使用此选项。
.RE

.SH 操作数
.sp
.LP
\fBinstallgrub\fR 命令接受下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIstage1\fR\fR
.ad
.RS 14n
.rt  
GRUB 阶段 1 文件的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fIstage2\fR\fR
.ad
.RS 14n
.rt  
GRUB 阶段 2 文件的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fIraw-device\fR\fR
.ad
.RS 14n
.rt  
要在其上安装 GRUB 代码的设备的名称。它必须是可读写的字符设备。对于磁盘设备，请指定 GRUB 菜单文件所在的分片。（对于 Solaris，它是根分片。） 
.RE

.SH 示例
.LP
\fB示例 1 \fR在硬盘分片上安装 GRUB
.sp
.LP
以下命令在根分片为 \fBc0d0s0\fR 的系统上安装 GRUB：

.sp
.in +2
.nf
example# /usr/sbin/installgrub /boot/grub/stage1 \e
         /boot/grub/stage2 /dev/rdsk/c0d0s0
.fi
.in -2

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/boot/grub\fR\fR
.ad
.RS 14n
.rt  
GRUB 文件所驻留的目录。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBboot\fR(1M)、\fBfdisk\fR(1M)、\fBfmthard\fR(1M)、\fBkernel\fR(1M)、\fBattributes\fR(5)
.SH 警告
.sp
.LP
在主引导扇区上安装 GRUB（\fB-m\fR 选项）会覆盖计算机上当前已安装的任何引导管理器。无论哪个 \fBfdisk\fR 分区处于活动状态，系统都始终在 Solaris 分区上引导 GRUB。
