Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/isnsadm.1m
'\" te
.\" 版权所有 (c) 2010，Oracle 和/或其附属公司。保留所有权利。
.TH isnsadm 1M "2010 年 3 月 10 日" "SunOS 5.11" "系统管理命令"
.SH 名称
isnsadm \- 管理 Internet 存储名称服务 (Internet Storage Name Service, iSNS) 服务器
.SH 用法概要
.LP
.nf
\fBisnsadm\fR \fIoptions\fR
.fi

.LP
.nf
\fBisnsadm\fR \fIsubcommand\fR [\fIsubcommand_options\fR] [\fIoperand\fR]
.fi

.SH 描述
.sp
.LP
\fBisnsadm\fR 命令是 Internet 存储名称服务 (Internet Storage Name Service, iSNS) 服务器的命令行接口。\fBisnsadm\fR 包括一组子命令（将分别在它们的各自部分中进行描述），每个子命令用于完成 iSNS 服务器管理功能中的一种。
.sp
.LP
对于将更改 iSNS 配置的任何操作都需要 \fBsolaris.isnsmgr.write\fR 授权。请参见 \fBisns\fR(1M )。对于读取操作，该命令不需要特殊的授权。
.sp
.LP
\fBisnsadm\fR 有一组常规选项和一组特定于子命令的选项。第一个类别在"选项"部分中进行了描述，第二个类别在每个子命令描述上下文中进行了描述。
.SH 选项
.sp
.LP
所支持的选项如下： 
.sp
.ne 2
.mk
.na
\fB\fB-?\fR, \fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示上下文帮助。停止解析任何后续参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR, \fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示版本信息。停止解析任何后续参数。
.RE

.SH 操作数
.sp
.LP
一个或多个 \fBisnsadm\fR 子命令使用下列操作数。
.sp
.ne 2
.mk
.na
\fB\fIiscsi-node-name\fR\fR
.ad
.sp .6
.RS 4n
iSCSI 目标或 iSCSI 启动器符号名称。最大长度为 223 个字符的字符串。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
搜索域符号名称。最大长度为 256 个字符的字符串。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
搜索域集符号名称。最大长度为 256 个字符的字符串。
.RE

.SH 子命令
.sp
.LP
\fBisnsadm\fR 命令支持下面描述的子命令。
.SS "\fBadd-dd\fR"
.sp
.LP
\fBadd-dd\fR 子命令用于将搜索域添加到搜索域集中。
.sp
.LP
\fBadd-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm add-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-dd\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
指定一个搜索域集。
.RE

.SS "\fBadd-node\fR"
.sp
.LP
\fBadd-node\fR 子命令用于将节点添加到指定的搜索域。
.sp
.LP
\fBadd-node\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm add-node \fIoption\fR \fIiscsi-node-name\fR,...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-node\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-d\fR,\fB--dd\fR \fIdiscovery-domain-name \fR\fR
.ad
.sp .6
.RS 4n
指定一个搜索域。
.RE

.SS "\fBcreate-dd\fR"
.sp
.LP
\fBcreate-dd\fR 子命令用于使用您指定的名称创建搜索域。
.sp
.LP
\fBcreate-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm create-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd\fR 没有选项。
.SS "\fBcreate-dd-set\fR"
.sp
.LP
\fBcreate-dd-set\fR 子命令用于使用您指定的名称创建搜索域集。
.sp
.LP
\fBcreate-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm create-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd-set\fR 没有选项。
.SS "\fBdelete-dd\fR"
.sp
.LP
\fBdelete-dd\fR 子命令用于删除具有您指定的名称的搜索域。
.sp
.LP
\fBdelete-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm delete-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd\fR 没有选项。
.SS "\fBdelete-dd-set\fR"
.sp
.LP
\fBdelete-dd-set\fR 子命令用于删除具有您指定的名称的搜索域集。
.sp
.LP
\fBdelete-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm delete-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd-set\fR 没有选项。
.SS "\fBdisable-dd-set\fR"
.sp
.LP
\fBdisable-dd-set\fR 子命令用于禁用搜索域集。
.sp
.LP
\fBdisable-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm disable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdisable-dd-set\fR 没有选项。
.SS "\fBenable-dd-set\fR"
.sp
.LP
\fBenable-dd-set\fR 子命令用于启用搜索域集。
.sp
.LP
\fBenable-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm enable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBenable-dd-set\fR 没有选项。
.SS "\fBlist-dd\fR"
.sp
.LP
\fBlist-dd\fR 子命令用于显示关于搜索域的信息。如果未指定操作数，则它会列出 iSNS 服务器上当前存在的所有搜索域。
.sp
.LP
\fBlist-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm list-dd [\fIoption\fR] [\fIdiscovery-domain-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示搜索域的成员内容。
.RE

.SS "\fBlist-dd-set\fR"
.sp
.LP
\fBlist-dd-set\fR 子命令用于列出 iSNS 服务器上存在的搜索域集（包括启用的和禁用的）。请注意，没有 \fBdd-set\fR 注册。如果未指定操作数，它将列出所有搜索域集。
.sp
.LP
\fBlist-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm list-dd-set [\fIoption\fR] [\fIdiscovery-domain-set-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd-set\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示搜索域集内的所有搜索域。
.RE

.SS "\fBlist-node\fR"
.sp
.LP
\fBlist-node\fR 子命令用于显示当前已向 iSNS 服务器注册的节点的相关信息，以及未向其注册且属于非缺省搜索域的节点的相关信息。对于后一种情况，节点将其类型字段显示为 \fBunknown\fR（未知）。如果未指定操作数，\fBlist-node\fR 将列出 iSNS 服务器已知的所有节点。
.sp
.LP
\fBlist-node\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm list-node [\fIoptions\fR] [\fIiscsi-node-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-node\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--target\fR\fR
.ad
.sp .6
.RS 4n
对列表进行过滤以便只显示 iSCSI 目标节点。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR, \fB--initiator\fR\fR
.ad
.sp .6
.RS 4n
对列表进行过滤以便只显示 iSCSI 启动器节点。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
显示节点的详细信息。不使用此选项时，只会显示名称、别名和类型信息。
.RE

.SS "\fBmodify-dd\fR"
.sp
.LP
\fBmodify-dd\fR 子命令用于修改指定的搜索域的属性。
.sp
.LP
\fBmodify-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm modify-dd \fIoption\fR \fIdiscovery-domain-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
指定要向现有的搜索域应用的搜索域新名称。
.RE

.SS "\fBmodify-dd-set\fR"
.sp
.LP
\fBmodify-dd-set\fR 子命令用于修改搜索域集。
.sp
.LP
\fBmodify-dd-set\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm modify-dd-set \fIoption\fR \fIdiscovery-domain-set-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd-set\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
指定要向现有的搜索域集应用的搜索域集新名称。
.RE

.SS "\fBremove-dd\fR"
.sp
.LP
\fBremove-dd\fR 子命令用于删除与指定的搜索域集的关联。
.sp
.LP
\fBremove-dd\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm remove-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-dd\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
指定将从中删除搜索域的搜索域集。
.RE

.SS "\fBremove-node\fR"
.sp
.LP
\fBremove-node\fR 子命令用于删除节点。
.sp
.LP
\fBremove-node\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm remove-node \fIoption\fR \fIiscsi-node-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-node\fR 具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
指定将从中删除节点的搜索域。
.RE

.SS "\fBshow-config\fR"
.sp
.LP
\fBshow-config\fR 子命令用于显示 iSNS 服务器的管理设置。注意，可以通过服务管理工具（请参见 \fBsmf\fR(5)）修改这些设置。请参见 \fBisns\fR(1M)。
.sp
.LP
\fBshow-config\fR 子命令的语法如下所示：
.sp
.in +2
.nf
# \fBisnsadm show-config\fR
.fi
.in -2
.sp

.sp
.LP
\fBshow-config\fR 没有选项。
.SH 示例
.LP
\fB示例 1 \fR显示客户机
.sp
.LP
下面的示例使用 \fBlist-node\fR 子命令显示客户机。

.sp
.in +2
.nf
# \fBisnsadm list-node -v\fR
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
        Alias: STK5320_NAS
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        Alias: 
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Alias: host-x2100
        Type: Initiator
        Network Entity: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Portal: 172.20.236.123:58530
                Portal Group: 1
        DD Name: Default
.fi
.in -2
.sp

.LP
\fB示例 2 \fR显示搜索域
.sp
.LP
下面的示例使用 \fBlist-dd\fR 子命令显示搜索域。

.sp
.in +2
.nf
# \fBisnsadm list-dd -v\fR
DD name: Default
        DD set(s): Default
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        iSCSI name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
DD name: acct-dd
DD name: engineering-dd
.fi
.in -2
.sp

.LP
\fB示例 3 \fR添加节点
.sp
.LP
下面的示例使用 \fBadd-node\fR 子命令将节点添加到搜索域中，从而创建搜索域成员身份。

.sp
.in +2
.nf
# \fBisnsadm add-node -d engineering-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.engr\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR删除节点
.sp
.LP
下面的示例使用 \fBremove-node\fR 子命令将节点从搜索域中删除，从而删除搜索域成员身份。

.sp
.in +2
.nf
# \fBisnsadm remove-node -d acct-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct\fR
.fi
.in -2
.sp

.LP
\fB示例 5 \fR创建搜索域集
.sp
.LP
下面的示例使用 \fBcreate-dd-set\fR 子命令创建搜索域集。

.sp
.in +2
.nf
# \fBisnsadm create-dd-set operation-dd-set\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR显示搜索域集
.sp
.LP
下面的示例使用 \fBlist-dd-set\fR 子命令显示搜索域集。

.sp
.in +2
.nf
# \fBisnsadm list-dd-set -v\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
.fi
.in -2
.sp

.LP
\fB示例 7 \fR添加搜索域
.sp
.LP
下面的示例使用 \fBadd-dd\fR 子命令将搜索域添加到搜索域集中。

.sp
.in +2
.nf
# \fBisnsadm add-dd -s operation-dd-set engineering-dd\fR
.fi
.in -2
.sp

.LP
\fB示例 8 \fR显示搜索域集
.sp
.LP
下面的示例使用 \fBlist-dd-set\fR 子命令显示搜索域集的属性。

.sp
.in +2
.nf
# \fBisnsadm list-dd-set\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
        DD Name: engineering-dd
.fi
.in -2
.sp

.LP
\fB示例 9 \fR启用搜索域集
.sp
.LP
下面的示例使用 \fBenable-dd-set\fR 子命令启用搜索域集。

.sp
.in +2
.nf
# \fBisnsadm enable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fB示例 10 \fR禁用搜索域集
.sp
.LP
下面的示例使用 \fBdisable-dd-set\fR 子命令禁用搜索域集。

.sp
.in +2
.nf
# \fBisnsadm disable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fB示例 11 \fR显示管理设置
.sp
.LP
下面的示例使用 \fBshow-config\fR 子命令显示当前的管理设置。

.sp
.in +2
.nf
# \fBisnsadm show-config\fR
        Data Store Location: /etc/isns/isnsdata.xml
        Entity Status Inquiry Non-Response Threshold: 3
        Management SCN Enabled: yes
        Authorized Control Node Names: -
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/storage/isns
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBiscsiadm\fR(1M)、\fBisns\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
如果调用某个子命令时使用了多个操作数，并且在一个或多个（并非全部）操作数上失败，则 \fBisnsadm\fR 会显示一条指示部分失败的一般消息，并显示失败操作数的列表。要查看有关某个特定操作数的错误，可以对该失败操作数发出同一子命令。
