Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/mdnsd.1m
'\" te
.\" 版权所有 (c) 2003-2004 Apple Computer, Inc。保留所有权利。
.\" 以 Apache 许可 2.0 版（以下简称"许可"）授权；只有遵守该许可方可使用此文件。可以从以下位置获取许可的副本：http://www.apache.org/licenses/LICENSE-2.0。除非因适用法律需要或书面同意，否则根据许可分发的软件"按原样"提供，无任何明示或暗示的保证或条件。有关据此许可实施的、针对具体语言规定的权限和限制，请参见许可。
.\" 版权所有 (c) 2007，2010，Oracle 和/或其附属公司。保留所有权利。
.TH mdnsd 1M "2007 年 8 月 21 日" "SunOS 5.11" "系统管理命令"
.SH 名称
mdnsd \- 多播 DNS 守护进程
.SH 用法概要
.LP
.nf
mdnsd [-\fBdebug\fR]
.fi

.SH 描述
.sp
.LP
\fBmdnsd\fR 是多播 DNS 和 DNS 服务发现的守护程序。
.sp
.LP
\fBmdnsd\fR 守护进程在 UDP 端口 5353 侦听多播 DNS 查询数据包。当它接收到知道答案的查询时，\fBmdnsd\fR 将发出相应的多播 DNS 答复数据包。
.sp
.LP
\fBmdnsd\fR 守护进程还代表客户机进程执行多播 DNS 查询，并维护答复的高速缓存。
.sp
.LP
\fBmdnsd\fR 守护进程没有用户可指定的命令行参数，且用户不应手动运行 \fBmdnsd\fR。\fBmdnsd\fR 守护进程应由 Solaris 管理工具 (Solaris Management Facility，SMF) 和 \fBsvcadm\fR(1M) 命令使用以下故障管理资源标识符 (Fault Management Resource Identifier，FMRI) 管理：
.sp
.in +2
.nf
svc:/network/dns/multicast:default
.fi
.in -2
.sp

.sp
.LP
要检查 \fBmdnsd\fR 的内部状态以用于调试和诊断目的，可向其发送一个 SIGUSR1 信号，之后它将使用 \fBsyslog\fR(3C) 工具记录其内部状态的快照摘要。\fBmdnsd\fR 使用系统日志工具代码守护进程和信息优先级。
.SH 选项
.sp
.LP
\fBmdnsd\fR 守护进程可识别以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-debug\fR\fR
.ad
.RS 10n
.rt  
调试模式。\fBmdnsd\fR 守护进程将输出发送至标准错误，并且不在后台运行。此选项仅用于调试该守护进程。
.RE

.SS "配置"
.sp
.LP
可以通过指定 \fBmdns\fR 作为名称服务转换配置文件 \fBnsswitch.conf\fR(4) 中的主机和 IP 节点的源，使用多播 \fBDNS\fR 查找主机名和主机地址。使用多播 \fBDNS\fR 查询主机名和主机地址的配置选项存储在 \fBSMF\fR 信息库中。此配置可通过 \fBsvccfg\fR(1M) 命令使用以下故障管理资源标识符 (FMRI) 进行修改： 
.sp
.in +2
.nf
svc:/network/dns/multicast:default
.fi
.in -2
.sp

.sp
.LP
使用多播 \fBDNS\fR 查询主机名和主机地址的配置选项存储在名为 "\fBnss_mdns_config\fR" 的属性组中。构成配置选项的属性如下：
.sp
.ne 2
.mk
.na
\fBsearch\fR
.ad
.RS 10n
.rt  
主机名查找的搜索域列表。缺省情况下，配置中不包含任何搜索域。搜索列表当前限制为六个域。
.RE

.sp
.ne 2
.mk
.na
\fBvalid\fR
.ad
.RS 10n
.rt  
在使用多播 \fBDNS\fR 查找域的主机名或主机地址之前检查的有效域列表。搜索列表中指定的域始终包含在有效列表中。有效域列表当前限制为十个域。
.RE

.sp
.LP
请注意，以上配置选项是 "Volatile"（可变），并且在未来发行版中可能会发生更改。
.SH 文件
.sp
.LP
/usr/lib/inet/mdnsd
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/network/dns/mdns
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBdns-sd\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsyslog\fR(3C)、\fBnsswitch.conf\fR(4)、\fBattributes\fR(5)
.sp
.LP
有关多播 DNS 的信息，请参见 http://www.multicastdns.org/。
.sp
.LP
有关 DNS 服务发现的信息，请参见 \fBhttp://www.dns-sd.org/\fR。
