Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/ndmpd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH ndmpd 1M "2011 年 8 月 4 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ndmpd \- 网络数据管理协议守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/ndmp/ndmpd\fR
.fi

.SH 描述
.sp
.LP
\fBndmpd\fR 守护进程处理客户机网络数据管理协议 (Network Data Management Protocol，NDMP) 请求。NDMP 是一种基于网络的企业级开放数据管理协议，用于备份和恢复。通过 \fBndmpd\fR 守护进程，用户可使用数据管理应用程序 (Data Management Application，DMA) 客户机管理数据备份和恢复。NDMP 协议用于协调 DMA 与 NDMP 服务器之间或两个 NDMP 服务器之间的数据移动和控制。
.sp
.LP
缺省情况下，\fBndmpd\fR 处于禁用状态。
.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现使 \fBndmpd\fR 守护进程无法进行初始化的错误，例如无法派生一个互斥锁初始化进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
指定的命令行选项无效。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ndmp/ndmpd\fR\fR
.ad
.sp .6
.RS 4n
网络数据管理协议服务器二进制文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/ndmp.log\fR\fR
.ad
.sp .6
.RS 4n
网络数据管理协议日志消息文件。重新引导时将删除此文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/dumpdates\fR\fR
.ad
.sp .6
.RS 4n
存储有关转储备份的日期和级别信息的文本文件。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/storage/ndmp
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBndmpadm\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsyslogd\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBndmpd\fR 守护进程由服务管理工具 (\fBsmf\fR(5)) 管理，其服务标识符为：
.sp
.in +2
.nf
svc:/system/ndmpd:default
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvcadm\fR(1M) 来执行对此服务的管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。
