Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/ndmpadm.1m
'\" te
.\" 版权所有 (c) 2007，2010，Oracle 和/或其附属公司。保留所有权利。
.TH ndmpadm 1M "2010 年 5 月 25 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ndmpadm \- 管理网络数据管理协议活动
.SH 用法概要
.LP
.nf
\fB/usr/sbin/ndmpadm\fR [\fB-?\fR ] \fIsubcommand\fR [\fIoptions\fR] [\fIdirect-object\fR]
.fi

.SH 描述
.sp
.LP
可使用 \fBndmpadm\fR 命令查询 \fBndmpd\fR(1M) 守护进程，以获取活动会话的状态，终止会话，查询备份设备以及设置或获取当前 NDMP（Network Data Management Protocol，网络数据管理协议）服务变量和属性。\fBndmpadm\fR 是作为一组子命令实现的（其中很多子命令都有自己的直接对象），下面将分别对这些子命令进行说明。某些子命令支持选项，这些选项将与子命令一起介绍。
.sp
.LP
\fBndmpadm\fR 命令支持以下子命令：
.sp
.ne 2
.mk
.na
\fB\fBdisable\fR\fR
.ad
.sp .6
.RS 4n
禁用指定的验证口令处理。
.RE

.sp
.ne 2
.mk
.na
\fB\fBenable\fR\fR
.ad
.sp .6
.RS 4n
启用指定的验证口令处理。
.RE

.sp
.ne 2
.mk
.na
\fB\fBget\fR\fR
.ad
.sp .6
.RS 4n
获取 NDMP 配置属性值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkill-sessions\fR\fR
.ad
.sp .6
.RS 4n
终止活动会话。
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR\fR
.ad
.sp .6
.RS 4n
设置 NDMP 配置属性的值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-devices\fR\fR
.ad
.sp .6
.RS 4n
获取与服务器连接的磁带设备列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-sessions\fR\fR
.ad
.sp .6
.RS 4n
显示活动 NDMP 会话的详细信息。
.RE

.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.RS 6n
.rt  
显示所有子命令和选项的列表。
.RE

.SH 子命令
.sp
.LP
\fBndmpadm\fR 命令支持下述子命令。
.SS "\fBdisable\fR 子命令"
.sp
.LP
\fBdisable\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm disable -a \fIauth-type\fR\fR
.fi
.in -2
.sp

.sp
.LP
该子命令为 NDMP 客户机的远程访问禁用 \fIauth-type\fR 指定的验证类型。\fIauth-type\fR 的有效值为 \fBcram-md5\fR 或 \fBcleartext\fR。
.SS "\fBenable\fR 子命令"
.sp
.LP
\fBenable\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm enable -a \fIauth-type\fR -u \fIusername\fR\fR
.fi
.in -2
.sp

.sp
.LP
该子命令提示输入两次用户口令以进行确认，并使用 NDMP 客户机访问的给定用户名和口令激活指定的验证类型。\fIauth-type\fR 的有效值为 \fBcram-md5\fR 或 \fBcleartext\fR。
.SS "\fBget\fR 子命令"
.sp
.LP
\fBget\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm get [-p] [\fIproperty\fR] [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
属性名与用于 \fBset\fR 子命令的属性名相同，如下所述。如果未指定属性，\fBget\fR 子命令将返回所有配置属性。
.SS "\fBkill-sessions\fR 子命令"
.sp
.LP
可以使用 \fBkill-sessions\fR 子命令终止会话编号 \fIID\fR。
.sp
.LP
\fBkill-sessions\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm kill-sessions \fIID\fR\fR
.fi
.in -2
.sp

.SS "\fBset\fR 子命令"
.sp
.LP
\fBset\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm set [-p] \fIproperty\fR=\fIvalue\fR [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
\fBndmp\fR(4) 手册页中介绍了可使用 \fBset\fR 子命令设置的属性。
.SS "\fBshow-devices\fR 子命令"
.sp
.LP
\fBshow-devices\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.sp
.LP
该子命令可列出当前连接到系统的磁带驱动器和库的名称、供应商、序列号以及其他信息。
.SS "\fBshow-sessions\fR 子命令"
.sp
.LP
\fBshow-sessions\fR 子命令显示会话的详细信息。\fBshow-sessions\fR 子命令的语法如下：
.sp
.in +2
.nf
# \fBndmpadm show-sessions [-i tape,scsi,data,mover] [\fIID\fR]\fR
.fi
.in -2
.sp

.sp
.LP
\fBshow-sessions\fR 子命令支持以下参数：
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fBtape\fR,\fBscsi\fR,\fBdata\fR,\fBmover\fR\fR
.ad
.sp .6
.RS 4n
标识要获取其数据的接口的类型。如果未指定接口，\fBshow-sessions\fR 将显示所有类型的接口的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fIID\fR\fR
.ad
.sp .6
.RS 4n
标识要显示其数据的特定会话。如果未指定 \fIID\fR，\fBshow-sessions\fR 将显示所有会话的数据。
.RE

.SH 示例
.LP
\fB示例 1 \fR获取所有 NDMP 连接的状态
.sp
.LP
以下命令将获取所有连接的状态。

.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR获取特定类型的连接的状态
.sp
.LP
以下命令将获取磁带和 SCSI 接口的状态。

.sp
.in +2
.nf
# \fBndmpadm show-sessions -i scsi,tape\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR限制协议版本
.sp
.LP
以下命令将限制 NDMP 协议使用版本 3。

.sp
.in +2
.nf
# \fBndmpadm set -p version=3\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR获取当前版本号
.sp
.LP
以下命令将获取当前正在运行的 NDMP 的版本号。

.sp
.in +2
.nf
# \fBndmpadm get -p version\fR
.fi
.in -2
.sp

.LP
\fB示例 5 \fR断开特定会话
.sp
.LP
以下命令将断开会话 5。会话编号是之前通过 \fBndmpadm show-sessions\fR 命令获取的。

.sp
.in +2
.nf
# \fBndmpadm kill-session 5\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR获取所有 NDMP 属性的值
.sp
.LP
以下命令将获取所有 NDMP 属性的值。

.sp
.in +2
.nf
# \fBndmpadm get\fR
.fi
.in -2
.sp

.LP
\fB示例 7 \fR启用 CRAM-MD5 验证
.sp
.LP
以下命令将启用 CRAM-MD5 验证。

.sp
.in +2
.nf
# \fBndmpadm enable -a cram-md5 -u admin\fR
Enter new password:\fB*****\fR
Re-enter password:\fB*****\fR
.fi
.in -2
.sp

.LP
\fB示例 8 \fR禁用明文口令验证
.sp
.LP
以下命令将禁用明文口令验证。

.sp
.in +2
.nf
# \fBndmpadm disable -a cleartext\fR
.fi
.in -2
.sp

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误（如 \fBndmpd\fR 守护进程未在运行），使得 \fBndmpadm\fR 无法联系守护进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
指定的命令行选项无效。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/storage/ndmp
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdump\fR(1)、\fBtar\fR(1)、\fBndmpd\fR(1M)、\fBndmpstat\fR(1M)、\fBsvccfg\fR(1M)、\fBsyslogd\fR(1M)、\fBndmp\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBndmpd\fR(1M) 守护进程由服务管理工具 (\fBsmf\fR(5)) 管理，其服务标识符为：
.sp
.in +2
.nf
svc:/system/ndmpd
.fi
.in -2
.sp

.sp
.LP
还可使用 \fBsvccfg\fR(1M) 对此服务执行管理操作，如设置和获取属性。例如，启用直接访问恢复 (Direct Access Recovery，DAR) 模式：
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBsetprop ndmpd/dar-support = yes\fR
.fi
.in -2
.sp

.sp
.LP
\&...以及获取属性列表：
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBlistprop\fR
.fi
.in -2
.sp

