Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/netstat.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. 保留所有权利。
.\" 版权所有 1989 AT&T
.\" 版权所有 (c) 1983 加利福尼亚大学董事会。保留所有权利。Berkeley 软件许可协议规定了再分发的条款和条件。
.TH netstat 1M "2011 年 7 月 8 日" "SunOS 5.11" "系统管理命令"
.SH 名称
netstat \- 显示网络状态
.SH 用法概要
.LP
.nf
\fBnetstat\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-g\fR [\fB-nv\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-p\fR [\fB-n\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-s\fR [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR] 
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-m\fR [\fB-T\fR u | d ] [\fB-v\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-i\fR [\fB-I\fR \fIinterface\fR] [\fB-an\fR] [\fB-f\fR \fIaddress_family\fR] 
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-r\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR | \fIfilter\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-M\fR [\fB-ns\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-D\fR [\fB-I\fR \fIinterface\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-d\fR [\fB-f\fR \fIaddress_family\fR]
.fi

.SH 描述
.sp
.LP
\fBnetstat\fR 命令可通过各种格式显示与网络有关的特定数据结构的内容（具体格式取决于选定的选项）。
.sp
.LP
\fBnetstat\fR 命令具有以上"用法概要"一节中显示的多种形式，如下所列：
.RS +4
.TP
.ie t \(bu
.el o
此命令的第一种形式（不带必需参数）显示每项协议的活动套接字列表。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第二、第三和第四种形式（\fB-g\fR、\fB-p\fR 和 \fB-s\fR 选项）显示来自各种网络数据结构的信息。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第五种形式（\fB-m\fR 选项）显示 STREAMS 内存统计信息。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第六种形式（\fB-i\fR 选项）显示接口的状态。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第七种形式（\fB-r\fR 选项）显示路由表。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第八种形式（\fB-M\fR 选项）显示多播路由表。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第九种形式（\fB-D\fR 选项）显示一个接口或所有接口的 \fBDHCP\fR 状态。
.RE
.RS +4
.TP
.ie t \(bu
.el o
第十种形式（\fB-d\fR 选项）显示目标高速缓存项的表。
.RE
.sp
.LP
下面将更详细地介绍这些形式。
.sp
.LP
如果不带任何参数（第一种形式），则 \fBnetstat\fR 会显示 \fBPF_INET\fR、\fBPF_INET6\fR 和 \fBPF_UNIX\fR 的连接套接字，除非 \fB-f\fR 选项另外修改。
.SH 选项
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
显示所有套接字、所有路由表项或所有接口（物理接口和逻辑接口）的状态。通常不会显示服务器进程使用的侦听器套接字。在大多数情况下，只会显示接口、主机、网络和缺省路由，并且只显示物理接口的状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
显示目标高速缓存项表。请参见下面的"显示"部分\fB\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIaddress_family\fR\fR
.ad
.sp .6
.RS 4n
限制对指定的 \fIaddress_family\fR 的所有显示。\fIaddress_family\fR 的值可以为下列值之一： 
.sp
.ne 2
.mk
.na
\fB\fBinet\fR\fR
.ad
.RS 9n
.rt  
适用于显示 IPv4 信息的 \fBAF_INET\fR 地址族。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinet6\fR\fR
.ad
.RS 9n
.rt  
适用于显示 IPv6 信息的 \fBAF_INET6\fR 地址族。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunix\fR\fR
.ad
.RS 9n
.rt  
适用于 \fBAF_UNIX\fR 地址族。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsdp\fR\fR
.ad
.RS 9n
.rt  
适用于套接字描述协议 (Socket Description Protocol, SDP) 协议和地址族。下面列出了针对 SDP 套接字显示的地址状态。\fBnetstat\fR 显示的标志后跟其含义。
.br
.in +2
\fBLST\fR Listen
.in -2
.br
.in +2
\fBEST\fR Established 
.in -2
.br
.in +2
\fBPL\fR Path Lookup
.in -2
.br
.in +2
\fBHS\fR Hello Request Sent
.in -2
.br
.in +2
\fBHR\fR Hello Request Received
.in -2
.br
.in +2
\fBHAR\fR Hello Ack Recvd
.in -2
.br
.in +2
\fBHAS\fR Hello Ack sent
.in -2
.br
.in +2
\fBDR\fR Fin received
.in -2
.br
.in +2
\fBDS\fR Fin sent
.in -2
.br
.in +2
\fBDSA\fR Fin Ack recvd
.in -2
.br
.in +2
\fBDRC\fR Simultaneous Disconnect
.in -2
.br
.in +2
\fBDSC\fR Disconnect sent (peer already closed)
.in -2
.br
.in +2
\fBTW1\fR Time Wait 1
.in -2
.br
.in +2
\fBTW2\fR Time Wait 2
.in -2
.br
.in +2
\fBCLD\fR Closed
.in -2
.br
.in +2
\fBERR\fR Error
.in -2
.br
.in +2
\fBINV\fR Invalid
.in -2
.br
.in +2
\fBUNK\fR Unknown
.in -2
对于 SDP 协议和地址族，\fBnetstat\fR 显示以下列标题：
.sp
.ne 2
.mk
.na
\fB\fBLocal Address\fR\fR
.ad
.RS 18n
.rt  
本地 IP 地址
.RE

.sp
.ne 2
.mk
.na
\fB\fBRemote Address\fR\fR
.ad
.RS 18n
.rt  
远程 IP 地址
.RE

.sp
.ne 2
.mk
.na
\fB\fBState\fR\fR
.ad
.RS 18n
.rt  
套接字的当前状态
.RE

.sp
.ne 2
.mk
.na
\fB\fBRxBPending\fR\fR
.ad
.RS 18n
.rt  
未读字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBTxBQueued\fR\fR
.ad
.RS 18n
.rt  
排队等待 Tx 的字节（包括 \fBTxBPosted\fR）
.RE

.sp
.ne 2
.mk
.na
\fB\fBTxBPosted\fR\fR
.ad
.RS 18n
.rt  
发送给 HW 进行传输的字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAdvtSz\fR\fR
.ad
.RS 18n
.rt  
本地通告的缓冲区大小
.RE

.sp
.ne 2
.mk
.na
\fB\fBRAdvtSz\fR\fR
.ad
.RS 18n
.rt  
远程通告的缓冲区大小
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAdvtBuff\fR\fR
.ad
.RS 18n
.rt  
本地通告的 Rx 缓冲区的数量
.RE

.sp
.ne 2
.mk
.na
\fB\fBRAdvtBuff\fR\fR
.ad
.RS 18n
.rt  
远程通告的 Rx 缓冲区的数量
.RE

.sp
.ne 2
.mk
.na
\fB\fBLPostBuff\fR\fR
.ad
.RS 18n
.rt  
当前发布的 Rx 缓冲区的数量
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilter\fR\fR
.ad
.sp .6
.RS 4n
如果只带有 \fB-r\fR 选项，显示的路由将限于匹配指定过滤器的路由。过滤器规则由 \fIkeyword\fR:\fIvalue\fR 对组成。已知关键字和值的语法如下：
.sp
.ne 2
.mk
.na
\fB\fBaf:\fR{\fBinet\fR|\fBinet6\fR|\fBunix\fR|\fBsdp\fR|\fInumber\fR}\fR
.ad
.sp .6
.RS 4n
选择地址族。这与 \fB-f\fR \fIaddress_family\fR 相同，两种语法均受支持。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoutif\fR:{\fIname\fR|\fIifIndex\fR|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
选择输出接口。可以按名称（如 \fBhme0\fR）或按 \fBifIndex\fR 编号（如 \fB2\fR）指定接口。如果使用 \fBany\fR，过滤器会匹配具有指定接口（除 null 接口以外的任何接口）的所有路由。如果使用 \fBnone\fR，过滤器会匹配具有 null 接口的所有路由。请注意，可以使用 \fBifconfig\fR(1M) 的 \fB-a\fR 选项查看接口的索引号 (\fIifIndex\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdst\fR:{\fIip-address\fR[/\fImask\fR]|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
选择目标 IP 地址。如果指定有掩码长度，则会选择具有匹配掩码或更长（更多特定）掩码的任何路由。如果使用 \fBany\fR，则会选择除 0 以外的所有地址。如果使用 \fBnone\fR，则会选择地址 0。
.RE

.sp
.ne 2
.mk
.na
\fB\fBflags:\fR[\fB+ -\fR]?[\fBABDGHLMSU\fR]\fB+\fR\fR
.ad
.sp .6
.RS 4n
选择标有指定标志的路由。缺省情况下，必须设置指定的标志才能进行匹配。如果带有前导 \fB+\fR，则必须设置指定的标志，而忽略其他标志。如果带有前导 \fB-\fR，则不得设置指定的标志，而允许设置其他标志。
.RE

您可以指定多个 \fB-f\fR 实例来指定多个过滤器。例如：
.sp
.in +2
.nf
% netstat -nr -f outif:hme0 -f outif:hme1 -f dst:10.0.0.0/8
.fi
.in -2
.sp

上述显示 10.0.0.0/8 网络中掩码长度为 8 或更长、输出接口为 \fBhme0\fR 或 \fBhme1\fR 的路由，并排除所有其他路由。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
显示所有接口的多播组成员。如果包含 \fB-v\fR 选项，则还会显示特定于源的成员信息。请参见下文的"显示"部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
显示用于 \fBIP\fR 通信的接口的状态。通常，此选项会显示物理接口的统计信息。与 \fB-a\fR 选项结合使用时，此选项还会报告逻辑接口的信息。请参见 \fBifconfig\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
显示 STREAMS 内存统计信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
以数字形式显示网络地址。\fBnetstat\fR 通常以符号形式显示地址。此选项可与任何显示格式配合使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
显示网络-介质表。请参见下文的"显示"部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
显示路由表。通常，只会显示接口、主机、网络和缺省路由；但是，当此选项与 \fB-a\fR 选项结合使用时，将显示所有路由，包括高速缓存。如果尚未设置多播路由，则 \fB-ra\fR 可能不会显示任何多播路由项，但内核将根据需要派生此类项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
显示每个协议的统计信息。与 \fB-M\fR 选项配合使用时，改为显示多播路由统计信息。与 \fB-a\fR 选项配合使用时，将会显示每个接口的统计信息，以及显示系统的全局统计信息（如果可用）。请参见下文的"显示"部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu\fR | \fBd\fR\fR
.ad
.sp .6
.RS 4n
显示时间戳。
.sp
指定 \fBu\fR 表示时间的内部表示形式的印刷表示形式。请参见 \fBtime\fR(2)。指定 \fBd\fR 表示标准日期格式。请参见 \fBdate\fR(1)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
详细模式。显示套接字的其他信息、STREAMS 内存统计信息、路由表和多播组成员。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIinterface\fR\fR
.ad
.sp .6
.RS 4n
显示特定接口的状态。\fIinterface\fR 可以是任何有效的接口，例如 \fBhme0\fR 或 \fBeri0\fR。通常，会显示物理接口的状态和统计信息。当此选项与 \fB-a\fR 选项结合使用时，还会报告逻辑接口的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.sp .6
.RS 4n
显示多播路由表。与 \fB-s\fR 选项配合使用时，改为显示多播路由统计信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
将统计信息的显示或所有套接字的状态限制为适用于 \fIprotocol\fR 的项目。protocol 可以是 \fBip\fR、\fBipv6\fR、\fBicmp\fR、\fBicmpv6\fR、\fBicmp\fR、\fBicmpv6\fR、\fBigmp\fR、\fBudp\fR、\fBtcp\fR 和 \fBrawip\fR 之一。\fBrawip\fR 也可指定为 \fBraw\fR。此命令只接受全小写形式的协议选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBDHCP\fR 配置的接口的状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
此修饰符显示套接字和路由表项的扩展安全属性。\fB-R\fR 修饰符仅在系统配置有 Solaris Trusted Extensions 功能时可用。
.sp
如果只带有 \fB-r\fR 选项，此选项将显示路由项的网关安全属性。有关安全属性的更多信息，请参见 \fBroute\fR(1M)。
.sp
当使用此命令的第一种形式显示套接字信息时，此选项会显示多级别端口 (Multi-Level Port, MLP) 套接字的其他信息。其中包括：
.RS +4
.TP
.ie t \(bu
.el o
对等方的标签（如果已连接套接字）。
.RE
.RS +4
.TP
.ie t \(bu
.el o
以下标志可附加到套接字的"状态"输出：
.RS

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.RS 5n
.rt  
套接字是区域专用 IP 地址上的 MLP。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
套接字是区域之间共享的 IP 地址上的 MLP。
.RE

.RE

.RE
.RE

.SH 操作数
.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
每 \fIinterval\fR 秒显示一次自上次显示以来累积的统计信息，并不断重复直到指定了 \fIcount\fR。用 \fIinterval\fR 进行调用时，第一行 netstat 输出显示自上次重新引导以来累积的统计信息。 
.sp
以下选项支持 \fIinterval\fR：\fB-i\fR、\fB-m\fR、\fB-s\fR 和 \fB-Ms\fR。有些值是配置参数，仅在每次间隔时重新显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
按 \fIcount\fR 指定的次数以及 \fIinterval\fR 指定的间隔显示接口统计信息。
.RE

.SH 显示
.SS "活动套接字（第一种形式）"
.sp
.LP
每个活动套接字的显示内容均显示本地地址和远程地址、发送队列和接收队列的大小（字节）、发送窗口和接收窗口（字节）以及协议的内部状态。
.sp
.LP
通常用于显示套接字地址的符号格式为：
.sp
.in +2
.nf
\fBhostname\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
前提是指定了主机的名称，或
.sp
.in +2
.nf
\fInetwork\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
前提是套接字地址指定网络，而不指定特定主机。
.sp
.LP
与套接字关联的数字主机地址或网络号用于在 \fIhosts\fR 或 \fInetworks\fR 数据库中查找对应的符号主机名或网络名称。
.sp
.LP
如果地址的网络或主机名未知，或者指定了 \fB-n\fR 选项，则会显示数字网络地址。未指定的地址和端口或"通配符"地址和端口以星号 (\fB*\fR) 显示。有关 Internet 命名约定的更多信息，请参见 \fBinet\fR(7P) 和 \fBinet6\fR(7P)。
.sp
.LP
对于 SCTP 套接字，由于端点可由多个地址表示，因此详细选项 (\fB-v\fR) 会列显所有本地地址和远程地址。
.SS "\fITCP Sockets\fR"
.sp
.LP
\fBTCP\fR 套接字的可能状态值如下：
.sp
.ne 2
.mk
.na
\fB\fBBOUND\fR\fR
.ad
.RS 16n
.rt  
已绑定，准备连接或侦听。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSED\fR\fR
.ad
.RS 16n
.rt  
已关闭。套接字没有被使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSING\fR\fR
.ad
.RS 16n
.rt  
已关闭，然后远程关机；正在等待确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSE_WAIT\fR\fR
.ad
.RS 16n
.rt  
远程关机；正在等待套接字关闭。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESTABLISHED\fR\fR
.ad
.RS 16n
.rt  
已建立连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFIN_WAIT_1\fR\fR
.ad
.RS 16n
.rt  
套接字已关闭；正在关闭连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFIN_WAIT_2\fR\fR
.ad
.RS 16n
.rt  
套接字已关闭；正在等待远程关机。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIDLE\fR\fR
.ad
.RS 16n
.rt  
空闲，已打开但是未绑定。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAST_ACK\fR\fR
.ad
.RS 16n
.rt  
远程关机，然后关闭；正在等待确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLISTEN\fR\fR
.ad
.RS 16n
.rt  
正在侦听传入连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYN_RECEIVED\fR\fR
.ad
.RS 16n
.rt  
正在对连接进行初始同步。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYN_SENT\fR\fR
.ad
.RS 16n
.rt  
正在积极尝试建立连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIME_WAIT\fR\fR
.ad
.RS 16n
.rt  
关闭后等待远程关机重新传输。
.RE

.SS "\fISCTP Sockets\fR"
.sp
.LP
SCTP 套接字的可能状态值如下：
.sp
.ne 2
.mk
.na
\fB\fBCLOSED\fR\fR
.ad
.RS 21n
.rt  
已关闭。套接字没有被使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLISTEN\fR\fR
.ad
.RS 21n
.rt  
正在侦听传入关联。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESTABLISHED\fR\fR
.ad
.RS 21n
.rt  
已建立关联。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOOKIE_WAIT\fR\fR
.ad
.RS 21n
.rt  
\fBINIT\fR 已被发送到对等方，正在等待确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOOKIE_ECHOED\fR\fR
.ad
.RS 21n
.rt  
INIT-ACK 的状态 cookie 已被发送到对等方，正在等待确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_PENDING\fR\fR
.ad
.RS 21n
.rt  
已接收到来自上一层的 \fBSHUTDOWN\fR，正在等待确认对等方的所有未处理 \fBDATA\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_SENT\fR\fR
.ad
.RS 21n
.rt  
所有未处理数据已在 \fBSHUTDOWN_SENT\fR 状态中确认。\fBSHUTDOWN\fR 已被发送到对等方，正在等待确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_RECEIVED\fR\fR
.ad
.RS 21n
.rt  
已接收到来自对等方的 \fBSHUTDOWN\fR，正在等待确认所有未处理 \fBDATA\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_ACK_SENT\fR\fR
.ad
.RS 21n
.rt  
所有未处理数据已在 \fBSHUTDOWN_RECEIVED\fR 状态中确认。\fBSHUTDOWN_ACK\fR 已被发送到对等方。
.RE

.SS "网络数据结构（第二至第五种形式）"
.sp
.LP
显示形式取决于选定的 \fB-g\fR、\fB-m\fR、\fB-p\fR 或 \fB-s\fR 选项。
.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
.rt  
显示多播组成员的列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
显示内存使用率，例如 STREAMS mblk。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
显示网络-介质映射表。对于 IPv4，显示地址解析表。请参见 \fBarp\fR(1M)。对于 Pv6，显示邻居高速缓存。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
显示各种协议层的统计信息。
.RE

.sp
.LP
统计信息使用 MIB 指定的变量。为 \fBipForwarding\fR 定义的值是：
.sp
.ne 2
.mk
.na
\fB\fBforwarding(1)\fR\fR
.ad
.RS 21n
.rt  
充当网关。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnot-forwarding(2)\fR\fR
.ad
.RS 21n
.rt  
不充当网关。
.RE

.sp
.LP
IPv6 和 ICMPv6 协议层保留每个接口的统计信息。如果指定 \fB-a\fR 选项并附带 \fB-s\fR 选项，则会显示每个接口的统计信息及其总和。否则，只会显示统计信息的总和。
.sp
.LP
对于此命令的第二、第三和第四种形式，必须至少指定 \fB-g\fR、\fB-p\fR 或 \fB-s\fR。您可以指定这些选项的任意组合。此外，也可以指定 \fB-m\fR（第五种形式）以及 \fB-g\fR、\fB-p\fR 和 \fB-s\fR 选项的任意组合形式。如果指定这些选项中的多个选项，则 \fBnetstat\fR 会显示每个选项的信息。
.SS "接口状态（第六种形式）"
.sp
.LP
接口状态显示列出所有当前接口的信息，每行一个接口。如果使用 \fB-I\fR 选项指定接口，则只会显示指定接口的信息。
.sp
.LP
列表包含接口名称、\fBmtu\fR（最大传输单元，或最大包大小）（参见 \fBifconfig\fR(1M)）、接口连接到的网络、每个接口的地址以及与接口关联的计数器。计数器分别显示输入包、输入错误、输出包、输出错误和冲突的数量。对于点对点接口，"Net/Dest"（网络/目标）字段为链路另一侧的名称或地址。
.sp
.LP
如果指定 \fB-a\fR 选项并附带 \fB-i\fR 选项或 \fB-I\fR 选项，则输出包括物理接口的名称、每个逻辑接口的输入包和输出包的数量以及其他信息。
.sp
.LP
如果指定了 \fB-n\fR 选项，则列表会显示 IP 地址而不是接口名称。
.sp
.LP
如果指定了可选的 \fIinterval\fR，则会在 \fIinterval\fR 秒内连续显示输出，直到用户中断或达到 \fIcount\fR。请参见"操作数"部分。
.sp
.LP
使用 \fB-I\fR 选项可指定物理接口。与 \fIinterval\fR 操作数配合使用时，\fB-I\fR 选项的输出具有以下格式：
.sp
.in +2
.nf
input    eri0          output        input          (Total)   output
packets  errs  packets errs  colls   packets  errs  packets  errs   colls
227681   0     659471  1     502     261331   0     99597    1      502
10       0     0       0     0       10       0     0        0      0 
8        0     0       0     0       8        0     0        0      0 
10       0     2       0     0       10       0     2        0      0
.fi
.in -2
.sp

.sp
.LP
如果不指定输入接口，则会显示地址族 \fBinet\fR 或 \fBinet6\fR 的第一个接口。
.SS "路由表（第七种形式）"
.sp
.LP
路由表显示列出可用的路由以及每个路由的状态。每个路由都由目标主机或网络以及用于转发包的网关组成。\fIflags\fR 列显示路由的状态。这些标志如下：
.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
指示路由正在\fB运行\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBG\fR\fR
.ad
.RS 5n
.rt  
路由指向网关。
.RE

.sp
.ne 2
.mk
.na
\fB\fBH\fR\fR
.ad
.RS 5n
.rt  
路由指向主机而不是网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
用 \fB-multirt\fR 选项建立的冗余路由。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
路由是使用 \fB-setsrc\fR 选项建立的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 5n
.rt  
已通过重定向动态创建路由。
.RE

.sp
.ne 2
.mk
.na
\fB\fBB\fR\fR
.ad
.RS 5n
.rt  
包将被无提示放弃（设置了 \fBRTF_BLACKHOLE\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR\fR
.ad
.RS 5n
.rt  
包将被放弃，并发送 ICMP 错误（设置了 \fBRTF_REJECT\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBI\fR\fR
.ad
.RS 5n
.rt  
用 \fB-indirect\fR 选项建立的间接路由（非直接可达的网关）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZ\fR\fR
.ad
.RS 5n
.rt  
（仅限于非全局专用 IP 区域）路由是根据在全局区域中使用 \fBzonecfg\fR(1M) 配置的路由信息在引导时静态添加的。
.RE

.sp
.LP
如果指定了 \fB-a\fR 选项，则会产生带有以下标志的路由项：
.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 5n
.rt  
多播地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR\fR
.ad
.RS 5n
.rt  
克隆链路目标上的接口主机路由项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.RS 5n
.rt  
主机的本地地址。
.RE

.sp
.LP
接口路由是为连接到本地主机的每个接口创建的；此类路由项的网关字段会显示传出接口的地址。
.sp
.LP
\fBuse\fR 列显示使用相关路由发送或转发的包数量。
.sp
.LP
\fIinterface\fR 项指示路由所使用的网络接口。
.SS "多播路由表（第八种形式）"
.sp
.LP
多播路由表由虚拟接口表和实际路由表组成。
.SS "DHCP 接口信息（第九种形式）"
.sp
.LP
\fBDHCP\fR 接口信息包含接口名称、接口当前状态、租用信息、包数量和标志列表。 
.sp
.LP
这些状态与 \fIRFC 2131\fR 中设定的规范相关。
.sp
.LP
租用信息包括：
.RS +4
.TP
.ie t \(bu
.el o
开始租用的时间；
.RE
.RS +4
.TP
.ie t \(bu
.el o
开始续租的时间；以及
.RE
.RS +4
.TP
.ie t \(bu
.el o
租用到期的时间。
.RE
.sp
.LP
当前定义的标志包括：
.sp
.ne 2
.mk
.na
\fB\fBBOOTP\fR\fR
.ad
.RS 11n
.rt  
接口含有通过 \fBBOOTP\fR（仅限于 IPv4）获得的租用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBUSY\fR\fR
.ad
.RS 11n
.rt  
接口正忙于 \fBDHCP\fR 事务。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRIMARY\fR\fR
.ad
.RS 11n
.rt  
接口为主接口。请参见 \fBdhcpinfo\fR(1) 和 \fBifconfig \fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFAILED\fR\fR
.ad
.RS 11n
.rt  
接口处于故障状态，并且必须手动重新启动。
.RE

.sp
.LP
系统会为已发送包的数量、已接收包的数量以及 \fBDHCP\fR 客户端拒绝提供的租用数量保留数据包计数。所有三个计数器均初始化为零，然后在获得租用后递增。在开始接口的续租期限时，这些计数器将被重置。因此，这些计数器表示获得当前租用时已发送、已接收和拒绝的数据包数量，或表示尝试获得未来租用时已发送、已接收和拒绝的数据包数量。
.SS "目标高速缓存项表（第十种形式）"
.sp
.LP
目标高速缓存项显示列出记录的路径 MTU、该项的存在时间（秒）和标志。\fBP\fR 标志指示已记录路径 MTU。\fBS\fR 标志指示路径 MTU 小于 IP 将允许的最小值。\fBU\fR 标志指示在目标高速缓存项中缓存了一些传输度量（往返时间等）。
.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/inet_type\fR\fR
.ad
.RS 26n
.rt  
\fBDEFAULT_IP\fR 设置
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBarp\fR(1M)、\fBdhcpinfo\fR(1)、\fBdhcpagent\fR(1M)、\fBifconfig\fR(1M)、\fBiostat\fR(1M)、\fBkstat\fR(1M)、\fBmibiisa\fR(1M)、\fBsavecore\fR(1M)、\fBvmstat\fR(1M)、\fBzonecfg\fR(1M)、\fBhosts\fR(4)、\fBinet_type\fR(4)、\fBnetworks\fR(4)、\fBprotocols\fR(4)、\fBservices\fR(4)、\fBattributes\fR(5)、\fBdhcp\fR(5)、\fBkstat\fR(7D)、\fBinet\fR(7P)、\fBinet6\fR(7P)
.sp
.LP
Droms, R. 编著的《\fIRFC 2131, Dynamic Host Configuration Protocol\fR》，Network Working Group，1997 年 3 月出版。
.sp
.LP
Droms, R. 编著的《\fIRFC 3315, Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\fR》，Cisco Systems。2003 年 7 月出版。
.SH 附注
.sp
.LP
显示接口信息时，\fBnetstat\fR 接受 \fB/etc/default/inet_type\fR 中的 \fBDEFAULT_IP\fR 设置。如果将其设置为 \fBIP_VERSION4\fR，则 \fBnetstat\fR 将省略与 IPv6 接口、统计信息、连接、路由等有关的信息。
.sp
.LP
但是，可以在命令行上覆盖 \fB/etc/default/inet_type\fR 中的 \fBDEFAULT_IP\fR。例如，如果已使用命令行并通过 \fBinet6\fR 地址族或 IPv6 协议之一以显式方式请求 IPv6 信息，则会覆盖 \fBDEFAULT_IP\fR 设置。
.sp
.LP
如果需要检查内核崩溃之后的网络状态信息，请对 \fBsavecore\fR(1M) 输出使用 \fBmdb\fR(1) 实用程序。
.sp
.LP
\fBnetstat\fR 实用程序通过打开 \fB/dev/tcp\fR 并发出查询来获取系统中的 TCP 统计信息。因此，\fBnetstat\fR 在报告连接状态时可能会显示处于 \fBIDLE\fR 状态的额外未用连接。
.sp
.LP
以前版本的 \fBnetstat\fR 采用未记录的方法报告使用 \fBkstat\fR(7D) 工具发布的内核统计信息。此功能已被删除。改为使用 \fBkstat\fR(1M)。
.sp
.LP
\fBnetstat\fR 将其输出限制为与 \fBnetstat\fR 运行区域相关的信息。（这对共享 IP 区域和专用 IP 区域均适用。）
