Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/nfsstat.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH nfsstat 1M "2011 年 4 月 6 日" "SunOS 5.11" "系统管理命令"
.SH 名称
nfsstat \- NFS 统计信息
.SH 用法概要
.LP
.nf
\fBnfsstat\fR [\fB-cnrsza\fR] [\fB-T\fR u | d ] [\fB-v\fR \fIversion\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnfsstat\fR \fB-m\fR [\fIpathname\fR]...
.fi

.SH 描述
.sp
.LP
\fBnfsstat\fR 显示关于 \fBNFS\fR 和 \fBRPC\fR（Remote Procedure Call，远程过程调用）、内核接口的统计信息。它还可用于对此信息进行重新初始化。如果没有给出选项，缺省设置如下：
.sp
.LP
\fBnfsstat\fR \fB-csnra\fR
.sp
.LP
缺省情况下显示全部信息，但是不进行重新初始化。
.SH 选项
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBNFS_ACL\fR 信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
显示客户机信息。仅输出客户端 \fBNFS\fR、\fBRPC\fR 和 \fBNFS_ACL\fR 信息。可以结合 \fB-n\fR、\fB-r\fR 和 \fB-a\fR 选项一起使用，仅输出客户端 \fBNFS\fR、\fBRPC\fR 和 \fBNFS_ACL\fR 信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR [\fIpathname...\fR]\fR
.ad
.sp .6
.RS 4n
显示每个 \fBNFS\fR 挂载文件系统的统计信息。如果不指定 \fIpathname\fR，显示所有 NFS 挂载文件系统的统计信息。如果指定了 \fIpathname\fR，显示 \fIpathname\fR 指示的 NFS 挂载文件系统的统计信息。
.sp
这包括服务器名称和地址、挂载标志、当前读取和写入大小、重新传输计数、属性高速缓存超时值、故障转移信息，以及用于动态重新传输的计时器。动态重新传输计时器仅在使用动态重新传输时显示。缺省情况下，通过 \fBTCP\fR 协议的 \fBNFS\fR 挂载和通过 \fBTCP\fR 或 \fBUDP\fR 的 \fBNFS\fR 版本 3 挂载不使用动态重新传输。
.sp
如果指定 \fB-m\fR 选项，这将是 \fBnfsstat\fR 使用的唯一选项。如果除 \fB-m\fR 外还指定了其他选项，您将接收到一条错误消息，警告您 \fB-m\fR 标志无法与其他选项一起使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBNFS\fR 信息。输出客户端和服务器端的 \fBNFS\fR 信息。可以与 \fB-c\fR 和 \fB-s\fR 选项一起使用，仅输出客户机或服务器的 \fBNFS\fR 信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBRPC\fR 信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
显示服务器信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu\fR | \fBd\fR\fR
.ad
.sp .6
.RS 4n
显示时间戳。
.sp
指定 \fBu\fR 表示时间的内部表示形式的印刷表示形式。请参见 \fBtime\fR(2)。指定 \fBd\fR 表示标准日期格式。请参见 \fBdate\fR(1)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
指定要输出其统计信息的 NFS 版本。后跟可选 \fIversion\fR 参数 (\fB2\fR|\fB3\fR|\fB4\fR) 时，可以指定该版本的统计信息。缺省情况下，输出所有版本的统计信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.sp .6
.RS 4n
将统计信息归零（重新初始化）。该选项仅由超级用户使用，且可以与以上任何选项一起使用，在输出完特定统计信息集合后将其归零。
.RE

.SH 操作数
.sp
.LP
支持下列操作数： 
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.sp .6
.RS 4n
仅显示计数报告
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
每隔一定间隔（秒）报告一次。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.sp .6
.RS 4n
指定要显示统计信息的 NFS 挂载文件系统中文件的路径名。 
.RE

.SH 显示
.sp
.LP
服务器 \fBRPC\fR 显示屏包括以下字段：
.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 层拒绝的调用总数（\fBbadlen\fR 和 \fBxdrcall\fR 的总和，如下面所定义）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadlen\fR\fR
.ad
.sp .6
.RS 4n
长度小于最小 \fBRPC\fR 调用的 \fBRPC\fR 调用数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.sp .6
.RS 4n
接收到的 \fBRPC\fR 调用总数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupchecks\fR\fR
.ad
.sp .6
.RS 4n
在重复请求高速缓存中查找的 \fBRPC\fR 调用数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupreqs\fR\fR
.ad
.sp .6
.RS 4n
发现重复的 \fBRPC\fR 调用数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnullrecv\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 调用在认为已被接收时却无法执行的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxdrcall\fR\fR
.ad
.sp .6
.RS 4n
头无法被 \fBXDR\fR 解码的 \fBRPC\fR 调用数。
.RE

.sp
.LP
服务器 \fBNFS\fR 显示屏显示收到 (\fBcalls\fR) 和拒绝 (\fBbadcalls\fR) 的 \fBNFS\fR 调用数，以及进行的各种调用的计数和百分比。
.sp
.LP
服务器 \fBNFS_ACL\fR 显示屏显示进行的各种调用的计数和百分比。
.sp
.LP
客户机 \fBRPC\fR 显示屏包括以下字段：
.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.sp .6
.RS 4n
进行的 \fBRPC\fR 调用总数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 层拒绝的调用总数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadverfs\fR\fR
.ad
.sp .6
.RS 4n
调用由于响应中检验器出错而失败的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadxids\fR\fR
.ad
.sp .6
.RS 4n
从服务器接收到的、不对应于任何未完成调用的回复次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantconn\fR\fR
.ad
.sp .6
.RS 4n
调用由于无法连接到服务器而失败的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantsend\fR\fR
.ad
.sp .6
.RS 4n
客户机尝试却无法通过无连接传输发送 \fBRPC\fR 请求的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterrupts\fR\fR
.ad
.sp .6
.RS 4n
调用在完成前被信号中断的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnewcreds\fR\fR
.ad
.sp .6
.RS 4n
必须刷新验证信息的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnomem\fR\fR
.ad
.sp .6
.RS 4n
调用由于无法分配内存而失败的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.sp .6
.RS 4n
由于等待服务器回复而超时，必须重新传输调用的次数。仅适用于无连接传输的 \fBRPC\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeouts\fR\fR
.ad
.sp .6
.RS 4n
调用等待服务器回复时超时的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimers\fR\fR
.ad
.sp .6
.RS 4n
计算的超时值大于等于为调用指定的最小超时值的次数。
.RE

.sp
.LP
客户机 \fBNFS\fR 显示屏显示发送和拒绝调用的次数，以及接收 \fBCLIENT\fR 句柄的次数 (\fBclgets\fR)，\fBCLIENT\fR 句柄高速缓存没有未使用条目的次数 (\fBcltoomany\fR)，以及各种调用的计数及其各自百分比。
.sp
.LP
客户机 \fBNFS_ACL\fR 显示屏显示进行的各种调用的计数和百分比。
.sp
.LP
\fB-m\fR 选项包括有关由挂载选项设置的挂载标志、系统的内部挂载标志的信息以及其他挂载信息。请参见 \fBmount_nfs\fR(1M)。
.sp
.LP
以下挂载标志由挂载选项设置：
.sp
.ne 2
.mk
.na
\fB\fBforcedirectio\fR\fR
.ad
.sp .6
.RS 4n
直接在客户机和服务器之间传输的数据，无需在客户机上缓冲。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgrpid\fR\fR
.ad
.sp .6
.RS 4n
BSD 组 ID 继承。请参见 \fBmount_nfs\fR(1M) 中的说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhard\fR\fR
.ad
.sp .6
.RS 4n
硬挂载。
.RE

.sp
.ne 2
.mk
.na
\fB\fBintr\fR\fR
.ad
.sp .6
.RS 4n
硬挂载上允许的中断。
.RE

.sp
.ne 2
.mk
.na
\fB\fBllock\fR\fR
.ad
.sp .6
.RS 4n
正在使用的本地锁定（无锁管理器）。请注意，这是一个专用接口。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoac\fR\fR
.ad
.sp .6
.RS 4n
客户机不缓存属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnointr\fR\fR
.ad
.sp .6
.RS 4n
硬挂载上不允许中断。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnocto\fR\fR
.ad
.sp .6
.RS 4n
没有关闭-打开一致性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR 重新传输。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrpctimesync\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 时间同步。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsize\fR\fR
.ad
.sp .6
.RS 4n
读取缓冲区大小（以字节为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsec\fR\fR
.ad
.sp .6
.RS 4n
\fBsec\fR 具有下列值之一： 
.sp
.ne 2
.mk
.na
\fB\fBdh\fR\fR
.ad
.sp .6
.RS 4n
\fBdes\fR 式验证（加密时间戳）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR 式验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5i\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR 式完整性验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5p\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR 式保密性验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnone\fR\fR
.ad
.sp .6
.RS 4n
无验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshort\fR\fR
.ad
.sp .6
.RS 4n
Short hand UNIX 式验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys\fR\fR
.ad
.sp .6
.RS 4n
UNIX 式验证（UID、GID）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsoft\fR\fR
.ad
.sp .6
.RS 4n
软挂载。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeo\fR\fR
.ad
.sp .6
.RS 4n
初始 \fBNFS\fR 超时值：十分之一秒。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwsize\fR\fR
.ad
.sp .6
.RS 4n
写入缓冲区大小（以字节为单位）。
.RE

.sp
.LP
以下挂载标志为系统内部使用：
.sp
.ne 2
.mk
.na
\fB\fBacl\fR\fR
.ad
.sp .6
.RS 4n
服务器支持 \fBNFS_ACL\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBdown\fR\fR
.ad
.sp .6
.RS 4n
服务器关机。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdynamic\fR\fR
.ad
.sp .6
.RS 4n
动态传输大小调整。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.sp .6
.RS 4n
服务器支持链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmirrormount\fR\fR
.ad
.sp .6
.RS 4n
通过 \fBmirrormount\fR 机制自动挂载。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinted\fR\fR
.ad
.sp .6
.RS 4n
输出 "Not responding"（无响应）消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreaddironly\fR\fR
.ad
.sp .6
.RS 4n
使用 \fBreaddir\fR 而非 \fBreaddirplus\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreferral\fR\fR
.ad
.sp .6
.RS 4n
通过引用机制自动挂载。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsymlink\fR\fR
.ad
.sp .6
.RS 4n
服务器支持符号链接。
.RE

.sp
.LP
以下标志与其他挂载信息有关：
.sp
.ne 2
.mk
.na
\fB\fBproto\fR\fR
.ad
.sp .6
.RS 4n
协议。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvers\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR 版本。
.RE

.sp
.LP
\fB-m\fR 选项还提供属性高速缓存超时值。\fB-m\fR 输出中的以下字段提供属性高速缓存的超时值：
.sp
.ne 2
.mk
.na
\fB\fBacdirmax\fR\fR
.ad
.sp .6
.RS 4n
保留高速缓存目录属性的最长秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacdirmin\fR\fR
.ad
.sp .6
.RS 4n
保留高速缓存目录属性的最短秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacregmax\fR\fR
.ad
.sp .6
.RS 4n
保留高速缓存文件属性的最长秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacregmin\fR\fR
.ad
.sp .6
.RS 4n
保留高速缓存文件属性的最短秒数。
.RE

.sp
.LP
\fB-m\fR 输出中的以下字段提供故障转移信息：
.sp
.ne 2
.mk
.na
\fB\fBcurrserver\fR\fR
.ad
.sp .6
.RS 4n
当前提供 \fBNFS\fR 服务的服务器。有关更多详细信息，请参见\fI\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailover\fR\fR
.ad
.sp .6
.RS 4n
已经选择某台新服务器的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoresponse\fR\fR
.ad
.sp .6
.RS 4n
服务器已响应失败的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBremap\fR\fR
.ad
.sp .6
.RS 4n
文件已重新评估到新服务器的次数。
.RE

.sp
.LP
下面显示的 \fB-m\fR 输出中的字段提供有关动态重新传送输的信息。仅在使用动态重新传输时才显示这些项。
.sp
.ne 2
.mk
.na
\fB\fBcur\fR\fR
.ad
.sp .6
.RS 4n
当前的后退重新传输值，以毫秒为单位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.sp .6
.RS 4n
估计偏差，以毫秒为单位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsrtt\fR\fR
.ad
.sp .6
.RS 4n
平滑往返时间值，以毫秒为单位。
.RE

.SH 退出状态
.sp
.LP
将返回下列退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
出现错误。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/file-system/ntfsprogs
.TE

.SH 另请参见
.sp
.LP
\fBmount_nfs\fR(1M)、\fBattributes\fR(5)
.sp
.LP
\fI《Installing Oracle Solaris 11 Systems》\fR
.sp
.LP
\fI《System Administration Guide: IP Services》\fR
