Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/nscadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH nscadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
nscadm \- 网络存储控制实用程序
.SH 用法概要
.LP
.nf
\fBnscadm\fR freeze \fIdevice\fR
.fi

.LP
.nf
\fBnscadm\fR unfreeze \fIdevice\fR
.fi

.LP
.nf
\fBnscadm\fR isfrozen \fIdevice\fR
.fi

.SH 描述
.sp
.LP
\fBnscadm\fR 命令可执行多个网络存储控制功能。
.sp
.LP
\fBnscadm\fR \fBfreeze\fR 命令可关闭对指定设备的现有引用，并阻止未来的访问。这可在不关闭系统的情况下执行虚拟卷设备驱动程序（例如 RAID 0、RAID 1、RAID 5）的维护。
.sp
.LP
\fBnscadm\fR \fBunfreeze\fR 命令可针对指定设备执行与 \fBnscadm\fR \fBfreeze\fR 相反的操作。
.sp
.LP
\fBnscadm\fR \fBisfrozen\fR 命令可返回指定设备的当前状态。
.SH 选项
.sp
.LP
\fBnscadm\fR 命令支持以下选项。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 13n
.rt  
显示用法菜单。
.RE

.SH 操作数
.sp
.LP
\fBnscadm\fR 命令行支持下列操作数：。
.sp
.ne 2
.mk
.na
\fB\fIdevice\fR\fR
.ad
.sp .6
.RS 4n
指定 \fBnscadm\fR 要对其执行操作的存储设备。
.RE

.SH 退出状态
.sp
.LP
对于 \fBfreeze\fR 和 \fBunfreeze\fR，子命令 \fBnscadm\fR 将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
成功
.RE

.sp
.ne 2
.mk
.na
\fB\fB255\fR\fR
.ad
.RS 13n
.rt  
错误
.RE

.sp
.LP
对于 \fBisfrozen\fR 子命令，\fBnscadm\fR 将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
设备当前处于冻结状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
设备当前未冻结。
.RE

.sp
.ne 2
.mk
.na
\fB\fB255\fR\fR
.ad
.RS 13n
.rt  
错误
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-cache-management
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBscmadm\fR(1M)、\fBattributes\fR(5)
