Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/pooladm.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates.保留所有权利。
.TH pooladm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
pooladm \- 激活和取消激活资源池工具
.SH 用法概要
.LP
.nf
\fB/usr/sbin/pooladm\fR [\fB-n\fR] [\fB-s\fR] [\fB-c\fR] [\fIfilename\fR] | \fB-x\fR
.fi

.LP
.nf
\fB/usr/sbin/pooladm\fR [\fB-d\fR | \fB-e\fR]
.fi

.SH 描述
.sp
.LP
\fBpooladm\fR 命令提供有关池和集合的管理操作。\fBpooladm\fR 读取指定文件名，并尝试激活其中包含的池配置。
.sp
.LP
在更新当前的池运行时配置之前，\fBpooladm\fR 会验证配置的正确性。 
.sp
.LP
不带选项的 \fBpooladm\fR 将打印当前正在运行的池配置。 
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
对给定位置的配置进行实例化。如果未指定文件名，将缺省使用 \fB/etc/pooladm.conf\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
禁用池工具，以便不能再对池进行处理。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 6n
.rt  
启用池功能以对池进行处理。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
验证配置而实际上不更新当前的活动配置。确认没有语法错误，并且可以在当前系统上将配置实例化。不执行应用程序特定属性的验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
使用当前动态配置的详细信息更新指定位置。
.sp
此选项要求对要更新的配置具有更新权限。如果将此选项与 \fB-c\fR 选项结合使用，动态配置将在静态位置之前更新。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
删除当前活动的池配置。销毁所有定义的资源，并将之前已分区的所有组件返回到各自的缺省资源。 
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIfilename\fR\fR
.ad
.RS 12n
.rt  
使用此文件中包含的配置。 
.RE

.SH 示例
.LP
\fB示例 1 \fR实例化配置
.sp
.LP
以下命令将实例化 \fB/home/admin/newconfig\fR 中包含的配置：

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-c\fR\fB /home/admin/newconfig\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR验证配置而不对其进行实例化
.sp
.LP
以下命令将尝试实例化 \fB/home/admin/newconfig\fR 中包含的配置。命令将显示遇到的任何错误情况，但不会实际修改活动的配置。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-n\fR\fB \fR\fB-c\fR\fB /home/admin/newconfig\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR删除当前配置
.sp
.LP
以下命令将删除当前的池配置：

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-x\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR启用池工具
.sp
.LP
以下命令将启用池工具：

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm -e\fR
.fi
.in -2
.sp

.LP
\fB示例 5 \fR使用 SMF 启用池工具
.sp
.LP
以下命令使用服务管理工具启用池工具。请参见 \fBsmf\fR(5)。

.sp
.in +2
.nf
example# \fB/usr/sbin/svcadm enable svc:/system/pools:default\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR将活动的配置保存到指定位置
.sp
.LP
以下命令将活动的配置保存到 \fB/tmp/state.backup\fR：

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm -s /tmp/state.backup\fR
.fi
.in -2
.sp

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/pooladm.conf\fR\fR
.ad
.RS 21n
.rt  
\fBpooladm\fR 的配置文件。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/resource-mgmt/resource-pools
_
接口稳定性请参见下文。
.TE

.sp
.LP
调用为 Committed（已确定）。输出为 Uncommitted（未确定）。 
.SH 另请参见
.sp
.LP
\fBpoolcfg\fR(1M)、\fBpoolbind\fR(1M)、\fBpsrset\fR(1M)、\fBsvcadm\fR(1M)、\fBpset_destroy\fR(2)、\fBlibpool\fR(3LIB)、\fBattributes\fR(5)、\fBsmf\fR(5)
.sp
.LP
\fI\fR
.SH 附注
.sp
.LP
不以可分区资源（如调度类）的绑定形式显示的资源绑定没有必要在 \fBpooladm\fR \fB-x\fR 操作中进行修改。
.sp
.LP
当 Solaris 启动时，池工具缺省为非活动状态。\fBpooladm\fR \fB-e\fR 会显式激活池工具。与处理器分区和进程绑定有关的某些 API 的行为在池处于活动状态时修改。请参见 \fBlibpool\fR(3LIB)。
.sp
.LP
您不能在已创建了处理器集的系统上启用池工具。在启用池工具之前，请使用 \fBpsrset\fR(1M) 命令或 \fBpset_destroy\fR(2) 手动销毁处理器集。
.sp
.LP
因为资源池工具是一个 \fBsmf\fR(5) 服务，所以也可以使用标准 SMF 接口启用和禁用资源池工具。
