Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/reboot.1m
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates.保留所有权利。
.\" 版权所有 (c) 1983 加利福尼亚大学董事会。保留所有权利。Berkeley 软件许可协议指定了有关重新发布的条款和条件。
.TH reboot 1M "2010 年 1 月 26 日" "SunOS 5.11" "系统管理命令"
.SH 名称
reboot \- 重新启动操作系统
.SH 用法概要
.LP
.nf
\fB/usr/sbin/reboot\fR [\fB-dlnq\fR] [\fB-f\fR | \fB-p\fR] [\fIboot_arguments\fR]
.fi

.LP
.nf
\fB/usr/sbin/reboot\fR [\fB-f\fR [\fB-e\fR \fIenvironment\fR] | \fB-p\fR] [\fB-dlnq\fR] [\fIboot_arguments\fR]
.fi

.SH 描述
.sp
.LP
\fBreboot\fR 实用程序可重新启动内核。PROM 监视器将内核装入内存，并将控制权转移给装入的内核。
.sp
.LP
在 x86 系统中，当指定了 \fB-f\fR 标志时，运行的内核会将下一个内核装入内存，然后将控制权转移给新装入的内核。此 \fBreboot\fR 形式如上面第二条用法概要所示。
.sp
.LP
虽然超级用户可以随时运行 \fBreboot\fR，但通常会先使用 \fBshutdown\fR(1M) 以警告登录用户服务即将丢失。有关详细信息，请参见 \fBshutdown\fR(1M)。
.sp
.LP
\fBreboot\fR 实用程序对磁盘执行 \fBsync\fR(1M) 操作，然后启动多用户重新引导。有关详细信息，请参见 \fBinit\fR(1M)。在 x86 系统中，重新引导可能还会根据需要更新引导归档文件，以确保成功重新引导。
.sp
.LP
\fBreboot\fR 实用程序通常会将重新引导记录到系统日志守护进程 \fBsyslogd\fR(1M) 中，并在登录记帐文件 \fB/var/adm/wtmpx\fR 中添加一条关机记录。如果提供了 \fB-n\fR 或 \fB-q\fR 选项，则会禁止这些操作。
.sp
.LP
通常，系统会在加电时或崩溃后进行重新引导。
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
强制在重新引导前执行系统故障转储。有关配置系统故障转储的信息，请参见 \fBdumpadm\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
如果存在 \fB-f\fR 选项，将重新引导至指定的引导环境。
.sp
次选项当前仅在 x86 系统中可用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
对于 x86 系统：
.sp
快速重新引导，跳过固件和引导装载程序。运行的内核会将新内核装入内存，同时将控制权转移给新装入的内核。如果要指定磁盘或内核参数，则必须在其他引导参数之前指定它们。
.sp
对于 SPARC 系统：
.sp
通过跳过某些 POST 测试加快重新引导过程。
.sp
缺省情况下，启用服务 \fBsvc:/system/boot-config:default\fR。它需要 \fBsolaris.system.shutdown\fR 作为 \fBaction_authorization\fR 和 \fBvalue_authorization\fR。当 \fBconfig/fastreboot_default\fR 属性设置为 \fBtrue\fR 时，\fBreboot\fR 的行为相当于 \fBreboot\fR \fB-f\fR。此属性的值可以使用 \fBsvccfg\fR(1M) 和 \fBsvcadm\fR(1M) 更改，以控制缺省的重新引导行为。
.sp
有关详细信息，请参见\fB示例\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
阻止向系统日志守护进程 \fBsyslogd\fR(1M) 发送有关谁执行了 \fBreboot\fR 的消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
避免调用 \fBsync\fR(2)，并且不将重新引导记录到 \fBsyslogd\fR(1M) 或 \fB/var/adm/wtmpx\fR 中。内核仍会在重新引导之前尝试同步文件系统，除非也使用了 \fB-d\fR 选项。如果将选项 \fB-d\fR 和 \fB-n\fR 一起使用，内核将不会尝试同步文件系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
重新引导至 PROM。此标志可用于通过固件重新引导系统，而不会更改由 \fBsystem/boot-config\fR 服务中的 \fBconfig/fastreboot_default\fR 属性设置指定的缺省重新引导行为。
.sp
\fB-p\fR 和 \fB-f\fR 选项互相排斥。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
快速。以快速、断然的方式重新引导，而不先关闭正在运行的进程。
.RE

.SH 操作数
.sp
.LP
支持下列操作数： 
.sp
.ne 2
.mk
.na
\fB\fIboot_arguments\fR\fR
.ad
.sp .6
.RS 4n
可选的 \fIboot_arguments\fR 为 \fBuadmin\fR(2) 函数指定参数，这些参数在重新启动时将传递给引导程序和内核。参数的形式和列表在 \fBboot\fR(1M) 和 \fBkernel\fR(1M) 手册页中有述。如果指定参数，参数间的空白将替换为单空格，除非针对 shell 将空白放在引号中。如果 \fIboot_arguments\fR 以连字符开头，则必须在其前面加上 \fB--\fR 分界符（两个连字符），以表示 \fBreboot\fR 参数列表结束。
.RE

.SH 示例
.LP
\fB示例 1 \fR将 \fB-r\fR 和 \fB-v\fR 参数传递给 \fBboot\fR
.sp
.LP
在下面的示例中，必须使用分界符 \fB--\fR（两个连字符）将 \fBreboot\fR 的选项与 \fBboot\fR(1M) 的参数分隔开来。

.sp
.in +2
.nf
example# \fBreboot -dl -- -rv\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR使用特定磁盘和内核重新引导
.sp
.LP
下面的示例使用特定的磁盘和内核重新引导。

.sp
.in +2
.nf
example# \fBreboot disk1 kernel.test/unix\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR快速重新引导
.sp
.LP
下面的示例使用 \fB-f\fR 选项执行快速重新引导。

.sp
.LP
如果启用了 \fBsvc:/system/boot-config:default\fR 服务，并且 \fBconfig/fastreboot_default\fR 属性设置为 \fBtrue\fR，则可省略 \fB-f\fR 选项。

.sp
.LP
在 x86 系统中，以下命令将重新引导至 GRUB（请参见 \fBgrub\fR(5)）菜单文件 \fBmenu.lst\fR 中的缺省条目。

.sp
.in +2
.nf
example# \fBreboot -f\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将重新引导至另一个 UFS 根磁盘。

.sp
.in +2
.nf
example# \fBreboot -f -- '/dev/dsk/c1d0s0'\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将重新引导至另一个 ZFS 根池。

.sp
.in +2
.nf
example# \fBreboot -f -- 'rpool/ROOT/root2'\fR
.fi
.in -2
.sp

.sp
.LP
以下命令使用 \fB-k\fR 选项重新引导至同一磁盘上的 \fBmykernel\fR。

.sp
.in +2
.nf
example# \fBreboot -f -- '/platform/i86pc/mykernel/amd64/unix -k'\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将重新引导至挂载在 \fB/mnt\fR 上的另一个根磁盘上的 \fBmykernel\fR。

.sp
.in +2
.nf
example# \fBreboot -f -- '/mnt/platform/i86pc/mykernel/amd64/unix -k'\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将重新引导至另一个名为 \fBsecond_root\fR 的引导环境中的 \fB/platform/i86pc/kernel/$ISADIR/unix\fR。

.sp
.in +2
.nf
example# \fBreboot -f -e second_root\fR
.fi
.in -2
.sp

.sp
.LP
以下命令使用 \fB-kv\fR 选项重新引导至同一内核。

.sp
.in +2
.nf
example# \fBreboot -f -- '-kv'\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将禁用缺省的快速重新引导行为。

.sp
.in +2
.nf
example# \fBsvccfg -s "system/boot-config:default" \e\fR
\fBsetprop config/fastreboot_default=false\fR
example# \fBsvcadm refresh svc:/system/boot-config:default\fR
.fi
.in -2
.sp

.sp
.LP
以下命令将重新启用缺省的快速重新引导行为。

.sp
.in +2
.nf
example# \fBsvccfg -s "system/boot-config:default" \e\fR
\fBsetprop config/fastreboot_default=true\fR
example# \fBsvcadm refresh svc:/system/boot-config:default\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR重新引导至特定 GRUB 菜单
.sp
.LP
以下命令将重新引导至 GRUB 菜单中的条目 \fB2\fR。

.sp
.in +2
.nf
example# \fBbootadm list-menu\fR
  the location for the active GRUB menu is: /rpool/boot/grub/menu.lst
  default 0
  timeout 10
  0 zfsbe1
  1 zfsbe1 failsafe
  2 zfsbe2
  3 zfsbe2 Solaris xVM
  4 zfsbe2 failsafe
example# \fBreboot 2\fR
.fi
.in -2
.sp

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.sp .6
.RS 4n
登录记帐文件
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBmdb\fR(1)、\fBboot\fR(1M)、\fBdumpadm\fR(1M)、\fBfsck\fR(1M)、\fBhalt\fR(1M)、\fBinit\fR(1M)、\fBkernel\fR(1M)、\fBshutdown\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsync\fR(1M)、\fBsyslogd\fR(1M)、\fBsync\fR(2)、\fBuadmin\fR(2)、\fBreboot\fR(3C)、\fBattributes\fR(5)、\fBgrub\fR(5)
.SH 附注
.sp
.LP
\fBreboot\fR 实用程序不执行 \fB/etc/rc\fInum\fR.d\fR 中的脚本，也不执行 \fBinittab\fR(4) 中的关机操作。为确保完全关闭系统服务，请使用 \fBshutdown\fR(1M) 或 \fBinit\fR(1M) 重新引导 Solaris 系统。
