Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/sbdadm.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates.保留所有权利。
.TH sbdadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
sbdadm \- SCSI Block Disk 命令行接口
.SH 用法概要
.LP
.nf
\fBsbdadm\fR \fBcreate-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBdelete-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBimport-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBlist-lu\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBmodify-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR
.fi

.SH 描述
.sp
.LP
\fBsbdadm\fR 命令创建和管理向 SCSI 目标模式框架 (SCSI Target Mode Framework, STMF) 进行了注册的基于 SCSI 块设备的逻辑单元。
.SH 子命令
.sp
.LP
\fBsbdadm\fR 命令支持下面列出的子命令。注意，如果您输入一个问号作为命令的参数 (\fBsbdadm ?\fR)，\fBsbdadm\fR 将显示帮助。
.sp
.ne 2
.mk
.na
\fB\fBcreate-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
创建一个可以向 STMF 进行注册的逻辑单元。对于 \fB-s\fR 选项，\fIsize\fR 是一个整数，后跟下列字母之一，表示大小的单位：
.sp
.ne 2
.mk
.na
\fB\fBk\fR\fR
.ad
.RS 5n
.rt  
千字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
兆字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBg\fR\fR
.ad
.RS 5n
.rt  
千兆字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
兆兆字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.RS 5n
.rt  
千兆兆字节
.RE

.sp
.ne 2
.mk
.na
\fB\fBe\fR\fR
.ad
.RS 5n
.rt  
艾字节
.RE

如果未指定 \fIsize\fR，则大小缺省为 \fIfilename\fR 的大小。
.sp
指定的大小可以超过文件或设备的大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
删除使用 \fBsbdadm create-lu\fR 创建的现有逻辑单元。这可以有效地从 STMF 框架中卸载逻辑单元。逻辑单元上的任何现有数据将保持不变。
.RE

.sp
.ne 2
.mk
.na
\fB\fBimport-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
将之前使用 \fBsbdadm create-lu\fR 创建的且后来又使用 \fBsbdadm delete-lu\fR 从 STMF 中删除的逻辑单元导入并装入到 STMF 中。成功后，该逻辑单元将重新可供 STMF 使用。\fIfilename\fR 是在 \fBsbdadm create-lu\fR 命令中为该逻辑单元使用的文件名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-lu\fR\fR
.ad
.sp .6
.RS 4n
列出使用 \fBsbdadm create-lu\fR 命令创建的所有逻辑单元。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
修改使用 \fBsbdadm create-lu\fR 命令创建的逻辑单元的属性。对于 \fB-s\fR 选项，\fIsize\fR 是一个整数值，后跟单位说明符。单位说明符同上文的 \fBcreate-lu\fR 部分所述。指定了此选项时，逻辑单元的当前大小将更改为新的大小。
.sp
指定的大小可以超过 \fIlu_name\fR 表示的文件或设备的大小。
.RE

.SH 操作数
.sp
.LP
\fBsbdadm\fR 使用以下操作数：
.sp
.ne 2
.mk
.na
\fB\fIfilename\fR\fR
.ad
.sp .6
.RS 4n
现有文件的名称，或原始块设备的全限定路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fIlu_name\fR\fR
.ad
.sp .6
.RS 4n
逻辑单元的 32 字节十六进制表示。
.RE

.SH 示例
.LP
\fB示例 1 \fR创建逻辑单元
.sp
.LP
以下命令系列将创建一个 10 千兆字节的逻辑单元。

.sp
.in +2
.nf
# \fBtouch /export/lun/0\fR
# \fBsbdadm create-lu -s 10g /export/lun/0\fR
# \fBsbdadm create-lu /dev/rdsk/c1t1d0s0\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR列出逻辑单元
.sp
.LP
以下命令将列出所有逻辑单元。

.sp
.in +2
.nf
# \fBsbdadm list-lu\fR
Found 2 LU(s) 

              	GUID           	   DATA SIZE    SOURCE 
--------------------------------  -----------  ------ 
6000ae4000144f21d92c47b0dd650002  10737352704  /export/lun/0
6000ae4000144f21d92c47b0de300032  134283264    /dev/rdsk/c1t1d0s0
.fi
.in -2
.sp

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB非零\fR\fR
.ad
.sp .6
.RS 4n
出现错误。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性T{
system/storage/scsi-target-mode-framework
T}
_
接口稳定性T{
Obsolete Committed（已过时且已确定）
T}
.TE

.SH 另请参见
.sp
.LP
\fBstmfadm\fR(1M)、\fBattributes\fR(5)
