Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/scmadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH scmadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
scmadm \- 存储高速缓存管理器管理实用程序
.SH 用法概要
.LP
.nf
\fBscmadm\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-h\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-e\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-d\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-v\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-C\fR [\fIparameter\fR [= [\fIvalue\fR]]...]
.fi

.LP
.nf
\fBscmadm\fR \fB-o\fR {system | \fIcd\fR | \fIdevice\fR} [\fIoption\fR]
.fi

.LP
.nf
\fBscmadm\fR \fB-m\fR {\fIcd\fR |  \fIdiskname\fR |  all}
.fi

.SH 描述
.sp
.LP
\fBscmadm\fR 命令提供了用于控制和收集存储设备高速缓存相关信息的各种选项。 
.SH 选项
.sp
.LP
如果未指定任何选项，\fBscmadm\fR 将显示所配置的包含磁盘名称、选项和全局选项的高速缓存描述符的列表。\fBscmadm\fR 命令支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBscmadm\fR 命令的用法信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
读取配置并使用那些参数启用存储设备高速缓存。请参见 \fBdscfg\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
关闭存储设备高速缓存。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
显示高速缓存的版本号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR [\fIparameter\fR[=[\fIvalue\fR]] ...]\fR
.ad
.sp .6
.RS 4n
设置或显示配置参数。如果没有为 \fB-C\fR 选项指定任何参数，则会显示当前的高速缓存配置参数。如果指定了 \fIparameter\fR，则会显示 \fIparameter\fR 的当前值。如果指定了 \fIparameter=value\fR，则会显示 \fIparameter\fR 的当前值并将该参数的值更改为 \fIvalue\fR。如果省略了 \fIvalue\fR 或者将 \fIvalue\fR 指定为空字符串、" " 或 "-"，则会将参数从配置中删除，且系统将使用缺省值。可以在 \fBscmadm\fR 命令的单个调用中指定多个参数。对配置参数所做的更改在高速缓存下次重新启动时才会生效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR { \fBsystem\fR | \fBcd\fR | \fIdiskname\fR } [\fIoption\fR]\fR
.ad
.sp .6
.RS 4n
为系统或者为由 \fBcd\fR 或 \fIdiskname\fR 指定的高速缓存设备设置或显示选项。如果指定了\fI选项\fR \fBrdcache\fR 或 \fBnordcache\fR，则会为系统或指定的高速缓存设备设置该选项。选项保存为配置的一部分，因此选项持久有效。请参见 \fBdscfg\fR(1M)。要通知系统"忘记"所保存的某个选项，请使用 \fBforget\fR（忘记）选项。这不会更改选项，只会把选项从所保存的配置中删除。如果未指定任何选项，则会显示当前选项。\fBrdcache\fR 选项是缺省设置。\fIoption\fR 的定义如下：
.sp
.ne 2
.mk
.na
\fB\fBrdcache\fR\fR
.ad
.sp .6
.RS 4n
数据块可能会被再次引用，应该保留在高速缓存中。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnordcache\fR\fR
.ad
.sp .6
.RS 4n
数据块不可能被再次引用，应该将其作为最近最少使用的项对待，以便其他块可以更长久地保留在高速缓存中。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR { \fBcd\fR | \fIdiskname\fR | \fBall\fR }\fR
.ad
.sp .6
.RS 4n
为由 \fBcd\fR 或 \fIdiskname\fR 指定的设备显示高速缓存描述符和磁盘名称映射；如果指定了 \fBall\fR（全部），则会为系统上的所有存储设备显示高速缓存描述符和磁盘名称映射。
.RE

.SH 退出状态
.sp
.LP
\fBscmadm\fR 命令成功时返回 0，发生错误时返回非零值。
.SH 文件
.sp
.LP
\fB/dev/sdbc\fR
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-cache-management
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdscfg\fR(1M)、\fBattributes\fR(5)
.SH 诊断
.sp
.LP
如果没有足够的连续内存，则 \fBscmadm\fR 将失败。
