Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/smbd.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates.保留所有权利。
.TH smbd 1M "2011 年 8 月 23 日" "SunOS 5.11" "系统管理命令"
.SH 名称
smbd \- SMB 服务器守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/smbd\fR
.fi

.SH 描述
.sp
.LP
\fBsmbd\fR 守护进程处理来自 \fBSMB\fR 客户机（如 Windows 客户机）的 \fBCIFS\fR/\fBSMB\fR 请求。只有具有 \fB{PRIV_SYS_SMB}\fR 且具有足够的特权向 \fB/var/run\fR 目录进行写入的进程能够运行此守护进程。
.sp
.LP
在所有可用的传输上使用 \fBshare\fR(1M) 命令或 \fBzfs\fR(1M) \fBset share\fR 命令会自动调用 \fBsmbd\fR 守护进程。缺省情况下，\fBsmbd\fR 在 NetBIOS-Over-TCP (\fBNBT\fR) 和 \fBTCP\fR 传输上启动。
.sp
.LP
当在 \fBNBT\fR 上启动 \fBsmbd\fR 时，会启动以下服务：
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS 名称服务在 \fBUDP\fR 端口 137 上启动。
.RE
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS 数据报服务在 \fBUDP\fR 端口 138 上启动。
.RE
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS 会话服务在 \fBTCP\fR 端口 139 上启动。
.RE
.sp
.LP
当在 TCP 上启动 \fBsmbd\fR 守护进程时，SMB 服务在 TCP 端口 445 上启动。
.sp
.LP
一次只能运行一个 \fBsmbd\fR 实例。
.SH 退出状态
.sp
.LP
将返回下列退出值：
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
守护进程干净地退出。
.RE

.sp
.ne 2
.mk
.na
\fB95\fR
.ad
.RS 13n
.rt  
守护进程带致命错误退出。
.RE

.sp
.ne 2
.mk
.na
\fB96\fR
.ad
.RS 13n
.rt  
守护进程带配置错误退出。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5) 手册页：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/file-system/smb
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBps\fR(1)、\fBsvcs\fR(1)、\fBshare\fR(1M)、\fBsharectl\fR(1M)、\fBsmbadm\fR(1M)、\fBsmbstat\fR(1M)、\fBsvcadm\fR(1M)、\fBzfs\fR(1M)、\fBsmb\fR(4)、\fBsmbautohome\fR(4)、\fBsystem\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
可以使用 \fBsvcadm\fR 命令对 \fBsmbd\fR 服务执行管理操作，例如启用、禁用或重新启动服务。可以使用 \fBsvcs\fR 命令查询该服务的状态。
.sp
.LP
\fBsmbd\fR 服务由服务管理工具管理，其服务标识符为 \fBsvc:/network/smb/server\fR。
.sp
.LP
如果禁用了 \fBsmbd\fR 服务，可通过 \fBshare\fR(1M) 命令或 \fBzfs set share\fR 命令启用该服务，除非其 \fBauto_enable\fR 属性设置为 false。
