Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/smbios.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates.保留所有权利。
.TH smbios 1M "2005 年 8 月 31 日" "SunOS 5.11" "系统管理命令"
.SH 名称
smbios \- 显示系统管理 BIOS 映像的内容
.SH 用法概要
.LP
.nf
\fBsmbios\fR [\fB-BeOsx\fR] [\fB-i\fR \fIid\fR] [\fB-t\fR \fItype\fR] [\fB-w\fR \fIfile\fR] [\fIfile\fR]
.fi

.SH 描述
.sp
.LP
\fBsmbios\fR 实用程序显示当前系统导出的或文件中存储的系统管理 BIOS (System Management BIOS, SMBIOS) 映像的内容。SMBIOS 是一种行业标准机制，低层次系统软件使用该机制将硬件配置信息导入较高层次的系统管理软件。SMBIOS 数据格式自身是由分布式管理任务组 (Distributed Management Task Force, DMTF) 定义的。有关 SMBIOS 以及如何获取 SMBIOS 规范和实施指南副本的更多信息，请参阅 http://www.dmtf.org。 
.sp
.LP
SMBIOS 映像包括一个结构表，每个结构描述系统软件或硬件配置的某个方面。缺省情况下，\fBsmbios\fR 显示当前 SMBIOS 映像的完整内容。如果指定了 \fB-s\fR 选项，\fBsmbios\fR 将显示映像中存在的结构的摘要。如果指定了 \fB-w\fR 选项，\fBsmbios\fR 会将 SMBIOS 映像的副本写入到指定文件。然后，\fBsmbios\fR 可以应用于生成的文件以显示其内容。 
.sp
.LP
\fBsmbios\fR 尝试以用户可阅读的方式显示每个结构及其内容。如果 \fBsmbios\fR 不能识别某个结构的类型或内容，则会显示该结构的原始十六进制数据。 
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.RS 11n
.rt  
为损坏的 BIOS 禁用头验证。 
.sp
缺省情况下，\fBsmbios\fR 尝试通过验证锚字符串、头校验和以及版本号来验证 SMBIOS 头。当 BIOS 具有不兼容的头时可能需要此选项。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 11n
.rt  
 显示 SMBIOS 入口点的内容，而不是 SMBIOS 结构表的内容。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIid\fR\fR
.ad
.RS 11n
.rt  
仅显示指定的结构（由其整数 ID 指定）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR\fR
.ad
.RS 11n
.rt  
 显示过时的结构类型。 
.sp
缺省情况下，\fBsmbios\fR 将省略 DMTF SMBIOS 规范中其类型被标记为已过时的结构的输出。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 11n
.rt  
仅显示结构标识符和类型的摘要列表，而不是每个选定结构的内容。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR\fR
.ad
.RS 11n
.rt  
仅显示其类型与指定的整数类型匹配的那些结构，如 DMTF SMBIOS 规范所定义的那样。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIfile\fR\fR
.ad
.RS 11n
.rt  
将 SMBIOS 映像的副本写入指定文件并退出。 
.sp
将 SMBIOS 入口点写入到其结构表地址设置为结构表的文件偏移量的文件的开头，并计算新的入口点校验和。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 11n
.rt  
除适合用户阅读的输出外，还显示所选结构的原始十六进制数据。 
.sp
缺省情况下，如果 \fBsmbios\fR 无法为所选结构显示适合用户阅读的输出，则仅显示十六进制数据。 
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
指定要显示的其他 SMBIOS 映像，而不是当前系统的 SMBIOS 映像。 
.RE

.SH 退出状态
.sp
.LP
将返回下列退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。成功检查了 SMBIOS 映像中的所有结构。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现致命错误，如未能打开指定的文件或设备，或映像损坏。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
指定的命令行选项无效。 
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/dev/smbios\fR \fR
.ad
.RS 16n
.rt  
内核 SMBIOS 映像设备。该设备特殊文件用于导出当前系统 SMBIOS 映像的快照。 
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性请参见下文。 
.TE

.sp
.LP
命令行选项为 Committed（已确定）。人类可阅读的输出为 Uncommitted（未确定）。 
.SH 另请参见
.sp
.LP
\fBprtdiag\fR(1M)、\fBattributes\fR(5)、\fBsmbios\fR(7D)
.sp
.LP
\fI系统管理 BIOS 参考规范\fR（请参见 http://www.dmtf.org）
.SH 附注
.sp
.LP
系统管理 BIOS 映像的实现完全是由系统和 BIOS 供应商决定的。并不是所有系统都导出 SMBIOS。在不同的系统和 BIOS 供应商之间，SMBIOS 结构内容变化很大，并且经常不遵循规范中包含的准则。BIOS 可能根本不填充某些结构字段，而某些字段可能是由不合适的值填充的。 
