Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/sndrd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH sndrd 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
sndrd \- Remote Mirror 守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/sndrd\fR [\fB-c\fR \fImax_connections\fR] [\fB-l\fR \fIlisten_backlog\fR]
.fi

.SH 描述
.sp
.LP
\fBsndrd\fR 守护进程处理客户机远程镜像请求。只有超级用户或具有同等特权的用户可以运行此守护进程。该守护进程是以运行级 2 自动调用的。\fBsndrd\fR 重新启动 TCP 传输层。
.sp
.LP
要更改 \fBsndrd\fR 的启动参数，管理员必须以 root 身份或等效身份更改 \fB/etc/default/sndr\fR 文件，而不是编辑 \fB/lib/svc/method/svc-rdcsyncd\fR 文件。请参见 \fBsndr\fR(4)。
.SH 选项
.sp
.LP
\fBsndrd\fR 守护进程支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fImax_connections\fR\fR
.ad
.sp .6
.RS 4n
设置面向连接的传输上的服务器允许的最大连接数。缺省情况下，连接数是 16。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlisten_backlog\fR\fR
.ad
.sp .6
.RS 4n
为面向连接的传输上的 RDC TCP 设置连接队列长度。缺省值为 10 个条目。
.RE

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
守护进程启动成功。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
守护进程启动失败。
.RE

.sp
.LP
错误信息以 \fBLOG_ERR\fR 级别报告到 \fBsyslog\fR 中。
.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
用于启动 \fBsndrd\fR 的 shell 脚本。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
用于停止 \fBsndrd\fR 的 shell 脚本。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-remote-mirror
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBsvcadm\fR(1M)、\fBsyslogd\fR(1M)、\fBds.log\fR(4)、\fBattributes\fR(5)
.SH 附注
.sp
.LP
不要手动停止 sndrd 守护进程。如果需要手动停止 sndrd，请执行以下步骤。这将同时停止 \fBsndrd\fR 和 \fBsndrsyncd\fR 守护进程。
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
不要手动启动或重新启动 sndrd 守护进程。如果需要手动启动 sndrd，请执行以下步骤。这将同时启动 sndrd 和 sndrsyncd 守护进程。
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
有关其他信息，请参见 \fBsvcadm\fR(1M)。
