Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/sndrsyncd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH sndrsyncd 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
sndrsyncd \- Availability Suite Remote Mirror 更新重新同步守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/sndrsyncd\fR 
.fi

.SH 描述
.sp
.LP
\fBsndrsyncd\fR 守护进程在网络或计算机发生故障后自动执行更新重新同步，并且在需要时调用 Point-in-Time Copy 副本以保护在重新同步过程中更新的数据卷。
.sp
.LP
当 Remote Mirror 使用的网络链路出现故障时，内核将通知该守护进程，该守护进程将使用 \fB-u\fR 选项调用 \fBsndradm\fR(1M) 命令来重新同步启用了自动同步功能且正在使用该网络链路的所有 Remote Mirror 集。有关如何为 Remote Mirror 集配置自动同步功能的详细信息，请参见 \fBsndradm\fR(1M)。
.sp
.LP
当有任何 Remote Mirror 重新同步启动或完成时，也会通知该守护进程。如果在 Availability Suite 配置文件中配置了守护进程，该守护进程将创建 Availability Suite 快照。在辅助服务器上，守护进程检查文件系统当前是否已挂载到辅助卷上，如果文件系统当前已挂载，则会通知内核不允许启动同步。
.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
守护进程启动成功。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
守护进程启动失败。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
用于启动 \fBsndrsyncd\fR 的 shell 脚本。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
用于停止 \fBsndrsyncd\fR 的 shell 脚本。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-remote-mirror
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBiiadm\fR(1M)、\fBsndradm\fR(1M)、\fBsndrd\fR(1M)、\fBsvcadm\fR(1M)、\fBds.log\fR(4)、\fBrdc.cf\fR(4)、\fBattributes\fR(5)
.SH 附注
.sp
.LP
不要手动停止 sndrsyncd 守护进程。如果需要手动停止 sndrsyncd，请执行以下步骤。这将同时停止 \fBsndrd\fR 和 \fBsndrsyncd\fR 守护进程。
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
不要手动启动或重新启动 \fBsndrsyncd\fR 守护进程。如果需要手动启动 \fBsndrsyncd\fR，请执行以下步骤。这将同时启动 \fBsndrd\fR 和 \fBsndrsyncd\fR 守护进程。
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
有关其他信息，请参见 \fBsvcadm\fR(1M)。
