Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/sndradm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH sndradm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
sndradm \- 控制 Sun StorageTek Availability Suite 远程镜像操作
.SH 用法概要
.LP
.nf
\fBsndradm\fR \fB-I\fR a \fImaster\fR \fIshadow\fR \fIbitmap\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-I\fR d \fImaster\fR \fIshadow\fR \fIbitmap\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-h\fR \fIusage message\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-v\fR \fIversion information\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-e\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-E\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-d\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-D\fR block [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-D\fR noblock [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-l\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-m\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-m\fR \fB-r\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-u\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-u\fR \fB-r\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-w\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-H\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-p\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-P\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR a \fIvolume\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR d [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR r \fIvolume\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-i\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-a\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-A\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-F\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-W\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR b p \fIbitmap\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR b s \fIbitmap\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR C \fItag\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR g \fIio_groupname\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR m sync [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR m async [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR \fB-f\fR \fIvolset-file\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR r [\fIsndr_set\fR] *
.fi

.SH 描述
.sp
.LP
\fB/usr/sbin/sndradm\fR 命令是用于 Sun StorageTek Availability Suite 远程镜像软件的管理命令行接口。使用远程镜像，可以在物理分隔的不同 Sun 服务器之间实时复制磁盘。远程镜像在概念上与 RAID 1 的本地磁盘镜像方案相似，但它在较远距离执行复制操作。
.sp
.LP
如果未在命令行中指定远程镜像集 (\fIsndr_set\fR)，\fBsndradm\fR 基于配置的所有远程镜像集运行。
.sp
.LP
\fBsndradm\fR 命令在 Availability Suite 日志文件 \fB/var/adm/ds.log\fR（请参见 \fBds.log\fR(4)）中为除输出 (\fB-p\fR、\fB-P\fR 和 \fB-i\fR）、帮助 (\fB-h\fR) 和版本 (\fB-v\fR) 以外的所有操作生成一个项。
.SH 选项
.sp
.LP
\fBsndradm\fR 实用程序支持下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIvolset-file\fR\fR
.ad
.sp .6
.RS 4n
指定包含一个或多个远程镜像集的 \fIsndr_set\fR 信息的文件，该文件的格式与下面记录的完全指定命令行 \fIsndr_set\fR 的格式相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIio_groupname\fR\fR
.ad
.sp .6
.RS 4n
将操作仅限制为 \fIio_groupname\fR 包含的远程镜像集。 
.sp
给定集合的 \fIio_groupname\fR 必须在主要主机和辅助主机上保持一致。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
在群集节点中，将操作仅限制为 \fItag\fR 指定的群集资源组或磁盘组名称所包含的远程镜像集。此选项在非群集系统上无效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
使用 \fBsndradm\fR 启动远程镜像操作后不会提示用户。对于输出、帮助和版本选项以外的所有选项，缺省行为是提示进行响应。例如，在启动从主卷到辅助卷的完全同步之后，远程镜像提示：\fB"Overwrite secondary with primary? (Y/N) [N]"\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsndr_set\fR\fR
.ad
.sp .6
.RS 4n
指定远程镜像集。对于已启用的集合，此选项可以是 \fIshost\fR:\fIsdev\fR 格式的 \fBset_name\fR。可以提供一个格式与配置文件相同的完全指定的远程镜像集：
.sp
.in +2
.nf
\fIphost  pdev  pbitmap  shost  sdev  sbitmap\fR \fBip\fR {\fBsync | async\fR} \e
[g \fIio_groupname\fR] [C \fItag\fR]
.fi
.in -2

下面介绍了这些参数：
.sp
.ne 2
.mk
.na
\fB\fIphost\fR\fR
.ad
.sp .6
.RS 4n
指定主卷所在的服务器。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpdev\fR\fR
.ad
.sp .6
.RS 4n
指定要复制的主卷分区。仅指定全路径名（例如，\fB/dev/rdsk/c0t1d0s2\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpbitmap\fR\fR
.ad
.sp .6
.RS 4n
指定存储主分区的位图（记分板日志）的卷分区。仅指定全路径名（例如，\fB/dev/rdsk/c0t1d0s3\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fIshost\fR\fR
.ad
.sp .6
.RS 4n
指定辅助卷所在的服务器。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsdev\fR\fR
.ad
.sp .6
.RS 4n
指定辅助卷分区。仅指定全路径名（例如，\fB/dev/rdsk/c0t1d0s4\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsbitmap\fR\fR
.ad
.sp .6
.RS 4n
指定存储辅助分区的位图（记分板日志）的卷分区。仅指定全路径名（例如，\fB/dev/rdsk/c0t1d0s5\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBip\fR\fR
.ad
.sp .6
.RS 4n
指定网络传输协议。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsync | async\fR\fR
.ad
.sp .6
.RS 4n
指定远程镜像运行模式。\fBsync\fR 是远程镜像模式，在此模式下，I/O 操作不会确认为已完成，直到已更新远程卷为止。\fBasync\fR 是远程镜像模式，在此模式下，主要主机 I/O 操作确认为已完成，然后再更新远程卷。
.RE

.sp
.ne 2
.mk
.na
\fB\fIio_groupname\fR\fR
.ad
.sp .6
.RS 4n
指定远程镜像集所属的远程镜像一致性组的名称。在异步模式下，必须在远程镜像一致性组中的所有复制卷中保存写入顺序。这可以确保该组包含的辅助卷包含相应主卷的有效时间点副本。 
.sp
向一致性组添加现有集合或在组中添加某个集合时，必须使用相同组名在主要主机和辅助主机上配置此集合。
.RE

.sp
.ne 2
.mk
.na
\fB\fItag（标记）\fR\fR
.ad
.sp .6
.RS 4n
对于群集内的操作，如果卷名未暗含本地数据的磁盘组名称或资源标记以及位图卷，此选项会指定这些内容（例如，\fB/dev/rdsk/md/dg/vol\fR 和 \fB/dev/vx/rdsk/dg/vol\fR 均指示磁盘组名称 \fBdg\fR）。用户负责确保为远程镜像指定的群集标记与相应群集资源组标记匹配，并确保在重新配置群集资源组时所有 Availability Suite 服务都是最新的。在非群集系统上指定群集资源标记是非法的。
.RE

.RE

.SH 参数
.sp
.LP
有效 \fBsndradm\fR 命令必须指定下面列出的某个参数。
.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fBa\fR \fImaster\fR \fIshadow\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
向 Availability Suite 配置文件添加具有指定主卷、影子卷和位图卷的 \fBndr_ii\fR 项。请参见 \fBsndrsyncd\fR(1M)。如果相应 Point-in-Time Copy 集合不存在，则会在相关卷上执行下一 \fBsync\fR 命令时启用此集合。如果不再需要此集合，使用 \fBiiadm\fR \fB-d\fR 可禁用此 Point-in-Time Copy 集合。请参见 \fBiiadm\fR(1M)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fBd\fR \fImaster\fR \fB\fIshadow\fR\fR \fB\fIbitmap\fR\fR\fR
.ad
.sp .6
.RS 4n
从 Availability Suite 配置文件中删除具有指定主卷、影子卷和位图卷的 \fBndr_ii\fR 项。使用 \fBdscfg\fR 命令列出 \fBndr_ii\fR 配置项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定此集合的自动同步变量的值（打开或关闭）。针对某个集合请求 \fBautosync\fR 之后，从请求同步操作之时起，此功能处于活动状态，直到手动将此集合置于日志记录模式为止。手动将此集合置于日志记录模式后，\fBautosync\fR 功能将处于非活动状态，并在下次执行 \fBsync\fR 请求之前一直保持非活动状态。要检查 \fBautosync\fR 是否处于活动状态，请使用 \fBsndradm\fR \fB-P\fR。要检查是否已针对某个集合请求 autosync，请在 \fBdscfg\fR \fB-l\fR 输出中查找此集合的"\fBauto=on;\fR"标记。请参见 \fBsndrsyncd\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定在异步模式下复制集时为处理异步队列可创建的最大线程数。缺省值为 \fB2\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-W\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定可在异步模式下复制的集合中排队的最大写入数。缺省值为 \fB4096\fR。例如，将此值设置为 1 可确保辅助卷包含的写入操作数比主卷包含的写入操作数最多小 1。
.sp
调整最大写入数仅对使用基于内存的异步 I/O 队列有效。当使用基于磁盘的 I/O 队列时，将忽略此值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fB{block\fR \fB|\fR \fBnoblock}\fR\fR
.ad
.sp .6
.RS 4n
切换基于磁盘的队列的 \fBblock\fR|\fBnoblock\fR 属性。缺省设置为 \fBblock\fR。如果 I/O 填充速率远远大于清除速率以致无法填充此队列，则会阻止传入 I/O 直到队列中存在用于此 I/O 的充足空间为止。这是为了保存写入顺序，而不管是在一个卷还是在同一一致性组中的多个卷内。如果设置了 \fBnoblock\fR，传入 I/O 将填充此队列，并且不会阻止 I/O。此集合将置于日志记录模式，并忽略磁盘队列内容。后继更新同步会将最新数据同步到辅助站点。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定可在异步模式下复制的集合中排队的内核内存中的 512 字节 FBA 的最大数目。缺省值为 \fB16384\fR。
.sp
调整最大 FBA 数仅对使用基于内存的异步 I/O 队列的集合有效。使用基于磁盘的 I/O 队列时，将忽略此值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
输出 \fBsndradm\fR 用法汇总。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
输出远程镜像版本号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
为集合启用远程镜像，并启用记分板日志记录。设置记分板以便指示需要完全同步。集合详细信息保存在当前配置中。请参见 \fBdscfg\fR(1M)。针对存储卷驱动程序启用逻辑卷和位图卷（请参见 \fBsv\fR(7D)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.sp .6
.RS 4n
为集合启用远程镜像，并启用记分板日志记录。清除记分板以便指示已确保完全同步主卷和辅助卷。集合详细信息保存在当前配置中。请参见 \fBdscfg\fR(1M)。针对存储卷驱动程序启用逻辑卷和位图卷（请参见 \fBsv\fR(7D)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
为集合禁用远程镜像，并暂停任何当前的同步操作。\fBsndradm\fR \fB-d\fR 还会废弃用于跟踪主卷和辅助卷之间的临时差异的任何活动记分板。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
在主卷和辅助卷之间停止远程镜像复制和复制操作，并在这些卷上启动单独的远程镜像记分卡日志记录。复制一致性组中的所有集合时，这意味着辅助卷包含相应主卷的有效时间点副本。此种情况下，只要远程镜像集进入日志记录模式，\fBrdc\fR 内核模块会使此组中的所有其他集合自动进入日志记录模式。这确保辅助卷仍包含有效的时间点副本。要在使用 \fB-l\fR 参数后恢复远程镜像，请使用 \fB-m\fR 参数执行完全重新同步，或者使用 \fB-u\fR 参数执行更新重新同步（根据记分板）。
.sp
此选项不会在当前正在同步的任何卷的辅助卷上运行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.sp .6
.RS 4n
等待同步复制完成或中止，或者立即返回（如果在辅助系统上调用）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
报告指定卷集使用的网络链路的运行状况。此链路的运行状况报告为活动或非活动。活动表示此网络链路当前正积极用于复制或重新同步数据，因此运行状况良好。非活动表示网络链路当前未积极用于复制或重新同步数据，这可能表示此链路存在问题。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
显示配置的远程镜像卷或集合的列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
显示配置的远程镜像卷或集合的列表以及额外详细信息。（请参见下面的状态说明。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBa\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
向集合或组添加磁盘队列。集合或组处于日志记录模式时，此操作有效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBd\fR\fR
.ad
.sp .6
.RS 4n
从集合或组中删除磁盘队列。集合或组处于日志记录模式时，此操作有效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBr\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
替换组或集合的磁盘队列。按照在队列禁用操作中的方式从集合或组中删除队列，并且按照在队列添加操作中的方式添加新磁盘队列。集合或组处于日志记录模式时，此操作有效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
采用与 \fIvolset-file\fR 相同的格式显示配置的远程镜像卷或集合的列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
尝试重置远程镜像集的错误条件，例如，故障位图。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBb\fR \fBp\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
重新配置远程镜像集的主要位图。应在主要服务器和辅助服务器上输入此命令。一次只能为一个集合重新配置主要位图。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBb\fR \fBs\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
重新配置远程镜像集的辅助位图。应在主要服务器和辅助服务器上输入此命令。一次只能为一个集合重新配置辅助位图。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBC\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
重新配置远程镜像集的逻辑卷的群集标记或磁盘组名称（如果路径名未指示这些内容）。这不会影响远程卷。无法在非群集系统上使用此参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBm\fR \fB{sync\fR \fB|\fR \fBasync}\fR\fR
.ad
.sp .6
.RS 4n
重新配置远程镜像集的复制模式。一致性组包含的集合必须全部处于同步或异步状态。无法在一个组中混合多种模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBg\fR \fIgroup\fR\fR
.ad
.sp .6
.RS 4n
重新配置远程镜像集的一致性组。应使用相同组名在主要服务器和辅助服务器上输入此命令。
.sp
要从一致性组中删除某个集合，请在重新配置一致性组时指定空字符串 (" ")。
.RE

.sp
.LP
只能从主要服务器上发出下列参数：
.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
启动从主卷到辅助卷的完整卷复制，同时对新更新启用从主卷到辅助卷的远程镜像复制。当主卷和辅助卷可能互不相同，并且不存在以增量方式重新同步卷的日志记录信息时，请使用此参数。请参见"退出状态"。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
颠倒同步方向，以便从辅助卷同步主卷。将此参数与 \fB-m\fR 或 \fB-u\fR 参数配合使用。\fB-m\fR \fB-r\fR 启动从辅助（源）卷到主（目标）卷的完整卷复制，但同时启用从主（源）卷到辅助（目标）卷的新更新的远程镜像复制，从而确保卷集保持同步。当主卷和辅助卷内容可能互不相同，并且辅助卷具有所需内容，但不存在以增量方式重新同步卷（使用 \fB-u\fR）的日志记录信息时，请使用 \fB-m\fR \fB-r\fR。\fB-u\fR \fB-r\fR 使用在暂停复制时维护的远程镜像记分板日志从辅助（源）卷重新同步主（目标）卷。然后，恢复从主卷到辅助卷的新更新的远程镜像复制，以使卷集保持同步。在恢复/刷新操作期间停止卷集的工作负荷。此操作确保在恢复新更新复制之前匹配主卷和辅助卷。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
更新远程镜像卷集。此参数重新同步远程镜像卷集。仅更新远程镜像记分板中记录为已发生更改的块。启用对主卷的远程镜像复制，并使用远程镜像记分板日志启动重新同步过程，以使相应辅助卷与主卷匹配。
.RE

.SS "\fBsndradm\fR \fB-P\fR 返回的状态"
.sp
.LP
下面列出了 \fBsndradm\fR \fB-P\fR 可返回的状态。
.sp
.ne 2
.mk
.na
\fB\fBvolume\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
逻辑数据卷的 I/O 操作已失败
.RE

.sp
.ne 2
.mk
.na
\fB\fBbitmap\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
逻辑位图卷的 I/O 操作已失败
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisk\fR \fBqueue\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
磁盘队列卷的 I/O 操作已失败
.RE

.sp
.ne 2
.mk
.na
\fB\fBneed\fR \fBsync\fR\fR
.ad
.sp .6
.RS 4n
已中断到此卷的同步。需要完成此同步（或通过 Point-in-Time Copy 恢复）。不能更改数据流方向，直到已完成一个或其他数据流为止。
.RE

.sp
.ne 2
.mk
.na
\fB\fBneed\fR \fBreverse\fR \fBsync\fR\fR
.ad
.sp .6
.RS 4n
已中断到此卷的反向同步。需要完成此同步（或通过 Point-in-Time Copy 恢复）。不能更改数据流方向，直到已完成一个或其他数据流为止。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlogging\fR\fR
.ad
.sp .6
.RS 4n
仅在位图中记录传入写入。不会将数据复制到远程站点。\fBneed sync\fR、\fBneed reverse sync\fR 和 \fBqueuing\fR 均为日志记录的子状态，以便在位图中记录（而不是复制）写入。队列模式（如下所述）将写入记录到位图，并对请求进行排队，以便在稍后由异步刷新程序复制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreverse\fR \fBsyncing\fR\fR
.ad
.sp .6
.RS 4n
正在进行从辅助卷到主卷的复制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsyncing\fR\fR
.ad
.sp .6
.RS 4n
正在进行从主卷到辅助卷的复制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBqueuing\fR\fR
.ad
.sp .6
.RS 4n
使用磁盘队列进行常规异步复制时，i/o 将放置到磁盘队列中，以便由异步刷新程序线程复制。如果发生临时链路故障，集合将切换到队列模式。不会废弃队列，因为它将与基于内存的队列一起运行。数据将记录到位图中，并放置在队列中。启用链路并发出 \fBsndradm\fR \fB-u\fR 时（通过为集合启用 autosync 来自动执行此操作），将重新启动刷新程序。这会在整个临时链路中断过程中保留写入顺序。如果不需要使用写入顺序，并且仅需要最新数据，则可将集合手动置于日志记录模式 (\fBsndradm\fR \fB-l\fR)，并发出更新同步 (\fBsndradm\fR \fB-u\fR)。此操作废弃队列中的数据，并使用位图进行快速重新同步。如果在链路恢复并发出更新同步之前填充队列，则会废弃此队列，并将集合置于日志记录模式以免应用程序挂起。
.RE

.SH 示例
.LP
\fB示例 1 \fR启用远程镜像集
.sp
.LP
下面的命令在主机 \fBexample\fR 上启用远程镜像异步集合，其中 \fBexample\fR 是主要主机，\fBexample-remote\fR 是辅助主机。

.sp
.in +2
.nf
example% \fBsndradm -e example /dev/rdsk/c1t0d0s1 /dev/rdsk/c1t1d0s3 \e
example-remote /dev/rdsk/c2t3d0s5 /dev/rdsk/c2t4d0s5 ip async\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR向异步集合添加磁盘队列
.sp
.LP
下面的命令向异步集合添加磁盘队列卷。

.sp
.in +2
.nf
example% \fBsndradm -q a /dev/rdsk/c1t2d0s3 \e
example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR从异步集合中删除磁盘队列
.sp
.LP
下面的命令从附加有磁盘队列卷的集合中删除磁盘队列卷。

.sp
.in +2
.nf
example% \fBsndradm -q d example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR禁用远程镜像集
.sp
.LP
下面的命令禁用在主机 \fBexample\fR 上启用的远程镜像集。

.sp
.in +2
.nf
example% \fBsndradm -d example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
命令已成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
出现错误。
.RE

.sp
.LP
在脚本中执行 \fB-m\fR 或 \fB-u\fR 选项时，这些选项后面的某个选项的退出状态始终返回成功，而不管远程镜像集的当前状态如何。
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性storage/avs/avs-remote-mirror
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdscfg\fR(1M)、\fBsndrd\fR(1M)、\fBsndrsyncd\fR(1M)、\fBds.log\fR(4)、\fBrdc.cf\fR(4)、\fBattributes\fR(5)、\fBsv\fR(7D)
