Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/snmp-notify.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates.保留所有权利。
.TH snmp-notify 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
snmp-notify \- 用于软件事件的 SNMP 通知守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/fm/notify/snmp-notify\fR
.fi

.SH 描述
.sp
.LP
\fBsnmp-notify\fR 是用于订阅软件事件及 FMA 诊断和修复事件并根据存储在 SMF 服务配置系统信息库中的一组通知首选项生成 SNMP 陷阱通知的守护进程。
.sp
.LP
SNMP 通知首选项是使用 \fBsvccfg\fR(1M) 设置的。
.sp
.LP
\fBsnmp-notify\fR 由服务管理工具 \fBsmf\fR(5) 管理，其服务 FMRI 为：
.sp
.in +2
.nf
svc:/system/fm/snmp-notify:default
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvcadm\fR(1M) 来执行对此服务的管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。
.SS "属性"
.sp
.LP
可以设置以下服务属性：
.sp
.ne 2
.mk
.na
\fB\fBconfig/rootdir\fR\fR
.ad
.sp .6
.RS 4n
这是缺省值为 \fB/\fR 的一个 \fBastring\fR 属性。设置了此属性时，将为 \fBsnmp-notify\fR 评估的所有路径名使用指定的根目录。
.RE

.SH 示例
.LP
\fB示例 1 \fR配置通知首选项
.sp
.LP
以下命令为 SMF 服务状态转换事件配置通知首选项。

.sp
.in +2
.nf
# \fBsvccfg setnotify -g from-online,to-maintenance snmp:active\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR启用 SNMP 通知
.sp
.LP
以下命令为故障管理诊断事件启用通知。

.sp
.in +2
.nf
# \fBsvccfg setnotify problem-diagnosed snmp:active\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR列出通知设置
.sp
.LP
以下命令列出故障管理诊断事件的所有通知设置。

.sp
.in +2
.nf
# \fBsvccfg listnotify fma-diagnosis\fR
.fi
.in -2
.sp

.sp
.LP
有关配置 SNMP 通知首选项的更多信息，请参阅 \fBsvccfg\fR(1M)。

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/fault-management/snmp-notify
_
接口稳定性Unstable（不稳定）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsyslogd\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)
