Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/srptadm.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates.保留所有权利。
.TH srptadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
srptadm \- 管理 SRP 目标
.SH 用法概要
.LP
.nf
\fBsrptadm modify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
     [\fB-r\fR, \fB--reset\fR] \fIhca_guid\fR
.fi

.LP
.nf
\fBsrptadm list-target\fR [\fIhca_guid\fR]
.fi

.LP
.nf
\fBsrptadm modify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
.fi

.LP
.nf
\fBsrptadm list-defaults\fR
.fi

.SH 描述
.sp
.LP
\fBsrptadm\fR 命令管理 \fBstmfadm\fR(1M) 和 \fBlibstmf\fR(3LIB) 中描述的 SCSI 目标模式框架内的 SCSI RDMA 协议 (SCSI RDMA Protocol, SRP) 目标端口。这允许 SRP 启动器使用 SCSI 协议访问 SCSI 目标模式框架 (SCSI Target Mode Framework, STMF) 逻辑单元。
.sp
.LP
\fBsrptadm\fR 是作为一组子命令以及用于各个子命令的选项和操作数实现的。下文中的相应部分分别描述了这些子命令。
.SH 子命令
.sp
.ne 2
.mk
.na
\fB\fBlist-defaults\fR\fR
.ad
.sp .6
.RS 4n
列出关于缺省属性的信息。此子命令没有选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-target\fR [\fIhca_guid\fR]\fR
.ad
.sp .6
.RS 4n
如果指定了 \fIhca_guid\fR，则列出目标 HCA 的属性。否则，将列出所有 HCA 的属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]\fR
.ad
.sp .6
.RS 4n
修改缺省参数。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR、\fB--enable\fR\fR
.ad
.sp .6
.RS 4n
为没有使用 \fBmodify-target\fR 显式禁用的所有 HCA 启用 SRP 目标创建。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR、\fB--disable\fR\fR
.ad
.sp .6
.RS 4n
为没有使用 \fBmodify-target\fR 显式启用的所有 HCA 禁用 SRP 目标创建。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR] [\fB-r\fR, \fB--reset\fR \fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
为指定的 HCA 设置 SRP 目标属性。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR、\fB--enable\fR\fR
.ad
.sp .6
.RS 4n
在此 HCA 上启用 SRP 目标创建。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR、\fB--disable\fR\fR
.ad
.sp .6
.RS 4n
在此 HCA 上禁用 SRP 目标创建。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR、\fB--reset\fR\fR
.ad
.sp .6
.RS 4n
清除特定于 HCA 的信息并重置为缺省值。如果指定了此选项，则与此 HCA 关联的 SRP 目标（如果有）将不进行任何修改，直至重新启动 SRP 目标 SMF 服务。
.RE

.RE

.SH 操作数
.sp
.LP
list-target 和 modify-target 子命令具有以下操作数。
.sp
.ne 2
.mk
.na
\fB\fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
此系统上可以为其提供 SRP 目标服务的 InfiniBand 主机通道适配器 (Host Channel Adapter, HCA) 的 GUID。GUID 必须为以下格式之一：
.sp
.ne 2
.mk
.na
\fB\fB3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
基础十六进制格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
带有前导零的基础十六进制格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhca:3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
\fBcfgadm\fR(1M) 中的格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeui.0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
EUI 格式。
.RE

.RE

.SH 用法
.sp
.LP
如果在 SRP 服务处于 \fBonline\fR 状态时更改缺省状态，则现有目标的状态不会更改，直至服务重新启动。
.sp
.LP
如果 SRP 目标服务处于 \fBonline\fR 状态，则更改目标状态会立即生效。设置为 \fBdisabled\fR 的目标将脱机并被删除；设置为 \fBenabled\fR 的目标将立即创建。
.SH 示例
.LP
\fB示例 1 \fR列出缺省属性
.sp
.LP
以下命令列出缺省的 SRP 目标服务属性。

.sp
.in +2
.nf
# \fBsrptadm list-defaults\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR更改缺省行为
.sp
.LP
以下命令将 SRP 目标服务的缺省行为更改为服务处于启用状态时不创建 SRP 目标。

.sp
.in +2
.nf
# \fBsrptadm modify-defaults -d\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR列出特定 HCA 的属性
.sp
.LP
以下命令列出特定 HCA 的 SRP 目标属性。

.sp
.in +2
.nf
# \fBcfgadm | grep hca\fR
hca:3BA000100CD18              IB-HCA       connected    configured   ok
hca:3BA000100D030              IB-HCA       connected    configured   ok

# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online
.fi
.in -2
.sp

.LP
\fB示例 4 \fR为特定 HCA 禁用服务
.sp
.LP
以下命令为特定 HCA 禁用 SRP 目标服务。

.sp
.in +2
.nf
# \fBsrptadm modify-target -d 3BA000100CD18\fR
.fi
.in -2
.sp

.sp
.LP
可使用 \fBlist-target\fR 命令查看更改：

.sp
.in +2
.nf
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : false
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : -
.fi
.in -2
.sp

.LP
\fB示例 5 \fR重新启用目标服务
.sp
.LP
以下命令序列重新启用 SRP 目标服务并显示 SRP 和 STMF 目标属性。

.sp
.in +2
.nf
# \fBsrptadm modify-target -e 3BA000100CD18\fR
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online

# \fBstmfadm list-target -v eui.0003BA000100CD18\fR
Target: eui.0003BA000100CD18
    Operational Status: Online
    Provider Name     : srpt
    Alias             : -
    Protocol          : SRP
    Sessions          : 0
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性T{
system/storage/scsi-rdma/scsi-rdma-target
T}
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBcfgadm\fR(1M)、\fBstmfadm\fR(1M)、\fBlibsrpt\fR(3LIB)、\fBlibstmf\fR(3LIB)、\fBattributes\fR(5)、\fBsrpt\fR(7D)
