Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/svadm.1m
'\" te
.\" 版权所有 (c) 2007，Oracle 和/或其附属公司。保留所有权利。
.TH svadm 1M "2007 年 10 月 2 日" "SunOS 5.11" "系统管理命令"
.SH 名称
svadm \- 是用来控制 Availability Suite 存储卷操作的命令行接口
.SH 用法概要
.LP
.nf
\fBsvadm\fR \fB-h\fR
.fi

.LP
.nf
\fBsvadm\fR \fB-v\fR
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR]
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-i\fR
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-e\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-d\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-r\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.SH 描述
.sp
.LP
\fBsvadm\fR 命令提供相应的工具来为指定的卷启用和禁用存储卷 (Storage Volume, SV) 驱动程序以及动态地重新配置系统，从而对 SV 驱动程序进行控制。
.SH 选项
.sp
.LP
如果没有为 \fBsvadm\fR 命令指定参数，则该实用程序将显示当前处于 SV 控制下的卷的列表。\fBsvadm\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
在群集节点上，用于将操作限制到属于标记指定的群集资源组或磁盘组名称的那些卷。在非群集系统上，此选项是非法的。可以使用特殊\fI标记\fR \fBlocal\fR 将操作限制到无法转移到群集中其他节点的那些卷。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
禁用在命令行上或配置文件中指定的 SV 设备。如果同时指定了此选项与 \fB-C\fR 标记，则卷应该在此群集磁盘组中。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
启用在命令行上或配置文件中指定的 SV 设备。卷的详细信息将保存在当前配置中。请参见 \fBdscfg\fR(1M)。如果同时指定了此选项与 \fB-C\fR 标记，则卷应该在此群集磁盘组中。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
指定包含卷列表的配置文件。命令将读取该卷列表，然后执行操作。\fIconfig_file\fR 的格式是卷路径名的简单列表，一行一个路径名。将忽略空白行以及以注释字符 (#) 开头的行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBsvadm\fR 用法摘要。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
显示当前处于 SV 控制下的卷的扩展状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
当指定了 \fIconfig_file\fR 时，将重新配置正在运行的系统以使其与 \fIconfig_file\fR 中指定的配置相匹配。当指定了 \fB-C\fR 选项时，将比较每个卷的群集标记并将其更改为 \fIcluster_tag\fR。如果随此选项指定了一个卷，则只有重新配置与此卷关联的群集标记有效。要启用或禁用单个卷，应该使用 \fB-e\fR 或 \fB-d\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
显示 SV 版本号。
.RE

.SH 用法
.sp
.LP
启用 SV 卷后，对设备的常规系统调用访问（请参见 \fBintro\fR(2)）将被重定向到 StoreEdge 体系结构软件。这样，标准应用程序可以使用 StorageTek 功能，如 Oracle StorageTek Point-in-Time Copy 和 Remote Mirror Software。
.sp
.LP
\fBsvadm\fR 命令在执行启用 (\fB-e\fR) 和禁用 (\fB-d\fR) 操作时，会在 Availability Suite 日志文件 \fB/var/adm/ds.log\fR 中生成一个条目（请参见 \fBds.log\fR(4)）。 
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性driver/storage/sv、driver/storage/sv
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBdscfg\fR(1M)、\fBds.log\fR(4)、\fBattributes\fR(5)、\fBsv\fR(7D)
