Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/tninfo.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH tninfo 1M "2007 年 6 月 20 日" "SunOS 5.11" "系统管理命令"
.SH 名称
tninfo \- 显示内核级网络信息和统计信息
.SH 用法概要
.LP
.nf
\fB/usr/sbin/tninfo\fR [\fB-h\fR \fIhostname\fR] [\fB-m\fR \fIzone-name\fR] [\fB-t\fR \fItemplate\fR]
.fi

.SH 描述
.sp
.LP
\fBtninfo\fR 提供了一个接口来检索并显示内核级网络信息和统计信息。
.SH 选项
.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhostname\fR\fR
.ad
.RS 16n
.rt  
显示远程主机高速缓存中指定的主机的安全结构。输出应当反映 \fBtnrhdb\fR 数据库中指定的内容。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIzone-name\fR\fR
.ad
.RS 16n
.rt  
显示与指定区域关联的 MLP 配置。输出应当反映 \fBtnzonecfg\fR 数据库中指定的内容。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItemplate\fR\fR
.ad
.RS 16n
.rt  
显示与指定的 \fItemplate\fR 关联的结构。输出应当反映 \fBtnrhtp\fR 数据库中指定的内容。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示内核中缓存的远程主机结构
.sp
.LP
此示例显示内核中缓存的远程主机结构。输出反映 \fBtnrhdb\fR 数据库中的定义。

.sp
.in +2
.nf
# \fBtninfo -h machine1\fR
   IP address= 192.168.8.61
   Template = cipso
.fi
.in -2
.sp

.LP
\fB示例 2 \fR显示全局区域的多级别端口
.sp
.LP
此示例为全局区域显示内核中缓存的 MLP。输出反映 \fBtnzonecfg\fR 数据库中的定义，以及动态分配的 MLP。\fBprivate\fR 表示特定于区域的 MLP。

.sp
.in +2
.nf
# \fBtninfo -m global\fR
private:23/tcp;111/tcp;111/udp;515/tcp;2049/tcp;6000-6003/tcp;
        32812/tcp;36698/ip;38634/tcp;64365/ip
shared: 6000-6003/tcp
.fi
.in -2
.sp

.LP
\fB示例 3 \fR显示 \fBcipso\fR 模板定义
.sp
.LP
此示例显示内核中缓存的 \fBcipso\fR 模板定义。输出反映 \fBtnrhtp\fR 数据库中的定义。

.sp
.in +2
.nf
# \fBtninfo -t cipso\fR
=====================================
   Remote Host Template Table Entries:
   __________________________
   template: cipso
   host_type: CIPSO
   doi: 1
   min_sl: ADMIN_LOW
   hex: ADMIN_LOW
   max_sl: ADMIN_HIGH
   hex: ADMIN_HIGH
.fi
.in -2
.sp

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
可信网络远程主机数据库
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
可信网络远程主机模板
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
可信区域配置数据库
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/trusted
_
接口稳定性请参见下文。
.TE

.sp
.LP
命令行为 Committed（已确定）。输出为 Uncommitted（未确定）。
.SH 另请参见
.sp
.LP
\fBtnd\fR(1M)、\fBtnctl\fR(1M)、\fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures\fR
.SH 附注
.sp
.LP
仅当系统配置有 Trusted Extensions 时，本手册页中介绍的功能才可用。
