Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/txzonemgr.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH txzonemgr 1M "2011 年 5 月 12 日" "SunOS 5.11" "系统管理命令"
.SH 名称
txzonemgr \- Trusted Extensions 区域管理器配置实用程序
.SH 用法概要
.LP
.nf
\fB/usr/sbin/txzonemgr\fR [\fB-c\fR | \fB-d[f]\fR | \fB-Z\fR \fIfile\fR]
.fi

.SH 描述
.sp
.LP
\fBtxzonemgr\fR shell 脚本提供了简单的基于菜单的 \fBGUI\fR 向导，在启用了 Trusted Extensions 的系统上创建、安装、初始化和引导有标签区域。此脚本还提供用于网络选项、名称服务选项的菜单项，以及用于使全局区域成为现有 LDAP 服务器的客户机的菜单项。缺省情况下，所有区域都配置为使用与全局区域相同的名称服务和 IP 地址。
.sp
.LP
\fBtxzonemgr\fR 还可以在命令行模式（而非 GUI 模式）下使用下述的合适选项执行一组有限的命令。
.sp
.LP
\fBtxzonemgr\fR 由在 "Zone Management"（区域管理）权限配置文件中授予的角色或全局区域中的 root 运行。
.SH 选项
.sp
.LP
没有指定选项时，\fBtxzonemgr\fR 作为基于菜单的 GUI 运行。使用任何选项都会导致命令行运行。除了下面指定的选项以外，其他选项不能组合使用。
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
创建缺省区域。要求预先不存在任何区域。创建的区域的编号、名称和属性可能会根据情况而变。但是，通常会创建一个 "public"（公共）区域和至少一个其他区域。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
销毁所有区域。将停止、卸载并删除所有区域。只有同时指定了 \fB-f\fR 选项时才提示您进行确认。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
强制。可以与 \fB-d\fR 一起使用来覆盖确认提示。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
使用文件中指定的列表创建一组区域。文件中的每行都必须包含区域名称和其相应的标签（以空格分隔）。即使标签包含空格，也不应当用引号括起。如果存在名为"快照"的现有区域，则从其中克隆所有指定的区域。否则将安装列表中的第一个区域，然后从中克隆快照区域。接下来从快照克隆剩下的区域。这些区域配置为需要手动引导。但是，当授权用户向 GNOME 工作区分配有效标签时，将自动引导相应区域。
.RE

.SH 退出状态
.sp
.LP
对于 GUI 模式，不返回任何值。对于命令行运行，返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
出现错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
用法无效。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
命令接口稳定性 Committed（已确定） 
_
交互对话Not an Interface（不是接口）
.TE

.SH 另请参见
.sp
.LP
\fBzenity\fR(1)（非 SunOS 手册页）、\fBipadm\fR(1M)、\fBzoneadm\fR(1M)、\fBzonecfg\fR(1M)、\fBattributes\fR(5)、\fBrbac\fR(5)、\fBzones\fR(5)
.sp
.LP
《\fISolaris Trusted Extensions 管理员规程\fR》
.SH 附注
.sp
.LP
如果是从 \fBJDS\fR 管理区域，请使用 \fBtxzonemgr\fR 而不是 \fBCDE\fR 操作。
.sp
.LP
\fBtxzonemgr\fR 使用 \fBzenity\fR 命令。有关详细信息，请参见 \fBzenity\fR(1) 手册页（不是 SunOS 集合的一部分）。
