Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/wpad.1m
'\" te
.\" 版权所有 (c) 2008，Oracle 和/或其附属公司。保留所有权利
.TH wpad 1M "2008 年 3 月 11 日" "SunOS 5.11" "系统管理命令"
.SH 名称
wpad \- WPA 和 WPA2 协议守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/inet/wpad\fR [\fB-i\fR \fIinterface\fR] [\fB-k\fR \fIpre_shared_key_name\fR]
.fi

.SH 描述
.sp
.LP
\fBwpad\fR 守护进程为 WiFi 保护访问 (WiFi Protected Access, WPA) 版本 1 和版本 2 提供了按 IEEE802.11i 标准定义的常用客户端功能。WPA 是由行业协会 WiFi 联盟制定的。WPA 实现了大部分 IEEE 802.11i 标准，其用途是在 802.11i 标准制定过程中充当一种过渡标准以取代有线等效保密 (Wired Equivalent Privacy, WEP)。WPA2 实现了整套标准。
.sp
.LP
\fBwpad\fR 提供以下 WPA/IEEE 802.11i 功能：
.RS +4
.TP
.ie t \(bu
.el o
WPA-PSK（"WPA-个人"）
.RE
.RS +4
.TP
.ie t \(bu
.el o
针对 CCMP、TKIP、WEP104、WEP40 的密钥管理
.RE
.sp
.LP
使用 \fBdladm\fR(1M) 停止和启动 \fBwpad\fR 守护进程。用法：
.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&...启动 \fBwpad\fR 守护进程。用法：
.sp
.in +2
.nf
# \fBdladm disconnect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&...停止该守护进程。
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterface\fR\fR
.ad
.sp .6
.RS 4n
指定一个用于启动 \fBwpad\fR 守护进程的 WiFi 链路接口。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIpre_shared_key_name\fR\fR
.ad
.sp .6
.RS 4n
指定用于 WiFi 链路的预共享密钥。
.RE

.SH 示例
.LP
\fB示例 1 \fR在特定 WiFi 链路上启动 \fBwpad\fR 守护进程
.sp
.LP
要创建 WPA 密钥 \fBpsk\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
要使用密钥 \fBpsk\fR 连接到链路 \fBath0\fR 上的 ESSID \fBwlan\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR停止特定 WiFi 链路上的 \fBwpad\fR 守护进程
.sp
.LP
要停止链路 \fBath0\fR 上的守护进程，请输入：

.sp
.in +2
.nf
# \fBdladm disconnect-wifi ath0\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/network/wpa
_
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBdladm\fR(1M)、\fBsvcadm\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBwpad\fR 服务由服务管理工具 \fBsmf\fR(5) 管理，其服务标识符为：
.sp
.in +2
.nf
svc:/network/wpa:\fI<link>\fR
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvcadm\fR(1M) 来执行对此服务的管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。
