Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1m/zonestatd.1m
'\" te
.\" 版权所有 (c) 2010，Oracle 和/或其附属公司。保留所有权利。
.TH zonestatd 1M "2010 年 8 月 13 日" "SunOS 5.11" "系统管理命令"
.SH 名称
zonestatd \- 区域监视守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/zones/zonestatd\fR
.fi

.SH 描述
.sp
.LP
\fBzonestatd\fR 是一个在系统引导期间启动的系统守护进程。它监视区域使用系统资源的情况，以及区域和系统的配置信息，如 \fBpsrset\fR \fB psets\fR、池 \fBpsets\fR 和资源控制设置。
.sp
.LP
此守护进程由区域管理软件自动启动，而不应直接调用。它不属于编程接口，而应归类为专用接口。
.SH 安全
.sp
.LP
要想让每个非全局区域 (NGZ) 中的 \fBzonestat\fR 服务正常运行，全局区域中的 \fBzonestat\fR 服务必须处于联机状态。每个 NGZ 中的 \fBzonestat\fR 服务并不直接读取系统配置和使用数据，而是从全局区域上的 \fBzonestat\fR 服务中读取。
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/zones
_
接口稳定性Private（专用）
.TE

.SH 另请参见
.sp
.LP
\fBprctl\fR(1)、\fBsvcs\fR(1)、\fBzonestat\fR(1)、\fBacctadm\fR(1M)、\fBpooladm\fR(1M)、\fBpoolcfg\fR(1M)、\fBrcapadm\fR(1M)、\fBsvcadm\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)、\fBzones\fR(5)
.SH 附注
.sp
.LP
\fBzonestat\fR 服务由服务管理工具 \fBsmf\fR(5) 管理，其服务标识符为：
.sp
.in +2
.nf
svc:/system/zones-monitoring:default
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvcadm\fR(1M) 来执行对此服务的管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。
.sp
.LP
\fBzonestat\fR 服务具有以下 SMF 配置属性：
.sp
.in +2
.nf
config/sample_interval
.fi
.in -2
.sp

.sp
.LP
该属性设置 \fBzonestatd\fR 采样间隔。该间隔是区域监视守护进程 \fBzonestatd\fR 在对资源使用情况进行采样时所使用的间隔。该间隔也是用于确定配置更改（如处理器集更改、资源控制更改和区域状态更改）的间隔。
.sp
.LP
缺省间隔为 5 秒。
.sp
.LP
\fBzonestat\fR 服务利用了扩展记帐功能。该服务启用进程记帐资源跟踪功能（如果尚未启用），并配置进程记帐文件。\fBzonestat\fR 服务将按配置的间隔滚动进程记帐日志（请参见 \fBzonestat\fR(1)）。
.sp
.LP
如果在外部启用了扩展进程记帐，\fBzonestat \fR服务将按照配置使用进程记帐日志。它不会滚动记帐日志，但如果记帐日志在外部滚动，它仍会正确工作。
