Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/adpu320.7d
'\" te
.\" Copyright 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH adpu320 7D "23 May 2006" "SunOS 5.11" "Devices"
.SH NAME
adpu320 \- Adaptec Ultra320 SCSI host bus adapter driver
.SH SYNOPSIS
.LP
.nf
\fBscsi@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBadpu320\fR host bus adapter driver is a SCSA-compliant nexus driver that supports the following Adaptec Ultra320 SCSI Devices:
.sp
.ne 2
.mk
.na
\fBChips\fR
.ad
.RS 9n
.rt  
AIC-7902
.RE

.sp
.LP
The \fBadpu320\fR driver supports standard functions provided by the SCSA interface, including tagged and untagged queuing, Wide/Fast/Ultra SCSI, and auto request sense. The \fBadpu320\fR driver does not support linked commands. The \fBadpu320\fR driver supports hot swap SCSI and hot plug PCI.
.sp
.LP
Additionally, the \fBadpu320\fR driver supports the following features: 
.RS +4
.TP
.ie t \(bu
.el o
64-bit addressing (Dual address Cycle)
.RE
.RS +4
.TP
.ie t \(bu
.el o
PCI-X v1.1 operating up to 133MHz and 64bits
.RE
.RS +4
.TP
.ie t \(bu
.el o
PCI bus spec v2.2 operating up to 66MHz and 64bits
.RE
.RS +4
.TP
.ie t \(bu
.el o
Packetized SCSI at 320 and 160 MB/s
.RE
.RS +4
.TP
.ie t \(bu
.el o
QAS
.RE
.RS +4
.TP
.ie t \(bu
.el o
DT 
.RE
.RS +4
.TP
.ie t \(bu
.el o
40MB/sec in single-ended mode and up to 320MB/sec transfer rate in LVD mode
.RE
.RS +4
.TP
.ie t \(bu
.el o
Domain Validation
.RE
.RS +4
.TP
.ie t \(bu
.el o
Retained Training Information (RTI)
.RE
.RS +4
.TP
.ie t \(bu
.el o
PCI and PCI-X Error handling
.RE
.LP
Note - 
.sp
.RS 2
The \fBadpu320\fR driver does not support the HostRAID feature found on some Adaptec SCSI controllers.  For \fBadpu320\fR to support a Adaptec SCSI adapter with HostRAID, you must not use any HostRAID features.
.RE
.SS "Driver Configuration"
.sp
.LP
The \fBadpu320\fR host bus adapter driver is configured by defining the properties found in \fBadpu320\fR.conf. Properties in the \fBadpu320\fR.conf file that can be modified by the user include: \fBADPU320_SCSI_RD_STRM\fR, \fBADPU320_SCSI_NLUN_SUPPORT\fR. 
.sp
.in +2
.nf
-------------------------------------------------------------
                Option: ADPU320_SCSI_RD_STRM=[value]
            Definition: Enables/disables read streaming negotiation
                        for all drives.
       Possible Values: 0 (off), 1 (on)
         Default Value: 0 (off)

                Option: ADPU320_SCSI_NLUN_SUPPORT=[value]
            Definition: Enables the number of logical units to be 
                        scanned per drive.
       Possible Values: 1-64 
         Default Value: 64 
     -------------------------------------------------------------
.fi
.in -2
.sp

.sp
.LP
\fBIf you alter or add driver parameters incorrectly, you can render your system inoperable. Use driver parameters with caution.\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityx86
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/adpu320\fR\fR
.ad
.RS 29n
.rt  
Driver module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/adpu320\fR\fR
.ad
.RS 29n
.rt  
64-bit driver module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/adpu320.conf\fR\fR
.ad
.RS 29n
.rt  
Configuration file.
.RE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBprtconf\fR(1M), \fBattributes\fR(5), \fBscsi_abort\fR(9F), \fBscsi_hba_attach_setup\fR(9F), \fBscsi_ifgetcap\fR(9F), \fBscsi_reset\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_extended_sense\fR(9S), \fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR 
.sp
.LP
\fISmall Computer System Interface-3 (SCSI-3)\fR
