Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/ahci.7d
'\" te
.\" Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ahci 7D "22 Nov 2010" "SunOS 5.11" "Devices"
.SH NAME
ahci \- Advanced Host Controller Interface SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBahci\fR driver is a SATA framework-compliant HBA driver that supports SATA HBA controllers that are compatible with the \fIAdvanced Host Controller Interface 1.0\fR specification. AHCI is an Intel-developed protocol that describes the register-level interface for host controllers for serial ATA 1.0a and Serial ATA II. The \fIAHCI 1.0\fR specification describes the interface between the system software and the host controller hardware.
.sp
.LP
The \fBahci\fR driver currently supports the Intel ICH6/7/8/9/10, VIA vt8251 and JMicron AHCI controllers which are compliant with the Advanced Host Controller Interface 1.0 specification. The Intel ICH6/7/8/9 and VIA vt8251 controllers support standard SATA features. The \fBahci\fR driver currently supports hard disk, ATAPI DVD, ATAPI tape, ATAPI disk (i.e. Dell RD1000), hotplug, NCQ (Native command queuing) and Port multipliers (Silicon Image 3726/4726). Power management is not yet supported.
.SH CONFIGURATION
.sp
.LP
The \fBahci\fR driver is configured by defining properties in \fBahci.conf\fR.  These properties override the default settings. 
.sp
.LP
Contact the hardware vendor before modifying these properties. The HBA might not work properly if above properties are not correctly configured.
.sp
.LP
The \fBahci\fR driver supports following modifiable properties:
.sp
.ne 2
.mk
.na
\fB\fBahci-dma-prdt-number\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of \fBPRDT\fR in the command table. The \fBPRDT\fR (Physical Region Descriptor Table) contains the scatter/gather list for the data transfer. The number of \fBPRDT\fR in the command table can be from \fB1\fR to \fB65,535\fR. The default value is \fB257\fR, (1MB \fB(256KB/pg * 256) + 1).\fR. See the \fBAHCI\fR specification for more details.
.RE

.sp
.ne 2
.mk
.na
\fB\fBahci-msi-enabled\fR\fR
.ad
.sp .6
.RS 4n
Enables the \fBMSI\fR interrupt. The \fBahci\fR driver always enables the \fBMSI\fR (Message Signaled Interrupt) if the \fBHBA\fR supports. The default value is \fB1\fR. Specifying a \fB0\fR disables \fBMSI\fR and uses legacy interrupt.
.RE

.sp
.ne 2
.mk
.na
\fB\fBahci-buf-64bit-dma\fR\fR
.ad
.br
.na
\fB\fBahci-commu-64bit-dma\fR\fR
.ad
.sp .6
.RS 4n
Enables 64-bit DMA support. The \fBahci\fR driver always enables 64-bit DMA addressing for the data transfer and the communication system descriptors if the HBA supports. The default value is \fB1\fR. Specifying a \fB0\fR disables 64-bit \fBdma\fR addressing for the data buffer and communication system descriptors respectively.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsb600-buf-64bit-dma-disable\fR\fR
.ad
.sp .6
.RS 4n
The \fBahci\fR driver disables 64-bit DMA addressing for data buffer on AMD/ATI SB600 by default. The default value is \fB1\fR. Specifying \fB0\fR switches on 64-bit DMA addressing for the data buffer on SB600 chip sets.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsbxxx-commu-64bit-dma-disable\fR\fR
.ad
.sp .6
.RS 4n
The \fBahci\fR driver disables 64-bit DMA addressing for communication system descriptors on AMD/ATI SB series (SB600/700/710/750/800) by default. The default value is \fB1\fR. Specifying \fB0\fR switches on 64-bit DMA addressing for communication system descriptors on these chip sets.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ahci\fR\fR
.ad
.sp .6
.RS 4n
32-bit \fBELF\fR kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ahci\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBELF\fR kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ahci.conf\fR\fR
.ad
.sp .6
.RS 4n
Optional configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/storage/ahci
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M), \fBattributes\fR(5), \fBsata\fR(7D)
.sp
.LP
\fIAdvanced Host Controller Interface 1.0\fR
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.sp
.LP
To bind the \fBahci\fR driver to your controller, choose the [AHCI] BIOS option. 
.sp
.LP
Booting is not supported if toggle exists between the [IDE] and [AHCI] BIOS options 
