Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/amd8111s.7d
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH amd8111s 7D "16 Aug 2011" " SunOS 5.11" "Devices"
.SH NAME
amd8111s \- AMD-8111 Fast Ethernet Network Adapter driver
.SH SYNOPSIS
.LP
.nf
/dev/amd8111s
.fi

.SH DESCRIPTION
.sp
.LP
The \fBamd8111s\fR Fast Ethernet driver is a multi-threaded, loadable, clonable,  GLD-based  STREAMS  driver supporting  the Data Link Provider Interface, \fBdlpi\fR(7P), on the AMD-8111 Fast Ethernet Network Adapter. 
.sp
.LP
The \fBamd8111s\fR driver functions include controller initialization, frame  transmit and receive, promiscuous and multicast support, and error recovery and reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning, character-special device \fB/dev/amd8111\fR is used to access all AMD-8111 Fast Ethernet devices installed within the system.
.sp
.LP
The \fBamd8111s\fR driver is managed by the \fBdladm\fR(1M) command  line utility, which allows VLANs to be defined on top of amd8111s instances and for amd8111s instances to be aggregated.  See \fBdladm\fR(1M) for more details.
.SH CONFIGURATION
.sp
.LP
By default, the \fBamd8111s\fR driver performs auto-negotiation to select the link speed and mode. Link speed and mode can be any of the following: 
.sp
.LP
100 Mbps, full-duplex.
.sp
.LP
100 Mbps, half-duplex.
.sp
.LP
10 Mbps, full-duplex.
.sp
.LP
10 Mbps, half-duplex.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/amd8111s*\fR \fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd8111s*\fR \fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/amd8111s*\fR \fR
.ad
.sp .6
.RS 4n
64-bit ELF Kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
Availabilitydriver/network/ethernet/amd8111s
Architecturex86
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBstreamio\fR(7I), \fBdlpi\fR(7P)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
