Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/arcmsr.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.TH arcmsr 7D "28 Feb 2008" "SunOS 5.11" "Devices"
.SH NAME
arcmsr \- SAS and SATA HBA driver for Areca Hardware Raid devices
.SH DESCRIPTION
.sp
.LP
The \fBarcmsr\fR host bus adapter driver is a SCSA-compliant nexus driver that supports Areca Technology SAS and SATA RAID devices. 
.sp
.LP
Supported SATA RAID cards:
.sp
.in +2
.nf
ARC-1110  pci17d3,1110
ARC-1120  pci17d3,1120
ARC-1130  pci17d3,1130
ARC-1160  pci17d3,1160
ARC-1170  pci17d3,1170
ARC-1201  pci17d3,1201
ARC-1210  pci17d3,1210
ARC-1220  pci17d3,1220
ARC-1230  pci17d3,1230
ARC-1260  pci17d3,1260
ARC-1270  pci17d3,1270
ARC-1280  pci17d3,1280
.fi
.in -2

.sp
.LP
Supported SAS RAID cards:
.sp
.in +2
.nf
ARC-1380  pci17d3,1380
ARC-1381  pci17d3,1381
ARC-1680  pci17d3,1680
ARC-1681  pci17d3,1681
.fi
.in -2

.SH CONFIGURATION
.sp
.LP
There are no user configurable parameters available. Please configure your hardware through the host system BIOS.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/arcmsr\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/arcmsr\fR
.ad
.RS 28n
.rt  
64-bit kernel module (x64 only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/arcmsr.conf\fR
.ad
.RS 28n
.rt  
Driver configuration file (contains no user-configurable options).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86, x64 only 
_
Availabilitydriver/storage/arcmsr
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBattributes\fR(5), \fBscsi_hba_attach_setup\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_inquiry\fR(9S), \fBscsi_device\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fISmall Computer System Interface-2 (SCSI-2)\fR
.sp
.LP
\fIhttp://www.areca.com.tw/products/main.htm\fR
.sp
.LP
\fIhttp://developer.intel.com/design/iio/index.htm\fR \(em(Intel Corp IO processors provide the underlying RAID engine for the supported devices).
