Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/arn.7d
'\" te
.\"  Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH arn 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
arn \- Atheros AR9280/9281/9285 IEEE802.11 a/b/g/n wireless network device
.SH DESCRIPTION
.sp
.LP
The \fBarn\fR IEEE802.11 a/b/g/n wireless driver is a loadable, clonable, GLDv3-based STREAMS driver supporting Atheros AR9280/9281/9285 IEEE802.11 a/b/g/n wireless network device.
.SS "Configuration"
.sp
.LP
The \fBarn\fR driver performs auto-negotiation to determine the data rate and mode. The driver supports only BSS networks (also known as \fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR(or \fBopen-system\fR)  or \fBshared system\fR authentication. For wireless security, WEP encryption, WPA-PSK, and WPA2-PSK are currently supported. Configuration and administration tasks can be performed with the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/arn\fR\fR
.ad
.RS 25n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/arn\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/arn\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel driver module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/arn
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBgld\fR(7D)
