Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/ath.7d
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ath 7D "14 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
ath \- Atheros AR52xx 802.11b/g wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The \fBath\fR \fI802.11b/g \fR wireless  NIC driver is a  multi-threaded, loadable, clonable, GLDv3-based STREAMS driver for the Atheros  AR52xx  (AR5210/5211/5212)  chipset-based  wireless NIC.
.sp
.LP
The \fBath\fR driver functions include controller initialization, wireless \fI802.11b/g\fR infrastructure network connection, WEP, frame transmit and receive, and promiscuous and multi-cast  support.
.SH DRIVER CONFIGURATION
.sp
.LP
The \fBath\fR driver performs auto-negotiation to determine the data rates and mode. Supported \fI802.11b\fR data rates (Mbits/sec.) are 1, 2, 5.5 and 11. Supported \fI802.11g\fR data rates (Mbits/sec.) are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54.
.sp
.LP
The \fBath\fR driver supports only BSS networks (also known  as "ap" or "infrastructure" networks) and the "open" (or "opensystem") authentication type. Only  WEP encryption is currently supported. Configuration and administration can be performed  through  the  \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ath*\fR\fR
.ad
.RS 25n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ath\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ath\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBgld\fR(7D)
.sp
.LP
\fIANSI/IEEE Std 802.11\fR- Standard for Wireless LAN Technology, 1999. 
.sp
.LP
\fIIEEE Std 802.11a\fR- Standard for Wireless LAN Technology-Rev. A, 2003
.sp
.LP
\fIIEEE Std 802.11b\fR - Standard for Wireless LAN Technology-Rev.B, 2003
.sp
.LP
\fIIEEE Std 802.11g\fR\(em Standard for Wireless LAN Technology - Rev. G, 2003
