Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/atu.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH atu 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
atu \- Atmel AT76C50x USB IEEE 802.11b Wireless Device Driver
.SH DESCRIPTION
.sp
.LP
The \fBatu 802.11b\fR wireless driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the Atmel AT76C50x chipset-based wireless devices.
.SS "Configuration"
.sp
.LP
The \fBatu\fR driver performs auto-negotiation to determine the data rate and mode. Supported 802.11b data rates are 1, 2, 5.5, and 11 Mbits/sec. 
.sp
.LP
The \fBatu\fR driver supports only BSS networks (also known as \fBap\fR or \fBinfrastructure\fR networks). 
.sp
.LP
\fBopen\fR (or \fBopen-system\fR) and \fBshared key\fR authentication modes are supported. Encryption types WEP40 and WEP104 are supported.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/atu*\fR\fR
.ad
.RS 25n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/atu\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/atu\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/atu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBgld\fR(7D)
.sp
.LP
\fI802.11 - Wireless LAN Media Access Control and Physical Layer Specification - IEEE, 2001\fR
