Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/audiovia823x.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved. 
.TH audiovia823x 7D "12 May 2009" "SunOS 5.11" "Devices"
.SH NAME
audiovia823x \- VIA VT8233, VT8235, and VT8237) support
.SH DESCRIPTION
.sp
.LP
The \fBaudiovia823\fR\fIx\fR driver provides support for the VIA VT8233, VT8235, and VT8237 AC'97 devices found on motherboards with certain VIA chip sets.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiovia823x\fR\fR
.ad
.sp .6
.RS 4n
32-bit x86 kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audiovia823x\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.27i) |cw(3.23i) 
lw(2.27i) |lw(3.23i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/audio/audiovia823x
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7I), \fBdsp\fR(7I), \fBmixer\fR(7I) 
