Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/audiosolo.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved. 
.TH audiosolo 7D "18 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
audiosolo \- ESS Solo-1 audio device support
.SH DESCRIPTION
.sp
.LP
The \fBaudiosolo\fR driver provides support for the ESS Solo-1 audio device. This device is found on certain motherboards and discrete audio cards. It supports 16-bit 48 kHZ stereo playback and capture.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiosolo\fR\fR
.ad
.sp .6
.RS 4n
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audiosolo\fR\fR
.ad
.sp .6
.RS 4n
64-bit kernel driver module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/audio/audiosolo
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
