Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/audiohd.7d
'\" te
.\" Copyright (c) 2010, Sun Microsystems, Inc. All rights reserved. 
.TH audiohd 7D "10 Mar 2010" "SunOS 5.11" "Devices"
.SH NAME
audiohd \- Intel High Definition Audio Controller support
.SH DESCRIPTION
.sp
.LP
The \fBaudiohd\fR driver provides support for the generic codec chips which are compatible with the Intel High-Definition Audio Controller 1.0 specification.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiohd.conf\fR\fR
.ad
.RS 29n
.rt  
\fBaudiohd\fR driver configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiohd\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audiohd\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 kernel driver module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based system
_
Availabilitydriver/audio/audiohd
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.sp
.LP
\fIIntel High-Definition Audio Specification 1.0.\fR - Intel Corporation
.sp
.LP
\fIALC880 Specification\fR \(em Realtek Inc.
