Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/audioixp.7d
'\" te
.\" Copyright (c) 2010 Sun Microsystems, Inc. All rights reserved. 
.TH audioixp 7D "10 Mar 2010" "SunOS 5.11" "Devices"
.SH NAME
audioixp \- ATI IXP400 south bridge audio digital controller interface
.SH DESCRIPTION
.sp
.LP
The \fBaudioixp\fR device uses the IXP400 south bridge audio digital controller and a AC-97 Codec to implement the audio device interface. 
.sp
.LP
The \fBaudioixp\fR  device  provides  support  for  the internal speaker, headphone, line out, line in, and microphone.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audioixp.conf\fR\fR
.ad
.RS 30n
.rt  
Driver configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audioixp\fR\fR
.ad
.RS 30n
.rt  
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audioixp\fR\fR
.ad
.RS 30n
.rt  
64-bit kernel driver module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based system
_
Availabilitydriver/audio/audioixp
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I)
.sp
.LP
\fIATI IXP400 South Bridge Data Sheet\fR
