Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/audio810.7d
'\" te
.\" Copyright (c) 2010 Sun Microsystems, Inc. All rights reserved. 
.TH audio810 7D "10 Mar 2010" "SunOS 5.11" "Devices"
.SH NAME
audio810 \- Intel ICH series, nVidia nForce series and AMD 8111 audio core support
.SH DESCRIPTION
.sp
.LP
The \fBaudio810\fR driver provides support for AC 97 audio controllers embedded in Intel ICH, nVidia nForce, and AMD 8111 chips.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audio810\fR\fR
.ad
.RS 30n
.rt  
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audio810\fR\fR
.ad
.RS 30n
.rt  
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audio810.conf\fR\fR
.ad
.RS 30n
.rt  
\fBaudio810\fR driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based systems
_
Availabilitydriver/audio/audio810
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I)
.sp
.LP
\fIAMD-8111 HyperTransport I/O Hub Data Sheet\fR \(em Advanced Micro Devices Inc.
.sp
.LP
\fIALC655 Specification\fR \(em Realtek Inc.
.SH NOTES
.sp
.LP
Some laptops (including Sony VAIO, among others), have their on-board amplifier powered down by default, meaning that audio is suppressed even if hardware and the \fBaudio810\fR driver are working normally. To correct this, set the \fBac97-invert-amp=1\fR property in the \fB/kernel/drv/audio810.conf\fR to power-up the amplifier.
