Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/bcm_sata.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH bcm_sata 7D "31 Aug 2009" "SunOS 5.11" "Devices"
.SH NAME
bcm_sata \- Broadcom HT1000 SATA controller driver
.SH SYNOPSIS
.sp
.LP
\fBsata@\fR\fIunit-address\fR
.SH DESCRIPTION
.sp
.LP
The \fBbcm_sata\fR driver is a SATA HBA driver that supports Broadcom HT1000 SATA HBA controllers.
.sp
.LP
HT1000 SATA controllers are compliant with the Serial ATA 1.0 specification and SATA II Phase 1.0 specification (the extension to the SATA 1.0 specification). These HT1000 controllers support standard SATA features including SATA-II disks, NCQ, hotplug, ATAPI devices and port multiplier. 
.sp
.LP
The driver does not currently support NCQ and port multiplier features.
.SS "Configuration"
.sp
.LP
The \fBbcm_sata\fR module contains no user configurable parameters.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/bcm_sata\fR\fR
.ad
.RS 30n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/bcm_sata\fR\fR
.ad
.RS 30n
.rt  
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/storage/bcm_sata
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M), \fBattributes\fR(5), \fBsata\fR(7D), \fBsd\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
