Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/cmdk.7d
'\" te
.\"  Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.TH cmdk 7D "4 Nov 2008" "SunOS 5.11" "Devices"
.SH NAME
cmdk \- common disk driver
.SH SYNOPSIS
.LP
.nf
cmdk@\fItarget\fR, \fIlun\fR : [ \fIpartition\fR \fB|\fR \fIslice\fR ]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcmdk\fR device driver is a common interface to various disk devices. The driver supports magnetic fixed disks and magnetic removable disks.
.sp
.LP
The \fBcmdk\fR device driver supports three different disk labels: fdisk partition table, Solaris x86 VTOC and EFI/GPT.
.sp
.LP
The block-files access the disk using the system's normal buffering mechanism and are read and written without regard to physical disk records. There is also a "raw" interface that provides for direct transmission between the disk and the user's read or write buffer. A single read or write call usually results in one I/O operation; raw I/O is therefore considerably more efficient when many bytes are transmitted. The names of the block files are found in \fB/dev/dsk\fR. Raw file names are found in \fB/dev/rdsk\fR.
.sp
.LP
I/O requests to the magnetic disk must have an offset and transfer length that is a multiple of 512 bytes or the driver returns an \fBEINVAL\fR error.
.sp
.LP
Slice 0 is normally used for the root file system on a disk, slice 1 as a paging area (for example, swap), and slice 2 for backing up the entire fdisk partition for Solaris software. Other slices may be used for \fBusr\fR file systems or system reserved area.
.sp
.LP
The fdisk partition 0 is to access the entire disk and is generally used by the \fBfdisk\fR(1M) program.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/c\fR\fIn\fR\fBd\fR\fIn\fR[\fBs\fR|\fBp\fR]\fIn\fR\fR
.ad
.RS 26n
.rt  
block device (IDE)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/c\fR\fIn\fR\fBd\fR\fIn\fR[\fBs\fR|\fBp\fR]\fIn\fR\fR
.ad
.RS 26n
.rt  
raw device (IDE)
.sp
where:
.sp
.ne 2
.mk
.na
\fB\fBc\fR\fIn\fR\fR
.ad
.RS 6n
.rt  
controller \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBd\fR\fIn\fR\fR
.ad
.RS 6n
.rt  
lun \fIn (0-1)\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fIn\fR\fR
.ad
.RS 6n
.rt  
UNIX system slice \fIn (0-15).\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fIn\fR\fR
.ad
.RS 6n
.rt  
fdisk partition (0-36).
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/cmdk\fR\fR
.ad
.RS 26n
.rt  
32-bit kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/cmdk\fR\fR
.ad
.RS 26n
.rt  
64-bit kernel module.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
\fBfdisk\fR(1M), \fBmount\fR(1M), \fBlseek\fR(2), \fBread\fR(2), \fBwrite\fR(2), \fBreaddir\fR(3C), \fBscsi\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5), \fBdkio\fR(7I)
