Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/cpqary3.7d
'\" te
.\" Copyright (c) 2009, Hewlett-Packard Development Company, L.P. All Rights Reserved.
.\" Portions Copyright (c) 2010 Sun Microsystems, Inc. All Rights Reserved.
.TH cpqary3 7D "4 Jan 2010" "SunOS 5.11" "Devices"
.SH NAME
cpqary3 \- provides disk and SCSI tape support for HP Smart Array controllers
.SH DESCRIPTION
.sp
.LP
The \fBcpqary3\fR module provides low-level interface routines between the common disk I/O subsystem and the HP SMART Array controllers. The \fBcpqary3\fR driver provides disk and SCSI tape support for the HP Smart Array controllers.
.sp
.LP
Please refer to the \fIcpqary3 Release Notes\fR, for the supported HP Smart Array Controllers and Storage boxes.
.sp
.LP
Each of the controller should be the sole initiator on a SCSI bus. Auto configuration code determines if the adapter is present at the Configured address and what types of devices are attached to it.
.SS "Configuration"
.sp
.LP
Use the Array Configuration Utility to configure the controllers. Each controller can support up to 32 logical volumes. In addition, each controller supports up to a maximum of 28 connected SCSI tape drives. With 1.90 and later versions of \fBcpqary3\fR driver, HP Smart Array SAS controllers, having Firmware Revision 5.10 or later, support 64 logical drives. This firmware also supports Dual Domian Multipath configurations.
.sp
.LP
The driver attempts to initialize itself in accordance with the information found in the configuration file, \fB/kernel/drv/cpqary3.conf\fR.
.sp
.LP
The target driver's configuration file need entries if support is needed for targets numbering greater than the default number of targets supported by the corresponding target driver.
.sp
.LP
By default, entries for SCSI target numbers 0 to 15 are present in \fBsd.conf\fR. Entries for target numbers 16 and above are added in SCSI class in the \fBsd.conf\fR file for supporting corresponding logical volumes.
.sp
.LP
If SCSI tape drives are connected to the supported controllers, entries for target IDs from \fB33\fR to \fB33+\fR\fIn\fR must be added in the \fB/kernel/drv/st.conf\fR file under \fBscsi\fR class, where \fIn\fR is the total number of SCSI tape drives connected to the controller with largest number of tape drives connected to it, in the existing configuration. For example, two supported controllers, \fBc1\fR and \fBc2\fR are present in the system.  If controller \fBc1\fR has two tape drives and controller \fBc2\fR has five tape drives connected, entries for target IDs \fB33\fR through \fB38\fR are required under \fBscsi\fR class in \fB/kernel/drv/st.conf\fR file. The maximum number of tape drives that can be connected to a controller is \fB28\fR. With 1.90 and later versions of the \fBcpqary3\fR driver, if tape drives are connected to the Smart Array SAS controllers, target ID entries for tape drives from \fB65\fR to \fB65+\fR\fIn\fR must be added in the \fB/kernel/drv/st.conf\fR file under the \fBscsi\fR class.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/cpqary3.conf\fR\fR
.ad
.RS 28n
.rt  
Configuration file for \fBCPQary3\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sd.conf\fR\fR
.ad
.RS 28n
.rt  
Configuration file for \fBsd\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/st.conf\fR\fR
.ad
.RS 28n
.rt  
Configuration file for \fBst\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk\fR\fR
.ad
.RS 28n
.rt  
Block special file names for disk device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk\fR\fR
.ad
.RS 28n
.rt  
Character special file names for disk device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rmt\fR\fR
.ad
.RS 28n
.rt  
Special file names for SCSI tape devices
.RE

.SH SEE ALSO
.sp
.LP
\fBdriver.conf\fR(4), \fBsd\fR(7D), \fBst\fR(7D)
.sp
.LP
\fIcpqary3 Release Notes\fR
.SH NOTES
.sp
.LP
The Smart Array controllers supported by the current version of the \fBcpqary3\fR driver do not support \fBformat unit\fR SCSI command. Therefore, selecting the \fBformat\fR option under the \fBformat\fR utility main menu  is not supported. In addition, the \fBrepair\fR option under \fBformat\fR utility main menu is not supported as this operation is not applicable to Logical volumes connected to the supported Smart Array controllers.
.sp
.LP
The names of the block files can be found in \fB/dev/dsk\fR. The names of the raw files can be found in \fB/dev/rdsk\fR.
