Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/imraid_sas.7d
'\" te
.\" Copyright (c) LSI Corporation 2010-2011.
.\" Portions Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH imraid_sas 7D "13 Jan 2011" "SunOS 5.11" "Devices"
.SH NAME
imraid_sas \- LSI MegaRAID FALCON SAS2.0 Controller HBA driver
.SH DESCRIPTION
.sp
.LP
The \fBimraid_sas\fR MegaRAID FALCON SAS2.0 controller host bus adapter driver is a SCSA-compliant nexus driver that supports the LSI MegaRAID FALCON SAS 92xx series of controllers.
.sp
.LP
FALCON HBA supports up to 64 JBOD drives which are directly exposed to OS.
.sp
.LP
Some of the RAID Features include the following:
.RS +4
.TP
.ie t \(bu
.el o
RAID levels 0, 1, and 5
.RE
.RS +4
.TP
.ie t \(bu
.el o
RAID spans 10
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online Capacity Expansion (OCE)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online RAID Level Migration (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Auto resume after loss of system power during array rebuild or reconstruction (RLM) 
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configurable stripe size up to 64KB
.RE
.RS +4
.TP
.ie t \(bu
.el o
Check Consistency for background data integrity
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patrol read for media scanning and repairing
.RE
.RS +4
.TP
.ie t \(bu
.el o
16 logical drive support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Automatic rebuild
.RE
.RS +4
.TP
.ie t \(bu
.el o
Global and dedicated Hot Spare support
.RE
.sp
.LP
The \fBimraid_sas.conf\fR file consists a user tunable parameter to configure MSI or MSI-X support in the \fBimraid_sas\fR driver. Pre-boot applications or MegaCli can be used to configure the HBA. The MegaCli utility can be downloaded from the LSI website. To install the operating system on the drives attached to the FALCON HBA, either creates a virtual drive or a JBOD drive from the pre-boot application.
.sp
.LP
The LSI MegaRAID FALCON SAS device can support up to 16 virtual  SAS2.0, SAS1.0, SATA3.0, or SATA 6.0 disks. The BIOS numbers the virtual  disks as 1 through 16. In Solaris these drives are numbered from 0 to 15.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/imraid_sas\fR\fR
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/imraid_sas\fR\fR
.ad
.sp .6
.RS 4n
64-bit kernel module x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/imraid_sas.conf\fR\fR
.ad
.sp .6
.RS 4n
Driver configuration file containing one user-configurable option
.sp
This file is not editable.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/storage/imraid_sas
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBattributes\fR(5), \fBsata\fR(7D), \fBscsi_hba_attach_setup\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fISmall Computer System Interface-2 (SCSI-2)\fR
.SH NOTES
.sp
.LP
JBOD drives do not qualify for any of the RAID processing.
.sp
.LP
The \fBimraid_sas\fR driver only supports internal and external expanders that are not fully SAS1.0 or fully SAS2.0 compliant.
