Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/iwh.7d
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH iwh 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
iwh \- Intel(R) WiFi Link 5100/5300 Driver
.SH DESCRIPTION
.sp
.LP
The \fBiwh\fR \fI802.11a/g/n\fR wireless NIC driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the Intel Shirley Peak WiFi  chipset-based NIC's. Driver functions  include controller initialization, wireless \fI802.11\fR infrastructure network connection, WEP and  frame transmit and receive.
.SH CONFIGURATION
.sp
.LP
The \fBiwh\fR driver performs auto-negotiation  to determine the data rate and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec. Supported \fI802.11g\fR data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54 Mbits/sec.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/iwh\fR\fR
.ad
.RS 25n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/iwh\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/iwh\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/iwh
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN Media  Access Control  and  Physical Layer Specification\fR- IEEE, 2001. 
