Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/iwk.7d
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH iwk 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
iwk \- Intel Pro. Wireless 802.11a/g/n 4965 driver
.SH DESCRIPTION
.sp
.LP
The  iwk \fI802.11a/g/n\fR  wireless NIC driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the Intel Pro Wireless 4965AGN chipset-based wireless NIC's.
.SH DRIVER CONFIGURATION
.sp
.LP
The \fBiwk\fR driver supports only \fI802.11g\fR BSS networks (also known as "ap" or "infrastructure" networks) and "open" (or "open-system") or "shared system" authentication. For wireless security, WEP encryption and WPA-PSK are currently supported. You perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/iwk*\fR\fR
.ad
.RS 25n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/iwk\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/iwk\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/iwk
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fIIEEE 802.11g- Wireless LAN Standard\(em IEEE, 2003\fR
