Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/marvell88sx.7d
'\" te
.\" Copyright (c) 2007, 2010, Oracle and its affiliates. All rights reserved.
.TH marvell88sx 7D "5 Apr 2010" "SunOS 5.11" "Devices"
.SH NAME
marvell88sx \- Marvell 88SX SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmarvell88sx\fR driver is a SATA framework-compliant HBA driver that supports the Marvell 88SX5081, 88SX5080, 88SX5040, 88SX5041, 88SX6081, and 88SX6041 controllers. 
.sp
.LP
The 88SX5081, 88SX5080, 88SX5040  and 88SX5041 Marvell controllers are fully compliant with the Serial ATA 1.0  specification and support the SATA device hot-swap compliant 1.5 Gbps speed feature.
.sp
.LP
The 88SX6081 and 88SX6041 Marvell controllers are fully-compliant with the SATA II Phase 1.0 specification (the extension  to the SATA 1.0 specification) and support SATA II native command queuing and backwards compatibility with SATA I 1.5 Gpbs speed and devices. In addition, the 88SX6081 device supports the SATA II Phase 1.0 specification features, including SATA II 3.0 Gbps speed, SATA II  Port Multiplier functionality and SATA II Port Selector.  
.sp
.LP
Currently the driver does not support port multiplier or port selector functionality.
.SH CONFIGURATION
.sp
.LP
There are no  tunable parameters in the \fBmarvell88sx.conf\fR file.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/marvell88sx\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/marvell88sx\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/marvell88sx.conf\fR\fR
.ad
.sp .6
.RS 4n
Driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/storage/marvell88sx
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBprtconf\fR(1M), \fBcfgadm_sata\fR(1M), \fBattributes\fR(5), \fBnv_sata\fR(7D), \fBsata\fR(7D)
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the system console:
.sp
.in +2
.nf
marvell88sx<n>:PCI error address 0x<high addr>:<low addr> 
PCI command 0x<command>DAC [true|false]  attribute  
0x<attribute><pci error type>.
.fi
.in -2
.sp

.sp
.LP
The \fIn\fRth instance of a marvell88sx reports a PCI bus status message.  (A hardware issue needs attention). The PCI bus address,  PCI command (whether or not it was a dual address  command), the PCI-X attribute bit, and the error type are displayed.
.sp
.in +2
.nf
marvell88sx<n>: port <port #>: error in PIO command 0<cmd>x: 
status 0x<status>.
.fi
.in -2
.sp

.sp
.LP
The port number on the \fIn\fRth marvell88sx controller received an error while performing a programmed I/O command <cmd> with status <status>.
.sp
.in +2
.nf
marvell88sx<n>: error on port<port#>: One or more of the following:
.fi
.in -2
.sp

.sp
.in +2
.nf
ATA UDMA data parity error  
ATA UDMA PRD parity error  
device error  
device disconnected  
device connected   
SError interrupt
reserved bit 6  
EDMA self disabled  
BIST FIS or asynchronous notification   
command request queue parity error  
command response queue parity error   
internal memory parity error  
I/O ready time-out  
link control receive error - crc   
link control receive error - fifo   
link control receive error - reset  
link control receive error - state   
link data receive error - crc  
link data receive error - fifo  
link data receive error - reset  
link data receive error - state  
link control transmit error - crc  
link control transmit error - fifo  
link control transmit error - reset   
link control transmit error - DMAT  
link control transmit error - collision   
link data transmit error -crc
link data transmit error - fifo 
link data transmit error - reset 
link data transmit error - DMAT  
link data transmit error - collision
transport protocol error
.fi
.in -2

.sp
.LP
The port number on the \fIn\fRth marvell88sx controller received one or more error conditions as listed.
.sp
.in +2
.nf
marvell88sx<n>: device on port <port #> still busy.
.fi
.in -2
.sp

.sp
.LP
The port number on the \fIn\fRth marvell88sx remains busy. (Indicates a hardware problem). Check the disk and the controller.
.sp
.in +2
.nf
marvell88sx<n>: pci_config_setup failed.
.fi
.in -2
.sp

.sp
.LP
Could not access PCI configuration space for the \fIn\fRth marvell88sx controller.
.sp
.in +2
.nf
marvell88sx<n>:failed to get device id.
.fi
.in -2
.sp

.sp
.LP
The device-id property for the \fIn\fRth marvell88sx controller cannot be read.
.sp
.in +2
.nf
marvell88sx<n>: Unrecognized device - device id 0x<device id> 
assuming <n> ports.
.fi
.in -2
.sp

.sp
.LP
The device id associated with the \fIn\fRth marvell88sx  controller is not supported and the number of ports could not be determined. \fIn\fR ports are being assumed.
.sp
.in +2
.nf
marvell88sx<n>:Unrecognized device - device idOx<device id>.
.fi
.in -2
.sp

.sp
.LP
The device id associated with the \fIn\fRth marvell88sx  controller is not supported.
.sp
.in +2
.nf
marvell88sx<n>: Could not attach. Could not allocate softstate.
.fi
.in -2
.sp

.sp
.LP
A call to ddi_soft_state_zalloc() failed for the \fIn\fRth marvell88sx  controller. The system may be low on resources. The  driver failed to attach.
.sp
.in +2
.nf
 marvell88sx<n>: Could not attach, unknown device model.
.fi
.in -2
.sp

.sp
.LP
The \fIn\fRth  marvell88sx  controller  is  unsupported  hardware. The  driver failed to attach.
.sp
.in +2
.nf
marvell88sx<n>: Could not attach, unsupported chip step-
 ping or unable to get the chip stepping.
.fi
.in -2
.sp

.sp
.LP
The \fIn\fRth marvell88sx controller is  not supported  due to a known bad chip stepping or a stepping of  an unknown model.
.sp
.in +2
.nf
 marvell88sx<n>: ddi_intr_get_supported_types failed.
.fi
.in -2
.sp

.sp
.LP
The driver failed to attach.
.sp
.in +2
.nf
marvell88sx<n>: power management component not created.
.fi
.in -2
.sp

.sp
.LP
Power management is not supported.
.sp
.in +2
.nf
mavell88sx<n>: unable to attach to sata framework.
.fi
.in -2
.sp

.sp
.LP
The driver failed to attach.
.sp
.in +2
.nf
marvell88sx<n>: unable to detach from sata framework.
.fi
.in -2
.sp

.sp
.LP
The driver failed to detach.
.sp
.in +2
.nf
marvell88sx<n>: Could not attach, failed interrupt registration.
.fi
.in -2
.sp

.sp
.LP
The driver failed to attach.
.sp
.in +2
.nf
marvell88sx<n>: Cannot get number interrupts, rc 
.fi
.in -2
.sp

.sp
.LP
The number of interrupts for the \fIn\fRth marvell88sx  device could not be determined.
.sp
.in +2
.nf
 marvell88sx<n>: 0 is not a valid number of interrupts.
.fi
.in -2
.sp

.sp
.LP
The number of interrupts for the \fIn\fRth marvell88sx  device was returned as 0.
.sp
.in +2
.nf
marvell88sx<n>: Failed to get the number of available interrupts.                
.fi
.in -2
.sp

.sp
.LP
The number of available interrupts for the \fIn\fRth  marvell88sx controller could not be determined.
.sp
.in +2
.nf
 marvell88sx<n>: Number of available interrupts is 0.
.fi
.in -2
.sp

.sp
.LP
No interrupts  were  available for the \fIn\fRth  marvell88sx device.
.sp
.in +2
.nf
marvell88sx<n>: could not allocate interrupts.
.fi
.in -2
.sp

.sp
.LP
The interrupts for  the \fIn\fRth marvell88sx device  could not be allocated.
.sp
.in +2
.nf
marvell88sx<n>: could not get interrupt priority.
.fi
.in -2
.sp

.sp
.LP
The interrupt priority for the \fIn\fRth marvell88sx  device could not be determined.
.sp
.in +2
.nf
 marvell88sx<n>: Could not add interrupt handler.
.fi
.in -2
.sp

.sp
.LP
An interrupt service routine could not be added to the system for the \fIn\fRth marvell88sx device.
.sp
.in +2
.nf
marvell88sx<n>:polled read/write request never completed- port <num>.
.fi
.in -2
.sp

.sp
.LP
A polled read or write did not complete in a reasonable amount of time. If this problem persists, there may be a  hardware  problem with (a) the  controller, (b) the controller port, (c) the disk attached to controller port or (d) the cabling.
.sp
.in +2
.nf
marvell88sx<n>: EDMA never disabled.
.fi
.in -2
.sp

.sp
.LP
Could  not  disable EDMA. (Indicates a hardware problem).
.sp
.in +2
.nf
marvell88sx<n>: Could not attach.
.fi
.in -2
.sp

.sp
.LP
The \fIn\fRth marvell8ssx  device could not attach. This message is usually preceded by  another warning indicating why the attach failed.
