Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/ntxn.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ntxn 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
ntxn \- NetXen 10/1 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ntxn*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBntxn\fR 10/1 Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on NetXen 10/1 Gigabit Ethernet controllers.
.sp
.LP
The \fBntxn\fR driver functions include chip initialization, frames transmit and receive, promiscuous and multicast support, TCP and UDP checksum off-load (IPv4) and 9600 bytes jumbo frame. 
.sp
.LP
The \fBntxn\fR driver and hardware support the 10GBASE CX4, 10GBASE-SR/W, LR/W, and 10/100/1000BASE-T physical layers.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/ntxn\fR, is used to access all NetXen devices installed within the system.
.sp
.LP
The \fBntxn\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBntxn\fR instances and for \fBntxn\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to your DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 9600.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address component is followed immediately by a 2-byte SAP component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address (FF:FF:FF:FF:FF:FF).
.RE
.SH CONFIGURATION
.sp
.LP
By default, the \fBntxn\fR driver works without any configuration file.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ntxn*\fR\fR
.ad
.RS 26n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ntxn\fR\fR
.ad
.RS 26n
.rt  
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ntxn\fR\fR
.ad
.RS 26n
.rt  
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ntxn.conf\fR\fR
.ad
.RS 26n
.rt  
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
Availabilitydriver/network/ethernet/ntxn
Architecturex86
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBndd\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBstreamio\fR(7I), \fBdlpi\fR(7P)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
