Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/radeon.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.  All Rights Reserved.
.TH radeon 7d "24 Jun 2009" "SunOS 5.11" "Devices"
.SH NAME
radeon \- DRI (Direct Rendering Infrastructure)-compliant kernel driver providing 3-dimensional graphic hardware acceleration support.
.SH DESCRIPTION
.sp
.LP
The \fBradeon\fR driver is a DRI-compliant  kernel driver that provides graphics hardware acceleration support. DRI is a framework for coordinating OS kernel, 3D  graphics hardware, X window system and OpenGL applications.
.sp
.LP
The \fBradeon\fR driver currently supports certain low-end ATI radeon graphics cards, including Radeon X700.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/radeon\fR\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/radeon\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/graphics/drm
_
Architecture x86
_
Interface Stability Committed
.TE

.SH SEE ALSO
.sp
.LP
\fB/usr/X11/share/man/man1/Xserver.1\fR
.sp
.LP
\fB/usr/X11/share/man/man1/Xorg.1\fR
.sp
.LP
\fB/usr/X11/share/man/man5/X11.5\fR
.sp
.LP
\fBattributes\fR(5)
