Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/rum.7d
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rum 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
rum \- Ralink RT2501/RT2601/RT73USB 802.11b/g Wireless Driver
.SH DESCRIPTION
.sp
.LP
The \fBrum\fR \fI802.11b/g\fR wireless NIC driver is  a multi-threaded, loadable, clonable,  GLDv3-based  STREAMS driver supporting the Ralink RT2501/RT2601/RT73USB chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The \fBrum\fR driver performs auto-negotiation to determine the data  rate  and mode. Supported 802.11b data rates are 1, 2,      5.5 and 11 Mbits/sec. Supported 802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54 Mbits/sec. The \fBrum\fR driver supports only BSS  networks (also known as "ap" or "infrastructure" networks) and "open" (or "open-system") or "shared system" authentication.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/rum*\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/rum\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/rum\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i) 
lw(0i) |lw(5.5i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability driver/network/wlan/rum
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN  Media  Access Control and  Physical Layer Specification\fR - IEEE, 2001
