Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/rwd.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rwd 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
rwd \- Ralink RT2561/RT2561S/RT2661 IEEE802.11b/g wireless network driver
.SH DESCRIPTION
.sp
.LP
The rwd IEEE802.11b/g wireless network driver is a multithreaded, loadable, clonable, GLDv3-based STREAMS driver supporting Ralink RT2561/RT2561S/RT2661 IEEE802.11b/g wireless network driver.
.SH CONFIGURATION
.sp
.LP
The \fBrwd\fR driver performs auto-negotiation to determine the data rate and mode. The driver supports only BSS networks (also known as "ap" or "infrastructure" networks) and "open"(or "open-system") or "shared system" authentication. For wireless security,  WEP encryption, WPA-PSk, and WPA2-PSK are currently supported. You can perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/rwd\fR\fR
.ad
.RS 25n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/rwd\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/rwd\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/rwd
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fIIEEE802.11b/g - Wireless LAN Standard - IEEE, 2003\fR
