Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/rwn.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rwn 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
rwn \- Ralink RT2700/2800 IEEE802.11 a/b/g/n wireless network device
.SH DESCRIPTION
.sp
.LP
The \fBrwn\fR IEEE802.11 a/b/g/n wireless driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting Ralink RT2700/RT2800 IEEE802.11 a/b/g/n wireless network device.
.SS "Configuration"
.sp
.LP
The \fBrwn\fR driver performs auto-negotiation to determine the data rate and mode. The driver supports only BSS networks (also known as \fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR (\fBopen-system\fR) or \fBshared system\fR authentication. 
.sp
.LP
For wireless security, WEP encryption, WPA-PSK, and WPA2-PSK are currently supported. You can perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/rwn\fR\fR
.ad
.RS 25n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/rwn\fR\fR
.ad
.RS 25n
.rt  
32-bit ELF kernel module, x86
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/rwn\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module, x86
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/network/wlan/rwn
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fIIEEE802.11b/g - Wireless LAN Standard - IEEE, 2003\fR
