Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/scu.7d
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH scu 7D "21 Jun 2011" "SunOS 5.11" "Devices"
.SH NAME
scu \- Intel SAS2.0 storage controller unit driver
.SH SYNOPSIS
.sp
.LP
\fBscsi@\fR\fIunit-address\fR
.SH DESCRIPTION
.sp
.LP
The \fBscu\fR driver is a SCSAv3 compliant SAS2.0 driver.
.sp
.LP
The Intel \fBscu\fR host bus adapter driver is a nexus driver that is SAS 2.0 and SATA 3 compliant. It supports multiple operation modes including SSP, STP, SMP initiator, SMP target and SATA host operations. \fBscu\fR is integrated into the south bridge- Patsburg, providing 1.5/3/6 Gb/s link operations for SAS and SATA, and also supports wide ports up to X4.
.sp
.LP
The \fBscu\fR driver is SCSA v3 compliant, and it has advanced features provided by SCSA v3 including flexible \fBiport\fR attach/detach, hot plug functionality, and MPxIO capability. Besides the basic SAS/SATA I/O, the driver also supports expander, FMA, fast reboot, suspend/resume, and \fBsmhba\fR.
.SS "Configuration"
.sp
.LP
The \fBscu\fR driver is configured by defining properties in the \fBscu.conf\fR file. These properties override the global SCSI settings. 
.sp
.LP
The \fBscu\fR driver supports the following properties:
.sp
.ne 2
.mk
.na
\fB\fBmpxio-disable\fR\fR
.ad
.sp .6
.RS 4n
Solaris I/O multipathing is enabled or disabled on SAS devices with the \fBmpxio-disable\fR property. Specifying \fBmpxio-disable="no"\fR activates I/O multipathing. \fBmpxio-disable="yes"\fR disables I/O multipathing.
.sp
Solaris I/O multipathing can be enabled or disabled on a per port basis. Per port settings override the global setting for the specified ports.
.sp
The following example shows how to disable multipathing on port \fB0\fR, whose parent is \fB/pci@0,0/pci8086,2940@1c/pci1000,72@0\fR:
.sp
.in +2
.nf
name="scu" parent="/pci@0,0/pci8086,3c02@1c/pci8086,1d60@0"
mpxio-disable="yes";
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBis-sata-ncq-enabled\fR\fR
.ad
.sp .6
.RS 4n
Set \fB1\fR to enable the \fBSATA NCQ\fR feature, and disable otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax-ncq-depth\fR\fR
.ad
.sp .6
.RS 4n
Set the \fBNCQ\fR depth to \fIn\fR. The maximum value is \fB32\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax-speed-generation\fR\fR
.ad
.sp .6
.RS 4n
Set the speed for PHY/port, the default is \fB3\fR, which indicates generation 3, that is, \fB6.0 Gb/s\fR. When this is changed to \fB2\fR, that indicates \fB3.0 Gb/s\fR. When this is changed to \fB1\fR, that indicates \fB1.5 Gb/s\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/smp/amd64/scu\fR\fR
.ad
.RS 24n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/scu.conf\fR\fR
.ad
.RS 24n
.rt  
Optional configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stabilityx86
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBpci\fR(4), \fBattributes\fR(5), \fBscsi_abort\fR(9F), \fBscsi_hba_attach_setup\fR(9F), \fBscsi_ifgetcap\fR(9F), \fBscsi_ifsetcap\fR(9F),\fBscsi_reset\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_extended_sense\fR(9S), \fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S) 
