Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/man7d/urtw.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH urtw 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
urtw \- RealTek RTL8187L/RTL8187B USB 802.11b/g Wireless Driver
.SH DESCRIPTION
.sp
.LP
The \fBurtw\fR 802.11b/g wireless driver is a multi-threaded, loadable, clonable, GLDv3-basedSTREAMS driver supporting the RealTek RTL8187L chipset-based wireless devices.
.SS "Configuration"
.sp
.LP
The \fBurtw\fR driver performs auto-negotiation to determine the data rate and mode. Supported 802.11b data rates are 1, 2, 5.5 and 11 Mbits/sec. Supported 802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 8, 24, 36, 48 and 54 Mbits/sec. The \fBatu\fR driver supports only BSS networks (also known as\fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR (or \fBopen-system\fR) or \fBshared system\fR authentication.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/urtw*\fR\fR
.ad
.RS 26n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/urtw\fR\fR
.ad
.RS 26n
.rt  
32-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/urtw\fR\fR
.ad
.RS 26n
.rt  
64-bit ELF kernel module. (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/urtw
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 \(em Wireless LAN Media Access Control and Physical Layer Specification, IEEE, 2001\fR
