Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_add_engine.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_add_engine 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_add_engine, audio_dev_remove_engine \- add or remove an audio engine to or from a device
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

void audio_dev_add_engine(audio_dev_t *\fIadev\fR, audio_engine_t *\fIengine\fR);
.fi

.LP
.nf
void audio_dev_remove_engine(audio_dev_t *\fIadev\fR, audio_engine_t *\fIengine\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 10n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc\fR(9F)
.RE

.sp
.ne 2
.mk
.na
\fB\fIengine\fR\fR
.ad
.RS 10n
.rt  
pointer to an audio engine allocated with \fBaudio_engine_alloc\fR(9F)
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_add_engine()\fR function associates an allocated and initialized engine with an audio device.
.sp
.LP
Multiple engines may be added to an audio device in this fashion. Usually device drivers perform this at least twice: once for a playback engine and once for a record engine. Multiple playback engines can be especially useful in allowing the framework to avoid software mixing overhead or to support engines running with different parameters. For example, different engines may support different audio formats or different sample rates.
.sp
.LP
Generally, \fBaudio_dev_add_engine()\fR should be called before registering the audio device with the audio framework using \fBaudio_dev_register\fR(9F).
.sp
.LP
The \fBaudio_dev_remove_engine()\fR function removes an engine from the list of engines associated with a device. This is generally called during \fBdetach\fR(9E) processing.
.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBdetach\fR(9E), \fBaudio_dev_alloc\fR(9F), \fBaudio_dev_register\fR(9F), \fBaudio_dev_unregister\fR(9F), \fBaudio_engine_alloc\fR(9F)
