Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_init_ops.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_init_ops 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_init_ops, audio_fini_ops \- initialize DDI entry points for an audio device driver
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

void audio_init_ops(struct dev_ops *\fIdevops\fR, const char *\fIname\fR);
.fi

.LP
.nf
void audio_fini_ops(struct dev_ops *\fIdevops\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdevops\fR\fR
.ad
.RS 10n
.rt  
pointer to the \fBdev_ops\fR(9S) vector for the device instance
.RE

.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 10n
.rt  
name of the audio driver, which must be the same as the kernel module name. For example, "audiohd".
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_init_ops()\fR function initializes the device operations vector for an audio driver, setting a number of entry points to common implementation from the audio framework. It must be executed during the \fB_init\fR(9E) function for the driver.
.sp
.LP
The actual values supplied by \fBaudio_init_ops()\fR are the fields for \fIdevo_cb_ops\fR and \fIdevo_getinfo\fR.
.sp
.LP
Device drivers need to supply any other entry points, especially the \fBattach\fR(9E), \fBdetach\fR(9E), and \fBquiesce\fR(9E) entry points.
.sp
.LP
The \fBddi_driver_name\fR(9F) function cannot be used to determine the device driver's name, as there is not necessarily a \fBdev_info_t\fR to use during the \fB_init\fR(9E) entry point. A constant string must be supplied by the driver.
.sp
.LP
The \fBaudio_fini_ops()\fR function undoes the work of \fBaudio_init_ops()\fR and releases resources allocated by \fBaudio_init_ops()\fR.
.SH CONTEXT
.sp
.LP
These functions may be called from the driver's \fB_init\fR(9E) and \fB_fini\fR(9E) entry points only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBattach\fR(9E), \fBdetach\fR(9E), \fB_fini\fR(9E), \fB_init\fR(9E), \fBquiesce\fR(9E), \fBddi_driver_name\fR(9F), \fBdev_ops\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.sp
.LP
Audio device driver names are limited to at most 12 characters.
.sp
.LP
The audio DDI is provided by the drv/audio module. Developers should supply "-dy -Ndrv/audio" on the final link command line to ensure that symbol dependencies can be satisfied when the driver is loaded.
