Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_warn.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_warn 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_warn \- log a warning message for an audio device
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

void audio_dev_warn(audio_dev_t *\fIadev\fR, const char *\fIfmt\fR, ...);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 8n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc\fR(9F). This parameter can be \fINULL\fR if no suitable device pointer is available.
.RE

.sp
.ne 2
.mk
.na
\fB\fIfmt\fR\fR
.ad
.RS 8n
.rt  
format of message to be displayed
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_warn()\fR function is a convenience wrapper that sends a message to the system console or logs using \fBcmn_err\fR(9F) with a level of \fBCE_WARN\fR. It also prefixes the message with information identifying the device if \fIadev\fR is not \fINULL\fR.
.sp
.LP
The format should not contain any trailing newlines, as the newline will be appended by \fBcmn_err()\fR automatically. Unlike \fBcmn_err()\fR, however, no special handling of the first character of the format string is performed.
.SH CONTEXT
.sp
.LP
This function may be called in any context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio_dev_alloc\fR(9F), \fBcmn_err\fR(9F)
