Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_engine_alloc.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_engine_alloc 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_engine_alloc, audio_engine_free \- allocate or free an audio engine
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

audio_engine_t *audio_engine_alloc(audio_engine_ops_t *\fIops\fR,
     unsigned \fIflags\fR);
.fi

.LP
.nf
void audio_engine_free(audio_engine_t *\fIengine\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIops\fR\fR
.ad
.RS 10n
.rt  
pointer to an operations vector describing the engine
.RE

.sp
.ne 2
.mk
.na
\fB\fIflags\fR\fR
.ad
.RS 10n
.rt  
integer mask of flags indicating further details about the engine and its capabilities. \fBENGINE_INPUT_CAP\fR indicates the engine supports recording \fBENGINE_OUTPUT_CAP\fR indicates the engine supports playback. All other possible bits are reserved and should be unset.
.RE

.sp
.ne 2
.mk
.na
\fB\fIengine\fR\fR
.ad
.RS 10n
.rt  
pointer to an audio engine allocated with \fBaudio_engine_alloc()\fR
.RE

.SH DESCRIPTION
.sp
.LP
The \fBaudio_engine_alloc()\fR function allocates a structure representing an audio DMA or PIO engine (sometimes called a "stream"). The allocated structure is opaque to device drivers, but is used when the driver needs to supply a reference to the engine to other functions in the Solaris Audio DDI.
.sp
.LP
The \fBaudio_engine_free()\fR function frees a previously allocated structure and releases any resources associated with it. It is important that device drivers not call this while the engine remains registered with the audio device. This should not be called until after the engine is deregistered with \fBaudio_dev_remove_engine\fR(9F) or before it is registered with \fBaudio_dev_add_engine\fR(9F).
.SH RETURN VALUES
.sp
.LP
The audio_engine_alloc function returns an opaque handle for the audio engine. It always succeeds.
.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_dev_add_engine\fR(9F), \fBaudio_dev_remove_engine\fR(9F), \fBaudio_engine_set_private\fR(9F), \fBaudio_engine_ops\fR(9S)
