Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_register.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_register 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_register, audio_dev_unregister \- register or unregister an audio device from the system
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

int audio_dev_register(audio_dev_t *\fIadev\fR);
.fi

.LP
.nf
int audio_dev_unregister(audio_dev_t *\fIadev\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 8n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc\fR(9F)
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_register()\fR function is called by the driver to complete configuration of the audio device and register the device (along with all of its engines and controls) with the audio framework.
.sp
.LP
Use of this function also results in making the device accessible to applications through the creation of minor nodes and other such entities.
.sp
.LP
The \fBaudio_dev_register()\fR function is often the last function called by a driver during \fBattach\fR(9E) processing.
.sp
.LP
The \fBaudio_dev_unregister()\fR function is the inverse operation, and deregisters the device (and engines and controls) from the framework. However, it also checks to make sure that the device is not in use before doing so. As such, it is usually the first function called during \fBdetach\fR(9E) processing.
.SH RETURN VALUES
.sp
.LP
The \fBaudio_dev_register()\fR function returns \fBDDI_SUCCESS\fR on success or \fBDDI_FAILURE\fR on failure.
.sp
.LP
The \fBaudio_dev_unregister()\fR function returns \fBDDI_SUCCESS\fR if it unregistered successfully, or \fBDDI_FAILURE\fR if it did not. Generally, \fBDDI_FAILURE\fR indicates that the audio device is still in use.
.SH CONTEXT
.sp
.LP
These functions may only be called in user or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBattach\fR(9E), \fBdetach\fR(9E), \fBaudio_dev_alloc\fR(9F)
