Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_alloc.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_alloc 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_alloc, audio_dev_free \- allocate or free an audio device
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

audio_dev_t *audio_dev_alloc(dev_info_t *\fIdip\fR, int \fIdevno\fR);
.fi

.LP
.nf
void audio_dev_free(audio_dev_t *\fIadev\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 9n
.rt  
the device instance structure for the device
.RE

.sp
.ne 2
.mk
.na
\fB\fIdevno\fR\fR
.ad
.RS 9n
.rt  
an integer representing the "logical device" number of the device. If 0 is supplied, the instance number returned from \fBddi_get_instance\fR(9F) is used instead.
.RE

.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 9n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc()\fR
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_alloc()\fR function allocates a structure representing a logical audio device. Normally, there is one such audio device per \fBdev_info_t\fR. Some devices, however, may support the notion of multiple logical devices, where different audio devices with completely independent configurations can be supported. These devices will usually have completely independent physical ports as well. In such cases, the driver may supply a non-zero value for the \fIdevno\fR.
.sp
.LP
If \fIdevno\fR is used, it is the responsibility of the driver to ensure that all values of \fIdevno\fR are unique for that particular driver, and a \fIdevno\fR must be supplied for all hardware instances in the system to avoid collisions with device instance numbers.
.sp
.LP
An audio device (\fBaudio_dev_t\fR) may have multiple DMA or PIO engines "streams", but generally all of these engines are subject to the same set of controllable parameters (such as gain, port selection, etc.)
.sp
.LP
The \fBaudio_dev_free()\fR function frees a previously allocated audio device handle and releases any resources associated with it.
.SH RETURN VALUES
.sp
.LP
The \fBaudio_dev_alloc()\fR function returns an opaque handle for the audio device. It always succeeds.
.SH CONTEXT
.sp
.LP
The \fBaudio_dev_alloc()\fR and \fBaudio_dev_free()\fR functions may be called from user or kernel context only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_dev_add_control\fR(9F), \fBaudio_dev_add_engine\fR(9F), \fBaudio_dev_register\fR(9F), \fBaudio_dev_set_description\fR(9F), \fBaudio_dev_suspend\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
