Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_suspend.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_suspend 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_suspend, audio_dev_resume \- suspend or resume an audio device
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

void audio_dev_suspend(audio_dev_t *\fIadev\fR);
.fi

.LP
.nf
void audio_dev_resume(audio_dev_t *\fIadev\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 8n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc\fR(9F)
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_suspend()\fR function suspends all functions associated with an audio device. The intention is for the audio driver to call this as the first part of its handling for \fBDDI_SUSPEND\fR in \fBdetach\fR(9E).
.sp
.LP
The \fBaudio_dev_resume()\fR function resumes functionality associated with the audio device. This function will generally be the last thing executed during the handling for \fBDDI_RESUME\fR in \fBattach\fR(9E).
.sp
.LP
The framework ensures no entry points associated with the audio device are executing while the device is suspended. Furthermore, the framework guarantees that any engines that may have been running are stopped with \fBaudio_engine_stop\fR(9E) before returning from \fBaudio_dev_suspend()\fR. Those engines will be restarted using \fBaudio_engine_start\fR(9E) by \fBaudio_dev_resume()\fR.
.sp
.LP
Any control settings are retrieved during suspend and restored as during resume.
.sp
.LP
The driver must not hold any locks while calling either of these functions.
.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBattach\fR(9E), \fBaudio_engine_start\fR(9E), \fBaudio_engine_stop\fR(9E), \fBdetach\fR(9E), \fBaudio_dev_add_control\fR(9F), \fBaudio_dev_alloc\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
