Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/audio_dev_set_description.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH audio_dev_set_description 9F "21 Apr 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
audio_dev_set_description, audio_dev_set_version, audio_dev_add_info \- set human-readable information fields for an audio device
.SH SYNOPSIS
.LP
.nf
#include <sys/audio/audio_driver.h>

void audio_dev_set_description(audio_dev_t *\fIadev\fR, const char *\fIdesc\fR);
.fi

.LP
.nf
void audio_dev_set_version(audio_dev_t *\fIadev\fR, const char *\fIvers\fR);
.fi

.LP
.nf
void audio_dev_add_info(audio_dev_t *\fIadev\fR, const char *\fIinfo\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIadev\fR\fR
.ad
.RS 8n
.rt  
pointer to an audio device allocated with \fBaudio_dev_alloc\fR(9F)
.RE

.sp
.ne 2
.mk
.na
\fB\fIdesc\fR\fR
.ad
.RS 8n
.rt  
a short description of the device
.RE

.sp
.ne 2
.mk
.na
\fB\fIvers\fR\fR
.ad
.RS 8n
.rt  
a human-readable version for the device
.RE

.sp
.ne 2
.mk
.na
\fB\fIinfo\fR\fR
.ad
.RS 8n
.rt  
additional human-readable details about the device
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBaudio_dev_set_description()\fR and \fBaudio_dev_version()\fR functions set strings describing the device for applications to display this information to users.
.sp
.LP
The \fBaudio_dev_add_info()\fR function provides more detailed information, such as codec details. Successive calls to this function are additive. Each addition will represent one line of output in any detailed device report.
.sp
.LP
The strings are copied by the framework, so drivers may use local or temporary storage for them. They must be properly terminated with null bytes. Only the ASCII character set is supported.
.sp
.LP
The supplied strings may be truncated to 16 characters by some applications.
.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7D), \fBaudio_dev_alloc\fR(9F)
