Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/bioaligned.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH bioaligned 9F "21 Dec 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bioaligned \- check alignment of buffer data
.SH SYNOPSIS
.LP
.nf
#include<sys/ddi.h>
#include<sys/sunddi.h>

int bioaligned(struct buf *\fIbp\fR, size_t \fIalign\fR, int \fIflags\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIbp\fR\fR
.ad
.RS 9n
.rt  
Pointer to the \fBbuf\fR(9S) structure describing the original I/O request.
.RE

.sp
.ne 2
.mk
.na
\fB\fIalign\fR\fR
.ad
.RS 9n
.rt  
Power of two alignment being checked.
.RE

.sp
.ne 2
.mk
.na
\fB\fIflags\fR\fR
.ad
.RS 9n
.rt  
Determines the type of alignment being checked. Flag values supported are \fBBIOALIGNED_BEGIN\fR (which checks the beginning address alignment), and \fBBIOALIGNED_END\fR (which checks the ending address alignment).
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The \fBbioaligned()\fR function checks the alignment of memory associated with a buffer. It returns 1 if the buffer is aligned and 0 if the buffer is unaligned.
.SH RETURN VALUES
.sp
.LP
The \fBbioaligned()\fR function returns 1 if the buffer is aligned and 0 if the buffer is unaligned.
.SH CONTEXT
.sp
.LP
The \fBbioaligned()\fR function can be called from any context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBbiodone\fR(9F), \fBbp_mapin\fR(9F), \fBfreerbuf\fR(9F), \fBgetrbuf\fR(9F), \fBbuf\fR(9S)
