Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/canput.9f
'\" te
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH canput 9F "11 Apr 1991" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
canput \- test for room in a message queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBcanput\fR(\fBqueue_t *\fR\fIq\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR \fR
.ad
.RS 6n
.rt  
Pointer to the message queue.
.RE

.SH DESCRIPTION
.sp
.LP
\fBcanput()\fR searches through the stream (starting at \fIq\fR) until it finds a queue containing a service routine where the message can be enqueued, or until it reaches the end of the stream.  If found, the queue containing the service routine is tested to see if there is room for a message in the queue.
.sp
.LP
\fBcanputnext(\fR\fIq\fR\fB)\fR and \fBbcanputnext(\fR\fIq\fR\fB,\fR\fI pri\fR\fB)\fR should always be used in preference to \fBcanput(\fR\fIq\fR\fB\(->q_next)\fR and \fBbcanput(\fR\fIq\fR\fB\(->q_next,\fR\fI pri\fR\fB)\fR respectively.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fB1\fR \fR
.ad
.RS 6n
.rt  
If the message queue is not full.
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
If the queue is full.
.RE

.SH CONTEXT
.sp
.LP
\fBcanput()\fR can be called from user or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBbcanput\fR(9F), \fBbcanputnext\fR(9F), \fBcanputnext\fR(9F), \fBputbq\fR(9F), \fBputnext\fR(9F) 
.sp
.LP
\fIWriting Device Drivers\fR 
.sp
.LP
 \fISTREAMS Programming Guide\fR 
.SH WARNINGS
.sp
.LP
Drivers are responsible for both testing a queue with \fBcanput()\fR and refraining from placing a message on the queue if \fBcanput()\fR fails.
