Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/csx_Parse_CISTPL_FUNCID.9f
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.TH csx_Parse_CISTPL_FUNCID 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_FUNCID \- parse Function Identification tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_FUNCID\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fR\fItu\fR, 
     \fBcistpl_funcid_t *\fR\fIcf\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI \fRSpecific (Solaris \fBDDI) \fR
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIch\fR\fR
.ad
.RS 6n
.rt  
Client handle returned from \fBcsx_RegisterClient\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fItu\fR\fR
.ad
.RS 6n
.rt  
Pointer to a \fBtuple_t\fR structure (see \fBtuple\fR(9S)) returned by a call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fIcf\fR\fR
.ad
.RS 6n
.rt  
Pointer to a \fBcistpl_funcid_t\fR structure which contains the parsed \fBCISTPL_FUNCID\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Function Identification tuple, \fBCISTPL_FUNCID,\fR into a form usable by \fBPC \fRCard drivers.
.sp
.LP
The \fBCISTPL_FUNCID\fR tuple is used to describe information about the functionality provided by a \fBPC \fRCard. Information is also provided to enable system utilities to decide if the \fBPC \fRCard should be configured during system initialization. If additional function specific information is available, one or more function extension tuples of type \fBCISTPL_FUNCE\fR follow this tuple (see \fBcsx_Parse_CISTPL_FUNCE\fR(9F)). 
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBcistpl_funcid_t\fR are:
.sp
.in +2
.nf
uint32_t     function;     /* PC Card function code */
uint32_t     sysinit;      /* system initialization mask */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fB\fBfunction\fR\fR
.ad
.RS 12n
.rt  
This is the function type for \fBCISTPL_FUNCID:\fR 
.sp
.ne 2
.mk
.na
\fBTPLFUNC_MULTI\fR
.ad
.RS 27n
.rt  
Vendor-specific multifunction card
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_MEMORY\fR
.ad
.RS 27n
.rt  
Memory card
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_SERIAL\fR
.ad
.RS 27n
.rt  
Serial I/O port
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_PARALLEL\fR
.ad
.RS 27n
.rt  
Parallel printer port
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_FIXED\fR
.ad
.RS 27n
.rt  
Fixed disk, silicon or removable
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_VIDEO\fR
.ad
.RS 27n
.rt  
Video interface
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_LAN\fR
.ad
.RS 27n
.rt  
Local Area Network adapter
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_AIMS\fR
.ad
.RS 27n
.rt  
Auto Incrementing Mass Storage
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_SCSI\fR
.ad
.RS 27n
.rt  
SCSI bridge
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_SECURITY\fR
.ad
.RS 27n
.rt  
Security cards
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_VENDOR_SPECIFIC\fR
.ad
.RS 27n
.rt  
Vendor specific
.RE

.sp
.ne 2
.mk
.na
\fBTPLFUNC_UNKNOWN\fR
.ad
.RS 27n
.rt  
Unknown function(s)
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsysinit\fR\fR
.ad
.RS 11n
.rt  
This field is bit-mapped and defined as follows:
.sp
.ne 2
.mk
.na
\fBTPLINIT_POST\fR
.ad
.RS 16n
.rt  
POST should attempt configure
.RE

.sp
.ne 2
.mk
.na
\fBTPLINIT_ROM\fR
.ad
.RS 16n
.rt  
Map ROM during sys init
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBCS_SUCCESS\fR\fR
.ad
.RS 27n
.rt  
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_BAD_HANDLE\fR\fR
.ad
.RS 27n
.rt  
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_UNKNOWN_TUPLE\fR\fR
.ad
.RS 27n
.rt  
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_NO_CARD\fR\fR
.ad
.RS 27n
.rt  
No \fBPC \fRCard in socket.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_NO_CIS\fR\fR
.ad
.RS 27n
.rt  
No Card Information Structure (CIS) on \fBPC \fRCard.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_UNSUPPORTED_FUNCTION\fR\fR
.ad
.RS 27n
.rt  
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_GetFirstTuple\fR(9F), \fBcsx_GetTupleData\fR(9F), \fBcsx_Parse_CISTPL_FUNCE\fR(9F), \fBcsx_RegisterClient\fR(9F), \fBcsx_ValidateCIS\fR(9F), \fBtuple\fR(9S) 
.sp
.LP
\fIPC Card 95 Standard, PCMCIA/JEIDA\fR
