Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/csx_Parse_CISTPL_LONGLINK_MFC.9f
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH csx_Parse_CISTPL_LONGLINK_MFC 9F "24 Jan 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_LONGLINK_MFC \- parse the Multi-Function tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_LONGLINK_MFC\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fR\fItu\fR,
     \fBcistpl_longlink_mfc_t *\fR\fIpt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI \fRSpecific (Solaris \fBDDI) \fR
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIch\fR \fR
.ad
.RS 7n
.rt  
Client handle returned from \fBcsx_RegisterClient\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fItu\fR \fR
.ad
.RS 7n
.rt  
Pointer to a \fBtuple_t\fR structure (see \fBtuple\fR(9S)) returned by a call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fIpt\fR \fR
.ad
.RS 7n
.rt  
Pointer to a \fBcistpl_longlink_mfc_t\fR structure which contains the parsed \fBCISTPL_LONGLINK_MFC\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Multi-Function tuple, \fBCISTPL_LONGLINK_MFC,\fR into a form usable by \fBPC \fRCard drivers.
.sp
.LP
The \fBCISTPL_LONGLINK_MFC\fR tuple describes the start of the function-specific \fBCIS \fRfor each function on a multi-function card.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBcistpl_longlink_mfc_t\fR are:
.sp
.in +2
.nf
uint32_t    nfuncs;
uint32_t    nregs;
uint32_t    function[CIS_MAX_FUNCTIONS].tas
uint32_t    function[CIS_MAX_FUNCTIONS].addr
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fB\fBnfuncs\fR \fR
.ad
.sp .6
.RS 4n
This field indicates the number of functions on the \fBPC \fRcard.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnregs\fR \fR
.ad
.sp .6
.RS 4n
This field indicates the number of configuration register sets.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfunction[CIS_MAX_FUNCTIONS].tas\fR \fR
.ad
.sp .6
.RS 4n
This field provides the target address space for each function on the \fBPC \fRcard. This field can be one of:
.sp
.ne 2
.mk
.na
\fB\fBCISTPL_LONGLINK_MFC_TAS_AM\fR\fR
.ad
.sp .6
.RS 4n
CIS in attribute memory
.RE

.sp
.ne 2
.mk
.na
\fB\fBCISTPL_LONGLINK_MFC_TAS_CM\fR\fR
.ad
.sp .6
.RS 4n
CIS in common memory
.RE

.sp
.ne 2
.mk
.na
\fB\fBfunction[CIS_MAX_FUNCTIONS].addr\fR \fR
.ad
.sp .6
.RS 4n
This field provides the target address offset for each function on the \fBPC \fRcard.
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBCS_SUCCESS\fR \fR
.ad
.RS 28n
.rt  
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_BAD_HANDLE\fR \fR
.ad
.RS 28n
.rt  
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_UNKNOWN_TUPLE\fR \fR
.ad
.RS 28n
.rt  
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_NO_CARD\fR \fR
.ad
.RS 28n
.rt  
No \fBPC \fRCard in socket.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_NO_CIS\fR \fR
.ad
.RS 28n
.rt  
No Card Information Structure (CIS) on \fBPC \fRCard.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_UNSUPPORTED_FUNCTION\fR \fR
.ad
.RS 28n
.rt  
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_GetFirstTuple\fR(9F), \fBcsx_GetTupleData\fR(9F), \fBcsx_RegisterClient\fR(9F), \fBcsx_ValidateCIS\fR(9F), \fBtuple\fR(9S) 
.sp
.LP
\fIPC Card 95 Standard,\fR PCMCIA/JEIDA
