Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/csx_ResetFunction.9f
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.TH csx_ResetFunction 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ResetFunction \- reset a function on a PC card
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ResetFunction\fR(\fBclient_handle_t\fR \fIch\fR, \fBreset_function_t *\fR\fIrf\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI\fR Specific (Solaris \fBDDI\fR)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIch\fR\fR
.ad
.RS 6n
.rt  
Client handle returned from \fBcsx_RegisterClient\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fIrf\fR\fR
.ad
.RS 6n
.rt  
Pointer to a \fBreset_function_t\fR structure.
.RE

.SH DESCRIPTION
.sp
.LP
\fBcsx_ResetFunction()\fR requests that the specified function on the \fBPC\fR card initiate a reset operation.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBreset_function_t\fR are:
.sp
.in +2
.nf
 uint32_t     Socket;        /* socket number */
  uint32_t     Attributes;    /* reset attributes  */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fB\fBSocket\fR\fR
.ad
.RS 14n
.rt  
Not used in Solaris, but for portability with other Card Services implementations, it should be set to the logical socket number.
.RE

.sp
.ne 2
.mk
.na
\fB\fBAttributes\fR\fR
.ad
.RS 14n
.rt  
Must be \fB0\fR. 
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBCS_SUCCESS\fR\fR
.ad
.RS 27n
.rt  
Card Services has noted the reset request.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_IN_USE\fR\fR
.ad
.RS 27n
.rt  
This Card Services implementation does not permit configured cards to be reset.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_BAD_HANDLE\fR\fR
.ad
.RS 27n
.rt  
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_NO_CARD\fR\fR
.ad
.RS 27n
.rt  
No \fBPC\fR card in socket.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_BAD_SOCKET\fR\fR
.ad
.RS 27n
.rt  
Specified socket or function number is invalid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCS_UNSUPPORTED_FUNCTION\fR\fR
.ad
.RS 27n
.rt  
No \fBPCMCIA\fR hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_event_handler\fR(9E), \fBcsx_RegisterClient\fR(9F) 
.sp
.LP
\fIPC Card 95 Standard\fR, PCMCIA/JEIDA
.SH NOTES
.sp
.LP
\fBcsx_ResetFunction()\fR has not been implemented in this release and always returns \fBCS_IN_USE\fR. 
