Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/datamsg.9f
'\" te
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.TH datamsg 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
datamsg \- test whether a message is a data message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>



\fBint\fR \fBdatamsg\fR(\fBunsigned char\fR \fItype\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fItype\fR\fR
.ad
.RS 8n
.rt  
The type of message to be tested. The \fBdb_type\fR field of the  \fBdatab\fR(9S) structure contains the message type. This field may be accessed through the message block using \fBmp->b_datap->db_type\fR. 
.RE

.SH DESCRIPTION
.sp
.LP
The \fBdatamsg()\fR function tests the type of message to determine if it is a data message type (\fBM_DATA\fR, \fBM_DELAY\fR, \fBM_PROTO\fR , or \fBM_PCPROTO\fR).
.SH RETURN VALUES
.sp
.LP
\fBdatamsg\fR returns 
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
if the message is a data message
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
otherwise.
.RE

.SH CONTEXT
.sp
.LP
The \fBdatamsg()\fR function can be called from user, interrupt, or kernel context.
.SH EXAMPLES
.sp
.LP
The \fBput\fR(9E) routine enqueues all data messages for handling by the \fBsrv\fR(9E) (service) routine. All non-data messages are handled in the  \fBput\fR(9E) routine.
.sp
.in +2
.nf
1 \fIxxx\fRput(q, mp)
2      queue_t *q;
3      mblk_t *mp;
4 {
5    if (datamsg(mp->b_datap->db_type)) {
6            putq(q, mp);
7            return;
8    }
9    switch (mp->b_datap->db_type) {
10    case M_FLUSH:
		       \&.\|.\|.
11    }
12 }
.fi
.in -2

.SH SEE ALSO
.sp
.LP
\fBput\fR(9E), \fBsrv\fR(9E), \fBallocb\fR(9F), \fBdatab\fR(9S), \fBmsgb\fR(9S) 
.sp
.LP
\fIWriting Device Drivers\fR 
.sp
.LP
\fISTREAMS Programming Guide\fR
