Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dev_nintrs.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.TH ddi_dev_nintrs 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dev_nintrs \- return the number of interrupt specifications a device has
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dev_nintrs\fR(\fBdev_info_t *\fR\fIdip\fR, \fBint *\fR\fIresultp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete. Use the new interrupt interfaces referenced in \fBIntro\fR(9F). Refer to \fIWriting Device Drivers\fR for more information.
.SH DESCRIPTION
.sp
.LP
The \fBddi_dev_nintrs()\fR function returns the number of interrupt specifications a device has in \fB*\fR\fIresultp\fR.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dev_nintrs()\fR function returns:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
A successful return. The number of interrupt specifications that the device has is set in \fIresultp\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
The device has no interrupt specifications.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dev_nintrs()\fR function can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBisa\fR(4), \fBsbus\fR(4), \fBddi_add_intr\fR(9F), \fBddi_dev_nregs\fR(9F), \fBddi_dev_regsize\fR(9F), \fBIntro\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
