Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_fm_service_impact.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH ddi_fm_service_impact 9F "14 May 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_fm_service_impact \- report the impact of an error
.SH SYNOPSIS
.LP
.nf
#include <sys/ddifm.h>

\fBvoid\fR \fBddi_fm_service_impact\fR(\fBdev_info_t\fR *\fIdip\fR, \fBint\fR *\fIimpact\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 10n
.rt  
Pointer to the \fBdev_info\fR structure
.RE

.sp
.ne 2
.mk
.na
\fB\fIimpact\fR\fR
.ad
.RS 10n
.rt  
Impact of error
.RE

.SH DESCRIPTION
.sp
.LP
The following service impact values are accepted by \fBddi_fm_service_impact()\fR:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SERVICE_LOST\fR\fR
.ad
.RS 26n
.rt  
The service provided by the device is unavailable due to an error. The operational state of the device will transition to \fBDEVI_DEVICE_DOWN\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_SERVICE_DEGRADED\fR\fR
.ad
.RS 26n
.rt  
The driver is unable to provide normal service, but it can provide a partial or degraded level of service. The driver might have to make repeated attempts to perform an operation before it succeeds, or it may be running at less than its configured speed. A driver may use this value to indicate that an alternative device should be used if available, but that it can continue operation if no alternative exists. The operational state of the device will transition to \fBDEVI_DEVICE_DEGRADED\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_SERVICE_RESTORED\fR\fR
.ad
.RS 26n
.rt  
The service provided by the device has been restored. The operational state of the device will transition to its pre-error condition state and \fBDEVI_DEVICE_DOWN\fR or \fBDEVI_DEVICE_DEGRADED\fR is removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_SERVICE_UNAFFECTED\fR\fR
.ad
.RS 26n
.rt  
The service provided by the device was unaffected by the error.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_fm_service_impact()\fR function can be called from user, kernel, or high-level interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBfmd\fR(1M), \fBattributes\fR(5), \fBddi_fm_ereport_post\fR(9F), \fBpci_ereport_post\fR(9F)
