Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dma_free.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. 
.TH ddi_dma_free 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_free \- release system DMA resources
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_free\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. \fBddi_dma_free_handle\fR(9F) should be used instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
.rt  
The handle filled in by a call to \fBddi_dma_setup\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_free()\fR function releases system \fBDMA\fR resources set up by \fBddi_dma_setup\fR(9F). When a \fBDMA\fR transfer completes, the driver should free up system \fBDMA\fR resources established by a call to \fBddi_dma_setup\fR(9F). This is done by a call to \fBddi_dma_free()\fR. \fBddi_dma_free()\fR does an implicit \fBddi_dma_sync\fR(9F) for you so any further synchronization steps are not necessary.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_free()\fR function returns:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Successfully released resources
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Failed to free resources
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_free()\fR function can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBddi_dma_addr_setup\fR(9F), \fBddi_dma_buf_setup\fR(9F), \fBddi_dma_free_handle\fR(9F), \fBddi_dma_htoc\fR(9F), \fBddi_dma_sync\fR(9F), \fBddi_dma_req\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
