Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dma_coff.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.TH ddi_dma_coff 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_coff \- convert a DMA cookie to an offset within a DMA handle.
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_coff\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_cookie_t *\fR\fIcookiep\fR,
     \fBoff_t *\fR\fIoffp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris SPARC DDI (Solaris SPARC DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 11n
.rt  
The \fIhandle\fR filled in by a call to \fBddi_dma_setup\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fIcookiep\fR\fR
.ad
.RS 11n
.rt  
A pointer to a \fBDMA\fR cookie (see \fBddi_dma_cookie\fR(9S)) that contains the appropriate address, length and bus type to be used in programming the \fBDMA\fR engine.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoffp\fR\fR
.ad
.RS 11n
.rt  
A pointer to an offset to be filled in.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_coff()\fR function converts the values in \fBDMA\fR cookie pointed to by \fIcookiep\fR to an offset (in bytes) from the beginning of the object that the DMA\fBhandle\fR has mapped.
.sp
.LP
The \fBddi_dma_coff()\fR function allows a driver to update a \fBDMA\fR cookie with values it reads from its device's \fBDMA\fR engine after a transfer completes and convert that value into an offset into the object that is mapped for \fBDMA\fR.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_coff()\fR function returns:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Successfully filled in \fIoffp\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Failed to successfully fill in \fIoffp\fR.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_coff()\fR function can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_dma_setup\fR(9F), \fBddi_dma_sync\fR(9F), \fBddi_dma_cookie\fR(9S) 
.sp
.LP
\fIWriting Device Drivers\fR 
