Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dma_get_attr.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH ddi_dma_get_attr 9F "12 Oct 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_get_attr \- get the device DMA attribute structure from a DMA handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_get_attr\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_attr_t *\fR\fIattrp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
.rt  
The handle filled in by a call to \fBddi_dma_alloc_handle\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIattrp\fR\fR
.ad
.RS 10n
.rt  
Pointer to a buffer suitable for holding a DMA attribute structure. See \fBddi_dma_attr\fR(9S).
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_dma_get_attr()\fR is used to get a \fBddi_dma_attr\fR(9S) structure. This structure describes the attributes of the DMA data path to which any memory object bound to the given handle will be subject.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 19n
.rt  
Successfully passed back attribute structure in buffer pointed to by \fIattrp\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_DMA_BADATTR\fR\fR
.ad
.RS 19n
.rt  
A valid attribute structure could not be passed back.
.RE

.SH CONTEXT
.sp
.LP
\fBddi_dma_get_attr()\fR can be called from any context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_attr\fR(9S)
