Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_get8.9f
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.TH ddi_get8 9F "1 Nov 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_get8, ddi_get16, ddi_get32, ddi_get64, ddi_getb, ddi_getw, ddi_getl, ddi_getll \- read data from the mapped memory address, device register or allocated DMA memory address
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBuint8_t\fR \fBddi_get8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fR\fIdev_addr\fR);
.fi

.LP
.nf
\fBuint16_t\fR \fBddi_get16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t *\fR\fIdev_addr\fR);
.fi

.LP
.nf
\fBuint32_t\fR \fBddi_get32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fR\fIdev_addr\fR);
.fi

.LP
.nf
\fBuint64_t\fR \fBddi_get64\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint64_t *\fR\fIdev_addr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). The \fBddi_getb()\fR, \fBddi_getl()\fR, \fBddi_getll()\fR, and \fBddi_getw()\fR functions are obsolete. The \fBddi_get8()\fR function replaces \fBddi_getb()\fR. The \fBddi_get32()\fR function replaces \fBddi_getl()\fR. The \fBddi_get64()\fR function replaces \fBddi_getll()\fR. The \fBddi_get16()\fR function replaces \fBddi_getw()\fR.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 12n
.rt  
The data access handle returned from setup calls, such as \fBddi_regs_map_setup\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fIdev_addr\fR\fR
.ad
.RS 12n
.rt  
Base device address.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_get8()\fR, \fBddi_get16()\fR, \fBddi_get32()\fR, and \fBddi_get64()\fR functions read 8 bits, 16 bits, 32 bits and 64 bits of data, respectively, from the device address, \fIdev_addr\fR.
.sp
.LP
Each individual datum will automatically be translated to maintain a consistent view between the host and the device based on the encoded information in the data access handle.  The translation may involve byte-swapping if the host and the device have incompatible endian characteristics.
.sp
.LP
For certain bus types, you can call these \fBDDI\fR functions from a high-interrupt context. These types include \fBISA\fR and SBus buses. See \fBsysbus\fR(4), \fBisa\fR(4), and \fBsbus\fR(4) for details. For the PCI bus, you can, under certain conditions, call these \fBDDI\fR functions from a high-interrupt context. See \fBpci\fR(4).
.SH RETURN VALUES
.sp
.LP
These functions return the value read from the mapped address.
.SH CONTEXT
.sp
.LP
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityT{
\fBddi_getb()\fR, \fBddi_getl()\fR, \fBddi_getll()\fR, and \fBddi_getw()\fR are Obsolete; \fBddi_get8()\fR, \fBddi_get16()\fR, \fBddi_get32()\fR, \fBddi_get64()\fR are Committed
T}
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_put8\fR(9F), \fBddi_regs_map_free\fR(9F), \fBddi_regs_map_setup\fR(9F), \fBddi_rep_get8\fR(9F), \fBddi_rep_put8\fR(9F) 
