Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dma_numwin.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.TH ddi_dma_numwin 9F "29 Sep 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_numwin \- retrieve number of DMA windows
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_numwin\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBuint_t *\fR\fInwinp\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
.rt  
The  \fBDMA\fR handle previously allocated by a call to  \fBddi_dma_alloc_handle\fR(9F). 
.RE

.sp
.ne 2
.mk
.na
\fB\fInwinp\fR \fR
.ad
.RS 11n
.rt  
Upon a successful return,  \fInwinp\fR will contain the number of  \fBDMA\fR windows for this object.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
\fBddi_dma_numwin()\fR returns the number of  \fBDMA\fR windows for a  \fBDMA\fR object if partial resource allocation was permitted.
.SH RETURN VALUES
.sp
.LP
\fBddi_dma_numwin()\fR returns:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR \fR
.ad
.RS 16n
.rt  
Successfully filled in the number of  \fBDMA\fR windows.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR \fR
.ad
.RS 16n
.rt  
\fBDMA\fR windows are not activated.
.RE

.SH CONTEXT
.sp
.LP
\fBddi_dma_numwin()\fR can be called from user, kernel, or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBddi_dma_addr_bind_handle\fR(9F), \fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_buf_bind_handle\fR(9F), \fBddi_dma_unbind_handle\fR(9F) 
.sp
.LP
\fIWriting Device Drivers\fR 
