Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_dma_unbind_handle.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.TH ddi_dma_unbind_handle 9F "26 Sep 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_unbind_handle \- unbinds the address in a DMA handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_unbind_handle\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
.rt  
The  \fBDMA\fR handle previously allocated by a call to  \fBddi_dma_alloc_handle\fR(9F). 
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
\fBddi_dma_unbind_handle()\fR frees all  \fBDMA\fR resources associated with an existing  \fBDMA\fR handle.  When a  \fBDMA\fR transfer completes, the driver should call \fBddi_dma_unbind_handle()\fR to free system  \fBDMA\fR resources established by a call to \fBddi_dma_buf_bind_handle\fR(9F) or  \fBddi_dma_addr_bind_handle\fR(9F). \fBddi_dma_unbind_handle()\fR does an implicit \fBddi_dma_sync\fR(9F) making further synchronization steps unnecessary.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR \fR
.ad
.RS 16n
.rt  
on success
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR \fR
.ad
.RS 16n
.rt  
on failure
.RE

.SH CONTEXT
.sp
.LP
\fBddi_dma_unbind_handle()\fR can be called from user, kernel, or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBddi_dma_addr_bind_handle\fR(9F), \fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_buf_bind_handle\fR(9F), \fBddi_dma_free_handle\fR(9F), \fBddi_dma_sync\fR(9F) 
.sp
.LP
\fIWriting Device Drivers\fR 
