Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_remove_event_handler.9f
'\" te
.\"  Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH ddi_remove_event_handler 9F "2 May 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_remove_event_handler \- remove an NDI event service callback handler
.SH SYNOPSIS
.LP
.nf
#include <sys/dditypes.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_remove_event_handler\fR(\fBddi_registration_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fBddi_registration_id_t \fR\fIid\fR\fR
.ad
.RS 28n
.rt  
Unique system wide registration ID return by \fBddi_add_event_handler\fR(9F) upon successful registration.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_remove_event_handler()\fR function removes the callback handler specified by the registration \fIid\fR (\fBddi_registration_id_t\fR). Upon successful removal, the callback handler is removed from the system and will not be invoked in the face of the event.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Callback handler removed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Failed to remove callback handler.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_remove_event_handler()\fR function can be called from user and kernel contexts only.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBddi_add_event_handler\fR(9F), \fBddi_get_eventcookie\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.sp
.LP
Device drivers must remove all registered callback handlers before \fBdetach\fR(9E) processing for that device instance is complete.
