Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_binding_name.9f
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.TH ddi_binding_name 9F "3 May  1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_binding_name, ddi_get_name \- return driver binding name
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBchar *\fR\fBddi_binding_name\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.LP
.nf
\fBchar *\fR\fBddi_get_name\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR \fR
.ad
.RS 8n
.rt  
A pointer to the device's \fBdev_info\fR structure.
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_binding_name()\fR and \fBddi_get_name()\fR return the driver binding name. This is the name used to select a driver for the device. This name is typically derived from the device  \fBname\fR property or the device \fBcompatible\fR property. The name returned may be a driver alias or the driver name.
.SH RETURN VALUES
.sp
.LP
\fBddi_binding_name()\fR and \fBddi_get_name()\fR return the name used to bind a driver to a device.
.SH CONTEXT
.sp
.LP
\fBddi_binding_name()\fR and \fBddi_get_name()\fR can be called from user, kernel, or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBddi_node_name\fR(9F) 
.sp
.LP
\fIWriting Device Drivers\fR 
.SH WARNINGS
.sp
.LP
The name returned by \fBddi_binding_name()\fR and \fBddi_get_name()\fR is read-only.
