Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_get_driver_private.9f
'\" te
.\"  Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.TH ddi_get_driver_private 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_get_driver_private, ddi_set_driver_private \- get or set the address of the device's private data area
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_set_driver_private\fR(\fBdev_info_t *\fR\fIdip\fR, \fBvoid\fR *\fIdata\fR);
.fi

.LP
.nf
\fBvoid\fR *\fBddi_get_driver_private\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.LP
\fBddi_get_driver_private()\fR
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 7n
.rt  
Pointer to device information  structure to get from.
.RE

.sp
.LP
\fBddi_set_driver_private()\fR
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 8n
.rt  
Pointer to device information structure to set.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdata\fR\fR
.ad
.RS 8n
.rt  
Data area address to set.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_get_driver_private()\fR function returns the address of the device's private data area from the device information structure pointed to by \fIdip\fR. 
.sp
.LP
The \fBddi_set_driver_private()\fR function sets the address of the device's private data area in the device information structure pointed to by \fIdip\fR with the value of \fIdata\fR.
.SH RETURN VALUES
.sp
.LP
The \fBddi_get_driver_private()\fR function returns the contents of  \fBdevi_driver_data\fR. If \fBddi_set_driver_private()\fR has not been previously called with \fIdip\fR, an unpredictable value is returned.
.SH CONTEXT
.sp
.LP
These functions can be called from user , interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fIWriting Device Drivers\fR 
