Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_report_dev.9f
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.TH ddi_report_dev 9F "7 Jun 1993" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_report_dev \- announce a device
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_report_dev\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR \fR
.ad
.RS 8n
.rt  
a pointer the device's \fBdev_info\fR structure.
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_report_dev()\fR prints a banner at boot time,  announcing the device pointed to by \fIdip\fR. The banner is always placed in the system logfile (displayed by \fBdmesg\fR(1M)), but is only displayed on the console if the system was booted with the verbose (\fB-v\fR) argument.
.SH CONTEXT
.sp
.LP
\fBddi_report_dev()\fR can be called from user context.
.SH SEE ALSO
.sp
.LP
\fBdmesg\fR(1M), \fBkernel\fR(1M) 
.sp
.LP
\fIWriting Device Drivers\fR 
