Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_getiminor.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.TH ddi_getiminor 9F "18 Nov 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_getiminor \- get kernel internal minor number from an external dev_t
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/mkdev.h>
#include <sys/ddi.h>



\fBminor_t\fR \fBddi_getiminor\fR(\fBdev_t\fR \fIdev\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. \fBgetminor\fR(9F) should be used instead.
.SH PARAMETERS
.sp
.LP
The following parameters are supported:
.sp
.ne 2
.mk
.na
\fB\fIdev\fR\fR
.ad
.RS 7n
.rt  
Device number.
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_getiminor()\fR extracts the minor number from a device number. This call should be used only for device numbers that have been passed to the kernel from the user space through opaque interfaces such as the contents of \fBioctl\fR(9E) and \fBputmsg\fR(2). The device numbers passed in using standard device entry points must continue to be interpreted using the \fBgetminor\fR(9F) interface. This new interface is used to translate between user visible device numbers and in kernel device numbers. The two numbers may differ in a clustered system.
.sp
.LP
For certain bus types, you can call this \fBDDI\fR function from a  high-interrupt context.  These types include \fBISA\fR and SBus buses.  See \fBsysbus\fR(4), \fBisa\fR(4), and \fBsbus\fR(4) for details.
.SH CONTEXT
.sp
.LP
\fBddi_getiminor()\fR can be called from user context only.
.SH RETURN VALUES
.sp
.LP
The minor number or \fBEMINOR_UNKNOWN\fR if the minor number of the device is invalid.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBgetmajor\fR(9F), \fBgetminor\fR(9F), \fBmakedevice\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.SH WARNINGS
.sp
.LP
Drivers are required to replace calls to \fBddi_getminor.9f\fR by \fBgetminor\fR(9F)) in order to compile under Solaris 10 and later versions.
