Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ddi_intr_get_supported_types.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH ddi_intr_get_supported_types 9F "07 Apr 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_intr_get_supported_types \- return information on supported hardware interrupt types
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_intr_get_supported_types\fR(\fBdev_info_t *\fR\fIdip\fR, \fBint *\fR\fItypesp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 10n
.rt  
Pointer to \fBdev_info\fR structure
.RE

.sp
.ne 2
.mk
.na
\fB\fItypesp\fR\fR
.ad
.RS 10n
.rt  
Pointer to supported interrupt types
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_intr_get_supported_types()\fR function retrieves the interrupt types supported by a particular hardware device and by the system software. Upon successful return, the supported types are returned as a bit mask in the integer pointed to by the \fItypesp\fR argument. See <\fBsys/ddi_intr.h\fR> for a list of interrupts that can be returned by a hardware device.
.sp
.LP
For PCI devices that support MSI and/or MSI-X based hardware, this interface returns only the interrupt types that are supported by all the hardware in the path to the hardware device.
.sp
.LP
An interrupt type is usable by the hardware device if it is returned by the \fBddi_intr_get_supported_types()\fR function. The device driver can be programmed to use one of the returned interrupt types to receive hardware interrupts.
.SH RETURN VALUES
.sp
.LP
The \fBddi_intr_get_supported_types()\fR function returns:
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 21n
.rt  
On success.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_EINVAL\fR\fR
.ad
.RS 21n
.rt  
On encountering invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_INTR_NOTFOUND\fR\fR
.ad
.RS 21n
.rt  
Returned when the hardware device is found not to support any hardware interrupts.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_intr_get_supported_types()\fR function can be called from user or kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBpci\fR(4), \fBattributes\fR(5), \fBpcmcia\fR(7D), \fBsysbus\fR(4), \fBddi_intr_add_handler\fR(9F), \fBddi_intr_alloc\fR(9F), \fBddi_intr_enable\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.sp
.LP
The \fBddi_intr_get_supported_types()\fR function can be called by the device driver even at any time if the driver has added an interrupt handler for a given interrupt type.
.sp
.LP
Soft interrupts are always usable and are not returned by this interface.
.sp
.LP
Any consumer of this interface should verify that the return value is not equal to \fBDDI_SUCCESS\fR. Incomplete checking for failure codes could result in inconsistent behavior among platforms.
