Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/devmap_set_ctx_timeout.9f
'\" te
.\"  Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.TH devmap_set_ctx_timeout 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
devmap_set_ctx_timeout \- set the timeout value for the context management callback
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBdevmap_set_ctx_timeout\fR(\fBdevmap_cookie_t\fR \fIdhp\fR, \fBclock_t\fR \fIticks\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdhp\fR\fR
.ad
.RS 9n
.rt  
An opaque mapping handle that the system uses to describe the mapping.
.RE

.sp
.ne 2
.mk
.na
\fB\fIticks\fR\fR
.ad
.RS 9n
.rt  
Number of clock ticks to wait between successive calls to the context management callback function.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBdevmap_set_ctx_timeout()\fR function specifies the time interval for the system to wait between successive calls to the driver's context management callback function, \fBdevmap_contextmgt\fR(9E). 
.sp
.LP
Device drivers typically call \fBdevmap_set_ctx_timeout()\fR in the \fBdevmap_map\fR(9E) routine. If the drivers do not call \fBdevmap_set_ctx_timeout()\fR to set the timeout value, the default timeout value of \fB0\fR will result in no delay between successive calls to the driver's \fBdevmap_contextmgt\fR(9E) callback function.
.SH CONTEXT
.sp
.LP
The \fBdevmap_set_ctx_timeout()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fBdevmap_contextmgt\fR(9E), \fBdevmap_map\fR(9E), \fBtimeout\fR(9F) 
