Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/flushband.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH flushband 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
flushband \- flush messages for a specified priority band
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBflushband\fR(\fBqueue_t\fR \fI*q\fR, \fBunsigned char\fR \fIpri\fR, \fBint\fR \fIflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 8n
.rt  
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
.rt  
Priority of messages to be flushed.
.RE

.sp
.ne 2
.mk
.na
\fB\fIflag\fR\fR
.ad
.RS 8n
.rt  
Valid \fIflag\fR values are:
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLUSHDATA\fR\fR
.ad
.RS 13n
.rt  
Flush only data messages (types \fBM_DATA,\fR \fBM_DELAY,\fR \fBM_PROTO,\fR and \fBM_PCPROTO\fR \fB\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLUSHALL\fR\fR
.ad
.RS 13n
.rt  
Flush all messages.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBflushband()\fR function flushes messages associated with the priority band specified by \fIpri\fR. If \fIpri\fR is \fB0\fR, only normal and high priority messages are flushed. Otherwise, messages are flushed from the band \fIpri\fR according to the value of \fIflag\fR.
.SH CONTEXT
.sp
.LP
The \fBflushband()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fBflushq\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR \fISTREAMS Programming Guide\fR
