Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/getrbuf.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.TH getrbuf 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
getrbuf \- get a raw buffer header
.SH SYNOPSIS
.LP
.nf
#include <sys/buf.h>
#include <sys/kmem.h>
#include <sys/ddi.h>



\fBstruct buf *\fR\fBgetrbuf\fR(\fBint\fR \fIsleepflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIsleepflag\fR\fR
.ad
.RS 13n
.rt  
Indicates whether driver should sleep for free space.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBgetrbuf()\fR function allocates the space for a buffer header to the caller. It is used in cases where a block driver is performing raw (character interface) I/O and needs to set up a buffer header that is not associated with the buffer cache.
.sp
.LP
The \fBgetrbuf()\fR function calls \fBkmem_alloc\fR(9F) to perform the memory allocation. \fBkmem_alloc()\fRrequires the information included in the \fIsleepflag\fR argument. If \fIsleepflag\fR is set to \fBKM_SLEEP\fR, the driver may sleep until the space is freed up. If \fIsleepflag\fR is set to \fBKM_NOSLEEP\fR, the driver will not sleep.  In either case, a pointer to the allocated space is returned or \fBNULL\fR to indicate that no space was available.
.SH RETURN VALUES
.sp
.LP
The \fBgetrbuf()\fR function returns a pointer to the allocated buffer header, or \fBNULL\fR if no space is available.
.SH CONTEXT
.sp
.LP
The \fBgetrbuf()\fR function can be called from user, interrupt, or kernel context. (Drivers must not allow \fBgetrbuf()\fR to sleep if called from an interrupt routine.)
.SH SEE ALSO
.sp
.LP
\fBbioinit\fR(9F), \fBfreerbuf\fR(9F), \fBkmem_alloc\fR(9F), \fBkmem_free\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
