Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/inb.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.TH inb 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
inb, inw, inl, repinsb, repinsw, repinsd \- read from an I/O port
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBunsigned char\fR \fBinb\fR(\fBint\fR \fIport\fR);
.fi

.LP
.nf
\fBunsigned short\fR \fBinw\fR(\fBint\fR
\fIport\fR);
.fi

.LP
.nf
\fBunsigned long\fR \fBinl\fR(\fBint\fR \fIport\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepinsb\fR(\fBint\fR \fIport\fR, \fBunsigned char *\fR\fIaddr\fR, \fBint\fR
\fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepinsw\fR(\fBint\fR \fIport\fR, \fBunsigned short *\fR\fIaddr\fR, \fBint\fR
\fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepinsd\fR(\fBint\fR \fIport\fR, \fBunsigned long *\fR\fIaddr\fR, \fBint\fR
\fIcount\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
The functions described here are obsolete. For the \fBinb()\fR, \fBinw()\fR, and \fBinl()\fR functions, use, respectively, \fBddi_get8\fR(9F), \fBddi_get8\fR(9F), and \fBddi_get8\fR(9F) instead. For \fBrepinsb()\fR, \fBrepinsw()\fR, and\fBrepinsl()\fR, use, respectively, \fBddi_rep_get8\fR(9F), \fBddi_rep_get8\fR(9F), and \fBddi_rep_get8\fR(9F) instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIport\fR\fR
.ad
.RS 9n
.rt  
A valid I/O port address.
.RE

.sp
.ne 2
.mk
.na
\fB\fIaddr\fR\fR
.ad
.RS 9n
.rt  
The address of a buffer where the values will be stored.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 9n
.rt  
The number of values to be read from the I/O port.
.RE

.SH DESCRIPTION
.sp
.LP
These routines read data of various sizes from the I/O port with the address specified by \fIport\fR.
.sp
.LP
The \fBinb()\fR, \fBinw()\fR, and \fBinl()\fR functions read 8 bits, 16 bits, and 32 bits of data respectively, returning the resulting values.
.sp
.LP
The \fBrepinsb()\fR, \fBrepinsw()\fR, and \fBrepinsd()\fR functions read multiple 8-bit, 16-bit, and 32-bit values, respectively. \fIcount\fR specifies the number of values to be read. A pointer to a buffer will receive the input data; the buffer must be long enough to hold count values of the requested size.
.SH RETURN VALUES
.sp
.LP
The \fBinb()\fR, \fBinw()\fR, and \fBinl()\fR functions return the value that was read from the I/O port.
.SH CONTEXT
.sp
.LP
These functions may be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Architecturex86
_
Stability Level Obsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBisa\fR(4), \fBattributes\fR(5), \fBddi_get8\fR(9F), \fBddi_get8\fR(9F), \fBddi_get8\fR(9F), \fBddi_rep_get8\fR(9F), \fBddi_rep_get8\fR(9F), \fBddi_rep_get8\fR(9F), \fBoutb\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
