Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/kiconv_close.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc., All Rights Reserved
.TH kiconv_close 9F "16 Oct 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
kiconv_close \- code conversion descriptor deallocation function
.SH SYNOPSIS
.LP
.nf
#include <sys/errno.h>
#include <sys/sunddi.h>



\fBint\fR \fBkiconv_close\fR(\fBkiconv_t\fR \fIcd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIcd\fR\fR
.ad
.RS 6n
.rt  
Code conversion descriptor to be deallocated.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBkiconv_close()\fR function deallocates the conversion descriptor \fIcd\fR and all other associated resources allocated by the \fBkiconv_open()\fR function.
.SH RETURN VALUES
.sp
.LP
Upon successful completion, \fBkiconv_close()\fR returns 0; otherwise, it returns the following \fIerrno\fR value to indicate the error:
.sp
.ne 2
.mk
.na
\fB\fBEBADF\fR\fR
.ad
.RS 9n
.rt  
The code conversion descriptor is invalid.
.RE

.SH CONTEXT
.sp
.LP
\fBkiconv_close()\fR can be called from user or interrupt context.
.SH EXAMPLES
.LP
\fBExample 1 \fRClosing the Code Conversion
.sp
.LP
The following example shows how to close the code conversion descriptor with error checking:

.sp
.in +2
.nf
if (kiconv_close(cd) == EBADF) {
         /* Code conversion descriptor is invalid. */
         return (-1);
}
.fi
.in -2

.sp
.LP
The following example shows how to close the code conversion descriptor without error checking:

.sp
.in +2
.nf
(void) kiconv_close(cd);
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(3C), \fBiconv_close\fR(3C), \fBiconv_open\fR(3C), \fBu8_strcmp\fR(3C), \fBu8_textprep_str\fR(3C), \fBu8_validate\fR(3C), \fBuconv_u16tou32\fR(3C), \fBuconv_u16tou8\fR(3C), \fBuconv_u32tou16\fR(3C), \fBuconv_u32tou8\fR(3C), \fBuconv_u8tou16\fR(3C), \fBuconv_u8tou32\fR(3C), \fBattributes\fR(5), \fBkiconv\fR(9F), \fBkiconvstr\fR(9F), \fBkiconv_open\fR(9F), \fBu8_strcmp\fR(9F), \fBu8_textprep_str\fR(9F), \fBu8_validate\fR(9F), \fBuconv_u16tou32\fR(9F), \fBuconv_u16tou8\fR(9F), \fBuconv_u32tou16\fR(9F), \fBuconv_u32tou8\fR(9F), \fBuconv_u8tou16\fR(9F), \fBuconv_u8tou32\fR(9F)
.sp
.LP
The Unicode Standard
.sp
.LP
http://www.unicode.org/standard/standard.html
