Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ldi_devmap.9f
'\" te
.\"  Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_devmap 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_devmap \- Issue a devmap request to a device
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_devmap\fR(\fBldi_handle_t\fR \fIlh\fR, \fBdevmap_cookie_t\fR \fIdhp\fR, \fBoffset_t\fR \fIoff\fR, 
     \fBsize_t\fR \fIlen\fR, \fBsize_t *\fR\fImaplen\fR, \fBuint_t\fR \fImodel\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIlh\fR\fR
.ad
.RS 10n
.rt  
Layered handle.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdhp\fR\fR
.ad
.RS 10n
.rt  
Opaque mapping handle used by the system to describe mapping.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoff\fR\fR
.ad
.RS 10n
.rt  
User offset within the logical device memory at which mapping begins.
.RE

.sp
.ne 2
.mk
.na
\fB\fIlen\fR\fR
.ad
.RS 10n
.rt  
Mapping length (in bytes).
.RE

.sp
.ne 2
.mk
.na
\fB\fImaplen\fR\fR
.ad
.RS 10n
.rt  
Pointer to length (in bytes) of validated mapping.  (Less than or equal to \fIlen\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fImodel\fR\fR
.ad
.RS 10n
.rt  
Data model type of current thread.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBldi_devmap()\fR function passes an devmap request to the device entry point for the device specified by the layered handle. This operation is supported for character devices.
.SH RETURN VALUES
.sp
.LP
The \fBldi_devmap()\fR function returns \fB0\fR upon success. If a failure occurs before the request is passed to the device, possible return values are shown below. Otherwise any other error number may be returned by the device.
.sp
.ne 2
.mk
.na
\fBEINVAL\fR
.ad
.RS 11n
.rt  
Invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
\fBENOTSUP\fR
.ad
.RS 11n
.rt  
Operation is not supported for this device.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
