Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ldi_remove_event_handler.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_remove_event_handler 9F "21 Aug 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_remove_event_handler \- remove an NDI event service callback
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi_obsolete.h>

\fBint\fR \fBldi_remove_event_handler\fR(\fBldi_handle_t\fR \fIlh\fR,
     \fIldi_callback_id_t id\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Obsolete
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIldi_handle_t lh\fR\fR
.ad
.RS 24n
.rt  
Layered handle representing the device for which the event notification is requested.
.RE

.sp
.ne 2
.mk
.na
\fB\fIldi_callback_id_t id\fR\fR
.ad
.RS 24n
.rt  
Unique system-wide registration ID returned by \fBldi_add_event_handler\fR(9F) upon successful registration.
.RE

.SH DESCRIPTION
.sp
.LP
This function is obsolete and is only maintained for compatibility. Use of this function is strongly discouraged. For equivalent functionality provided by new interfaces, see \fBldi_ev_register_callbacks\fR(9F) and \fBldi_ev_remove_callbacks\fR(9F).
.sp
.LP
The \fBldi_remove_event_handler()\fR function removes the callback handler specified by the registration ID (\fIldi_callback_id_t\fR). Upon successful removal, the callback handler is removed from the system and is not invoked at the event occurance.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Callback handler removed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Failed to remove callback handler. 
.RE

.SH CONTEXT
.sp
.LP
This function can be called from user and kernel contexts only.
.SH SEE ALSO
.sp
.LP
\fBldi_ev_register_callbacks\fR(9F), \fBldi_ev_remove_callbacks\fR(9F), \fBldi_add_event_handler\fR(9F), \fBldi_get_eventcookie\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
