Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/ldi_get_eventcookie.9f
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_get_eventcookie 9F "21 Aug 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_get_eventcookie \- retrieve NDI event service cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi_obsolete.h>

\fBint\fR \fBldi_get_eventcookie\fR(\fBldi_handle_t\fR \fIlh\fR, \fIchar *name\fR
     \fIddi_eventcookie_t *ecp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Obsolete
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIldi_handle_t lh\fR\fR
.ad
.RS 26n
.rt  
Layered handle.
.RE

.sp
.ne 2
.mk
.na
\fB\fIchar *name\fR\fR
.ad
.RS 26n
.rt  
null-terminated string containing the event name.
.RE

.sp
.ne 2
.mk
.na
\fB\fIddi_eventcookie_t *ecp\fR\fR
.ad
.RS 26n
.rt  
Pointer to the kernel event cookie.
.RE

.SH DESCRIPTION
.sp
.LP
This function is obsolete and is only maintained for compatibility. Use of this function is strongly discouraged. For equivalent functionality provided by new interfaces, see \fBldi_ev_get_cookie\fR(9F) and \fBldi_ev_register_callbacks\fR(9F).
.sp
.LP
The \fBldi_get_eventcookie()\fR function queries the device tree for a cookie matching the given event name and returns a reference to that cookie. The search is performed by calling up the device tree hierarchy of the  device  represented by the layered driver handle until the request is satisfied by a bus nexus driver,  or the top of the dev_info tree is reached.
.sp
.LP
The cookie returned by this function can be used to register a callback handler with \fBldi_add_event_handler\fR(9F). 
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Cookie handle is returned.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Request was not serviceable by any nexus driver in the target device's ancestral device tree hierarchy.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel contexts.
.SH SEE ALSO
.sp
.LP
\fBldi_ev_get_cookie\fR(9F), \fBldi_ev_register_callbacks\fR(9F), \fBldi_add_event_handler\fR(9F), \fBldi_remove_event_handler\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
