Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/mac_prop_info_set_perm.9f
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH mac_prop_info_set_perm 9F "20 Jul 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
mac_prop_info_set_perm, mac_prop_info_set_default_uint8, mac_prop_info_set_default_str, mac_prop_info_set_default_link_flowctrl, mac_prop_info_set_range_uint32 \- set property information
.SH SYNOPSIS
.LP
.nf
#include <sys/mac_provider.h>

void mac_prop_info_set_perm(mac_prop_info_handle_t \fIph\fR,
    uint8_t \fIperm\fR);
.fi

.LP
.nf
void mac_prop_info_set_default_uint8(mac_prop_info_handle_t \fIph\fR,
    uint8_t \fIval\fR);
.fi

.LP
.nf
void mac_prop_info_set_default_str(mac_prop_info_handle_t \fIph\fR,
    const char *\fIstr\fR);
.fi

.LP
.nf
void mac_prop_info_set_default_link_flowctrl(
    mac_prop_info_handle_t \fIph\fR, link_flowctrl_t \fIval\fR);
.fi

.LP
.nf
void mac_prop_info_set_range_uint32(mac_prop_info_handle_t \fIph\fR,
    uint32_t \fImin\fR, uint32_t \fImax\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The entry points described here are invoked from a device driver's \fBmc_getcapab\fR(9E) entry point to associate information such as default values, permissions, or allowed value ranges.
.sp
.LP
Each one of these functions takes as first argument the property information handle which is passed to \fBmc_propinfo()\fR as argument.
.sp
.LP
The \fBmac_prop_info_set_perm()\fR function specifies the property of the property. The permission is passed through the \fIperm\fR argument and can be set to one of the following values.
.sp
.ne 2
.mk
.na
\fB\fBMAC_PROP_PERM_READ\fR\fR
.ad
.RS 23n
.rt  
The property is read-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAC_PROP_PERM_WRITE\fR\fR
.ad
.RS 23n
.rt  
The property is write-only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAC_PROP_PERM_RW\fR\fR
.ad
.RS 23n
.rt  
The property can be read and written.
.RE

.sp
.LP
The driver is not required to call \fBmac_prop_info_set_perm()\fR for every property. If the driver does not call that function for a specific property, the framework will assume that the property has read and write permissions, corresponding to \fBMAC_PROP_PERM_RW\fR.
.sp
.LP
The \fBmac_prop_info_set_default_uint8()\fR, \fBmac_prop_info_set_default_str()\fR, and \fBmac_prop_info_set_default_link_flowctrl()\fR functions are used to associate a default value with a specific property.
.sp
.LP
The \fBmac_prop_info_set_range_uint32()\fR function is used by a driver to associate an allowed range of values for a specific property. The range is defined by the \fImin\fR and \fImax\fR arguments passed by the device driver. This function can be called successively to specify multiple non-overlapping ranges.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/header
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBmac\fR(9E)
