Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/miocack.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.TH miocack 9F "9 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
miocack \- Positively acknowledge an M_IOCTL message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBvoid\fR \fBmiocack\fR(\fBqueue_t *\fR\fIwq\fR, \fBmblk_t *\fR\fImp\fR, \fBint\fR\fIcount\fR, \fBint\fR \fIrval\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIwq\fR\fR
.ad
.RS 9n
.rt  
Write queue associated with the read queue to send the M_IOCACK on.
.RE

.sp
.ne 2
.mk
.na
\fB\fImp\fR\fR
.ad
.RS 9n
.rt  
M_IOCTL message.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 9n
.rt  
Value to set the ioc_count of the \fBiocblk\fR(9S) to.
.RE

.sp
.ne 2
.mk
.na
\fB\fIrval\fR\fR
.ad
.RS 9n
.rt  
Value to set the ioc_rval of the \fBiocblk\fR(9S) to.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBmiocack()\fR function converts an M_IOCTL message into a M_IOCACK message and sends the resulting message upstream.
.sp
.LP
To convert the message, \fBmiocack()\fR changes the message type to M_IOCACK, sets the 'ioc_count' and 'ioc_rval' members of the \fBiocblk\fR(9S) associated with \fImp\fR to the passed-in values, and clears the 'ioc_error' field. If the caller specifies a non-zero value for count, it is expected that the caller has already set 'mp->b_cont' field to point to a message block with a length of at least \fIcount\fR bytes.
.sp
.LP
Callers that only need to perform the message conversion, or need to perform additional steps between the conversion and the      sending of the M_IOCACK should use \fBmioc2ack\fR(9F).
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH NOTES
.sp
.LP
Callers must not hold any locks across a \fBmiocack()\fR that can be acquired as part of \fBput\fR(9E) processing.
.SH SEE ALSO
.sp
.LP
\fBmioc2ack\fR(9F), \fBput\fR(9E), \fBiocblk\fR(9S)
.sp
.LP
\fISTREAMS Programming Guide\fR
