Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_hook_unregister.9f
'\" te
.\" Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
.TH net_hook_unregister 9F "8 Dec 2010" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_hook_unregister \- disable a hook that was called in event processing
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_hook_unregister\fR(\fBnet_handle_t\fR \fInet\fR, \fBchar *\fR\fIhook_name\fR, \fBhook_t\fR \fIhook\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 13n
.rt  
value returned from a successful call to \fBnet_protocol_register()\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIhook_name\fR\fR
.ad
.RS 13n
.rt  
hook name to be unregistered
.RE

.sp
.ne 2
.mk
.na
\fB\fIhook\fR\fR
.ad
.RS 13n
.rt  
value returned from a successful call to \fBnet_hook_register\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_hook_unregister()\fR function disables the callback hooks that were registered with the \fBnet_hook_register()\fR function.
.SH RETURN VALUES
.sp
.LP
If the \fBnet_hook_unregister()\fR function succeeds, 0 is returned. Otherwise, an error indicating the problem      encountered.
.SH CONTEXT
.sp
.LP
The \fBnet_hook_unregister()\fR function may be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_hook_register\fR(9F)
