Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_getmtu.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_getmtu 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_getmtu \- determine the MTU of a given network interface
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_getmtu\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBconst\fR \fBphy_if_t\fR \fIifp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 7n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIifp\fR\fR
.ad
.RS 7n
.rt  
value returned from a successful call to \fBnet_phylookup\fR(9F) or \fBnet_phygetnext\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_getmtu()\fR function receives information about the current \fBMTU\fR of a network interface. The value returned from this function call should not be cached as the \fBMTU\fR of a network interface since it is not guaranteed to be constant. 
.SH RETURN VALUES
.sp
.LP
The \fBnet_getmtu()\fR function returns -1 if the network protocol does not support this feature and otherwise returns the current MTU of the network interface.
.SH CONTEXT
.sp
.LP
The \fBnet_getmtu()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_phygetnext\fR(9F), \fBnet_phylookup\fR(9F), \fBnet_protocol_lookup\fR(9F)
