Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_routeto.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_routeto 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_routeto \- indicate which network interface packets are sent
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBphy_if_t\fR \fBnet_routeto\fR(\fBconst\fR \fBnet_data_t\fR *\fInet\fR, \fBstruct\fR \fBsockaddr\fR *\fIaddress\fR, 
     \fBstruct\fR \fBsockaddr\fR *\fInexthop\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 11n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIaddress\fR\fR
.ad
.RS 11n
.rt  
network address to find a path out of the machine for.
.RE

.sp
.ne 2
.mk
.na
\fB\fInexthop\fR\fR
.ad
.RS 11n
.rt  
pointer to the \fBsockaddr\fR structure in which to store the address of the next hop. If this information is not required, the value \fBNULL\fR may be passed instead.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_routeto()\fR function indicates which network interface packets destined for a particular address would be sent out of, according to the systems network routing tables. If \fBnext\fR is supplied as a non-\fBNULL\fR pointer, the \fBIP\fR address of the \fBnexthop\fR router to be used is returned in it.
.SH RETURN VALUES
.sp
.LP
The \fBnet_routeto()\fR function returns:
.sp
.ne 2
.mk
.na
\fB-1\fR
.ad
.RS 6n
.rt  
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 6n
.rt  
This function cannot find a route for the address given.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 6n
.rt  
Indicates which network interface can be used to reach the given address.
.RE

.SH CONTEXT
.sp
.LP
The \fBnet_routeto()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_phygetnext\fR(9F), \fBnet_phylookup\fR(9F), \fBnet_protocol_lookup\fR(9F), \fBattributes\fR(5)
