Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_getifname.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_getifname 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_getifname \- determine the name given to a network interface
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_getifname\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBconst\fR \fBphy_if_t\fR \fIifp\fR, 
     \fBchar *\fR\fIbuffer\fR, \fBsize_t\fR \fIbuflen\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 10n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIifp\fR\fR
.ad
.RS 10n
.rt  
value returned from a successful call to \fBnet_phylookup\fR(9F) or \fBnet_phygetnext\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIbuffer\fR\fR
.ad
.RS 10n
.rt  
pointer to the buffer in which to write the interface name.
.RE

.sp
.ne 2
.mk
.na
\fB\fIbuflen\fR\fR
.ad
.RS 10n
.rt  
size of the buffer in which to store the interface name.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_getifname()\fR function copies the name of the network interface into the buffer provided. The name will always be null-terminated. If the buffer is too small to fit both the interface name and the null-terminated name, the name in the buffer is truncated to fit. See \fBnet_phygetnext\fR(9F) for an example on how to use this function.
.SH RETURN VALUES
.sp
.LP
The \fBnet_getifname()\fR function returns:
.sp
.ne 2
.mk
.na
\fB-1\fR
.ad
.RS 6n
.rt  
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 6n
.rt  
Unsuccessful.
.RE

.SH CONTEXT
.sp
.LP
The \fBnet_getifname()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_phygetnext\fR(9F), \fBnet_phylookup\fR(9F), \fBnet_protocol_lookup\fR(9F)
