Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_inject_free.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_inject_free 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_inject_free \- free a net_inject_t structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBvoid\fR \fBnet_inject_free\fR(\fBnet_inject_t\fR *\fIinject\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIinject\fR\fR
.ad
.RS 10n
.rt  
pointer returned by \fBnet_inject_alloc\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_inject_free()\fR function frees a \fBnet_inject_t\fR structure that was originally allocated by \fBnet_inject_alloc\fR(9F).
.SH CONTEXT
.sp
.LP
The \fBnet_inject_free()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_inject_alloc\fR(9F), \fBattributes\fR(5), \fBnet_inject_t\fR(9S)
