Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_ispartialchecksum.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_ispartialchecksum 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_ispartialchecksum \- indicate if a packet is being scheduled for hardware checksum calculation
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_ispartialchecksum\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBmblk_t\fR *\fImb\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 7n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fImb\fR\fR
.ad
.RS 6n
.rt  
the \fBmblk\fR structure holding a packet that is the subject of this query.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_ispartialchecksum()\fR function looks at the fields within the \fBmblk\fR structure to determine if the packet contained inside contains headers with only partial checksum values. Partial checksum values are stored inside headers when the calculation of the complete checksum is being handled by the hardware. 
.SH RETURN VALUES
.sp
.LP
The \fBnet_ispartialchecksum()\fR function returns:
.sp
.ne 2
.mk
.na
\fB-1\fR
.ad
.RS 6n
.rt  
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 6n
.rt  
The packet does not contain partial checksums.
.RE

.sp
.LP
If a packet is marked for hardware checksum'ing, the following values are returned:
.sp
.ne 2
.mk
.na
\fB\fBNET_HCK_L3_FULL\fR\fR
.ad
.RS 19n
.rt  
Complete layer 3 checksum calculated
.RE

.sp
.ne 2
.mk
.na
\fB\fBNET_HCK_L3_PART\fR\fR
.ad
.RS 19n
.rt  
Partial layer 3 checksum calculated
.RE

.sp
.ne 2
.mk
.na
\fB\fBNET_HCK_L4_FULL\fR\fR
.ad
.RS 19n
.rt  
Complete layer 4 checksum calculated
.RE

.sp
.ne 2
.mk
.na
\fB\fBNET_HCK_L4_PART\fR\fR
.ad
.RS 19n
.rt  
Partial layer 4 checksum calculated
.RE

.SH CONTEXT
.sp
.LP
The \fBnet_ispartialchecksum()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_isvalidchecksum\fR(9F), \fBnet_protocol_lookup\fR(9F), \fBattributes\fR(5)
