Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_phylookup.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_phylookup 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_phylookup \- determine if a network interface name exists for a network protocol
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBphy_if_t\fR \fBnet_phylookup\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBconst\fR \fBchar\fR *\fIname\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 8n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 8n
.rt  
name of the network interface to find.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_phylookup()\fR function attempts to resolve the interface name passed in with the network protocol.
.sp
.LP
When called successfully, the value returned represents a network interface that exists, at the time of the call, within the scope of the network interface. This value is only guaranteed to be unique for a name within the scope of the network protocol.
.SH RETURN VALUES
.sp
.LP
The \fBnet_phylookup()\fR function returns -1 if it is not supported by the network  protocol,  and 0 if the named network interface does not exist (or is otherwise  unknown).  Otherwise, it returns  a  value  greater  than 0 representing a network interface that currently exists within the scope of this network protocol.
.SH CONTEXT
.sp
.LP
The \fBnet_phylookup()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_getifname\fR(9F), \fBnet_phygetnext\fR(9F), \fBnet_protocol_lookup\fR(9F), \fBattributes\fR(5)
