Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_zoneidtonetid.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_zoneidtonetid 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_zoneidtonetid \- map a zoneid_t struture identifier to a netid_t structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnetid_t\fR \fBnet_zoneidtonetid\fR(\fBconst\fR \fBzoneid_t\fR \fIzone\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIzone\fR\fR
.ad
.RS 8n
.rt  
valid \fBzoneid_t\fR structure that refers to a running zone.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_zoneidtonetid()\fR function maps the given \fBzoneid_t\fR structure (used to represent a zone that is currently running) into a \fBnetid_t\fR structure that is associated with the \fBIP\fR instance supporting network functions for that zone.
.SH RETURN VALUES
.sp
.LP
The \fBnet_zoneidtonetid()\fR function returns -1 if no mapping took place. Otherwise, it returns the \fBnetid_t\fR structure currently used by the \fBzoneid_t\fR structure. For zones that are using a shared \fBIP\fR instance, the \fBnetid_t\fR structure for the instance owned by the global zone is returned.
.SH CONTEXT
.sp
.LP
The \fBnet_zoneidtonetid()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_netidtozonid\fR(9F), \fBattributes\fR(5)
