Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_netidtozonid.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_netidtozonid 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_netidtozonid \- map a netid_t structure identifier to a zoneid_t structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBzoneid_t\fR \fBnet_netidtozonid\fR(\fBconst\fR \fBnetid_t\fR \fInet\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 7n
.rt  
valid \fBnetid_t\fR structure that refers to an existing \fBIP\fR instance.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_netidtozonid()\fR function maps the given \fBnetid_t\fR (used to represent an instance of \fBIP\fR) into the matching \fBzoneid_t\fR structure that is associated with it.
.SH RETURN VALUES
.sp
.LP
The \fBnet_netidtozonid()\fR function returns -1 if no mapping took place. Otherwise, it returns the \fBzoneid_t\fR structure currently associated with a \fBnetid_t\fR structure. For shared stack zones, the \fBzoneid_t\fR structure for the global zone is returned. 
.SH CONTEXT
.sp
.LP
The \fBnet_netidtozonid()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_zoneidtonetid\fR(9F), \fBattributes\fR(5)
