Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_protocol_lookup.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_protocol_lookup 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_protocol_lookup \- locate an implementation of a network layer protocol
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnet_data_t\fR \fBnet_protocol_lookup\fR(\fBnetid_t\fR \fIid\fR, \fBconst\fR \fBchar\fR *\fIprotocol\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIid\fR\fR
.ad
.RS 10n
.rt  
network instance identifier.
.RE

.sp
.ne 2
.mk
.na
\fB\fIfamily\fR\fR
.ad
.RS 10n
.rt  
name of the network protocol to find.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_protocol_lookup()\fR function attempts to locate a data structure that defines what capabilities it is exporting through this interface. The value returned by this call is guaranteed to be valid until it is passed into a call to \fBnet_protocol_release\fR(9F), after which it should no longer be treated as valid.
.sp
.LP
The protocol must be a registered name of a network protocol that has been registered. The symbols \fBNHF_INET\fR and \fBNHF_INET6\fR should be passed to \fBnet_protocol_lookup()\fR as the protocol name to gain access to either \fBIPv4\fR or \fBIPv6\fR respectively.
.SH RETURN VALUES
.sp
.LP
The \fBnet_protocol_lookup()\fR function returns \fBNULL\fR if it does not find any knowledge about the network protocol referenced. Otherwise, it returns a value that can be used with other calls in this framework.
.SH CONTEXT
.sp
.LP
The \fBnet_protocol_lookup()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_protocol_release\fR(9F), \fBattributes\fR(5)
