Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/net_getpmtuenabled.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH net_getpmtuenabled 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_getpmtuenabled \- determine if path MTU discovery is enabled for a network protocol
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_getpmtuenabled\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fInet\fR\fR
.ad
.RS 7n
.rt  
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_getpmtuenabled()\fR function returns a value to indicate whether or not path \fBMTU\fR (\fBPMTU\fR) discovery is enabled for this network protocol.
.SH RETURN VALUES
.sp
.LP
The \fBnet_getpmtuenabled()\fR function returns:
.sp
.ne 2
.mk
.na
\fB-1\fR
.ad
.RS 6n
.rt  
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 6n
.rt  
PATH MTU discovery is disabled.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 6n
.rt  
PATH MTU discovery is enabled.
.RE

.SH CONTEXT
.sp
.LP
The \fBnet_getpmtuenabled()\fR function may be called from user,  kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_getmtu\fR(9F), \fBnet_protocol_lookup\fR(9F)
