Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/nochpoll.9f
'\" te
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.TH nochpoll 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nochpoll \- error return function for non-pollable devices
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBnochpoll\fR(\fBdev_t\fR \fIdev\fR, \fBshort\fR \fIevents\fR, \fBint\fR \fIanyyet\fR, \fBshort\fR \fI*reventsp\fR, 
      \fBstruct pollhead\fR \fI**pollhdrp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdev\fR\fR
.ad
.RS 12n
.rt  
Device number.
.RE

.sp
.ne 2
.mk
.na
\fB\fIevents\fR\fR
.ad
.RS 12n
.rt  
Event flags.
.RE

.sp
.ne 2
.mk
.na
\fB\fIanyyet\fR\fR
.ad
.RS 12n
.rt  
Check current events only.
.RE

.sp
.ne 2
.mk
.na
\fB\fIreventsp\fR\fR
.ad
.RS 12n
.rt  
Event flag pointer.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpollhdrp\fR\fR
.ad
.RS 12n
.rt  
Poll head pointer.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnochpoll()\fR function is a routine that simply returns the value  \fBENXIO\fR. It is intended to be used in the \fBcb_ops\fR(9S) structure of a device driver for devices that do not support the \fBpoll\fR(2) system call.
.SH RETURN VALUES
.sp
.LP
The \fBnochpoll()\fR function returns \fBENXIO\fR.
.SH CONTEXT
.sp
.LP
The \fBnochpoll()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fBpoll\fR(2), \fBchpoll\fR(9E), \fBcb_ops\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
