Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/nvlist_lookup_nvpair.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.TH nvlist_lookup_nvpair 9F "24 Oct 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nvlist_lookup_nvpair, nvlist_exists \- lookup named pairs
.SH SYNOPSIS
.LP
.nf
#include <libnvpair.h>

\fBint\fR \fBnvlist_lookup_nvpair\fR(\fBnvlist_t *\fR\fInvl\fR, \fBconst char *\fR\fIname\fR,
     nvpair_t **\fInvp\fR);
.fi

.LP
.nf
\fBboolean_t\fR \fBnvlist_exists\fR(\fBnvlist_t *\fR\fInvl\fR, \fBconst char *\fR\fIname\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnvlist_lookup_nvpair()\fR function returns the nvpair with the matching name, regardless of type. It is valid only for lists allocated with \fBNV_UNIQUE_NAME\fR. See \fBnvlist_alloc\fR(9F).
.sp
.LP
The \fBnvlist_exists()\fR function returns success if any nvpair exists with the given name. It is valid for all types of lists.
.SH RETURN VALUES
.sp
.LP
The \fBnvlist_lookup_nvpair()\fR function returns 0 on success and an error value on failure.
.sp
.LP
The \fBnvlist_exists()\fR function returns \fBB_TRUE\fR if an nvpair with the given name exists and \fBB_FALSE\fR otherwise.
.SH ERRORS
.sp
.LP
The \fBnvlist_lookup_nvpair()\fR function will fail if:
.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 11n
.rt  
There is an invalid argument.
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOENT\fR\fR
.ad
.RS 11n
.rt  
No matching name-value pair is found.
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOTSUP\fR\fR
.ad
.RS 11n
.rt  
The list was not allocated with \fBNV_UNIQUE_NAME\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBnvlist_lookup_nvpair\fR(3NVPAIR), \fBnvlist_alloc\fR(9F), \fBattributes\fR(5)
