Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/outb.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All RIghts Reserved
.TH outb 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
outb, outw, outl, repoutsb, repoutsw, repoutsd \- write to an I/O port
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h> 

\fBvoid\fR \fBoutb\fR(\fBint\fR \fIport\fR, \fBunsigned char\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutw\fR(\fBint\fR \fIport\fR, \fBunsigned short\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutl\fR(\fBint\fR \fIport\fR, \fBunsigned long\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsb\fR(\fBint\fR \fIport\fR, \fBunsigned char *\fR\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsw\fR(\fBint\fR \fIport\fR, \fBunsigned short *\fR\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsd\fR(\fBint\fR \fIport\fR, \fBunsigned long *\fR\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
The functions described here are obsolete. For the \fBoutb()\fR, \fBoutw()\fR, and \fBoutl()\fR functions use, respectively, \fBddi_put8\fR(9F), \fBddi_put8\fR(9F), and \fBddi_put8\fR(9F) instead. For \fBrepoutsb()\fR, \fBrepoutsw()\fR, and\fBrepoutsl()\fR, use, respectively, \fBddi_rep_put8\fR(9F), \fBddi_rep_put8\fR(9F), and \fBddi_rep_put8\fR(9F) instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIport\fR\fR
.ad
.RS 9n
.rt  
A valid \fBI/O\fR port address.
.RE

.sp
.ne 2
.mk
.na
\fB\fIvalue\fR\fR
.ad
.RS 9n
.rt  
The data to be written to the \fBI/O\fR port.
.RE

.sp
.ne 2
.mk
.na
\fB\fIaddr\fR\fR
.ad
.RS 9n
.rt  
The address of a buffer from which the values will be fetched.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 9n
.rt  
The number of values to be written to the \fBI/O\fR port.
.RE

.SH DESCRIPTION
.sp
.LP
These routines write data of various sizes to the \fBI/O\fR port with the address specified by \fIport\fR. 
.sp
.LP
The \fBoutb()\fR, \fBoutw()\fR, and \fBoutl()\fR functions write 8 bits, 16 bits, and 32 bits of data respectively, writing the data specified by \fIvalue\fR.
.sp
.LP
The \fBrepoutsb()\fR, \fBrepoutsw()\fR, and \fBrepoutsd()\fR functions write multiple 8-bit, 16-bit, and 32-bit values, respectively. \fIcount\fR specifies the number of values to be written. \fIaddr\fR is a pointer to a buffer from which the output values are fetched.
.SH CONTEXT
.sp
.LP
These functions may be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Interface Stability Obsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBisa\fR(4), \fBattributes\fR(5), \fBddi_put8\fR(9F), \fBddi_put8\fR(9F), \fBddi_put8\fR(9F), \fBddi_rep_put8\fR(9F), \fBddi_rep_put8\fR(9F), \fBddi_rep_put8\fR(9F), \fBinb\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
