Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/pci_plist_getvf.9f
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH pci_plist_getvf 9F "19 May 2011" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pci_plist_getvf \- get the name-value pair list for the VF device
.SH SYNOPSIS
.LP
.nf
#include <sys/sunddi.h>

int pci_plist_getvf(pci_param_t \fIparam\fR, uint16_t \fIvf_index\fR,
     pci_plist_t *\fIvfplist_p\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIparam\fR\fR
.ad
.RS 12n
.rt  
A handle obtained from \fBpci_param_get\fR(9F) or \fBpci_param_get_ioctl\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIvf_index\fR\fR
.ad
.RS 12n
.rt  
0 through #VFS -1
.RE

.sp
.ne 2
.mk
.na
\fB\fIplist_p\fR\fR
.ad
.RS 12n
.rt  
A pointer to \fBpci_param_plist_t\fR where a non\(emnull \fIplist_p\fR is returned on successful return
.RE

.SH DESCRIPTION
.sp
.LP
The \fIvfplist_p\fR returned by \fBpci_plist_getvf()\fR is similar to \fBnvlist_t\fR and contains the name-value pairs for the VF (Virtual Function) device. The \fBpci_plist_t\fR supports the following data types:
.sp
.in +2
.nf
uchar, int8_t, uint8_t, int16_t uint16_t, int32_t, uint32_t, int64_t, 
uint64_t, char *, pci_plist_t
.fi
.in -2

.sp
.LP
Arrays of the above data types are supported.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 18n
.rt  
On success.
.RE

.sp
.ne 2
.mk
.na
\fBNon-zero value\fR
.ad
.RS 18n
.rt  
There is no name-value list for VF device.
.RE

.SH CONTEXT
.sp
.LP
The \fBpci_param_get()\fR function can be called from kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBpci_param_free\fR(9F), \fBpci_param_get\fR(9F), \fBpci_param_get_ioctl\fR(9F), \fBpci_plist_get\fR(9F)
