Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/pci_param_get_ioctl.9f
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH pci_param_get_ioctl 9F "19 May 2011" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pci_param_get_ioctl \- extract the params for PF and VF drivers
.SH SYNOPSIS
.LP
.nf
#include <sys/sunddi.h>

int pci_param_get_ioctl(dev_info_t *\fIdip\fR, intptr_t \fIarg\fR, int \fImode\fR,
     pci_param_t *\fIphp\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 13n
.rt  
Pointer to \fBdev_info\fR structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fIarg\fR, \fImode\fR\fR
.ad
.RS 13n
.rt  
The device driver is expected to pass the arguments they receive in their ioctl call directly to this interface.
.RE

.sp
.ne 2
.mk
.na
\fB\fIphp\fR\fR
.ad
.RS 13n
.rt  
A pointer to a (\fBvoid *\fR) param handle.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBpci_param_get_ioctl()\fR function extracts the params from the \fIarg\fR argument and returns a \fBpci_param_t\fR handle in \fIphp\fR. Drivers should call \fBpci_param_free\fR(9F) to free the param handle returned in this call after retrieving params from the handle. Drivers are expected to use \fBpci_plist_get\fR(9F) and \fBpci_plist_getvf\fR(9F) on the param handle to get the name-value list for the PF and VF devices.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 18n
.rt  
A valid param handle pointer \fIphp\fR is returned
.RE

.sp
.ne 2
.mk
.na
\fBNon-zero value\fR
.ad
.RS 18n
.rt  
The call failed to extract params from \fIarg\fR.
.RE

.SH CONTEXT
.sp
.LP
The \fBpci_param_get()\fR function can be called from kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability  Uncommitted  
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBpci_param_free\fR(9F), \fBpci_param_get\fR(9F), \fBpci_plist_get\fR(9F), \fBpci_plist_getvf\fR(9F)
