Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/putnextctl1.9f
'\" te
.\"  Copyright 1989 AT&T 
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.TH putnextctl1 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putnextctl1 \- send a control message with a one-byte parameter to a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBputnextctl1\fR(\fBqueue_t *\fR\fIq\fR, \fBint\fR \fItype\fR, \fBint\fR \fIp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 8n
.rt  
Queue to which the message is to be sent.
.RE

.sp
.ne 2
.mk
.na
\fB\fItype\fR\fR
.ad
.RS 8n
.rt  
Type of message.
.RE

.sp
.ne 2
.mk
.na
\fB\fIp\fR\fR
.ad
.RS 8n
.rt  
One-byte parameter.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBputnextctl1()\fR function, like \fBputctl1\fR(9F), tests the \fItype\fR argument to make sure a data type has not been specified, and attempts to allocate a message block. The \fIp\fR parameter can be used, for example, to specify how long the delay will be when an \fBM_DELAY\fR message is being sent. \fBputnextctl1()\fR fails if \fItype\fR is \fBM_DATA\fR, \fBM_PROTO\fR, or \fBM_PCPROTO\fR, or if a message block cannot be allocated. If successful, \fBputnextctl1()\fR calls the \fBput\fR(9E) routine of the queue pointed to by \fIq\fR with the newly allocated and initialized message.
.sp
.LP
A call to \fBputnextctl1(\fR\fIq\fR,\fItype, p\fR\fB)\fR is an atomic equivalent of \fBputctl1(\fR\fIq\fR\fB->q_next,\fR \fItype, p\fR\fB).\fR The STREAMS framework provides whatever mutual exclusion is necessary to insure that dereferencing \fIq\fR through its \fBq_next\fR field and then invoking \fBputctl1\fR(9F) proceeds without interference from other threads.
.sp
.LP
The \fBputnextctl1()\fR function should always be used in preference to \fBputctl1\fR(9F) 
.SH RETURN VALUES
.sp
.LP
On success, \fB1\fR is returned. \fB0\fR is returned if \fItype\fR is a data type, or if a message block cannot be allocated.
.SH CONTEXT
.sp
.LP
The \fBputnextctl1()\fR function can be called from user, interrupt, or kernel context.
.SH EXAMPLES
.sp
.LP
See the \fBputnextctl\fR(9F) function page for an example of \fBputnextctl1()\fR.
.SH SEE ALSO
.sp
.LP
\fBput\fR(9E), \fBallocb\fR(9F), \fBdatamsg\fR(9F), \fBputctl1\fR(9F), \fBputnextctl\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
