Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/qenable.9f
'\" te
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.TH qenable 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
qenable \- enable a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>



\fBvoid\fR \fBqenable\fR(\fBqueue_t *\fR\fIq\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 5n
.rt  
Pointer to the queue to be enabled.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBqenable()\fR function adds the queue pointed to by  \fIq\fR to the list of queues whose service routines are ready to be called by the STREAMS scheduler.
.SH CONTEXT
.sp
.LP
The \fBqenable()\fR function can be called from user, interrupt, or kernel context.
.SH EXAMPLES
.sp
.LP
See the \fBdupb\fR(9F) function page for an example of the \fBqenable()\fR.
.SH SEE ALSO
.sp
.LP
\fBdupb\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
