Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/scsi_sense_key.9f
'\" te
.\"  Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.TH scsi_sense_key 9F "28 Jun 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_sense_key, scsi_sense_asc, scsi_sense_ascq \- retrieve fields from SCSI sense data
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBuint8_t\fR \fBscsi_sense_key\fR(\fBuint8_t *\fR\fIsense_buffer\fR);
.fi

.LP
.nf
\fBuint8_t\fR \fBscsi_sense_asc\fR(\fBuint8_t *\fR\fIsense_buffer\fR);
.fi

.LP
.nf
\fBuint8_t\fR \fBscsi_sense_ascq\fR(\fBuint8_t *\fR\fIsense_buffer\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIsense_buffer\fR\fR
.ad
.RS 16n
.rt  
Pointer to a buffer containing \fBSCSI\fR sense data. The sense data is expected in wire format starting at the response code. It can be in either fixed or descriptor format.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBscsi_sense_key()\fR function returns the sense key value from the sense data contained in the sense_buffer.
.sp
.LP
The \fBscsi_sense_asc()\fR function returns the additional sense code (\fBASC\fR) value from the sense data contained in the sense_buffer.
.sp
.LP
The \fBscsi_sense_ascq()\fR function returns the additional sense code qualifier (\fBASCQ\fR) value from the sense data contained in the sense_buffer.
.sp
.LP
The \fBscsi_sense_key()\fR, \fBscsi_sense_asc()\fR, and \fBscsi_sense_ascq()\fR functions are used to retrieve values from \fBSCSI\fR sense data, regardles of whether the sense data is in fixed format or descriptor format.
.sp
.LP
Drivers should use \fBscsi_validate_sense\fR(9F) to ensure that valid sense key, \fBasc\fR, and \fBascq\fR values are present in the sense data.
.SH RETURN VALUES
.sp
.LP
The \fBscsi_sense_key()\fR function returns the sense key value from the sense buffer. The \fBscsi_sense_asc()\fR function returns the additional sense code (\fBASC\fR) from the sense buffer and the \fBscsi_sense_ascq()\fR function returns the additional sense code qualifier (\fBASCQ\fR) from the sense buffer.
.SH CONTEXT
.sp
.LP
The \fBscsi_sense_key()\fR, \fBscsi_sense_asc()\fR, and \fBscsi_sense_ascq()\fR functions can be called from user or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBscsi_ext_sense_fields\fR(9F), \fBscsi_find_sense_descr\fR(9F), \fBscsi_sense_cmdspecific_uint64\fR(9F), \fBscsi_sense_info_uint64\fR(9F), \fBscsi_validate_sense\fR(9F)
