Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/scsi_hba_pkt_comp.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems Inc. All Rights Reserved.
.TH scsi_hba_pkt_comp 9F "29 Jan 2009" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_hba_pkt_comp \- scsi_pkt completion routine
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>

\fBvoid\fR \fBscsi_hba_pkt_comp\fR(\fBstruct scsi_pkt *\fR\fIpkt\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIpkt\fR\fR
.ad
.RS 7n
.rt  
Pointer to a \fBscsi_pkt\fR(9S) structure.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
After filling in \fBscsi_pkt\fR(9S) fields with packet completion information, an HBA driver should call the \fBscsi_hba_pkt_comp()\fR function. This function is the recommended way for an HBA driver to signal completion of a \fBscsi_pkt\fR structure.  Use is mandatory for HBA drivers that use \fBtran_setup_pkt\fR(9E).
.sp
.LP
Calling the \fBscsi_hba_pkt_comp()\fR function allows SCSA to observe, and possibly react to, the completion of a \fBscsi_pkt\fR request.
.sp
.LP
A call to the \fBscsi_hba_pkt_comp()\fR function will always result in a call to the \fIpkt_comp\fR() callback function defined in \fBscsi_pkt\fR(9S). This \fIpkt_comp\fR() callback may, however, occur after return from \fBscsi_hba_pkt_comp()\fR, and may occur from a different thread executing on a different CPU.
.SH CONTEXT
.sp
.LP
The \fBscsi_hba_pkt_comp()\fR function can be called from user, interrupt, or kernel context. 
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBtran_setup_pkt\fR(9E), \fBscsi_pkt\fR(9S)
.SH NOTES
.sp
.LP
HBA driver calls \fBscsi_hba_pkt_comp()\fR instead of calling \fBscsi_pkt\fR(9S) \fIpkt_comp\fR directly.
