Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/strqget.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH strqget 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strqget \- get information about a queue or band of the queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBstrqget\fR(\fBqueue_t *\fR\fIq\fR, \fBqfields_t\fR \fIwhat\fR, \fBunsigned char\fR \fIpri\fR, \fBvoid *\fR\fIvalp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 8n
.rt  
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
\fB\fIwhat\fR\fR
.ad
.RS 8n
.rt  
Field of the \fBqueue\fR structure for (or the specified priority band) to return information about. Valid values are one of:
.sp
.ne 2
.mk
.na
\fB\fBQHIWAT\fR\fR
.ad
.RS 11n
.rt  
High water mark.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQLOWAT\fR\fR
.ad
.RS 11n
.rt  
Low water mark.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQMAXPSZ\fR\fR
.ad
.RS 11n
.rt  
Largest packet accepted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQMINPSZ\fR\fR
.ad
.RS 11n
.rt  
Smallest packet accepted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQCOUNT\fR\fR
.ad
.RS 11n
.rt  
Approximate size (in bytes) of data.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQFIRST\fR\fR
.ad
.RS 11n
.rt  
First message.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQLAST\fR\fR
.ad
.RS 11n
.rt  
Last message.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQFLAG\fR\fR
.ad
.RS 11n
.rt  
Status.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
.rt  
Priority band of interest.
.RE

.sp
.ne 2
.mk
.na
\fB\fIvalp\fR\fR
.ad
.RS 8n
.rt  
The address of where to store the value of the requested field.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBstrqget()\fR function gives drivers and modules a way to get information about a queue or a particular band of a queue without directly accessing STREAMS data structures, thus insulating them from changes in the implementation of these data structures from release to release.
.SH RETURN VALUES
.sp
.LP
On success, \fB0\fR is returned and the value of the requested field is stored in the location pointed to by \fIvalp\fR. An error number is returned on failure.
.SH CONTEXT
.sp
.LP
The \fBstrqget()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fBstrqset\fR(9F), \fBqueue\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
