Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/strqset.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH strqset 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strqset \- change information about a queue or band of the queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBstrqset\fR(\fBqueue_t *\fR\fIq\fR, \fBqfields_t\fR \fIwhat\fR, \fBunsigned char\fR \fIpri\fR, \fBintptr_t\fR \fIval\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 8n
.rt  
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
\fB\fIwhat\fR\fR
.ad
.RS 8n
.rt  
Field of the \fBqueue\fR structure (or the specified priority band) to return information about. Valid values are one of:
.sp
.ne 2
.mk
.na
\fB\fBQHIWAT\fR\fR
.ad
.RS 11n
.rt  
High water mark.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQLOWAT\fR\fR
.ad
.RS 11n
.rt  
Low water mark.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQMAXPSZ\fR\fR
.ad
.RS 11n
.rt  
Largest packet accepted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBQMINPSZ\fR\fR
.ad
.RS 11n
.rt  
Smallest packet accepted.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
.rt  
Priority band of interest.
.RE

.sp
.ne 2
.mk
.na
\fB\fIval\fR\fR
.ad
.RS 8n
.rt  
The value for the field to be changed.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBstrqset()\fR function gives drivers and modules a way to change information about a queue or a particular band of a queue without directly accessing STREAMS data structures.
.SH RETURN VALUES
.sp
.LP
On success, \fB0\fR is returned. \fBEINVAL\fR is returned if an undefined attribute is specified.
.SH CONTEXT
.sp
.LP
The \fBstrqset()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fBstrqget\fR(9F), \fBqueue\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.SH NOTES
.sp
.LP
When lowering existing values, set \fBQMINPSZ\fR before setting \fBQMAXPSZ\fR; when raising existing values, set \fBQMAXPSZ\fR before setting \fBQMINPSZ\fR.
