Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/usb_get_addr.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.TH usb_get_addr 9F "Feb 9 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_get_addr \- Retrieve device USB address
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>

\fBint\fR \fB\fR\fBusb_get_addr\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 7n
.rt  
Pointer to the device's dev_info structure.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBusb_get_addr()\fR function returns the current USB bus address for debugging  purposes. The returned address is unique for a specific USB bus, and may be replicated if multiple host controller instances are present on the system.
.SH RETURN VALUES
.sp
.LP
On success: USB device address.
.sp
.LP
On failure: returns 0. Fails if dip is NULL.
.SH CONTEXT
.sp
.LP
May be called from user, kernel or interrupt context.
.SH EXAMPLES
.sp
.in +2
.nf
int usb_addr;

usb_addr = usb_get_addr(dip);
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface StabilityCommitted
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusb_pipe_open\fR(9F)
