Arquivotheca/solaris11/usr/man/man/usr/share/man/man9f/usb_handle_remote_wakeup.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.TH usb_handle_remote_wakeup 9F "5 Feb 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_handle_remote_wakeup \- Enable or disable remote wakeup on USB devices
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>

\fBint\fR \fBusb_handle_remote_wakeup\fR(\fBdev_info_t *\fR\fIdip\fR, \fBint\fR \fIcmd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 7n
.rt  
Pointer to the device's \fBdev_info\fR structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcmd\fR\fR
.ad
.RS 7n
.rt  
Command. Either USB_REMOTE_WAKEUP_ENABLE or USB_REMOTE_WAKEUP_DISABLE.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBusb_handle_remote_wakeup()\fR function enables or disables remote wakeup on a USB device. This call can block.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fBUSB_SUCCESS\fR
.ad
.RS 15n
.rt  
Remote wakeup is successfully enabled or disabled.
.RE

.sp
.ne 2
.mk
.na
\fBUSB_FAILURE\fR
.ad
.RS 15n
.rt  
Remote wakeup is not supported by the device. An internal error occurred.
.RE

.SH CONTEXT
.sp
.LP
May be called from user or kernel context. 
.SH EXAMPLES
.sp
.in +2
.nf
    uint_t *pwrstates;

    /* Hook into device's power management.  Enable remote wakeup. */
    if (usb_create_pm_components(dip, pwrstates) == USB_SUCCESS) {
            usb_handle_remote_wakeup(dip, USB_REMOTE_WAKEUP_ENABLE);
    }
            
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface StabilityCommitted
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBpm_busy_component\fR(9F), \fBpm_idle_component\fR(9F), \fBpm_lower_power\fR(9F), \fBpm_raise_power\fR(9F), \fBusb_clr_feature\fR(9F), \fBusb_create_pm_components\fR(9F), \fBusb_get_cfg\fR(9F), \fBusb_get_dev_data\fR(9F), \fBusb_register_hotplug_cbs\fR(9F), \fBusb_cfg_descr\fR(9S)
