Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/ad.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH ad 5 "22 Oct 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ad \- Active Directory as a naming repository
.SH DESCRIPTION
.sp
.LP
Solaris clients can obtain naming information from Active Directory (AD) servers. 
.sp
.LP
The Solaris system must first join an AD domain and then add the \fBad\fR keyword to the appropriate entries in the \fBnsswitch.conf\fR(4) file. The Solaris system joins the AD domain by using the  \fBkclient\fR(1M) utility. The AD name service only supports the naming databases for \fBpasswd\fR and \fBgroup\fR.
.sp
.LP
Windows users are not able to log in. The \fBuser_attr\fR(4) database has no entries for Windows users, and the \fBpasswd\fR(1) command does not support the synchronization of user passwords with AD.
.sp
.LP
The Solaris AD client uses auto-discovery techniques to find AD directory servers, such as domain controllers and global catalog servers. The client also uses the LDAP v3 protocol to access naming information from AD servers. The AD server schema requires no modification because the AD client works with native AD schema. The Solaris AD client uses the \fBidmap\fR(1M) service to map between Windows security identifiers (SIDs) and Solaris user identifiers (UIDs) and group identifiers (GIDs). User names and group names are taken from the \fBsAMAccountName\fR attribute of the AD user and group objects and then tagged with the domain where the objects reside. The domain name is separated from the user name or group name by the \fB@\fR character. 
.sp
.LP
The client uses the SASL/GSSAPI/KRB5 security model. The \fBkclient\fR utility is used to join the client to AD. During the join operation, \fBkclient\fR configures Kerberos v5 on the client. See \fBkclient\fR(1M).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 24n
.rt  
Configuration file for the name-service switch.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.ad\fR\fR
.ad
.RS 24n
.rt  
Sample configuration file for the name-service switch configured with ad, dns and files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/nss_ad.so.1\fR\fR
.ad
.RS 24n
.rt  
Name service switch module for AD.
.RE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1), \fBsvcs\fR(1), \fBidmap\fR(1M), \fBidmapd\fR(1M), \fBkclient\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvccfg\fR(1M), \fBnsswitch.conf\fR(4), \fBuser_attr\fR(4), \fBsmf\fR(5)
