Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/crypt_bsdmd5.5
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH crypt_bsdmd5 5 "6 Aug 2003" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
crypt_bsdmd5 \- password hashing module using MD5 message hash algorithm
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/$ISA/crypt_bsdmd5.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcrypt_bsdmd5\fR module is a one-way password hashing module for use with \fBcrypt\fR(3C) that uses the MD5 message hash algorithm. The algorithm identifier for \fBcrypt.conf\fR(4) and \fBpolicy.conf\fR(4) is \fB1\fR. The output is compatible with \fBmd5crypt\fR on BSD and Linux systems.
.sp
.LP
The maximum password length for \fBcrypt_bsdmd5\fR is 255 characters.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1), \fBcrypt\fR(3C), \fBcrypt_genhash_impl\fR(3C), \fBcrypt_gensalt\fR(3C), \fBcrypt_gensalt_impl\fR(3C), \fBgetpassphrase\fR(3C), \fBcrypt.conf\fR(4), \fBpasswd\fR(4), \fBpolicy.conf\fR(4), \fBattributes\fR(5)
