Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/crypt_unix.5
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH crypt_unix 5 "6 Aug 2003" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
crypt_unix \- traditional UNIX crypt algorithm
.SH DESCRIPTION
.sp
.LP
The \fBcrypt_unix\fR algorithm is the traditional UNIX crypt algorithm. It is not considered sufficiently secure for current systems and is provided for backwards compatibility. The \fBcrypt_sunmd5\fR(5), \fBcrypt_bsdmd5\fR(5), or \fBcrypt_bsdbf\fR(5) algorithm should be used instead.
.sp
.LP
The algorithm identifier for \fBpolicy.conf\fR(4) is \fB__unix__\fR. There is no entry in \fBcrypt.conf\fR(4) for this algorithm.
.sp
.LP
The \fBcrypt_unix\fR algorithm is internal to \fBlibc\fR and provides the string encoding function used by \fBcrypt\fR(3C) when the first character of the salt is not a "$".
.sp
.LP
This algorithm is based on a one-way encryption algorithm with variations intended (among other things) to frustrate use of hardware implementations of a key search.  Only the first eight characters of the key passed to \fBcrypt()\fR are used with this algorithm; the rest are silently ignored. The salt is a two-character string chosen from the set [a-zA-Z0-9./].  This string is used to perturb the hashing algorithm in one of 4096 different ways.
.sp
.LP
The maximum password length for \fBcrypt_unix\fR is 8 characters.
.SH USAGE
.sp
.LP
The return value of the \fBcrypt_unix\fR algorithm might not be portable among standard-conforming systems. See \fBstandards\fR(5).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1), \fBcrypt\fR(3C), \fBcrypt_genhash_impl\fR(3C), \fBcrypt_gensalt\fR(3C), \fBcrypt_gensalt_impl\fR(3C), \fBgetpassphrase\fR(3C), \fBcrypt.conf\fR(4), \fBpasswd\fR(4), \fBpolicy.conf\fR(4), \fBattributes\fR(5), \fBcrypt_bsdbf\fR(5), \fBcrypt_bsdmd5\fR(5), \fBcrypt_sunmd5\fR(5), \fBstandards\fR(5)
