Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/crypt_bsdbf.5
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH crypt_bsdbf 5 "5 Jul 2011" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
crypt_bsdbf \- password hashing module using Blowfish cryptographic algorithm
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/$ISA/crypt_bsdbf.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcrypt_bsdbf\fR module is a one-way password hashing module for use with \fBcrypt\fR(3C) that uses the Blowfish cryptographic algorithm. The algorithm identifier for \fBcrypt.conf\fR(4) and \fBpolicy.conf\fR(4) is \fB2a\fR.
.sp
.LP
The maximum password length for \fBcrypt_bsdbf\fR is 72 characters.
.sp
.LP
The default number of rounds is \fBlog(4)\fR. This can be increased by updating \fB/etc/security/crypt.conf\fR, for example, for \fBlog(12)\fR rounds: 
.sp
.in +2
.nf
2a crypt_bsdbf.so.1    12
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1), \fBcrypt\fR(3C), \fBcrypt_genhash_impl\fR(3C), \fBcrypt_gensalt\fR(3C), \fBcrypt_gensalt_impl\fR(3C), \fBgetpassphrase\fR(3C), \fBcrypt.conf\fR(4), \fBpasswd\fR(4), \fBpolicy.conf\fR(4), \fBattributes\fR(5)
