Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_1250.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_1250 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_1250 \- code set conversion tables for MS 1250 (Windows Latin 2)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.18i) |cw(.79i) |cw(1.18i) |cw(.79i) |cw(1.56i) 
cw(1.18i) |cw(.79i) |cw(1.18i) |cw(.79i) |cw(1.56i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
MS 1250win2ISO 8859-2iso2ISO Latin 2
_
MS 1250win2MS 852dos2MS-DOS Latin 2
_
MS 1250win2MazoviamazMazovia
_
MS 1250win2DHNdhnDom Handlowy Nauki
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "MS 1250 to ISO 8859-2"
.sp
.LP
For the conversion of MS 1250 to ISO 8859-2, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 1250ISO 8859-2MS 1250ISO 8859-2
_
24-21140235273
212251236276
21340237274
214246241267
215253245241
216256246-26740
217254271261
221-2314027340
232271274245
23340276265
234266247365
.TE

.SS "MS 1250 to MS 852"
.sp
.LP
For the conversion of MS 1250 to MS 852, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 1250MS 852MS 1250MS 852
_
200-21140311220
212346312250
21340313323
214227314267
215233315326
216246316327
217215317322
220-23140320321
232347321343
23340322325
234230323340
235234324342
236247325212
237253326231
240377327236
241363330374
242364331336
243235332351
244317333353
245244334232
24640335355
247365336335
250371337341
25140340352
252270341240
253256342203
254252343307
255360344204
25640345222
257275346206
260370347207
26140350237
262362351202
263210352251
264357353211
265-26740354330
270367355241
271245356214
272255357324
273257360320
274225361344
275361362345
276226363242
277276364223
300350365213
301265366224
302266367366
303306370375
304216371205
305221372243
306217374201
307200375354
310254376356
.TE

.SS "MS 1250 to Mazovia"
.sp
.LP
For the conversion of MS 1250 to Mazovia, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 1250MazoviaMS 1250Mazovia
_
200-21340310-31140
214230312220
215-21640313-32040
217240321245
220-2334032240
234236323243
235-23640324-32540
237246326231
240377327-33340
241-24240334232
243234335-33640
24440337341
245217340-34140
246-25240342203
25325634340
254252344204
255-2564034540
257241346215
260370347207
26136135040
26240351202
263222352221
26440353211
265346354-35540
26640356214
267372357-36040
27040361244
27120636240
27240363242
273257364223
274-2764036540
277247366224
300-30340367366
304216370-37340
30540374201
306225375-37640
307200
.TE

.SS "MS 1250 to DHN"
.sp
.LP
For the conversion of MS 1250 to DHN, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 1250DHNMS 1250DHN
_
200-21340306201
214206307-31140
215-21640312202
217207313-32040
220-23340321204
23421732240
235-23640323205
237220324-32540
240377326231
241-24240327-33340
243203334232
24440335-33640
245200337341
246-2524034040
253256341240
254252342-34540
255-25640346212
257210347-35140
260370352213
261361353-35440
26240355241
263214356-36040
26440361215
26534636240
26640363216
267372364223
2704036540
271211366224
27240367366
273257370-37140
274-27640372243
277221373-37640
300-30540
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
