Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_maz.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_maz 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_maz \- code set conversion tables for Mazovia
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
MazoviamazISO 8859-2iso2ISO Latin 2
_
MazoviamazMS 1250win2Windows Latin 2
_
MazoviamazMS 852dos2MS-DOS Latin 2
_
MazoviamazDHNdhnDom Hanlowy Nauki
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "Mazovia to ISO 8859-2"
.sp
.LP
For the conversion of Mazovia to ISO 8859-2, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MazoviaISO 8859-2MazoviaISO 8859-2
_
24-17740230246
200307231326
201374232334
20235123340
203342234243
20434423540
20540236266
20626123740
207347240254
21040241257
211353242363
212-21340243323
214356244361
215346245321
216304246274
217241247277
220312250-34040
221352341337
222263342-36540
223364366367
22436636740
225306370260
226-22740371-37640
256201
.TE

.SS "Mazovia to MS 1250"
.sp
.LP
For the conversion of Mazovia to MS 1250, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
lw(1.38i) |lw(1.38i) |lw(1.38i) |lw(1.38i) 
.
MazoviaMS 1250MazoviaMS 1250
_
200307236234
20137423740
202351240217
203342241257
204344242363
20540243323
206271244361
207347245321
21040246237
211353247277
212-21340250-25140
214356252254
215346253-25540
216304256253
217245257273
220312260-34040
221352341337
222263342-34540
223364346265
224366347-36040
225306361261
226-22740362-3650
230214366367
23132636740
232334370260
2334037140
234243372267
23540373-37640
274212
.TE

.SS "Mazovia to MS 852"
.sp
.LP
For the conversion of Mazovia to MS 852, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MazoviaMS 852MazoviaMS 852
_
20540234235
20624523540
210-21340236230
21520623740
217244240215
220250241275
221251243340
222210244344
225217245343
226-22740246253
230227247276
23340250-37540
227327
.TE

.SS "Mazovia to DHN"
.sp
.LP
For the conversion of Mazovia to DHN, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MazoviaDHNMazoviaDHN
_
200-20540234203
206211236217
207-21440240207
215212241210
21640242216
217200243205
220202244215
221214246220
225201247221
230206
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
