Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_8859-5.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_8859-5 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_8859-5 \- code set conversion tables for ISO 8859-5 (Cyrillic)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
ISO 8859-5iso5KOI8-Rkoi8KOI8-R
_
ISO 8859-5iso5PC CyrillicaltAlternative PC Cyrillic
_
ISO 8859-5iso5MS 1251win5Windows Cyrillic
_
ISO 8859-5iso5Mac CyrillicmacMacintosh Cyrillic
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "ISO 8859-5 to KOI8-R"
.sp
.LP
For the conversion of ISO 8859-5 to KOI8-R, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-5KOI8-RISO 8859-5KOI8-R
_
244320301
241263321302
242261322327
243262323307
244264324304
245265325305
246266327332
247267330311
250270331312
251271332313
252272333314
253273334315
254274335316
256276336317
257277337320
260341340322
261342341323
262367342324
263347343325
264344344306
265345345310
266366346303
267372347336
270351350333
271352351335
272353352337
273354353331
274355354330
275356355334
276357356300
277360357321
300362360260
301363361243
302364362241
303365363242
304346364244
305350365245
306343366246
307376367247
310373370250
311375371251
312377372252
313371373253
314370374254
315374375255
316340376256
317361
.TE

.SS "ISO 8859-5 to PC Cyrillic"
.sp
.LP
For the conversion of ISO 8859-5 to PC Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-5PC CyrillicISO 8859-5PC Cyrillic
_
244307227
200-24040310230
241360311231
242-25440312232
255260313233
256-25740314234
260200315235
261201316236
262202317237
263203320240
264204321241
265205322242
266206323243
267207324244
270210325245
271211326246
272212327247
273213330250
274214331251
275215332252
276216333253
277217334254
300220335255
301221336256
302222337257
303223360-37440
304224375260
30522537640
30622636540
.TE

.SS "ISO 8859-5 to MS 1251"
.sp
.LP
For the conversion of ISO 8859-5 to MS 1251, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-5MS 1251ISO 8859-5MS 1251
_
244317337
200-23740320340
241250321341
242200322342
243201323343
244252324344
245275325345
246262326346
247257327347
250243330350
251212331351
252214332352
253216333353
254215334354
255210335355
256241336356
257217337357
260300340360
261301341361
262302342362
263303343363
264304344364
265305345365
266306346366
267307347367
270310350370
271311351371
272312352372
273313353373
274314354374
275315355375
276316356376
277317357377
300320360271
301321361270
302322362220
303323363203
304324364272
305325365276
306326366263
307327367277
310330370274
311331371232
312332372234
313333373236
314334374235
315335375210
316336376242
376331
.TE

.SS "ISO 8859-5 to Mac Cyrillic"
.sp
.LP
For the conversion of ISO 8859-5 to Mac Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-5Mac CyrillicISO 8859-5Mac Cyrillic
_
244317237
200-23740320340
240312321341
241335322342
242253323343
243256324344
244270325345
245301326346
246247327347
247272330350
250267331351
251274332352
252276333353
25340334354
254315335355
25540336356
256330337357
257332340360
260200341361
261201342362
262202343363
263203344364
264204345365
265205346366
266206347367
267207350370
270210351371
271211352372
272212353373
273213354374
274214355375
275215356376
276216357337
277217360334
300220361336
301221362254
302222363257
303223364271
304224365317
305225366264
306226367273
307227370300
310230371275
311231372277
31223237340
313233374316
31423437540
315235376331
316236
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
