Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_mac_cyr.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_mac_cyr 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_mac_cyr \- code set conversion tables for Macintosh Cyrillic
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
Mac CyrillicmacISO 8859-5iso5ISO 8859-5 Cyrillic
_
Mac CyrillicmacKOI8-Rkoi8KOI8-R
_
Mac CyrillicmacPC CyrillicaltAlternative PC Cyrillic
_
Mac CyrillicmacMS 1251win5Windows Cyrillic
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "Mac Cyrillic to ISO 8859-5"
.sp
.LP
For the conversion of Mac Cyrillic to ISO 8859-5, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
Conversions Performed
_
Mac CyrillicISO 8859-5Mac CyrillicISO 8859-5
_
244276252
200260277372
201261300370
202262301245
203263302-31140
204264312240
205265313242
206266314362
207267315254
210270316374
211271317365
212272320-32740
213273330256
214274331376
215275332257
216276333377
217277334360
220300335241
221301336361
222302337357
223303340320
224304341321
225305342322
226306343323
227307344324
230310345325
231311346326
232312347327
233313350330
234314351331
235315352332
236316353333
237317354334
240-24640355335
247246356336
250-25240357337
253242360340
254362361341
25540362342
256243363343
257363364344
260-26340365345
264366366346
265-26640367347
267250370350
270244371351
271364372352
272247373353
273367374354
274251375355
275371376356
375370
.TE

.SS "Mac Cyrillic to KOI8-R"
.sp
.LP
For the conversion of Mac Cyrillic to KOI8-R, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
Mac CyrillicKOI8-RMac CyrillicKOI8-R
_
244276272
200341277252
201342300250
202367301265
203347302-31140
204344312240
205345313261
206366314241
207372315274
210351316254
211352317245
212353320-32740
213354330276
214355331256
215356332277
216357333257
217360334260
220362335263
221363336243
222364337321
223365340301
224346341302
225350342327
226343343307
227376344304
230373345305
231375346326
232377347332
233371350311
234370351312
235374352313
236340353314
237361354315
240-24640355316
247266356317
250-25240357320
253261360322
254241361323
25540362324
256262363325
257242364306
260-26340365310
264246366303
265-26640367336
267270370333
270264371335
271244372337
272267373331
273247374330
274271375334
275251376300
375370
.TE

.SS "Mac Cyrillic to PC Cyrillic"
.sp
.LP
For the conversion of Mac Cyrillic to PC Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
Mac CyrillicPC CyrillicMac CyrillicPC Cyrillic
_
244355255
240-33440356256
335360357257
336361360340
337357361341
340240362342
341241363343
342242364344
343243365345
344244366346
345245367347
346246370350
347247371351
350250372352
351251373353
352252374354
353253375355
354254376356
303366
.TE

.SS "Mac Cyrillic to MS 1251"
.sp
.LP
For the conversion of Mac Cyrillic to MS 1251, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
Mac CyrillicMS 1251Mac CyrillicMS 1251
_
24425540
200300256201
201301257203
202302260-26340
203303264263
204304266264
205305267243
206306270252
207307271272
210310272257
211311273277
212312274212
213313275232
214314276214
215315277234
216316300274
217317301275
220320302254
221321303-30640
222322307253
223323310273
224324311205
225325312240
226326313200
227327314220
230330315215
231331316235
232332317276
233333320226
234334321227
235335322223
236336323224
237337324221
240206325222
24126032640
242245327204
24340330241
244247331242
245267332217
246266333237
247262334271
250256335250
252231336270
253200337377
254220362324
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
