Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_8859-2.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_8859-2 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_8859-2 \- code set conversion tables for ISO 8859-2 (Latin 2)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
ISO 8859-2iso2MS 1250win2Windows Latin 2
_
ISO 8859-2iso2MS 852dos2MS-DOS Latin 2
_
ISO 8859-2iso2MazoviamazMazovia
_
ISO 8859-2iso2DHNdhnDom Handlowy Nauki
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "ISO 8859-2 to MS 1250"
.sp
.LP
For the conversion of ISO 8859-2 to MS 1250, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-2MS 1250ISO 8859-2MS 1250
_
244261271
177-23740265276
241245266234
245274267241
246214271232
251212273235
253215274237
254217276236
256216266236
.TE

.SS "ISO 8859-2 to MS 852"
.sp
.LP
For the conversion of ISO 8859-2 to MS 852, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-2MS 852ISO 8859-2MS 852 
_
244316327
177-23740317322
240377320321
241244321343
242364322325
243235323340
244317324342
245225325212
246227326231
247365327236
250371330374
251346331336
252270332351
253233333353
254215334232
255360335355
256246336335
257275337341
260370340352
261245341240
262362342203
263210343307
264357344204
265226345222
266230346206
267363347207
270367350237
271347351202
272255352251
273234353211
274253354330
275361355241
276247356214
277276357324
300350360320
301265361344
302266362345
303306363242
304216364223
305221365213
306217366224
307200367366
310254370375
311220371205
312250372243
313323374201
314267375354
315326376356
366367
.TE

.SS "ISO 8859-2 to Mazovia"
.sp
.LP
For the conversion of ISO 8859-2 to Mazovia, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-2MazoviaISO 8859-2Mazovia
_
244323243
177-23740324-32540
240377326231
241217327-33340
24240334232
243234335-33640
244-24540337341
246230340-34140
247-25340342203
25424034340
255-25640344204
25724134540
260370346215
261206347207
2624035040
263222351202
264-26540352221
266236353211
267-27340354-35540
274246356214
275-27640357-36040
277247361244
300-3034036240
304216363242
30540364223
30622536540
307200366224
310-31140367366
312220370-37340
313-32040374201
321245375-37640
32240
.TE

.SS "ISO 8859-2 to DHN"
.sp
.LP
For the conversion of ISO 8859-2 to DHN, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-2DHNISO 8859-2DHN
_
24432240
177-23740323205
240377324-32540
241200326231
24240327-33340
243203334232
244-24540335-33640
246206337341
247-2534034040
254207341240
255-25640342-34540
257210346212
260370347-35140
261211352213
26240353-35440
263214355241
264-26540356-36040
266217361215
267-2734036240
274220363216
275-27640364223
27722136540
300-30540366224
306201367366
307-31140370-37140
312202372243
313-32040373-37640
321204
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
