Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_pc_cyr.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_pc_cyr 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_pc_cyr \- code set conversion tables for Alternative PC Cyrillic
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
PC CyrillicaltISO 8859-5iso5ISO 8859-5 Cyrillic
_
PC CyrillicaltKOI8-Rkoi8KOI8-R
_
PC CyrillicaltMS 1251win5Windows Cyrillic
_
PC CyrillicaltMac CyrillicmacMacintosh Cyrillic
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "PC Cyrillic to ISO 8859-5"
.sp
.LP
For the conversion of PC Cyrillic to ISO 8859-5, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
PC CyrillicISO 8859-5PC CyrillicISO 8859-5
_
244231311
200260232312
201261233313
202262234314
203263235315
204264236316
205265237317
206266240320
207267241321
210270242322
211271243323
212272244324
213273245325
214274246326
215275247327
216276250330
217277251331
220300252332
221301253333
222302254334
223303255335
224304256336
225305257337
226306260-337255
227307360241
230310362-376255
.TE

.SS "PC Cyrillic to KOI8-R"
.sp
.LP
For the conversion of PC Cyrillic to KOI8-R, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
PC CyrillicKOI8-RPC CyrillicKOI8-R
_
244242327
200341243307
201342244304
202367245305
203347246326
204344247332
205345250311
206366251312
207372252313
210351253314
211352254315
212353255316
213354256317
214355257320
215356260-337255
216357340322
217360341323
220362342324
221363343325
222364344306
223365345310
224346346303
225350347336
226343350333
227376351335
230373352337
231375353331
232377354330
233371355334
234370356300
235374357321
236340360263
237361361243
240301362-376255
241302
.TE

.SS "PC Cyrillic to MS 1251"
.sp
.LP
For the conversion of PC Cyrillic to MS 1251, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
PC CyrillicMS 1251PC CyrillicMS 1251
_
244242342
200300243343
201301244344
202302245345
203303246346
204304247347
205305250350
206306251351
207307252352
210310253353
211311254354
212312255355
213313256356
214314257357
215315260-337210
216316340360
217317341361
220320342362
221321343363
222322344364
223323345365
224324346366
225325347367
226326350370
227327351371
230330352372
231331353373
232332354374
233333355375
234334356376
235335357377
236336360250
237337361270
240340362-376210
241341
.TE

.SS "PC Cyrillic to Mac Cyrillic"
.sp
.LP
For the conversion of PC Cyrillic to Mac Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
PC CyrillicMac CyrillicPC CyrillicMac Cyrillic
_
244341361
240340342362
241341343363
242342344364
243343345365
244344346366
245345347367
246346350370
247347351371
250350352372
251351353373
252352354374
253353355375
254354356376
255355357337
256356360335
257357361336
260-33740362-37640
340360
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
