Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_8859-1.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_8859-1 5 "28 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_8859-1 \- code set conversion tables for ISO 8859-1 (Latin 1)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
ISO 8859-18859ISO 6466467 bit ASCII
_
ISO 8859-18859ISO 646de646deGerman
_
ISO 8859-18859ISO 646da646daDanish
_
ISO 8859-18859ISO 646en646enEnglish ASCII
_
ISO 8859-18859ISO 646es646esSpanish
_
ISO 8859-18859ISO 646fr646frFrench
_
ISO 8859-18859ISO 646it646itItalian
_
ISO 8859-18859ISO 646sv646svSwedish
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "ISO 8859-1 to ISO 646 (7-bit ASCII)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646, all characters not in the following table are mapped unchanged.
.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242 243 244 245 246 247
250 251 252 253 254 255 256 257
260 261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303 304 305 306 307
310 311 312 313 314 315 316 317
320 321 322 323 324 325 326 327
330 331 332 333 334 335 336 337
340 341 342 343 344 345 346 347
350 351 352 353 354 355 356 357
360 361 362 363 364 365 366 367
370 371 372 373 374 375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646de (GERMAN)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646de, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646deISO 8859-1ISO 646de
_
247100337176
304133344173
326134366174
334135374175
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
100 133 134 135 173 174 175 176
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242 243 244 245 246 
250 251 252 253 254 255 256 257
260 261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303     305 306 307
310 311 312 313 314 315 316 317
320 321 322 323 324 325     327
330 331 332 333     335 336 337
340 341 342 343     345 346 347
350 351 352 353 354 355 356 357
360 361 362 363 364 365     367
370 371 372 373     375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646da (DANISH)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646da, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646daISO 8859-1ISO 646da
_
305135345175
306133346173
330134370174
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
133 134 135 173 174 175
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242 243 244 245 246 247
250 251 252 253 254 255 256 257
260 261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303 304         307
310 311 312 313 314 315 316 317
320 321 322 323 324 325 326 327
    331 332 333 334 335 336 337
340 341 342 343 344         347
350 351 352 353 354 355 356 357
360 361 362 363 364 365 366 367
371 372 373 374         376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646en (ENGLISH ASCII)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646en, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
cw(2.75i) |cw(2.75i) 
.
Conversions Performed
_
ISO 8859-1ISO 646en
_
243043
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
043
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242     244 245 246 247
250 251 252 253 254 255 256 257
260 261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303 304 305 306 307
310 311 312 313 314 315 316 317
320 321 322 323 324 325 326 327
330 331 332 333 334 335 336 337
340 341 342 343 344 345 346 347
350 351 352 353 354 355 356 357
360 361 362 363 364 365 366 367
370 371 372 373 374 375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646fr (FRENCH)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646fr, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646frISO 8859-1ISO 646fr
_
243043347134
247135350175
250176351173
260133371174
340100
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
043
100 133 134 135 173 174 175 176
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242     244 245 246
    251 252 253 254 255 256 257
    261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303 304 305 306 307
310 311 312 313 314 315 316 317
320 321 322 323 324 325 326 327
330 331 332 333 334 335 336 337
    341 342 343 344 345 346
        352 353 354 355 356 357
360 361 362 363 364 365 366 367
370     372 373 374 375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646it (ITALIAN)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646it, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646itISO 8859-1ISO 646it
_
243043350175
247100351135
260133354176
340173362174
347134371140
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
043
100 133 134 135 173 174 175 176
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242     244 245 246
250 251 252 253 254 255 256 257
    261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303 304 305 306 307
310 311 312 313 314 315 316 317
320 321 322 323 324 325 326 327
330 331 332 333 334 335 336 337
    341 342 343 344 345 346
        352 353 354 355 356 357
360 361 362 363 364 365 366 367
370     372 373 374 375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646es (SPANISH)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646es, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646esISO 8859-1ISO 646es
_
241133321134
247100347175
260173361174
277135
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
100 133 134 135 173 174 175
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240     242 243 244 245 246
250 251 252 253 254 255 256 257
    261 262 263 264 265 266 267
270 271 272 273 274 275 276
300 301 302 303 304 305 306 307
310 311 312 313 314 315 316 317
320     322 323 324 325 326 327
330 331 332 333 334 335 336 337
340 341 342 343 344 345 346
350 351 352 353 354 355 356 357
360     362 363 364 365 366 367
370 371 372 373 374 375 376 377
.fi
.in -2
.sp

.SS "ISO 8859-1 to ISO 646sv (SWEDISH)"
.sp
.LP
For the conversion of ISO 8859-1 to ISO 646sv, all characters not in the following tables are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
ISO 8859-1ISO 646svISO 8859-1ISO 646sv
_
304133344173
305135345175
311100351140
326134366174
334136374176
.TE

.sp
.in +2
.nf
Converted to Underscore '_' (137)
---------------------------------
100 133 134 135 136 140
173 174 175 176
200 201 202 203 204 205 206 207
210 211 212 213 214 215 216 217
220 221 222 223 224 225 226 227
230 231 232 233 234 235 236 237
240 241 242 243 244 245 246 247
250 251 252 253 254 255 256 257
260 261 262 263 264 265 266 267
270 271 272 273 274 275 276 277
300 301 302 303         306 307
310     312 313 314 315 316 317
320 321 322 323 324 325     327
330 331 332 333     335 336 337
340 341 342 343         346 347
350     352 353 354 355 356 357
360 361 362 363 364 365     367
370 371 372 373     375 376 377
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
