Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_852.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_852 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_852 \- code set conversion tables for MS 852 (MS-DOS Latin 2)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
MS 852dos2ISO 8859-2iso2ISO Latin 2
_
MS 852dos2MS 1250win2Windows Latin 2
_
MS 852dos2MazoviamazMazovia
_
MS 852dos2DHNdhnDom Handlowy Nauki
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "MS 852 to ISO 8859-2"
.sp
.LP
For the conversion of MS 852 to ISO 8859-2, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 852ISO 8859-2\fBMS 852\fRISO 8859-2
_
24-17740271-27440
200307275257
201374276277
202351277-30540
203342306303
204344307343
205371310-31640
206346317244
207347320360
210263321320
211353322317
212325323313
213365324357
214356325322
215254326315
216304327316
217306330354
220311331-33440
221305335336
222345336331
22336433740
224366340323
225245341337
226265342324
227246343321
230266344361
231326345362
232334346251
233253347271
234273350300
235243351332
236327352340
237350353333
240341354375
241355355335
242363356376
243372357264
244241360255
245261361275
246256362262
247276363267
250312364242
251352365247
25240366367
253274367270
254310370260
255272371250
256-26440372377
265301374330
266302375370
26731437640
270252
.TE

.SS "MS 852 to MS 1250"
.sp
.LP
For the conversion of MS 852 to MS 1250, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 852MS 1250MS 852MS 1250
_
200307270252
201374271-27440
202351275257
203342276277
204344277-30540
205371306303
206346307343
207347310-31640
210263317244
211353320360
212325321320
213365322317
214356323313
215217324357
216304325322
217306326315
220311327316
221305330354
222345331-33440
223364335336
224366336331
22527433740
226276340323
227214341337
230234342324
231326343321
232334344361
233215345362
234235346212
235243347232
236327350300
237350351332
240341352340
241355353333
242363354375
243372355335
244245356376
245271357264
246216360255
247236361275
250312362262
251352363241
252254364242
253237365247
254310366367
255272367270
256253370260
257273371250
260-26440372377
265301374330
266302375370
26731437640
.TE

.SS "MS 852 to Mazovia"
.sp
.LP
For the conversion of MS 852 to Mazovia, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 852MazoviaMS 852Mazovia
_
20540246-24740
206215250220
210222251221
212-21340253246
215240254-27040
217225275241
220-22640276247
227230306-33640
230236340243
233-2344034240
235234343245
236-24340344244
244217345-37540
245206
.TE

.SS "MS 852 to DHN"
.sp
.LP
For the conversion of MS 852 to DHN, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
MS 852DHNMS 852DHN
_
200-20540244200
206212245211
20740246-24740
210214250202
211-21440251213
215207253220
21640254-27040
217201275210
220-22640276221
227206306-33640
230217340205
233-2344034240
235203343204
236-23740344215
242216345-37540
252254
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
