Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_koi8-r.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_koi8-r 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_koi8-r \- code set conversion tables for KOI8-R
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
KOI8-Rkoi8ISO 8859-5iso5ISO 8859-5 Cyrillic
_
KOI8-Rkoi8PC CyrillicaltAlternative PC Cyrillic
_
KOI8-Rkoi8MS 1251win5Windows Cyrillic
_
KOI8-Rkoi8Mac CyrillicmacMacintosh Cyrillic
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "KOI8-R to ISO 8859-5"
.sp
.LP
For the conversion of KOI8-R to ISO 8859-5, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
KOI8-RISO 8859-5KOI8-RISO 8859-5
_
244320337
241362321357
242363322340
243361323341
244364324342
245365325343
246366327322
247367330354
250370331353
251371332327
252372333350
253373334355
254374335351
256376336347
257377337352
260360340316
261242341260
262243342261
263241343306
264244344264
265245345265
266246346304
267247347263
270250350305
271251351270
272252352271
273253353272
274254354273
275255355274
276256356275
277257357276
300356360277
301320361317
302321362300
303346363301
304324364302
305325365303
306344366266
307323367262
310345370314
311330371313
312331372267
313332373310
314333374315
315334375311
316335376307
317336
.TE

.SS "KOI8-R to PC Cyrillic"
.sp
.LP
For the conversion of KOI8-R to PC Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
KOI8-RPC CyrillicKOI8-RPC Cyrillic
_
244333350
200-24240334355
243361335351
244-25440336347
255260337352
256-26240340236
263360341200
264-27440342201
275260343226
276-27740344204
300356345205
301240346224
302241347203
303346350225
304244351210
305245352211
306344353212
307243354213
310345355214
311250356215
312251357216
313252360217
314253361237
315254362220
316255363221
317256364222
320257365223
321357366206
322340367202
323341370234
324342371233
325343372207
326246373230
327242374235
330354375231
331353376227
332247
.TE

.SS "KOI8-R to MS 1251"
.sp
.LP
For the conversion of KOI8-R to MS 1251, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
KOI8-RMS 1251KOI8-RMS 1251
_
244317356
200-23740320357
241220321377
242203322360
243270323361
244272324362
245276325363
246263326346
247277327342
250274330374
251232331373
252234332347
253236333370
254235334375
255210335371
256242336367
257237337372
260271340336
261200341300
262201342301
263250343326
264252344304
265275345305
266262346324
267257347303
270243350325
271212351310
272214352311
273216353312
274215354313
275210355314
276241356315
277217357316
300376360317
301340361337
302341362320
303366363321
304344364322
305345365323
306364366306
307343367302
310365370334
311350371333
312351372307
313352373330
314353374335
315354375331
316355376327
376227
.TE

.SS "KOI8-R to Mac Cyrillic"
.sp
.LP
For the conversion of KOI8-R to Mac Cyrillic, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
KOI8-RMac CyrillicKOI8-RMac Cyrillic
_
244317356
200-23740320357
240312321337
241254322360
242257323361
243336324362
244271325363
245317326346
246264327342
247273330374
250300331373
251275332347
252277333370
25340334375
254316335371
25540336367
256331337372
257333340236
260334341200
261253342201
262256343226
263335344204
264270345205
265301346224
266247347203
267272350225
270267351210
271274352211
272276353212
27340354213
274315355214
27540356215
276330357216
277332360217
300376361237
301340362220
302341363221
303366364222
304344365223
305345366206
306364367202
307343370234
310365371233
311350372207
312351373230
313352374235
314353375231
315354376227
316355
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
