Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/iconv_dhn.5
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH iconv_dhn 5 "18 Apr 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
iconv_dhn \- code set conversion tables for DHN (Dom Handlowy Nauki)
.SH DESCRIPTION
.sp
.LP
The following code set conversions are supported:
.sp

.sp
.TS
tab() box;
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
cw(1.22i) |cw(.61i) |cw(1.22i) |cw(.61i) |cw(1.83i) 
.
Code Set Conversions Supported
_
CodeSymbolTarget CodeSymbolTarget Output
_
DHNdhnISO 8859-2iso2ISO Latin 2
_
DHNdhnMS 1250win2Windows Latin 2
_
DHNdhnMS 852dos2MS-DOS Latin 2
_
DHNdhnMazoviamazMazovia
.TE

.SH CONVERSIONS
.sp
.LP
The conversions are performed according to the following tables. All values in the tables are given in octal.
.SS "DHN to ISO 8859-2"
.sp
.LP
For the conversion of DHN to ISO 8859-2, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
DHNISO 8859-2DHNISO 8859-2
_
24-1774022240
200241223364
201306224366
202312225-23040
203243231326
204321232334
205323233-23740
206246240341
207254241355
210257242363
211261243372
212346244-34040
213352341337
214263342-36540
215361366367
21636336740
217266370260
220274371-37640
221277
.TE

.SS "DHN to MS 1250"
.sp
.LP
For the conversion of DHN to MS 1250, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
DHNMS 1250DHNMS 1250
_
200245233-23740
201306240341
202312241355
203243242363
204321243372
205323244-25140
206214252254
207217253-25540
210257256253
211271257273
212346260-34040
213352341337
214263342-34540
215361346265
216363347-36040
217234361261
220237362-36540
221277366367
2224036740
223364370260
22436637140
225-23040372267
231326373-37640
232334
.TE

.SS "DHN to MS 852"
.sp
.LP
For the conversion of DHN to MS 852, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
DHNMS 852DHNMS 852
_
200244212206
201217213251
202250214210
203235215344
204343216242
205340217230
206227220253
207215221276
210275222-37540
211245
.TE

.SS "DHN to Mazovia"
.sp
.LP
For the conversion of DHN to Mazovia, all characters not in the following table are mapped unchanged.
.sp

.sp
.TS
tab() box;
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
cw(1.38i) |cw(1.38i) |cw(1.38i) |cw(1.38i) 
.
Conversions Performed
_
DHNMazoviaDHNMazovia
_
200217212215
201225213221
202220214222
203234215244
204245216242
205243217236
206230220246
207240221247
210241222-24740
211206
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR \fR
.ad
.RS 30n
.rt  
conversion modules
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR \fR
.ad
.RS 30n
.rt  
conversion tables
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR \fR
.ad
.RS 30n
.rt  
list of conversions supported by conversion tables
.RE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5) 
