Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/ieee802.3.5
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ieee802.3 5 "24 Aug 2011" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ieee802.3, cap_autoneg, cap_1000fdx, cap_1000hdx, cap_100fdx, cap_100hdx, cap_10fdx, cap_10hdx, cap_rem_fault, cap_pause, cap_asym_pause, adv_cap_autoneg, adv_cap_1000fdx, adv_cap_1000hdx, adv_cap_100fdx, adv_cap_100hdx, adv_cap_10fdx, adv_cap_10hdx, adv_cap_pause, adv_cap_asym_pause, adv_rem_fault, lp_cap_autoneg, lp_cap_1000fdx, lp_cap_1000hdx, lp_cap_100fdx, lp_cap_100hdx, lp_cap_10fdx, lp_cap_10hdx, lp_cap_pause, lp_cap_asym_pause, lp_rem_fault, xcvr_addr, xcvr_id, xcvr_inuse, link_up, link_duplex, link_tx_pause, link_rx_pause \- Ethernet mii kstat and dladm parameters
.SH DESCRIPTION
.sp
.LP
This page describes the kernel statistics and the \fBdladm\fR(1M) configuration  parameters used to monitor and configure the Ethernet physical layer. 
.sp
.LP
The \fBcap_*\fR parameters exist in the kernel statistics for an Ethernet device. The parameters describe the maximum capability of a device. When the value of a statistic is \fB1\fR, the device has the capability described. When the value is \fB0\fR, the device does not have the capability.
.sp
.LP
The exceptions to this rule are the \fBcap_asym_pause\fR and \fBcap_pause\fR parameters which are explained later in this page.
.sp
.ne 2
.mk
.na
\fB\fBcap_autoneg\fR\fR
.ad
.RS 17n
.rt  
Capable of auto-negotiation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_1000fdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 1000 full duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_1000hdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 1000 half duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_100fdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 100 full duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_100hdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 100 half duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_10fdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 10 full duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_10hdx\fR\fR
.ad
.RS 17n
.rt  
Capable of 10 half duplex operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_rem_fault\fR\fR
.ad
.RS 17n
.rt  
Capable of reporting locally detected faults to link partner
.RE

.sp
.LP
The \fBadv_cap_*\fR parameters exist in the kernel statistics and represent a mirror image of the \fBdladm adv_*_cap\fR parameter list for an Ethernet device. The \fBdladm adv_*_cap\fR tuning parameters allow fine grain control of the Ethernet device physical layer. The parameters are also a subset of the \fBcap_*\fR statistics. If the \fBcap_*\fR value is \fB0\fR, the corresponding \fBadv_cap_*\fR must also be \fB0\fR. The exceptions to this rule are the \fBadv_cap_asym_pause\fR and \fBadv_cap_pause\fR parameters.
.sp
.LP
When auto-negotiation is enabled, the \fBadv_*_cap\fR statistics show which capabilities are advertised to the link partner. When auto-negotiation is disabled in \fIforced mode\fR, the statistics precisely show how a link should function and that it must be matched on the link partner to achieve a valid link up.
.sp
.LP
Statistics with values other than \fB0\fR and \fB1\fR are also described in the following.
.sp
.ne 2
.mk
.na
\fB\fBadv_cap_autoneg\fR\fR
.ad
.RS 19n
.rt  
Advertise auto-negotiation capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_1000fdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 1000 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_1000hdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 1000 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_100fdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 100 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_100hdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 100 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_10fdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 10 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_10hdx\fR\fR
.ad
.RS 19n
.rt  
Advertise 10 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_rem_fault\fR\fR
.ad
.RS 19n
.rt  
Fault value reported by the local system to the peer
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Link is good
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Fault
.RE

.RE

.sp
.LP
The \fBlp_cap_*\fR parameters exist as kernel statistics for an Ethernet device. The statistics are the advertised capabilities provided by the link partner on completion of auto-negotiation. If the capabilities match the capabilities provided in the local advertisement, the link can proceed to a link up state. If no match is found, the link remains down. In two other instances, \fBlp_cap_*\fR values might all be zero: (1) when a cable is not present and (2) when forced mode is enabled.
.sp
.ne 2
.mk
.na
\fB\fBlp_cap_autoneg\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises auto-negotiation capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_1000fdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 1000 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_1000hdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 1000 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_100fdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 100 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_100hdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 100 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_10fdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 10 full duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_10hdx\fR\fR
.ad
.RS 18n
.rt  
Link partner advertises 10 half duplex capability
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_rem_fault\fR\fR
.ad
.RS 18n
.rt  
Fault value the remote system reports
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Link is good
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Fault 
.RE

.RE

.sp
.LP
The \fBxcvr_*\fR kernel statistics provide information about the physical layer device that is in use.
.sp
.ne 2
.mk
.na
\fB\fBxcvr_addr\fR\fR
.ad
.RS 14n
.rt  
MII address in the \fB0\fR to \fB31\fR range of the physical layer device in use for a given Ethernet device
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcvr_id\fR\fR
.ad
.RS 14n
.rt  
MII transceiver manufacturer and device ID
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcvr_inuse\fR\fR
.ad
.RS 14n
.rt  
MII transceiver type, based on the following list:
.sp
.ne 2
.mk
.na
\fB\fB0\fR other\fR
.ad
.RS 15n
.rt  
Undefined
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR none\fR
.ad
.RS 15n
.rt  
MII present, but nothing connected
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR 10Mb/s\fR
.ad
.RS 15n
.rt  
10Mb/s Manchester encoding
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR 100BaseT4\fR
.ad
.RS 15n
.rt  
100 Mb/s 8B/6T
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR 100BaseX\fR
.ad
.RS 15n
.rt  
100 Mb/s 4B/5B
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR 100BaseT2\fR
.ad
.RS 15n
.rt  
100 Mb/s PAM5X5
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR 1000BaseX\fR
.ad
.RS 15n
.rt  
1000 Mb/s 8B/10B
.RE

.sp
.ne 2
.mk
.na
\fB\fB7\fR 1000BaseT\fR
.ad
.RS 15n
.rt  
1000 Mb/s 4D-PAM5
.RE

The above values define maximum capability. In many cases, lower speeds can occur. The \fBcap_*\fR statistics must be viewed to establish the range of capability.
.RE

.sp
.LP
The \fBlink_*\fR kernel statistics show the link state at the local end of the connection.
.sp

.sp
.TS
tab();
lw(2.01i) lw(.6i) lw(2.89i) 
lw(2.01i) lw(.6i) lw(2.89i) 
.
\fBlink_up\fR\fB1\fRLink is up
\fB0\fRLink is down
\fBlink_duplex\fR\fB2\fRFull duplex link
\fB1\fRHalf duplex link
\fB0\fRUnknown
.TE

.sp
.LP
The \fBcap_asym_pause\fR, \fBcap_pause\fR, \fBadv_cap_asym_pause\fR, and \fBadv_cap_pause\fR parameters do not follow the rules of other \fBcap_*\fR and \fBadv_cap_*\fR kstats or parameters. The \fBcap_*pause\fR  kstats provide information about the capabilities supported by the device and constrain the values that may be set to the corresponding \fBadv_cap_*pause\fR parameters.
.sp
.ne 2
.mk
.na
\fB\fBcap_pause\fR\fR
.ad
.RS 18n
.rt  
Symmetric pause capability.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap_asym_pause\fR\fR
.ad
.RS 18n
.rt  
Asymmetric pause capability.
.RE

.sp
.LP
The \fBadv_cap_pause\fR and \fBadv_cap_asym_pause\fR statistics are limited by the available settings for \fBcap_pause\fR and \fBcap_asym_pause\fR. These statistics are read-only values whose settings may be administratively controlled by setting the flowctrl property supported by  \fBdladm\fR(1M). For a device that is fully capable of pausing both Rx (receive) and Tx (transmit) operations, the settings available are defined in the truth table that follows the \fBadv_cap_pause\fR and \fBadv_cap_asm_pause\fR parameter descriptions below.
.sp
.ne 2
.mk
.na
\fB\fBadv_cap_pause\fR\fR
.ad
.RS 22n
.rt  
When adv_cap_pause is 1, the device can both assert and respond to flow control.                           This is the pre-Gigabit, symmetric mode of operation, and implies a full (both send and receive) implementation of the PAUSE mechanism within the device. In addition, if adv_cap_asym_pause is 1, the device can operate either symmetrically or asymmetrically in either direction.
.sp
If adv_cap_pause is 0, advertised, flow-control behavior is determined by adv_cap_asym_pause. If the value of adv_cap_asym_pause is 1, the device can assert flow control, but cannot resend.
.sp
No flow control is available when bot adv_cap_pause  and adv_cap_asym_pause are 0.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadv_cap_asym_pause\fR\fR
.ad
.RS 22n
.rt  
Asymmetric pause capability.
.RE

.sp
.LP
The \fBcap_asym_pause\fR and \fBcap_pause\fR statistics show the capability of a device and also limit the legal setting for \fBadv_cap_asym_pause\fR and \fBadv_cap_pause\fR.  The  following  truth table describes the available \fBadv_cap_asym_pause\fR and \fBadv_cap_pause\fR settings limited by \fBcap_asym_pause\fR and \fBcap_pause statistics\fR. The abbreviations below are used in the table.
.sp
.ne 2
.mk
.na
\fBCA\fR
.ad
.RS 6n
.rt  
\fBcap_asym_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBCP\fR
.ad
.RS 6n
.rt  
\fBcap_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBAA\fR
.ad
.RS 6n
.rt  
\fBadv_cap_asym_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBAP\fR
.ad
.RS 6n
.rt  
\fBadv_cap_pause\fR
.RE

.sp

.sp
.TS
tab();
lw(.45i) lw(.49i) lw(.49i) lw(.54i) lw(3.53i) 
lw(.45i) lw(.49i) lw(.49i) lw(.54i) lw(3.53i) 
.
\fBCP\fR\fBCA\fR\fBAP\fR\fBAA\fR\fBDescription\fR
\fB0\fR\fB0\fR\fB0\fR\fB0\fRNo pause in use.
\fB0\fR\fB0\fR\fBx\fR\fBx\fRDevice not pause capable, cannot set.
\fB0\fR\fB1\fR\fB0\fR\fB0\fRT{
Asymmetric Rx pause capable, but not advertised.
T}
\fB0\fR\fB1\fR\fB0\fR\fB1\fRT{
Asymmetric Rx pause capable and advertised.
T}
\fB0\fR\fB1\fR\fB1\fR\fB0\fRT{
Asymmetric Rx pause capable, but not advertised. Not capable of symmetric pause.
T}
\fB0\fR\fB1\fR\fB1\fR\fB1\fRT{
Asymmetric Rx pause capable and advertised. No symmetric pause capability or asymmetric Tx pause.
T}
\fB1\fR\fB0\fR\fB0\fR\fB0\fRT{
Symmetric pause capable, but not advertised.
T}
\fB1\fR\fB0\fR\fB0\fR\fB1\fRT{
Symmetric pause capable, advertising asymmetric Rx pause only.
T}
\fB1\fR\fB0\fR\fB1\fR\fB0\fRT{
Symmetric pause capable, advertising symmetric Rx and Tx pause capability.
T}
\fB1\fR\fB0\fR\fB1\fR\fB1\fRSymmetric pause capable and advertised.
\fB1\fR\fB1\fR\fB0\fR\fB0\fRT{
Symmetric and asymmetric pause capable, but not advertised.
T}
\fB1\fR\fB1\fR\fB0\fR\fB1\fRT{
Symmetric and asymmetric Tx pause capable. Only asymmetric Tx pause advertised.
T}
\fB1\fR\fB1\fR\fB1\fR\fB0\fRT{
Symmetric and symmetric Tx pause capable. Only symmetric pause advertised.
T}
\fB1\fR\fB1\fR\fB1\fR\fB1\fRT{
Asymmetric Tx pause capable and advertised.
T}
.TE

.sp
.LP
In the cases above, an error is posted when a device driver cannot advertise. A new setting is ignored and values revert to the previous setting.
.sp
.LP
The \fBlp_cap_pause\fR and the \fBlp_cap_asym_pause\fR provide the advertised capabilities of the link partners.
.sp
.ne 2
.mk
.na
\fB\fBlp_cap_pause\fR\fR
.ad
.RS 21n
.rt  
When \fBlp_cap_pause\fR is 1, the link-partner can both assert and respond to flow control. This is the pre-Gigabit, symmetric mode of operation, and implies a full (both send and receive) implementation of the  PAUSE mechanism within the device. In addition, if \fBlp_cap_asym_pause\fR is 1, the link-partner can operate either symmetrically or asymmetrically in either direction.
.sp
If \fBlp_cap_pause\fR is 0, the flow-control behavior supported by the link-partner is determined by \fBlp_cap_asym_pause\fR. If the value of \fBlp_cap_asym_pause\fR is 1, the link-partner can assert flow control, but cannot respond to any pause-frames sent to it.
.sp
No flow control is available when both \fBlp_cap_pause\fR and \fBlp_cap_asym_pause\fR are 0.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlp_cap_asym_pause\fR\fR
.ad
.RS 21n
.rt  
Asymmetric pause capability
.RE

.sp
.LP
When \fBadv_*pause_cap\fR and \fBlp_*pause_cap\fR are compared on completion of auto-negotiation, the chosen flow control mechanism for the link depends on what is most meaningful.
.sp
.ne 2
.mk
.na
\fB\fBlink_tx_pause\fR\fR
.ad
.RS 17n
.rt  
Link partner can assert flow control by sending pause frames when congestion is experienced.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlink_rx_pause\fR\fR
.ad
.RS 17n
.rt  
Link partner can  respond to pause frames  received.
.RE

.sp
.LP
The following truth table illustrates the meaningful flow control combinations related to local and link partner configurations. The abbreviations below are used in the table.
.sp
.ne 2
.mk
.na
\fBAA\fR
.ad
.RS 7n
.rt  
\fBadv_cap_asym_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBAP\fR
.ad
.RS 7n
.rt  
\fBadv_cap_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBLAC\fR
.ad
.RS 7n
.rt  
\fBlp_cap_asym_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBLPC\fR
.ad
.RS 7n
.rt  
\fBlp_cap_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBLA\fR
.ad
.RS 7n
.rt  
\fBlink_asym_pause\fR
.RE

.sp
.ne 2
.mk
.na
\fBLP\fR
.ad
.RS 7n
.rt  
\fBlink_pause\fR
.RE

.sp

.sp
.TS
tab();
lw(.33i) lw(.33i) lw(.37i) lw(.37i) lw(.33i) lw(.37i) lw(3.39i) 
lw(.33i) lw(.33i) lw(.37i) lw(.37i) lw(.33i) lw(.37i) lw(3.39i) 
.
\fBAA\fR\fBAP\fR\fBLAC\fR\fBLPC\fR\fBLA\fR\fBLP\fR\fBDescription\fR
\fB1\fR\fB0\fR\fB1\fR\fB1\fR\fB1\fR\fB0\fRT{
Local station will Tx a pause when Rx is congested.
T}
\fB0\fR\fB1\fR\fB0\fR\fB1\fR\fB0\fR\fB1\fRT{
Flow control in both Rx and Tx directions.
T}
\fBx\fR\fB1\fR\fB1\fR\fB0\fR\fB1\fR\fB1\fRT{
Local station honors received Pause frames by temporarily suspending Transmit.
T}
\fBx\fR\fBx\fR\fBx\fR\fBx\fR\fB0\fR\fB0\fRT{
All other combinations: Flow control not available on the link
T}
.TE

.sp
.LP
When forced mode is enabled, the current  setting of \fBadv_cap_asym_pause\fR  and \fBadv_cap_pause\fR are used for the link. The \fBlink_asym_pause\fR and \fBlink_pause\fR become equal to the current \fBadv_cap_asym_pause\fR and \fBadv_cap_pause\fR settings. The above table also applies in forced mode, but the link partner configuration  must be checked to verify that flow control is operating on the link.
.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBdriver.conf\fR(4), \fBbge\fR(7D), \fBdlpi\fR(7P), \fBeri\fR(7D), \fBgld\fR(7D), \fBhme\fR(7D), \fBqfe\fR(7d)
.SH NOTES
.sp
.LP
When \fBadv_cap_autoneg\fR is set to \fB0\fR, the highest priority speed and duplex is used for forced mode.
.sp
.LP
The highest priority is the highest speed at full duplex. The lowest priority is the lowest speed at half duplex.
.sp
.LP
MII transceivers can exist internally to a system or can be connected to an external MII connector. Typically, an internal transceiver has an \fBxcvr_addr\fR of \fB1\fR, while an external connection has an \fBxcvr_addr\fR of \fB0\fR.
