Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/ieee802.11.5
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.TH ieee802.11 5 "28 Nov 2006" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ieee802.11 \- 802.11 kernel statistics
.SH DESCRIPTION
.sp
.LP
This page describes the kernel statistics that can be used to monitor attributes specific to the 802.11 physical layer. These statistics can be retrieved using \fBkstat\fR(1M). Not all 802.11 devices will support all statistics.
.sp
.ne 2
.mk
.na
\fB\fBtx_frags\fR\fR
.ad
.RS 16n
.rt  
Count of data and management fragments transmitted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrx_frags\fR\fR
.ad
.RS 16n
.rt  
Count of data and management fragments received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrx_dups\fR\fR
.ad
.RS 16n
.rt  
Count of duplicate frames received. Duplicates are determined by the sequence control field.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmcast_tx\fR\fR
.ad
.RS 16n
.rt  
Count of broadcast and multicast frames transmitted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmcast_rx\fR\fR
.ad
.RS 16n
.rt  
Count of broadcast and multicast frames received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx_failed\fR\fR
.ad
.RS 16n
.rt  
Count of frames that could not be transmitted due to the retransmission limit being reached.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx_retrans\fR\fR
.ad
.RS 16n
.rt  
Count of frames successfully retransmitted after one or more retransmissions.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx_reretrans\fR\fR
.ad
.RS 16n
.rt  
Count of frames successfully retransmitted after more than one retransmission.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrts_success\fR\fR
.ad
.RS 16n
.rt  
Count of times a \fBCTS\fR was received in response to an \fBRTS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrts_failure\fR\fR
.ad
.RS 16n
.rt  
 Count of times a \fBCTS\fR was not received in response to an \fBRTS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBack_failure\fR\fR
.ad
.RS 16n
.rt  
Count of times an \fBACK\fR was expected but was not received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfcs_errors\fR\fR
.ad
.RS 16n
.rt  
Count of frames received with \fBFCS\fR errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwep_errors\fR\fR
.ad
.RS 16n
.rt  
Count of frames received with the \fBWEP\fR bit set but that either should not have been encrypted or that were discarded due to \fBWEP\fR not being supported.
.RE

.SH SEE ALSO
.sp
.LP
\fBkstat\fR(1M)
