Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/labels.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH labels 5 "20 Jul 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
labels \- Solaris Trusted Extensions label attributes
.SH DESCRIPTION
.sp
.LP
Labels are attributes that are used in mandatory policy decisions. Labels are associated, either explicitly or implicitly, with all subjects (generally processes) and objects (generally things with data such as files) that are accessible to subjects. The default Trusted Extensions mandatory policy labels are defined by a site's security administrator in \fBlabel_encodings\fR(4).
.SS "Mandatory Policy"
.sp
.LP
Various mandatory policies might be delivered in the lifetime of Solaris Trusted Extensions.
.sp
.LP
The default mandatory policy of Trusted Extensions is a Mandatory Access Control (MAC) policy that is equivalent to that of the Bell-LaPadula Model of the Lattice, the Simple Security Property, and the *-Property (Star Property), with restricted write up. The default mandatory policy is also equivalent to the Goguen and Mesegeur model of Non-Inteference.
.sp
.LP
For this MAC policy, two labels are always defined: \fBadmin_low\fR and \fBadmin_high\fR. The site's security administrator defines all other labels in \fBlabel_encodings\fR(4). \fBadmin_low\fR is associated with all normal user readable (viewable) Trusted Extensions objects. \fBadmin_high\fR is associated with all other Trusted Extensions objects. Only administrative users have MAC read (view) access to \fBadmin_high\fR objects and only administrative users have MAC write (modify) access to \fBadmin_low\fR objects or \fBadmin_high\fR objects.
.SS "Human Readable Labels"
.sp
.LP
Users interact with labels as strings. Graphical user interfaces and command line interfaces present the strings as defined in \fBlabel_encodings\fR(4). Human readable labels are classified at the label that they represent. Thus the string for a label \fBA\fR is only readable (viewable, translatable to or from human readable to opaque \fBm_label_t\fR) by a subject whose label allows read (view) access to that label.
.SS "Internal Text Labels"
.sp
.LP
In order to store labels in publicly accessible (\fBadmin_low\fR) name service databases, an unclassified internal text form is used. This textual form is not intended to be used in any interfaces other than those that are provided with the Trusted Extensions software release that created this textual form of the label.
.SS "Labels and Applications"
.sp
.LP
Applications interact with labels as opaque (\fBm_label_t\fR) structures. The semantics of these opaque structures are defined by a string to \fBm_label_t\fR translation. This translation is defined in \fBlabel_encodings\fR(4). Various Application Programming Interfaces (API) translate between strings and \fBm_label_t\fR structures. Various APIs test access of subject-related labels to object-related labels.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilitySee below.
.TE

.sp
.LP
The labels implementation is Committed for systems that implement the Defense Intelligence Agency (DIA) MAC policy of \fBlabel_encodings\fR(4). Other policies might exist in a future release of Trusted Extensions that might make obsolete or supplement \fBlabel_encodings\fR.
.sp
.LP
Internal text labels are Not-an-Interface and might change with any release of Trusted Extensions. They are intended only for input and generation on the same release of Trusted Extensions software.
.sp
.LP
As a potential porting aid for Trusted Solaris 8 applications, the opaque structure names \fBbslabel_t\fR, \fBblevel_t\fR, and \fBbclear_t\fR are defined to be equivalent to \fBm_label_t\fR. Like \fBm_label_t\fR, these types must be ported as opaque pointers. The same must be done with the various Trusted Solaris 8 label interfaces. These Trusted Solaris 8 structures and interfaces are Obsolete and might be removed from a future release of Trusted Extensions.
.SH SEE ALSO
.sp
.LP
\fBchk_encodings\fR(1M), \fBblcompare\fR(3TSOL), \fBlabel_to_str\fR(3TSOL), \fBm_label_alloc\fR(3TSOL), \fBm_label_dup\fR(3TSOL), \fBm_label_free\fR(3TSOL), \fBstr_to_label\fR(3TSOL), \fBlabel_encodings\fR(4), \fBattributes\fR(5)
.sp
.LP
Bell, D. E., and LaPadula, L. J. \fISecure Computer Systems: Unified Exposition and Multics Interpretation\fR, MTR-2997 Rev. 2, MITRE Corp., Bedford Mass., March 1976. NTIS AD-A023 588/7.
.sp
.LP
Goguen, J. A., and Mesegeur, J.: \fISecurity Policies and Security Models\fR, Proceedings 1982 Symposium on Security and Privacy, IEEE Computer Society Press, 1982, p 11-20.
.sp
.LP
Goguen, J. A., and Mesegeur, J.: \fIUnwinding and Interference Control\fR, Proceedings 1984 Symposium on Security and Privacy, IEEE Computer Society Press, 1984, p 75-86.
.sp
.LP
\fICompartmented Mode Workstation Labeling: Encodings Format\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
