Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/pam_dial_auth.5
'\" te
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pam_dial_auth 5 "15 Jun 2011" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_dial_auth \- authentication management PAM module for dialups
.SH SYNOPSIS
.LP
.nf
\fBpam_dial_auth.so.1\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpam_dial_auth\fR module implements \fBpam_sm_authenticate\fR(3PAM) which authenticates the user according to the \fBdialups\fR(4) and \fBd_passwd\fR(4) files configuration. 
.sp
.LP
Authentication service modules must implement both \fBpam_sm_authenticate()\fR and \fBpam_sm_setcred()\fR. \fBpam_sm_setcred()\fR in this module always returns \fBPAM_IGNORE\fR. 
.sp
.LP
The value of the \fBPAM_TTY\fR item is checked against entries in \fBdialups\fR(4). If there is a match, the user's shell is compared against entries in \fBd_passwd\fR(4). If there is a matching entry, the user is prompted for a password which is validated against the entry found.
.sp
.LP
The following option may be passed in to this service module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 9n
.rt  
\fBsyslog\fR(3C) debugging information at \fBLOG_DEBUG\fR level.
.RE

.SH ERRORS
.sp
.LP
If \fBdialups\fR(4) is not present, \fBPAM_IGNORE\fR is returned. Upon successful completion of \fBpam_sm_authenticate()\fR, \fBPAM_SUCCESS\fR is returned. The following error codes are returned upon error:
.sp
.ne 2
.mk
.na
\fB\fBPAM_AUTH_ERR\fR\fR
.ad
.RS 20n
.rt  
Authentication failure.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_SERVICE_ERR\fR\fR
.ad
.RS 20n
.rt  
Error in the calling service, \fBPAM_TTY\fR is not set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_SYSTEM_ERR\fR\fR
.ad
.RS 20n
.rt  
System error (\fBd_passwd\fR(4) is not present).
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_USER_UNKNOWN\fR\fR
.ad
.RS 20n
.rt  
No account is present for \fIuser\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBpam_sm_authenticate\fR(3PAM), \fBd_passwd\fR(4), \fBdialups\fR(4), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5), \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_authtok_store\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5), \fBpam_unix_session\fR(5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the multi-threaded application uses its own \fBPAM\fR handle.
