Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/pam_rhosts_auth.5
'\" te
.\"  Copyright (c) 1995, Sun Microsystems, Inc.   All Rights Reserved
.TH pam_rhosts_auth 5 "28 Oct 1996" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_rhosts_auth \- authentication management PAM module using ruserok()
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The rhosts  \fBPAM\fR module,  \fB/usr/lib/security/pam_rhosts_auth.so.1\fR, authenticates a user via the \fBrlogin\fR authentication protocol. Only \fBpam_sm_authenticate()\fR is implemented within this module. \fBpam_sm_authenticate()\fR uses the \fBruserok\fR(3SOCKET) library function to authenticate the \fBrlogin\fR or \fBrsh\fR user. \fBpam_sm_setcred()\fR is a null function.
.sp
.LP
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR is designed to be stacked on top of  the \fB/usr/lib/security/pam_unix.so.1\fR module for both the \fBrlogin\fR and \fBrsh\fR services. This module is normally configured as \fIsufficient\fR so that subsequent authentication is performed only on failure of \fBpam_sm_authenticate()\fR. The following option may be passed in to this service module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR \fR
.ad
.RS 10n
.rt  
\fBsyslog\fR(3C) debugging information at  \fBLOG_DEBUG\fR level.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBruserok\fR(3SOCKET), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5) 
.SH NOTES
.sp
.LP
The interfaces in  \fBlibpam()\fR are MT-Safe only if each thread within the multi-threaded application uses its own  \fBPAM\fR handle.
