Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/pam_authtok_store.5
'\" te
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pam_authtok_store 5 "15 Jun 2011" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_authtok_store \- password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_store.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBpam_authtok_store\fR provides functionality to the PAM password management stack. It provides one function: \fBpam_sm_chauthtok()\fR. 
.sp
.LP
When invoked with flags set to \fBPAM_UPDATE_AUTHTOK\fR, this module updates the authentication token for the user specified by \fBPAM_USER\fR. 
.sp
.LP
The authentication token \fBPAM_OLDAUTHTOK\fR can be used to authenticate the user against repositories that need updating (\fBNIS\fR, \fBLDAP\fR). After successful updates, the new authentication token stored in \fBPAM_AUTHTOK\fR is the user's valid password. 
.sp
.LP
This module honors the \fBPAM_REPOSITORY\fR item, which, if set, specifies which repository is to be updated. If \fBPAM_REPOSITORY\fR is unset, it follows the \fBnsswitch.conf\fR(4). 
.sp
.LP
The following option can be passed to the module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 17n
.rt  
\fBsyslog\fR(3C) debugging information at the \fBLOG_DEBUG\fR level
.RE

.sp
.ne 2
.mk
.na
\fB\fBserver_policy\fR\fR
.ad
.RS 17n
.rt  
If the account authority for the user, as specified by \fBPAM_USER\fR, is a server, do not encrypt the authentication token before updating.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 18n
.rt  
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_SYSTEM_ERR\fR\fR
.ad
.RS 18n
.rt  
Fails to get username, service name, old password or new password, user name null or empty, or password null. 
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBpam_chauthtok\fR(3PAM), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5), \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5), \fBpam_unix_session\fR(5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the multi-threaded application uses its own \fBPAM\fR handle.
.sp
.LP
If the \fBPAM_REPOSITORY\fR \fIitem_type\fR is set and a service module does not recognize the type, the service module does not process any information, and returns \fBPAM_IGNORE\fR. If the \fBPAM_REPOSITORY\fR \fIitem_type\fR is not set, a service module performs its default action.
