Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/solaris10.5
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH solaris10 5 "25 Jul 2011" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
solaris10 \- Solaris 10 branded zone
.SH DESCRIPTION
.sp
.LP
The \fBsolaris10\fR brand uses the branded zones framework described in \fBbrands\fR(5) to enable Solaris 10 binary applications to run unmodified on a machine with the latest Solaris Operating System kernel.
.sp
.LP
The \fBsolaris10\fR brand only supports running the Solaris 10 10/09 (Solaris 10 update 8) release, or later, within the zone.
.sp
.LP
The \fBsolaris10\fR brand includes the tools necessary to install a Solaris 10 system image into a non-global zone. It also supports the tools necessary to migrate a Solaris 10 native zone to a \fBsolaris10\fR branded zone. The brand supports the execution of 32-bit and 64-bit Solaris 10 applications on either SPARC or x86 machines running the latest Solaris operating system.
.SS "Configuration and Administration"
.sp
.LP
The \fBsolaris10\fR brand supports the whole root non-global zone model. All of the required Solaris 10 software and any additional packages are installed into the private file systems of the zone. 
.sp
.LP
The zone must reside on its own \fBzfs\fR(1M) dataset and only ZFS is supported. The ZFS dataset created automatically when the zone is installed or attached. If a ZFS dataset cannot be created, the zone is not installed or attached. 
.sp
.LP
The \fBzonecfg\fR(1M) utility is used to configure a \fBsolaris10\fR branded zone. The \fBSUNWsolaris10\fR template can be used when creating the zone or the configuration can be set up manually. Once a branded zone has been installed, that zone's brand cannot be changed or removed. The \fBzoneadm\fR(1M) utility is used to report the zone's brand type and administer the zone. The \fBzlogin\fR(1) utility is used to log in to the zone.
.sp
.LP
The support for delegated ZFS dataset configurations is currently experimental and has not yet been tested. Support for running these zones in a para-virtualized xVM domain is experimental and there are known problems with 64-bit x86 applications within the zone. The \fB/dev/sound\fR device cannot be configured into the branded zone. In addition, \fBmdb\fR(1) and \fBdtrace\fR(1M) are not fully functional when used in the global zone to examine processes executing within a \fBsolaris10\fR branded zone.
.sp
.LP
The \fBsolaris10\fR brand installer supports installing the zone from an image of an installed Solaris 10 system. This can be a full \fBflash_archive\fR(4), \fBcpio\fR(1), or \fBpax\fR(1) \fBxustar\fR archive. The \fBcpio\fR archive can be compressed with \fBgzip(1)\fR or \fBbzip2(1)\fR. The image can also be a level 0 \fBufsdump\fR(1M), or a path to the top-level of a Solaris 10 system's root directory tree. The zone cannot be installed from standard Solaris 10 distribution media. 
.sp
.LP
To migrate a native zone from a Solaris 10 system to the latest Solaris Operating System kernel, the attach subcommand supports installing the zone from an archive of an installed Solaris 10 native zone. As with the installer, this can be a \fBcpio\fR(1) or \fBpax\fR(1) \fBxustar\fR archive of the \fBzonepath\fR. The \fBcpio\fR archive can be compressed with \fBgzip(1)\fR or \fBbzip2(1)\fR. The image can also be a path to the top-level of a Solaris 10 zone's \fBzonepath\fR directory tree. In addition to migrating from a Solaris 10 native zone, the same migration options can be used when migrating a \fBsolaris10\fR branded zone from one host to another. When migrating from Solaris 10, it is possible that the zone is configured as a \fBsparseroot\fR zone. In this case, the zone should be readied on the host before the archive is made. This ensures that the inherited directories are included in the archive.
.SH SUB-COMMANDS
.sp
.LP
The following arguments of \fBzoneadm\fR(1M) brand-specific subcommand are supported: 
.sp
.ne 2
.mk
.na
\fB\fBattach\fR [\fB-a\fR \fIarchive\fR | \fB-d\fR \fIpath\fR] [\fB-c\fR \fIsysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
Attach the specified Solaris 10 native zone image into the branded zone. If neither \fB-a\fR or \fB-d\fR is specified, the zone's \fBzonepath\fR is assumed to already be properly installed with the zone's files.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.RS 15n
.rt  
The path to a \fBcpio\fR(1), \fBpax\fR(1) \fBxustar\fR, or \fBzfs\fR archive of either an installed Solaris 10 native zone or a \fBsolaris10\fR branded zone's \fBzonepath\fR. \fBcpio\fR and \fBzfs\fR archives can be compressed using \fBgzip\fR or \fBbzip2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.RS 15n
.rt  
Specifying a \fIsysidcfg\fR file causes a sys-unconfig to occur on the zone after attach. The \fIsysidcfg\fR file is then applied to the zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.RS 15n
.rt  
The path to the \fBzonepath\fR directory of either an installed Solaris 10 native zone or a \fBsolaris10\fR branded zone's \fBzonepath\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBclone\fR [\fB-c\fR \fBsysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
Install a zone by copying an existing installed zone. This subcommand is an alternative way to install the zone.
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fBsysidcfg\fR\fR
.ad
.RS 15n
.rt  
Provides a \fIsysidcfg\fR file to apply after unconfiguration of the cloned zone.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstall\fR [\fB-a\fR \fIarchive\fR] [\fB-d\fR \fIpath\fR] [\fB-p\fR] [\fB-s\fR] [\fB-u\fR] [\fB-v\fR] \e\fR
.ad
.br
.na
\fB[\fB-c\fR \fBsysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
Install the specified Solaris 10 system image into the zone. Either the \fB-u\fR or \fB-p\fR option is required \fBand\fR either the \fB-a\fR or \fB-d\fR option is required.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.sp .6
.RS 4n
The path to a \fBflash_archive\fR(4), \fBcpio\fR(1), \fBpax\fR(1) \fBxustar\fR, \fBzfs\fR archive, or a level \fB0\fR \fBufsdump\fR(1M) of an installed Solaris 10 system. The \fBcpio\fR and \fBzfs\fR archives can be compressed using \fBgzip\fR or \fBbzip2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.sp .6
.RS 4n
Provides a \fIsysidcfg\fR file to apply after installation. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
The path to the root directory of an installed Solaris 10 system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Preserve the system configuration after installing the zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Install silently.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Run  \fBsys-unconfig\fR on the zone after installing it.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Verbose output from the install process.
.RE

.RE

.SS "Application Support"
.sp
.LP
The \fBsolaris10\fR zone only supports user-level Solaris 10 applications. You cannot use Solaris 10 device drivers or Solaris 10 kernel modules from inside a \fBsolaris10\fR zone. However, depending on the kernel module, you might be able to use the latest Solaris kernel module version with the Solaris 10 user-level application.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/zones/brand/brand-solaris10
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcpio\fR(1), \fBmdb\fR(1), \fBpax\fR(1), \fBzlogin\fR(1), \fBdtrace\fR(1M), \fBufsdump\fR(1M), \fBzfs\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBflash_archive\fR(4), \fBattributes\fR(5), \fBbrands\fR(5), \fBzones\fR(5)
