Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/trusted_extensions.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.TH trusted_extensions 5 "12 Nov 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
trusted_extensions \- Solaris Trusted Extensions
.SH DESCRIPTION
.sp
.LP
Solaris\u\s-2TM\s+2\d Trusted Extensions software is a specific configuration of the Solaris Operating System (Solaris OS). Solaris Trusted Extensions (Trusted Extensions) provides labels for local objects and processes, for the desktop and windowing system, for zones and file systems, and for network communications. These labels are used to implement a Multilevel Security (MLS) policy that restricts the flow of information based on label relationships. In contrast to Discretionary Access Control (DAC) based on ownership, the MLS policy enforced by Trusted Extensions is an example of Mandatory Access Control (MAC).
.sp
.LP
By default, Trusted Extensions software is disabled. It is enabled and disabled (but not configured) by the \fBlabeld\fR(1M) service, identified by the FMRI:
.sp
.in +2
.nf
svc:/system/labeld:default
.fi
.in -2
.sp

.sp
.LP
Refer to the Administrator's Guide listed below for the required configuration of Trusted Extensions software necessary before use. The system must be rebooted after enabling or disabling \fBlabeld\fR to activate or deactivate Trusted Extensions software.
.SH SEE ALSO
.sp
.LP
\fBlabeld\fR(1M), \fBlabel_encodings\fR(4), \fBlabels\fR(5)
.sp
.LP
\fIOracle Solaris Trusted Extensions Configuration and Administration\fR
.sp
.LP
\fIOracle Solaris Trusted Extensions User Guide\fR
