Arquivotheca/solaris11/usr/man/man/usr/share/man/man5/wbem.5
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH wbem 5 "11 Nov 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
wbem \- Web-Based Enterprise Management
.SH DESCRIPTION
.sp
.LP
Web-Based Enterprise Management (\fBWBEM\fR) is a set of management and Internet-related technologies intended to unify the management of enterprise computing environments. Developed by the Distributed Management Task Force (\fBDMTF\fR), \fBWBEM\fR enables organizations to deliver an integrated set of standards-based management tools that support and promote World Wide Web technology. The \fBDMTF\fR has developed a set of standards that make up \fBWBEM\fR. This set of standards includes:
.SS "Common Information Model (\fBCIM\fR)"
.sp
.LP
CIM is an object-oriented data model that describes the overall management of information in an enterprise network environment. \fBCIM\fR consists of a \fBCIM\fR specification and a \fBCIM\fR schema:
.sp
.ne 2
.mk
.na
\fB\fBCIM\fR Specification\fR
.ad
.RS 21n
.rt  
Consists of the language and methodology that describes management data.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCIM\fR Schema\fR
.ad
.RS 21n
.rt  
Provides actual model descriptions of systems, applications, large area networks, and devices. The \fBCIM\fR Schema enables applications from different developers on different platforms to describe management data in a standard format. As a result, a variety of management applications can share this information.
.RE

.sp
.LP
\fBCIM\fR Operations Over HyperText Transport Protocol (\fBHTTP\fR) 1.1 is a transport mechanism that maps CIM operations to \fBHTTP\fR to allow implementations of \fBCIM\fR to interoperate in an open, standardized manner.
.sp
.LP
\fBCIM\fR Operations Over \fBHTTP\fR 1.1 uses eXtensible Markup Language (\fBXML\fR), which is a markup language that represents management information in textual form.
.sp
.LP
In addition to the \fBXML\fR representation, \fBCIM\fR information is also represented textually by the managed object format (\fBMOF\fR). These \fBMOF\fR representations are typically stored as text files that developers compile into a \fBCIM\fR Object Manager.
.SS "WBEM Tools and Services"
.sp
.LP
Tools and services that enable developers to create and Services management applications and instrumentation that manage heterogeneous computer environments include:
.RS +4
.TP
.ie t \(bu
.el o
Solaris \fBWBEM\fR Services
.RE
.RS +4
.TP
.ie t \(bu
.el o
Solaris \fBWBEM\fR Software Development Kit (\fBSDK\fR)
.RE
.SS "Solaris WBEM Services"
.sp
.LP
These services consist of a set of value-added Services components. These services make it easier for developers to create management applications that run in the Solaris operating environment. They also make the Solaris operating environment easier to manage. Solaris \fBWBEM\fR Services consists of:
.RS +4
.TP
.ie t \(bu
.el o
\fBCIM\fR Object Manager, \fBCIM\fR Repository, and \fBMOF\fR Compiler
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBCIM\fR and Solaris Schema, which is an extension schema of \fBCIM\fR. \fBCIM\fR and Solaris Schema is a collection of \fBCIM\fR classes that describe managed elements in the Solaris operating environment. These classes are available from the \fBCIM\fR Object Manager at start up.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Solaris Providers, which are programs that communicate information between the Solaris operating environment and the \fBCIM\fR Object Manager (providers get and set dynamic information about managed elements, acting as an intermediary between the \fBCIM\fR Object Manager and the managed elements).
.sp
Solaris software providers have been developed for a variety of areas: users, roles, file systems, and network configuration, for example. A remote provider is also available to distribute agents away from the \fBCIM\fR Object Manager when required. Because of the incremental development capabilities of the \fBWBEM\fR instrumentation framework, developers can progressively and consistently add more providers for additional Solaris software services.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSNMP\fR Adapter for \fBWBEM\fR, which enables Simple Network Management Protocol (\fBSNMP\fR) management applications to access system management information that is provided by Solaris \fBWBEM\fR Services. Used with the Solstice Enterprise Agent (\fBSEA\fR) Master Agent \fBsnmpdx\fR(1M), the \fBSNMP\fR Adapter for \fBWBEM\fR maps \fBSNMP\fR requests into equivalent \fBWBEM\fR Common Information Model (\fBCIM\fR) properties or instances.
.sp
The \fBSNMP\fR Adapter for \fBWBEM\fR also remaps the response from the \fBCIM\fR Object Manager into an \fBSNMP\fR response, which is returned to the management application.
.sp
A mapping file contains the corresponding Object Identifier (\fBOID\fR), class name, property name, and Abstract Syntax Notation One (\fBASN\fR.1) type for each object. Developers can create their own mapping files.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSNMP\fR Provider, which enables \fBWBEM\fR services to deliver \fBSNMP\fR information.
.RE
.SS "Solaris \fBWBEM\fR \fBSDK\fR"
.sp
.LP
The Solaris \fBWBEM\fR \fBSDK\fR is a set of application programming interfaces (\fBAPI\fRs) that contain the components necessary to write management applications. These applications communicate with \fBWBEM\fR-enabled management devices by using \fBXML\fR and \fBHTTP\fR communication standards.
.sp
.LP
Solaris \fBWBEM\fR applications request information or services from the Common Information Model (\fBCIM\fR) Object Manager through the \fBWBEM\fR \fBAPI\fRs. These \fBAPI\fRs represent \fBCIM\fR objects as Java classes. The \fBAPI\fRs are used to describe managed objects and to retrieve information about managed objects in a system environment. The advantage of modeling managed resources by using \fBCIM\fR is that those objects can be shared across any system that is \fBCIM\fR-compliant.
.sp
.LP
For more information on the Solaris \fBWBEM\fR \fBSDK\fR, see the \fISolaris \fBWBEM\fR Developer's Guide\fR. The Solaris \fBWBEM\fR \fBAPI\fR documentation is available in Javadoc format with the Solaris OS installation at \fB/usr/sadm/lib/wbem/doc/index.html\fR.
.SS "Compatibility of Solaris WBEM Services with Existing Protocols"
.sp
.LP
Adapters and converters enable Solaris \fBWBEM\fR Services of Solaris to work compatibly with existing protocols by mapping \fBWBEM\fR information to these protocols. One such protocol is Simple Network Management Protocol (\fBSNMP\fR).
.sp
.LP
Legacy management applications can administer \fBWBEM\fR-enabled software in the Solaris operating environment. Developers can write agents or providers that convert information from these protocols to \fBWBEM\fR, and they can write adapters that convert \fBWBEM\fR information into these protocols.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySPARC and x86
_
ArchitectureT{
SUNWwbapi, SUNWwbco, SUNWwbco, SUNWwbdev, SUNWwbdoc, SUNWwbpro
T}
_
CSIEnabled
.TE

.SH SEE ALSO
.sp
.LP
\fBappletviewer\fR(1), \fBcimworkshop\fR(1M), \fBinit.wbem\fR(1M), \fBmofcomp\fR(1M), \fBmofreg\fR(1M), \fBsnmpdx\fR(1M), \fBwbemadmin\fR(1M), \fBwbemconfig\fR(1M), \fBwbemlogviewer\fR(1M), \fBattributes\fR(5)
