Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/file.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved 
.\" Copyright (c) 2006, 2010, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at  http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.  This notice shall appear on any product containing this material.
.TH file 1 "8 Dec 2010" "SunOS 5.11" "User Commands"
.SH NAME
file \- determine file type
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfile\fR utility performs a series of tests on each file supplied by \fIfile\fR and, optionally, on each file listed in \fIffile\fR in an attempt to classify it. If the file is not a regular file, its file type is identified. The file types directory, \fBFIFO\fR, block special, and character special are identified as such. If the file is a regular file and the file is zero-length, it is identified as an empty file.
.sp
.LP
If \fIfile\fR appears to be a text file, \fBfile\fR examines the first 512 bytes and tries to determine its programming language. If \fIfile\fR is a symbolic link, by default the link is followed and \fBfile\fR tests the file to which the symbolic link refers.
.sp
.LP
If \fIfile\fR is a relocatable object, executable, or shared object, \fBfile\fR prints out information about the file's execution requirements. This information includes the machine class, byte-ordering, static/dynamic linkage, and any software or hardware capability requirements. If \fIfile\fR is a runtime linking configuration file, \fBfile\fR prints information about the target platform, including the machine class and byte-ordering.
.sp
.LP
By default, \fBfile\fR will try to use the localized magic file \fB/usr/lib/locale/\fIlocale\fR/LC_MESSAGES/magic\fR, if it exists, to identify files that have a magic number. For example, in the Japanese locale, \fBfile\fR will try to use \fB/usr/lib/locale/ja/LC_MESSAGES/magic\fR. If a localized magic file does not exist, \fBfile\fR will utilize \fB/etc/magic\fR. A magic number is a numeric or string constant that indicates the file type. See \fBmagic\fR(4) for an explanation of the format of \fB/etc/magic\fR.
.sp
.LP
If \fIfile\fR does not exist, cannot be read, or its file status could not be determined, it is not considered an error that affects the exit status. The output will indicate that the file was processed, but that its type could not be determined.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 12n
.rt  
Checks the magic file for format errors. For reasons of efficiency, this validation is normally not carried out.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 12n
.rt  
Applies any position-sensitive and context-sensitive default system tests to the file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIffile\fR\fR
.ad
.RS 12n
.rt  
\fIffile\fR contains a list of the files to be examined.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 12n
.rt  
When a symbolic link is encountered, this option identifies the file as a symbolic link. If \fB-h\fR is not specified and \fIfile\fR is a symbolic link that refers to a non-existent file, the \fBfile\fR utility identifies the file as a symbolic link, as if \fB-h\fR had been specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 12n
.rt  
If a file is a regular file, this option does not attempt to classify the type of file further, but identifies the file as a "regular file".
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImfile\fR\fR
.ad
.RS 12n
.rt  
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/file\fR\fR
.ad
.RS 22n
.rt  
Uses \fImfile\fR as an alternate magic file, instead of \fB/etc/magic\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/xpg4/bin/file\fR\fR
.ad
.RS 22n
.rt  
Specifies the name of a file containing position-sensitive tests that are applied to a file in order to classify it (see \fBmagic\fR(4)). If the \fB-m\fR option is specified without specifying the \fB-d\fR option or the \fB-M\fR option, position-sensitive default system tests are applied after the position-sensitive tests specified by the \fB-m\fR option.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fIMfile\fR\fR
.ad
.RS 12n
.rt  
Specifies the name of a file containing position-sensitive tests that are applied to a file in order to classify it (see \fBmagic\fR(4)). No position-sensitive default system tests nor context-sensitive default system tests are applied unless the \fB-d\fR option is also specified.
.RE

.sp
.LP
If the \fB-M\fR option is specified with the \fB-d\fR option, the \fB-m\fR option, or both, or if the \fB-m\fR option is specified with the \fB-d\fR option, the concatenation of the position-sensitive tests specified by these options is applied in the order specified by the appearance of these options.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
A path name of a file to be tested.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBfile\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
\fBExample 1 \fRDetermining if an Argument is a Binary Executable Files
.sp
.LP
The following example determine if an argument is a binary executable file:

.sp
.in +2
.nf
file "$1" | grep \(miFq executable &&
          printf "%s is executable.\n" "$1"
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables that affect the execution of \fBfile\fR: \fBLANG\fR, \fBLC_ALL\fR, \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, and \fBNLSPATH\fR.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/magic\fR\fR
.ad
.RS 14n
.rt  
\fBfile\fR's magic number file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
CSIEnabled
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
\fBcrle\fR(1), \fBelfdump\fR(1), \fBelffile\fR(1), \fBls\fR(1), \fBmagic\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH NOTES
.sp
.LP
The \fBfile\fR utility cannot examine archive members unless they are first extracted from the archive into a separate file. The \fBelffile\fR utility can examine archive members in place, and is recommended for use with \fBELF\fR objects and archives.
