Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/ld.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1998, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ld 1 "28 Mar 2011" "SunOS 5.11" "User Commands"
.SH NAME
ld \- link-editor for object files
.SH SYNOPSIS
.LP
.nf
\fBld\fR [\fB-32\fR | \fB-64\fR] [\fB-a\fR | \fB-r\fR] [\fB-b\fR] [\fB-B\fRdirect | nodirect]
[\fB-B\fR dynamic | static] [\fB-B\fR eliminate] [\fB-B\fR group] [\fB-B\fR local]
[\fB-B\fR reduce] [\fB-B\fR symbolic] [\fB-c\fR \fIname\fR] [\fB-C\fR] [\fB-d\fR y | n]
[\fB-D\fR [\fB!\fR]\fItoken1\fR,[\fB!\fR]\fItoken2\fR,...] [\fB-e\fR \fIepsym\fR] [\fB-f\fR \fIname\fR | \fB-F\fR \fIname\fR] [\fB-G\fR]
[\fB-h\fR \fIname\fR] [\fB-i\fR] [\fB-I\fR \fIname\fR] [\fB-l\fR \fIx\fR] [\fB-L\fR \fIpath\fR] [\fB-m\fR] [\fB-M\fR \fImapfile\fR]
[\fB-N\fR \fIstring\fR] [\fB-o\fR \fIoutfile\fR] [\fB-p\fR \fIauditlib\fR] [\fB-P\fR \fIauditlib\fR]
[\fB-Q\fR y | n] [\fB-R\fR \fIpath\fR] [\fB-s\fR] [\fB-S\fR \fIsupportlib\fR] [\fB-t\fR]
[\fB-u\fR \fIsymname\fR] [\fB-V\fR] [\fB-Y P\fR\fI,dirlist\fR] [\fB-z\fR absexec]
[\fB-z\fR allextract | defaultextract | weakextract ]
[\fB-z\fR altexec64] [\fB-z\fR assert-deflib[=\fIlibname\fR]]
[\fB-z\fR combreloc | nocombreloc ] [\fB-z\fR deferred | nodeferred]
[\fB-z\fR defs | nodefs] [\fB-z\fR direct | nodirect] [\fB-z\fR endfiltee]
[\fB-z\fR fatal-warnings | nofatal-warnings] [\fB-z\fR finiarray=\fIfunction\fR]
[\fB-z\fR globalaudit] [\fB-z\fR groupperm | nogroupperm]
[\fB-z\fR guidance[=\fIitem1\fR,\fIitem2\fR,...]] [\fB-z\fR help ]
[\fB-z\fR ignore | record] [\fB-z\fR initarray=\fIfunction\fR] [\fB-z\fR initfirst]
[\fB-z\fR interpose] [\fB-z\fR lazyload | nolazyload]
[\fB-z\fR ld32=\fIarg1\fR,\fIarg2\fR,...] [\fB-z\fR ld64=\fIarg1\fR,\fIarg2\fR,...]
[\fB-z\fR loadfltr] [\fB-z\fR mapfile-add=\fIname\fR] [\fB-z\fR muldefs]
[\fB-z\fR nocompstrtab] [\fB-z\fR nodefaultlib] [\fB-z\fR nodelete]
[\fB-z\fR nodlopen] [\fB-z\fR nodump] [\fB-z\fR noldynsym] [\fB-z\fR nopartial]
[\fB-z\fR noversion] [\fB-z\fR now] [\fB-z\fR origin] [\fB-z\fR preinitarray=\fIfunction\fR]
[\fB-z\fR redlocsym] [\fB-z\fR relaxreloc] [\fB-z\fR rescan-now] [\fB-z\fR rescan]
[\fB-z\fR rescan-start \fI\&...\fR \fB-z\fR rescan-end]
[\fB-z\fR strip-class=[\fB!\fR]\fIclass1\fR,[\fB!\fR]\fIclass2\fR,...]
[\fB-z\fR stub] [\fB-z\fR symbolcap] [\fB-z\fR target=sparc|x86]
[\fB-z\fR text | textwarn | textoff] [\fB-z\fR verbose] [\fB-z\fR wrap=\fIsymbol\fR]
\fIfilename\fR ...
.fi

.SH DESCRIPTION
.sp
.LP
The link-editor, \fBld\fR, combines relocatable object files by resolving symbol references to symbol definitions, together with performing relocations. \fBld\fR operates in two modes, static or dynamic, as governed by the \fB-d\fR option. In all cases, the default output of \fBld\fR is left in the file \fBa.out\fR. See NOTES.
.sp
.LP
In dynamic mode, \fB-dy\fR, the default, relocatable object files that are provided as arguments are combined to produce a dynamic executable file. This file is combined at runtime with any shared object files that are provided as arguments. If the \fB-G\fR option is specified, relocatable object files are combined to produce a shared object file. Without the \fB-G\fR option, a dynamic executable file is created.
.sp
.LP
In static mode, \fB-dn\fR, relocatable object files that are provided as arguments are combined to produce a static executable file. If the \fB-r\fR option is specified, relocatable object files are combined to produce one relocatable object file. See \fBStatic Executables\fR.
.sp
.LP
The Solaris environment uses dynamic linking to combine relocatable objects into dynamic executables and shared objects. This environment tightly couples the work of the link-editor and the runtime linker, \fBld.so.1\fR(1). Both of these utilities, together with their related technologies and utilities, are extensively documented in the \fILinker and Libraries Guide\fR.
.sp
.LP
If any argument is a library, \fBld\fR by default searches the library exactly once at the point the library is encountered on the argument list. The library can be either a shared object or relocatable archive. See \fBar.h\fR(3HEAD)).
.sp
.LP
A shared object consists of an indivisible, whole unit that has been generated by a previous link-edit of one or more input files. When the link-editor processes a shared object, the entire contents of the shared object become a logical part of the resulting output file image. The shared object is not physically copied during the link-edit as its actual inclusion is deferred until process execution. This logical inclusion means that all symbol entries defined in the shared object are made available to the link-editing process. See Chapter 4, \fIShared Objects,\fR in \fILinker and Libraries Guide\fR
.sp
.LP
For an archive library, \fBld\fR loads only those routines that define an unresolved external reference. \fBld\fR searches the symbol table of the archive library sequentially to resolve external references that can be satisfied by library members. This search is repeated until no external references can be resolved by the archive. Thus, the order of members in the library is functionally unimportant, unless multiple library members exist that define the same external symbol. Archive libraries that have interdependencies can require multiple command line definitions, or the use of one of the \fB-z\fR \fBrescan\fR options. See \fIArchive Processing\fR in \fILinker and Libraries Guide\fR.
.sp
.LP
\fBld\fR is a cross link-editor, able to link 32-bit objects or 64-bit objects, for SPARC or x86 targets. \fBld\fR uses the \fBELF\fR class and machine type of the first relocatable object on the command line to govern the mode in which to operate. The mixing of 32-bit objects and 64-bit objects is not permitted. Similarly, only objects of a single machine type are allowed. See the \fB-32\fR, \fB-64\fR and \fB-z target\fR options, and the \fBLD_NOEXEC_64\fR environment variable.
.SS "Static Executables"
.sp
.LP
The creation of static executables has been discouraged for many releases. In fact, 64-bit system archive libraries have never been provided. Because a static executable is built against system archive libraries, the executable contains system implementation details. This self-containment has a number of drawbacks.
.RS +4
.TP
.ie t \(bu
.el o
The executable is immune to the benefits of system patches delivered as shared objects. The executable therefore, must be rebuilt to take advantage of many system improvements.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The ability of the executable to run on future releases can be compromised.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The duplication of system implementation details negatively affects system performance.
.RE
.sp
.LP
With Solaris 10, 32-bit system archive libraries are no longer provided. Without these libraries, specifically \fBlibc.a\fR, the creation of static executables is no longer achievable without specialized system knowledge. However, the capability of \fBld\fR to process static linking options, and the processing of archive libraries, remains unchanged.
.SH OPTIONS
.sp
.LP
The following options are supported.
.sp
.ne 2
.mk
.na
\fB\fB-32\fR | \fB-64\fR\fR
.ad
.sp .6
.RS 4n
Creates a 32-bit, or 64-bit object.
.sp
By default, the class of the object being generated is determined from the first \fBELF\fR object processed from the command line. If no objects are specified, the class is determined by the first object encountered within the first archive processed from the command line. If there are no objects or archives, the link-editor creates a 32-bit object.
.sp
The \fB-64\fR option is required to create a 64-bit object solely from a \fBmapfile\fR.
.sp
The \fB-32\fR or \fB-64\fR options can also be used in the rare case of linking entirely from an archive that contains a mixture of 32 and 64-bit objects. If the first object in the archive is not the class of the object that is required to be created, then the \fB-32\fR or \fB-64\fR option can be used to direct the link-editor.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
In static mode only, produces a static executable file. Undefined references are not permitted. This option is the default behavior for static mode. The \fB-a\fR option can not be used with the \fB-r\fR option. See \fBStatic Executables\fR under DESCRIPTION.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, provides no special processing for dynamic executable relocations that reference symbols in shared objects. Without the \fB-b\fR option, the link-editor applies techniques within a dynamic executable so that the text segment can remain read-only. One technique is the creation of special position-independent relocations for references to functions that are defined in shared objects. Another technique arranges for data objects that are defined in shared objects to be copied into the memory image of an executable at runtime.
.sp
The \fB-b\fR option is intended for specialized dynamic objects and is not recommended for general use. Its use suppresses all specialized processing required to ensure an object's shareability, and can even prevent the relocation of 64-bit executables.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBdirect\fR | \fBnodirect\fR\fR
.ad
.sp .6
.RS 4n
These options govern direct binding. \fB-B\fR \fBdirect\fR establishes direct binding information by recording the relationship between each symbol reference together with the dependency that provides the definition. In addition, direct binding information is established between each symbol reference and an associated definition within the object being created. The runtime linker uses this information to search directly for a symbol in the associated object rather than to carry out a default symbol search.
.sp
Direct binding information can only be established to dependencies specified with the link-edit. Thus, you should use the \fB-z\fR \fBdefs\fR option. Objects that wish to interpose on symbols in a direct binding environment should identify themselves as interposers with the \fB-z\fR \fBinterpose\fR option. The use of \fB-B\fR \fBdirect\fR enables \fB-z\fR \fBlazyload\fR for all dependencies.
.sp
The \fB-B\fR \fBnodirect\fR option prevents any direct binding to the interfaces offered by the object being created. The object being created can continue to directly bind to external interfaces by specifying the \fB-z\fR \fBdirect\fR option. See Chapter 9, \fIDirect Bindings,\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBdynamic\fR | \fBstatic\fR\fR
.ad
.sp .6
.RS 4n
Options governing library inclusion. \fB-B\fR \fBdynamic\fR is valid in dynamic mode only. These options can be specified any number of times on the command line as toggles: if the \fB-B\fR \fBstatic\fR option is given, no shared objects are accepted until \fB-B\fR \fBdynamic\fR is seen. See the \fB-l\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBeliminate\fR\fR
.ad
.sp .6
.RS 4n
Causes any global symbols, not assigned to a version definition, to be eliminated from the symbol table. Version definitions can be supplied by means of a \fBmapfile\fR to indicate the global symbols that should remain visible in the generated object. This option achieves the same symbol elimination as the \fIauto-elimination\fR directive that is available as part of a \fBmapfile\fR version definition. This option can be useful when combining versioned and non-versioned relocatable objects. See also the \fB-B\fR \fBlocal\fR option and the \fB-B\fR \fBreduce\fR option. See \fISYMBOL_SCOPE / SYMBOL_VERSION Directives\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBgroup\fR\fR
.ad
.sp .6
.RS 4n
Establishes a shared object and its dependencies as a group. Objects within the group are bound to other members of the group at runtime. This mode is similar to adding the object to the process by using \fBdlopen\fR(3C) with the \fBRTLD_GROUP\fR mode. An object that has an explicit dependency on a object identified as a group, becomes a member of the group.
.sp
As the group must be self contained, use of the \fB-B\fR \fBgroup\fR option also asserts the \fB-z\fR \fBdefs\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBlocal\fR\fR
.ad
.sp .6
.RS 4n
Causes any global symbols, not assigned to a version definition, to be reduced to local. Version definitions can be supplied by means of a \fBmapfile\fR to indicate the global symbols that should remain visible in the generated object. This option achieves the same symbol reduction as the \fIauto-reduction\fR directive that is available as part of a \fBmapfile\fR version definition. This option can be useful when combining versioned and non-versioned relocatable objects. See also the \fB-B\fR \fBeliminate\fR option and the \fB-B\fR \fBreduce\fR option. See \fISYMBOL_SCOPE / SYMBOL_VERSION Directives\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBreduce\fR\fR
.ad
.sp .6
.RS 4n
When generating a relocatable object, causes the reduction of symbolic information defined by any version definitions. Version definitions can be supplied by means of a \fBmapfile\fR to indicate the global symbols that should remain visible in the generated object. By default, when a relocatable object is generated, version definitions are only recorded in the output image. The actual reduction of symbolic information is carried out when the object is used in the construction of a dynamic executable or shared object. The \fB-B\fR \fBreduce\fR option is applied automatically when a dynamic executable or shared object is created.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR \fBsymbolic\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only. When building a shared object, binds references to global symbols to their definitions, if available, within the object. Normally, references to global symbols within shared objects are not bound until runtime, even if definitions are available. This model allows definitions of the same symbol in an executable or other shared object to override the object's own definition. \fBld\fR issues warnings for undefined symbols unless \fB-z\fR \fBdefs\fR overrides.
.sp
The \fB-B\fR \fBsymbolic\fR option is intended for specialized dynamic objects and is not recommended for general use. To reduce the runtime relocation processing that is required an object, the creation of a version definition is recommended.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
Records the configuration file \fIname\fR for use at runtime. Configuration files can be employed to alter default search paths, provide a directory cache, together with providing alternative object dependencies. See \fBcrle\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
Demangles C++ symbol names displayed in diagnostic messages.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBy\fR | \fBn\fR\fR
.ad
.sp .6
.RS 4n
When \fB-d\fR \fBy\fR, the default, is specified, \fBld\fR uses dynamic linking. When \fB-d\fR \fBn\fR is specified, \fBld\fR uses static linking. See \fBStatic Executables\fR under DESCRIPTION, and \fB-B\fR \fBdynamic\fR|\fBstatic\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR [\fB!\fR]\fItoken1\fR,[\fB!\fR]\fItoken2\fR,...\fR
.ad
.sp .6
.RS 4n
Prints debugging information as specified by each \fItoken\fR, to the standard error. The special token \fBhelp\fR indicates the full list of tokens available. See \fIDebugging Aids\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIepsym\fR\fR
.ad
.br
.na
\fB\fB--entry\fR \fIepsym\fR\fR
.ad
.sp .6
.RS 4n
Sets the entry point address for the output file to be the symbol \fIepsym\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIname\fR\fR
.ad
.br
.na
\fB\fB--auxiliary\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
Useful only when building a shared object. Specifies that the symbol table of the shared object is used as an auxiliary filter on the symbol table of the shared object specified by \fIname\fR. Multiple instances of this option are allowed. This option can not be combined with the \fB-F\fR option. See \fIGenerating Auxiliary Filters\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIname\fR\fR
.ad
.br
.na
\fB\fB--filter\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
Useful only when building a shared object. Specifies that the symbol table of the shared object is used as a filter on the symbol table of the shared object specified by \fIname\fR. Multiple instances of this option are allowed. This option can not be combined with the \fB-f\fR option. See \fIGenerating Standard Filters\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR\fR
.ad
.br
.na
\fB\fB-shared\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, produces a shared object. Undefined symbols are allowed. See Chapter 4, \fIShared Objects,\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIname\fR\fR
.ad
.br
.na
\fB\fB--soname\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, when building a shared object, records \fIname\fR in the object's dynamic section. \fIname\fR is recorded in any dynamic objects that are linked with this object rather than the object's file system name. Accordingly, \fIname\fR is used by the runtime linker as the name of the shared object to search for at runtime. See \fIRecording a Shared Object Name\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
Ignores \fBLD_LIBRARY_PATH\fR. This option is useful when an \fBLD_LIBRARY_PATH\fR setting is in effect to influence the runtime library search, which would interfere with the link-editing being performed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIname\fR\fR
.ad
.br
.na
\fB\fB--dynamic-linker\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
When building an executable, uses \fIname\fR as the path name of the interpreter to be written into the program header. The default in static mode is no interpreter. In dynamic mode, the default is the name of the runtime linker, \fBld.so.1\fR(1). Either case can be overridden by \fB-I\fR \fIname\fR. \fBexec\fR(2) loads this interpreter when the \fBa.out\fR is loaded, and passes control to the interpreter rather than to the \fBa.out\fR directly.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIx\fR\fR
.ad
.br
.na
\fB\fB--library\fR \fIx\fR\fR
.ad
.sp .6
.RS 4n
Searches a library \fBlib\fR\fIx\fR\fB\&.so\fR or \fBlib\fR\fIx\fR\fB\&.a\fR, the conventional names for shared object and archive libraries, respectively. In dynamic mode, unless the \fB-B\fR \fBstatic\fR option is in effect, \fBld\fR searches each directory specified in the library search path for a \fBlib\fR\fIx\fR\fB\&.so\fR or \fBlib\fR\fIx\fR\fB\&.a\fR file. The directory search stops at the first directory containing either. \fBld\fR chooses the file ending in \fB\&.so\fR if \fB-l\fR\fIx\fR expands to two files with names of the form \fBlib\fR\fIx\fR\fB\&.so\fR and \fBlib\fR\fIx\fR\fB\&.a\fR. If no \fBlib\fR\fIx\fR\fB\&.so\fR is found, then \fBld\fR accepts \fBlib\fR\fIx\fR\fB\&.a\fR. In static mode, or when the \fB-B\fR \fBstatic\fR option is in effect, \fBld\fR selects only the file ending in \fB\&.a\fR. \fBld\fR searches a library when the library is encountered, so the placement of \fB-l\fR is significant. See \fILinking With Additional Libraries\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIpath\fR\fR
.ad
.br
.na
\fB\fB--library-path\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Adds \fIpath\fR to the library search directories. \fBld\fR searches for libraries first in any directories specified by the \fB-L\fR options and then in the standard directories. This option is useful only if the option precedes the \fB-l\fR options to which the \fB-L\fR option applies. See \fIDirectories Searched by the Link-Editor\fR in \fILinker and Libraries Guide\fR.
.sp
The environment variable \fBLD_LIBRARY_PATH\fR can be used to supplement the library search path, however the \fB-L\fR option is recommended, as the environment variable is also interpreted by the runtime environment. See \fBLD_LIBRARY_PATH\fR under ENVIRONMENT VARIABLES.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Produces a memory map or listing of the input/output sections, together with any non-fatal multiply-defined symbols, on the standard output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fImapfile\fR\fR
.ad
.sp .6
.RS 4n
Reads \fImapfile\fR as a text file of directives to \fBld\fR. This option can be specified multiple times. If \fImapfile\fR is a directory, then all regular files, as defined by \fBstat\fR(2), within the directory are processed. See Appendix B, \fISystem V Release 4 (Version 1) Mapfiles,\fR in \fILinker and Libraries Guide\fR. Example mapfiles are provided in \fB/usr/lib/ld\fR. See FILES.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR \fIstring\fR\fR
.ad
.sp .6
.RS 4n
This option causes a \fBDT_NEEDED\fR entry to be added to the \fB\&.dynamic\fR section of the object being built. The value of the \fBDT_NEEDED\fR string is the \fIstring\fR that is specified on the command line. This option is position dependent, and the \fBDT_NEEDED\fR \fB\&.dynamic\fR entry is relative to the other dynamic dependencies discovered on the link-edit line. This option is useful for specifying dependencies within device driver relocatable objects when combined with the \fB-dy\fR and \fB-r\fR options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIoutfile\fR\fR
.ad
.br
.na
\fB\fB--output\fR \fIoutfile\fR\fR
.ad
.sp .6
.RS 4n
Produces an output object file that is named \fIoutfile\fR. The name of the default object file is \fBa.out\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIauditlib\fR\fR
.ad
.sp .6
.RS 4n
Identifies an audit library, \fIauditlib\fR. This audit library is used to audit the object being created at runtime. A shared object identified as requiring auditing with the \fB-p\fR option, has this requirement inherited by any object that specifies the shared object as a dependency. See the \fB-P\fR option. See \fIRuntime Linker Auditing Interface\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIauditlib\fR\fR
.ad
.sp .6
.RS 4n
Identifies an audit library, \fIauditlib\fR. This audit library is used to audit the dependencies of the object being created at runtime. Dependency auditing can also be inherited from dependencies that are identified as requiring auditing. See the \fB-p\fR option, and the \fB-z\fR \fBglobalaudit\fR option. See \fIRuntime Linker Auditing Interface\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Q\fR \fBy\fR | \fBn\fR\fR
.ad
.sp .6
.RS 4n
Under \fB-Q\fR \fBy\fR, an \fBident\fR string is added to the \fB\&.comment\fR section of the output file. This string identifies the version of the \fBld\fR used to create the file. This results in multiple \fBld\fR \fBidents\fR when there have been multiple linking steps, such as when using \fBld\fR \fB-r\fR. This identification is identical with the default action of the \fBcc\fR command. \fB-Q\fR \fBn\fR suppresses version identification. \fB\&.comment\fR sections can be manipulated by the \fBmcs\fR(1) utility.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.br
.na
\fB\fB--relocatable\fR\fR
.ad
.sp .6
.RS 4n
Combines relocatable objects to produce one relocatable object file. \fBld\fR does not complain about unresolved references. This option cannot be used with the \fB-a\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIpath\fR\fR
.ad
.br
.na
\fB\fB-rpath\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
A colon-separated list of directories used to specify library search directories to the runtime linker. If present and not NULL, the path is recorded in the output object file and passed to the runtime linker. Multiple instances of this option are concatenated together with each \fIpath\fR separated by a colon. See \fIDirectories Searched by the Runtime Linker\fR in \fILinker and Libraries Guide\fR.
.sp
The use of a runpath within an associated object is preferable to setting global search paths such as through the \fBLD_LIBRARY_PATH\fR environment variable. Only the runpaths that are necessary to find the objects dependencies should be recorded. \fBldd\fR(1) can also be used to discover unused runpaths in dynamic objects, when used with the \fB-U\fR option.
.sp
Various tokens can also be supplied with a runpath that provide a flexible means of identifying system capabilities or an objects location. See Chapter 6, \fIEstablishing Dependencies with Dynamic String Tokens,\fR in \fILinker and Libraries Guide\fR. The \fB$ORIGIN\fR token is especially useful in allowing dynamic objects to be relocated to different locations in the file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--strip-all\fR\fR
.ad
.sp .6
.RS 4n
Strip any symbolic information from the output file. These options are equivalent to using the \fB-z strip-class\fR option with the \fBdebug\fR and \fBsymbol\fR class identifiers. See also the \fB-z\fR \fBredlocsym\fR and \fB-z\fR \fBnoldynsym\fR options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIsupportlib\fR\fR
.ad
.sp .6
.RS 4n
The shared object \fIsupportlib\fR is loaded with \fBld\fR and given information regarding the linking process. Shared objects that are defined by using the \fB-S\fR option can also be supplied using the \fBSGS_SUPPORT\fR environment variable. See \fILink-Editor Support Interface\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Turns off the warning for multiply-defined symbols that have different sizes or different alignments.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIsymname\fR\fR
.ad
.br
.na
\fB\fB--undefined\fR \fIsymname\fR\fR
.ad
.sp .6
.RS 4n
Enters \fIsymname\fR as an undefined symbol in the symbol table. This option is useful for loading entirely from an archive library. In this instance, an unresolved reference is needed to force the loading of the first routine. The placement of this option on the command line is significant. This option must be placed before the library that defines the symbol. See \fIDefining Additional Symbols with the -u option\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.br
.na
\fB\fB--version\fR\fR
.ad
.sp .6
.RS 4n
Outputs a message giving information about the version of \fBld\fR being used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Y\fR \fBP,\fR\fIdirlist\fR\fR
.ad
.sp .6
.RS 4n
Changes the default directories used for finding libraries. \fIdirlist\fR is a colon-separated path list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBabsexec\fR\fR
.ad
.sp .6
.RS 4n
Useful only when building a dynamic executable. Specifies that references to external absolute symbols should be resolved immediately instead of being left for resolution at runtime. In very specialized circumstances, this option removes text relocations that can result in excessive swap space demands by an executable.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBallextract\fR | \fBdefaultextract\fR | \fBweakextract\fR\fR
.ad
.br
.na
\fB\fB--whole-archive\fR | \fB--no-whole-archive\fR\fR
.ad
.sp .6
.RS 4n
Alters the extraction criteria of objects from any archives that follow. By default, archive members are extracted to satisfy undefined references and to promote tentative definitions with data definitions. Weak symbol references do not trigger extraction. Under the \fB-z\fR \fBallextract\fR or \fB--whole-archive\fR options, all archive members are extracted from the archive. Under \fB-z\fR \fBweakextract\fR, weak references trigger archive extraction. The \fB-z\fR \fBdefaultextract\fR or \fB--no-whole-archive\fR options provide a means of returning to the default following use of the former extract options. See \fIArchive Processing\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBaltexec64\fR\fR
.ad
.sp .6
.RS 4n
Execute the 64-bit \fBld\fR. Historically, the class of link-editor that was executed was determined by the class of \fBELF\fR object being created. Now, the class of the link-editor that is executed is determined by the class of the underlying system. Typically this is 64-bit. This option is maintained for backward compatibility.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBassert-deflib=[\fIlibname\fR]\fR\fR
.ad
.sp .6
.RS 4n
Enables warning messages for libraries specified with the \fB-l\fR command line option that are found by examining the default search paths provided by the link-editor. If a \fIlibname\fR value is provided, the default library warning feature is enabled, and the specified library is added to a list of libraries for which no warnings will be issued. Multiple \fB-z\fR \fBassert-deflib\fR options can be specified in order to specify multiple libraries for which warnings should not be issued. 
.sp
The \fIlibname\fR value should be the name of the library file, as found by the link-editor, without any path components. For example, the following enables default library warnings, and excludes the standard C library.
.sp
.in +2
.nf
\fBld ... -z assert-deflib=libc.so ...\fR
.fi
.in -2
.sp

\fB-z\fR \fBassert-deflib\fR is a specialized option, primarily of interest in build environments where multiple objects with the same name exist and tight control over the library used is required. If is not intended for general use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBcombreloc\fR | \fBnocombreloc\fR\fR
.ad
.sp .6
.RS 4n
By default, \fBld\fR combines multiple relocation sections when building executables or shared objects. This section combination differs from relocatable objects, in which relocation sections are maintained in a one-to-one relationship with the sections to which the relocations must be applied. The \fB-z\fR \fBnocombreloc\fR option disables this merging of relocation sections, and preserves the one-to-one relationship found in the original relocatable objects.
.sp
\fBld\fR sorts the entries of data relocation sections by their symbol reference. This sorting reduces runtime symbol lookup. When multiple relocation sections are combined, this sorting produces the least possible relocation overhead when objects are loaded into memory, and speeds the runtime loading of dynamic objects.
.sp
Historically, the individual relocation sections were carried over to any executable or shared object, and the \fB-z\fR \fBcombreloc\fR option was required to enable the relocation section merging previously described. Relocation section merging is now the default. The \fB-z\fR \fBcombreloc\fR option is still accepted for the benefit of old build environments, but the option is unnecessary, and has no effect.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBdeferred\fR | \fBnodeferred\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables the marking of dynamic dependencies as deferred. Dynamic dependencies which are marked \fBdeferred\fR, are also marked as lazy loadable, and are not loaded at initial process start-up. The loading of deferred dependencies is delayed until process execution, when the first binding to a deferred reference is made. Unlike basic lazy loadable dependencies, deferred dependencies are not processed as part of \fBLD_BIND_NOW\fR processing, or through \fBdlopen\fR(3C) with the \fBRTLD_NOW\fR flag. See \fILazy Loading of Dynamic Dependencies\fR in \fILinker and Libraries Guide\fR.
.sp
The use of deferred dependencies, together with \fBdlsym\fR(3C) and the \fBRTLD_PROBE\fR handle, provides a flexible mechanism, and natural coding style, for testing for functionality.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBdefs\fR | \fBnodefs\fR\fR
.ad
.br
.na
\fB\fB--no-undefined\fR\fR
.ad
.sp .6
.RS 4n
The \fB-z\fR \fBdefs\fR option and the \fB--no-undefined\fR option force a fatal error if any undefined symbols remain at the end of the link. This mode is the default when an executable is built. For historic reasons, this mode is \fBnot\fR the default when building a shared object. Use of the \fB-z\fR \fBdefs\fR option is recommended, as this mode assures the object being built is self-contained. A self-contained object has all symbolic references resolved internally, or to the object's immediate dependencies.
.sp
The \fB-z\fR \fBnodefs\fR option allows undefined symbols. For historic reasons, this mode is the default when a shared object is built. When used with executables, the behavior of references to such undefined symbols is unspecified. Use of the \fB-z\fR \fBnodefs\fR option is not recommended.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBdirect\fR | \fBnodirect\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables direct binding to any dependencies that follow on the command line. These options allow finer control over direct binding than the global counterpart \fB-B\fR \fBdirect\fR. The \fB-z\fR \fBdirect\fR option also differs from the \fB-B\fR \fBdirect\fR option in the following areas. Direct binding information is not established between a symbol reference and an associated definition within the object being created. Lazy loading is not enabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBendfiltee\fR\fR
.ad
.sp .6
.RS 4n
Marks a filtee so that when processed by a filter, the filtee terminates any further filtee searches by the filter. See \fIReducing Filtee Searches\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBfatal-warnings\fR | \fBnofatal-warnings\fR\fR
.ad
.br
.na
\fB\fB--fatal-warnings\fR | \fB--no-fatal-warnings\fR\fR
.ad
.sp .6
.RS 4n
The \fB-z\fR \fBfatal-warnings\fR and the \fB--fatal-warnings\fR option cause the link-editor to treat warnings as fatal errors.
.sp
The \fB-z\fR \fBnofatal-warnings\fR and the \fB--no-fatal-warnings\fR option cause the link-editor to treat warnings as non-fatal. This is the default behavior.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBfiniarray=\fR\fIfunction\fR\fR
.ad
.sp .6
.RS 4n
Appends an entry to the \fB\&.fini_array\fR section of the object being built. If no \fB\&.fini_array\fR section is present, a section is created. The new entry is initialized to point to \fIfunction\fR. See \fIInitialization and Termination Sections\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBglobalaudit\fR\fR
.ad
.sp .6
.RS 4n
This option supplements an audit library definition that has been recorded with the \fB-P\fR option. This option is only meaningful when building a dynamic executable. Audit libraries that are defined within an object with the \fB-P\fR option typically allow for the auditing of the immediate dependencies of the object. The \fB-z\fR \fBglobalaudit\fR promotes the auditor to a global auditor, thus allowing the auditing of all dependencies. See \fIInvoking the Auditing Interface\fR in \fILinker and Libraries Guide\fR.
.sp
An auditor established with the \fB-P\fR option and the \fB-z\fR \fBglobalaudit\fR option, is equivalent to the auditor being established with the \fBLD_AUDIT\fR environment variable. See \fBld.so.1\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBgroupperm\fR | \fBnogroupperm\fR\fR
.ad
.sp .6
.RS 4n
Assigns, or deassigns each dependency that follows to a unique group. The assignment of a dependency to a group has the same effect as if the dependency had been built using the \fB-B\fR \fBgroup\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBguidance[=\fR\fIitem1\fR\fB,\fR\fIitem2\fR\fB,...]\fR\fR
.ad
.sp .6
.RS 4n
Provide guidance messages to suggest \fBld\fR options that can improve the quality of the resulting object, or which are otherwise considered to be beneficial. The specific guidance offered is subject to change over time as the system evolves. Obsolete guidance offered by older versions of \fBld\fR may be dropped in new versions. Similarly, new guidance may be added to new versions of \fBld\fR. Guidance therefore always represents current best practices.
.sp
It is possible to enable guidance, while preventing specific guidance messages, by providing a list of \fIitem\fR tokens, representing the class of guidance to be suppressed. In this way, unwanted advice can be suppressed without losing the benefit of other guidance. Unrecognized \fIitem\fR tokens are quietly ignored by \fBld\fR, allowing a given \fBld\fR command line to be executed on a variety of older or newer versions of Solaris.
.sp
The guidance offered by the current version of \fBld\fR, and the \fIitem\fR tokens used to disable these messages, are as follows.
.sp
.ne 2
.mk
.na
\fBSpecify Required Dependencies\fR
.ad
.sp .6
.RS 4n
Dynamic executables and shared objects should explicitly define all of the dependencies they require. Guidance recommends the use of the \fB-z\fR \fBdefs\fR option, should any symbol references remain unsatisfied when building dynamic objects. This guidance can be disabled with \fB-z\fR \fBguidance=nodefs\fR.
.RE

.sp
.ne 2
.mk
.na
\fBDo Not Specify Non-Required Dependencies\fR
.ad
.sp .6
.RS 4n
Dynamic executables and shared objects should not define any dependencies that do not satisfy the symbol references made by the dynamic object. Guidance recommends that unused dependencies be removed. This guidance can be disabled with \fB-z\fR \fBguidance=nounused\fR.
.RE

.sp
.ne 2
.mk
.na
\fBLazy Loading\fR
.ad
.sp .6
.RS 4n
Dependencies should be identified for lazy loading. Guidance recommends the use of the \fB-z\fR \fBlazyload\fR option should any dependency be processed before either a \fB-z\fR \fBlazyload\fR or \fB-z\fR \fBnolazyload\fR option is encountered. This guidance can be disabled with \fB-z\fR \fBguidance=nolazyload\fR.
.RE

.sp
.ne 2
.mk
.na
\fBDirect Bindings\fR
.ad
.sp .6
.RS 4n
Dependencies should be referenced with direct bindings. Guidance recommends the use of the \fB-B\fR \fBdirect\fR, or \fB-z\fR \fBdirect\fR options should any dependency be processed before either of these options, or the \fB-z\fR \fBnodirect\fR option is encountered. This guidance can be disabled with \fB-z\fR \fBguidance=nodirect\fR.
.RE

.sp
.ne 2
.mk
.na
\fBPure Text Segment\fR
.ad
.sp .6
.RS 4n
Dynamic objects should not contain relocations to non-writable, allocable sections. Guidance recommends compiling objects with Position Independent Code (PIC) should any relocations against the text segment remain, and neither the \fB-z\fR \fBtextwarn\fR or \fB-z\fR \fBtextoff\fR options are encountered. This guidance can be disabled with \fB-z\fR \fBguidance=notext\fR.
.RE

.sp
.ne 2
.mk
.na
\fBMapfile Syntax\fR
.ad
.sp .6
.RS 4n
All mapfiles should use the version 2 mapfile syntax. Guidance recommends the use of the version 2 syntax should any mapfiles be encountered that use the version 1 syntax. This guidance can be disabled with \fB-z\fR \fBguidance=nomapfile\fR.
.RE

.sp
.ne 2
.mk
.na
\fBLibrary Search Path\fR
.ad
.sp .6
.RS 4n
Inappropriate dependencies that are encountered by \fBld\fR are quietly ignored. For example, a 32-bit dependency that is encountered when generating a 64-bit object is ignored. These dependencies can result from incorrect search path settings, such as supplying an incorrect \fB-L\fR option. Although benign, this dependency processing is wasteful, and might hide a build problem that should be solved. Guidance recommends the removal of any inappropriate dependencies. This guidance can be disabled with \fB-z\fR \fBguidance=nolibpath\fR.
.RE

In addition, \fB-z\fR \fBguidance=noall\fR can be used to entirely disable the guidance feature. Chapter 7, \fILink-Editor Quick Reference,\fR in \fILinker and Libraries Guide\fR for more information on guidance and advice for building better objects.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBhelp\fR\fR
.ad
.br
.na
\fB\fB--help\fR\fR
.ad
.sp .6
.RS 4n
Print a summary of the command line options on the standard output and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBignore\fR | \fBrecord\fR\fR
.ad
.sp .6
.RS 4n
Ignores, or records, dynamic dependencies that are not referenced as part of the link-edit. Ignores, or records, unreferenced \fBELF\fR sections from the relocatable objects that are read as part of the link-edit. By default, \fB-z\fR \fBrecord\fR is in effect.
.sp
If an \fBELF\fR section is ignored, the section is eliminated from the output file being generated. A section is ignored when three conditions are true. The eliminated section must contribute to an allocatable segment. The eliminated section must provide no global symbols. No other section from any object that contributes to the link-edit, must reference an eliminated section.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBinitarray=\fR\fIfunction\fR\fR
.ad
.sp .6
.RS 4n
Appends an entry to the \fB\&.init_array\fR section of the object being built. If no \fB\&.init_array\fR section is present, a section is created. The new entry is initialized to point to \fIfunction\fR. See \fIInitialization and Termination Sections\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBinitfirst\fR\fR
.ad
.sp .6
.RS 4n
Marks the object so that its runtime initialization occurs before the runtime initialization of any other objects brought into the process at the same time. In addition, the object runtime finalization occurs after the runtime finalization of any other objects removed from the process at the same time. This option is only meaningful when building a shared object.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBinterpose\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as an interposer. At runtime, an object is identified as an explicit interposer if the object has been tagged using the \fB-z interpose\fR option. An explicit interposer is also established when an object is loaded using the \fBLD_PRELOAD\fR environment variable. Implicit interposition can occur because of the load order of objects, however, this implicit interposition is unknown to the runtime linker. Explicit interposition can ensure that interposition takes place regardless of the order in which objects are loaded. Explicit interposition also ensures that the runtime linker searches for symbols in any explicit interposers when direct bindings are in effect.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBlazyload\fR | \fBnolazyload\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables the marking of dynamic dependencies to be lazily loaded. Dynamic dependencies which are marked \fBlazyload\fR are not loaded at initial process start-up. These dependencies are delayed until the first binding to the object is made. \fBNote:\fR Lazy loading requires the correct declaration of dependencies, together with associated runpaths for each dynamic object used within a process. See \fILazy Loading of Dynamic Dependencies\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBld32\fR=\fIarg1\fR,\fIarg2\fR,...\fR
.ad
.br
.na
\fB\fB-z\fR \fBld64\fR=\fIarg1\fR,\fIarg2\fR,...\fR
.ad
.sp .6
.RS 4n
The class of the link-editor is affected by the class of the output file being created and by the capabilities of the underlying operating system. The \fB-z\fR \fBld\fR[\fB32\fR|\fB64\fR] options provide a means of defining any link-editor argument. The defined argument is only interpreted, respectively, by the 32-bit class or 64-bit class of the link-editor.
.sp
For example, support libraries are class specific, so the correct class of support library can be ensured using:
.sp
.in +2
.nf
\fBld ... -z ld32=-Saudit32.so.1 -z ld64=-Saudit64.so.1 ...\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBloadfltr\fR\fR
.ad
.sp .6
.RS 4n
Marks a filter to indicate that filtees must be processed immediately at runtime. Normally, filter processing is delayed until a symbol reference is bound to the filter. The runtime processing of an object that contains this flag mimics that which occurs if the \fBLD_LOADFLTR\fR environment variable is in effect. See the \fBld.so.1\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBmapfile-add=\fR\fIname\fR\fR
.ad
.sp .6
.RS 4n
Adds \fIname\fR to the list of known \fBmapfile\fR conditional input expression predicates. This option is equivalent to placing the following lines at the top of the first \fBmapfile\fR read by the link-editor.
.sp
.in +2
.nf
$mapfile_version 2
$add \fIname\fR
.fi
.in -2

Names entered via \fB-z mapfile-add\fR can be used with \fBmapfile\fR \fB$if\fR and \fB$elif\fR directives to conditionally process \fBmapfile\fR input. See Chapter 10, \fIMapfiles,\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBmuldefs\fR\fR
.ad
.br
.na
\fB\fB--allow-multiple-definition\fR\fR
.ad
.sp .6
.RS 4n
Allows multiple symbol definitions. By default, multiple symbol definitions that occur between relocatable objects result in a fatal error condition. This option, suppresses the error condition, allowing the first symbol definition to be taken.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnocompstrtab\fR\fR
.ad
.sp .6
.RS 4n
Disables the compression of \fBELF\fR string tables. By default, string compression is applied to \fBSHT_STRTAB\fR sections, and to \fBSHT_PROGBITS\fR sections that have their \fBSHF_MERGE\fR and \fBSHF_STRINGS\fR section flags set.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnodefaultlib\fR\fR
.ad
.sp .6
.RS 4n
Marks the object so that the runtime default library search path, used after any \fBLD_LIBRARY_PATH\fR or runpaths, is ignored. This option implies that all dependencies of the object can be satisfied from its runpath.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnodelete\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as non-deletable at runtime. This mode is similar to adding the object to the process by using \fBdlopen\fR(3C) with the \fBRTLD_NODELETE\fR mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnodlopen\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as not available to \fBdlopen\fR(3C), either as the object specified by the \fBdlopen()\fR, or as any form of dependency required by the object specified by the \fBdlopen()\fR. This option is only meaningful when building a shared object.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnodump\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as not available to \fBdldump\fR(3C).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnoldynsym\fR\fR
.ad
.sp .6
.RS 4n
Prevents the inclusion of a \fB\&.SUNW_ldynsym\fR section in a dynamic executable or shared object. The \fB\&.SUNW_ldynsym\fR section augments the \fB\&.dynsym\fR section by providing symbols for local functions. Local function symbols allow debuggers to display local function names in stack traces from stripped programs. Similarly, \fBdladdr\fR(3C) is able to supply more accurate results.
.sp
The \fB-z\fR \fBnoldynsym\fR option also prevents the inclusion of the two symbol sort sections that are related to the \fB\&.SUNW_ldynsym\fR section. The \fB\&.SUNW_dynsymsort\fR section provides sorted access to regular function and variable symbols. The \fB\&.SUNW_dyntlssort\fR section provides sorted access to thread local storage (\fBTLS\fR) variable symbols.
.sp
The \fB\&.SUNW_ldynsym\fR, \fB\&.SUNW_dynsymsort\fR, and \fB\&.SUNW_dyntlssort\fR sections, which becomes part of the allocable text segment of the resulting file, cannot be removed by \fBstrip\fR(1). Therefore, the \fB-z\fR \fBnoldynsym\fR option is the only way to prevent their inclusion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnopartial\fR\fR
.ad
.sp .6
.RS 4n
Partially initialized symbols, that are defined within relocatable objects, are expanded in the output file being generated.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnoversion\fR\fR
.ad
.sp .6
.RS 4n
Does not record any versioning sections. Any version sections or associated \fB\&.dynamic\fR section entries are not generated in the output image.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBnow\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as requiring non-lazy runtime binding. This mode is similar to adding the object to the process by using \fBdlopen\fR(3C) with the \fBRTLD_NOW\fR mode. This mode is also similar to having the \fBLD_BIND_NOW\fR environment variable in effect. See \fBld.so.1\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBorigin\fR\fR
.ad
.sp .6
.RS 4n
Marks the object as requiring immediate \fB$ORIGIN\fR processing at runtime. This option is only maintained for historic compatibility, as the runtime analysis of objects to provide for \fB$ORIGIN\fR processing is now default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBpreinitarray=\fR\fIfunction\fR\fR
.ad
.sp .6
.RS 4n
Appends an entry to the \fB\&.preinit_array\fR section of the object being built. If no \fB\&.preinit_array\fR section is present, a section is created. The new entry is initialized to point to \fIfunction\fR. See \fIInitialization and Termination Sections\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBredlocsym\fR\fR
.ad
.sp .6
.RS 4n
Eliminates all local symbols except for the \fISECT\fR symbols from the symbol table \fBSHT_SYMTAB\fR. All relocations that refer to local symbols are updated to refer to the corresponding \fISECT\fR symbol. This option allows specialized objects to greatly reduce their symbol table sizes. See also the \fB-z\fR \fBstrip-class\fR and \fB-z\fR \fBnoldynsym\fR options.
.sp
Although useful for special objects such as those used within the operating system kernel, the \fB-z\fR \fBredlocsym\fR option is not recommended for general use. The size of the symbol table \fBSHT_SYMTAB\fR does not effect runtime behavior, and the elimination of local symbols can negatively effect process observability. Eliminated local symbols can reduce the debugging information that is generated using the compiler drivers \fB-g\fR option. Eliminated local symbols will also remove the information normally written to the \fB\&.SUNW_ldynsym\fR section, reducing the effectiveness of debuggers and tools such as \fBpstack\fR(1) and \fBtruss\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBrelaxreloc\fR\fR
.ad
.sp .6
.RS 4n
\fBld\fR normally issues a fatal error upon encountering a relocation using a symbol that references an eliminated COMDAT section. If \fB-z\fR \fBrelaxreloc\fR is enabled, \fBld\fR instead redirects such relocations to the equivalent symbol in the COMDAT section that was kept. \fB-z\fR \fBrelaxreloc\fR is a specialized option, mainly of interest to compiler authors, and is not intended for general use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBrescan-now\fR\fR
.ad
.br
.na
\fB\fB-z\fR \fBrescan\fR\fR
.ad
.sp .6
.RS 4n
These options rescan the archive files that are provided to the link-edit. By default, archives are processed once as the archives appear on the command line. Archives are traditionally specified at the end of the command line so that their symbol definitions resolve any preceding references. However, specifying archives multiple times to satisfy their own interdependencies can be necessary.
.sp
\fB-z\fR \fBrescan-now\fR is a positional option, and is processed by the link-editor immediately when encountered on the command line. All archives seen on the command line up to that point are immediately reprocessed in an attempt to locate additional archive members that resolve symbol references. This archive rescanning is repeated until a pass over the archives occurs in which no new members are extracted.
.sp
\fB-z\fR \fBrescan\fR is a position independent option. The link-editor defers the rescan operation until after it has processed the entire command line, and then initiates a final rescan operation over all archives seen on the command line. The \fB-z\fR \fBrescan\fR operation can interact incorrectly with objects that contain initialization (\&.init) or finalization (\&.fini) sections, preventing the code in those sections from running. For this reason, \fB-z\fR \fBrescan\fR is deprecated, and use of \fB-z\fR \fBrescan-now\fR is advised.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBrescan-start\fR ... \fB-z\fR \fBrescan-end\fR\fR
.ad
.br
.na
\fB\fB--start-group\fR ... \fB--end-group\fR\fR
.ad
.br
.na
\fB\fB-(\fR ... \fB-)\fR\fR
.ad
.sp .6
.RS 4n
Defines an archive rescan group. This is a positional construct, and is processed by the link-editor immediately upon encountering the closing delimiter option. Archives found within the group delimiter options are reprocessed as a group in an attempt to locate additional archive members that resolve symbol references. This archive rescanning is repeated until a pass over the archives On the occurs in which no new members are extracted. Archive rescan groups cannot be nested.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBstrip-class=\fR[\fB!\fR]\fIclass1\fR\fB,\fR[\fB!\fR]\fIclass2\fR\fB,...\fR\fR
.ad
.sp .6
.RS 4n
Strip a specific class of section from any input objects, preventing these sections from being added to the output file. This option provides fine grained control over the sections that can be omitted from the output file.
.sp
The strip classes described below only apply to non-allocatable sections.
.sp
Each class token can be prepended with a '\fB!\fR' to indicate that the class should not be removed. This definition can be useful when combined with the \fBnonalloc\fR class. For example, using '\fB-z\fR \fBstrip-class=nonalloc,!comment\fR' removes all non-allocatable sections except for the comment section.
.sp
The following classes of section can be defined.
.sp
.ne 2
.mk
.na
\fB\fBnonalloc\fR\fR
.ad
.sp .6
.RS 4n
Strip any non-allocatable section. These sections are identified as not including the \fBSHF_ALLOC\fR section flag. This class can encapsulate many of the other classes, and is often sufficient by itself to remove any unwanted sections. However, the symbol class of sections are \fBnot\fR captured by this class.
.RE

.sp
.ne 2
.mk
.na
\fB\fBannotate\fR\fR
.ad
.sp .6
.RS 4n
Strip any annotation section. These sections are identified by having a \fBSHT_SUNW_ANNOTATE\fR section type.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcomment\fR\fR
.ad
.sp .6
.RS 4n
Strip any comment section. These sections are identified by having a \fB\&.comment\fR section name. Alternatively, the \fBmcs\fR(1) command is commonly used to manipulate comment sections.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.sp .6
.RS 4n
Strip sections commonly used to contain debugging data. These sections are identified by having a \fB\&.compcom\fR, \fB\&.line\fR, \fB\&.stab*\fR, or \fB\&.debug*\fR section name. These sections are also identified by having a \fBSHT_SUNW_DEBUG*\fR section type.
.RE

.sp
.ne 2
.mk
.na
\fB\fBexclude\fR\fR
.ad
.sp .6
.RS 4n
Strip any excludable section. These sections are identified by having a \fBSHF_EXCLUDE\fR section flag. This class can be useful when creating a relocatable object. By default, such sections are automatically excluded when a dynamic executable or shared object is created, and are retained when creating a relocatable object.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnote\fR\fR
.ad
.sp .6
.RS 4n
Strip any note section. These sections are identified by having a \fBSHT_NOTE\fR section type.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsymbol\fR\fR
.ad
.sp .6
.RS 4n
Strip any non-allocatable symbol table and string table sections, providing the output file is not a relocatable object. These sections are identified by having a \fBSHT_SYMTAB\fR section type. Any associated string table is also removed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBstub\fR\fR
.ad
.sp .6
.RS 4n
Produces a stub shared object. A stub object is a shared object, built entirely from \fBmapfiles\fR, that supplies the same linking interface as the real object, while containing no code or data. Stub objects cannot be used at runtime. However, an application can be built against a stub object, where the stub object provides the real object name to be used at runtime, and then use the real object at runtime.
.sp
Stub objects can only be produced for shared objects, and a \fBmapfile\fR defining the global symbols to be exported must be supplied. The \fB-G\fR and \fB-M\fR options are therefore required when \fB-z\fR \fBstub\fR is used. When building a stub object, the link-editor ignores any object or library files specified on the command line, and these files need not exist in order to build a stub. Since the compilation step can be omitted, and because the link-editor has relatively little work to do, stub objects can be built very quickly.
.sp
See \fIStub Objects\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBsymbolcap\fR\fR
.ad
.sp .6
.RS 4n
Convert a relocatable object that defines object capabilities into a relocatable object that defines symbol capabilities. See \fIConverting Object Capabilities to Symbol Capabilities\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBtarget=sparc|x86\fR \fI\fR\fR
.ad
.sp .6
.RS 4n
Specifies the machine type for the output object. Supported targets are SPARC and x86. The 32-bit machine type for the specified target is used unless the \fB-64\fR option is also present, in which case the corresponding 64-bit machine type is used. By default, the machine type of the object being generated is determined from the first \fBELF\fR object processed from the command line. If no objects are specified, the machine type is determined by the first object encountered within the first archive processed from the command line. If there are no objects or archives, the link-editor assumes the native machine. This option is useful when creating an object directly with \fBld\fR whose input is solely from a \fBmapfile\fR. See the \fB-M\fR option. It can also be useful in the rare case of linking entirely from an archive that contains objects of different machine types for which the first object is not of the desired machine type.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBtext\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, forces a fatal error if any relocations against non-writable, allocatable sections remain. For historic reasons, this mode is not the default when building an executable or shared object. However, its use is recommended to ensure that the text segment of the dynamic object being built is shareable between multiple running processes. A shared text segment incurs the least relocation overhead when loaded into memory. See \fIPosition-Independent Code\fR in \fILinker and Libraries Guide\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBtextoff\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, allows relocations against all allocatable sections, including non-writable ones. This mode is the default when building a shared object.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBtextwarn\fR\fR
.ad
.sp .6
.RS 4n
In dynamic mode only, lists a warning if any relocations against non-writable, allocatable sections remain. This mode is the default when building an executable.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fBverbose\fR\fR
.ad
.sp .6
.RS 4n
This option provides additional warning diagnostics during a link-edit. Presently, this option enables the following warnings.
.RS +4
.TP
.ie t \(bu
.el o
Suspicious use of displacement relocations.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Restricted use of static \fBTLS\fR relocations when building shared objects.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Symbol visibility inconsistencies.
.RE
In the future, this option might be enhanced to provide additional diagnostics that are deemed too noisy to be generated by default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fBwrap=\fR\fIsymbol\fR\fR
.ad
.br
.na
\fB\fB-wrap=\fR \fIsymbol\fR\fR
.ad
.br
.na
\fB\fB--wrap=\fR \fIsymbol\fR\fR
.ad
.sp .6
.RS 4n
Rename undefined references to \fIsymbol\fR in order to allow wrapper code to be linked into the output object without having to modify source code. When \fB-z wrap\fR is specified, all undefined references to \fIsymbol\fR are modified to reference \fB__wrap_\fR\fIsymbol\fR, and all references to \fB__real_\fR\fIsymbol\fR are modified to reference \fIsymbol\fR. The user is expected to provide an object containing the \fB__wrap_\fR\fIsymbol\fR function. This wrapper function can call \fB__real_\fR\fIsymbol\fR in order to reference the actual function being wrapped.
.sp
The following is an example of a wrapper for the \fBmalloc\fR(3C) function.
.sp
.in +2
.nf
void *
__wrap_malloc(size_t c)
{
        (void) printf("malloc called with %zu\n", c);
        return (__real_malloc(c));
}
.fi
.in -2

If you link other code with this file using \fB-z\fR \fBwrap=malloc\fR to compile all the objects, then all calls to \fBmalloc\fR call the function \fB__wrap_malloc\fR instead. The call to \fB__real_malloc\fR calls the real \fBmalloc\fR function.
.sp
The real and wrapped functions should be maintained in separate source files. Otherwise, the compiler or assembler may resolve the call instead of leaving that operation for the link-editor to carry out, and prevent the wrap from occurring.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
\fB\fBLD_ALTEXEC\fR\fR
.ad
.sp .6
.RS 4n
An alternative link-editor path name. \fBld\fR executes, and passes control to this alternative link-editor. This environment variable provides a generic means of overriding the default link-editor that is called from the various compiler drivers. See the \fB-z altexec64\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLD_LIBRARY_PATH\fR\fR
.ad
.sp .6
.RS 4n
A list of directories in which to search for the libraries specified using the \fB-l\fR option. Multiple directories are separated by a colon. In the most general case, this environment variable contains two directory lists separated by a semicolon.
.sp
.in +2
.nf
\fIdirlist1\fR\fB;\fR\fIdirlist2\fR
.fi
.in -2
.sp

If \fBld\fR is called with any number of occurrences of \fB-L\fR, as in:
.sp
.in +2
.nf
\fBld ... -L\fIpath1\fR ... -L\fIpathn\fR ...\fR
.fi
.in -2
.sp

then the search path ordering is:
.sp
.in +2
.nf
\fB\fIdirlist1 path1\fR ... \fIpathn dirlist2\fR LIBPATH\fR
.fi
.in -2
.sp

When the list of directories does not contain a semicolon, the list is interpreted as \fIdirlist2\fR.
.sp
The \fBLD_LIBRARY_PATH\fR environment variable also affects the runtime linkers search for dynamic dependencies.
.sp
This environment variable can be specified with a _32 or _64 suffix. This makes the environment variable specific, respectively, to 32-bit or 64-bit processes and overrides any non-suffixed version of the environment variable that is in effect.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLD_NOEXEC_64\fR\fR
.ad
.sp .6
.RS 4n
Suppresses the automatic execution of the 64-bit link-editor. By default, the link-editor executes the 64-bit version when the \fBELF\fR class of the first relocatable object identifies a 64-bit object. The 64-bit image that a 32-bit link-editor can create, has some limitations. However, some link-edits might find the use of the 32-bit link-editor faster.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLD_OPTIONS\fR\fR
.ad
.sp .6
.RS 4n
A default set of options to \fBld\fR. \fBLD_OPTIONS\fR is interpreted by \fBld\fR just as though its value had been placed on the command line, immediately following the name used to invoke \fBld\fR, as in:
.sp
.in +2
.nf
\fBld $LD_OPTIONS ... \fIother-arguments\fR ...\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBLD_RUN_PATH\fR\fR
.ad
.sp .6
.RS 4n
An alternative mechanism for specifying a runpath to the link-editor. See the \fB-R\fR option. If both \fBLD_RUN_PATH\fR and the \fB-R\fR option are specified, \fB-R\fR supersedes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSGS_SUPPORT\fR\fR
.ad
.sp .6
.RS 4n
Provides a colon-separated list of shared objects that are loaded with the link-editor and given information regarding the linking process. This environment variable can be specified with a _32 or _64 suffix. This makes the environment variable specific, respectively, to the 32-bit or 64-bit class of \fBld\fR and overrides any non-suffixed version of the environment variable that is in effect. See the \fB-S\fR option.
.RE

.sp
.LP
Notice that environment variable-names that begin with the characters \&'\fBLD_\fR' are reserved for possible future enhancements to \fBld\fR and \fBld.so.1\fR(1).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fBlib\fIx\fR.so\fR\fR
.ad
.RS 15n
.rt  
shared object libraries.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlib\fIx\fR.a\fR\fR
.ad
.RS 15n
.rt  
archive libraries.
.RE

.sp
.ne 2
.mk
.na
\fB\fBa.out\fR\fR
.ad
.RS 15n
.rt  
default output file.
.RE

.sp
.ne 2
.mk
.na
\fB\fILIBPATH\fR\fR
.ad
.RS 15n
.rt  
For 32-bit libraries, the default search path is \fB/lib\fR, followed by \fB/usr/lib\fR. For 64-bit libraries, the default search path is \fB/lib/64\fR, followed by \fB/usr/lib/64\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ld\fR\fR
.ad
.RS 15n
.rt  
A directory containing several \fBmapfiles\fR that can be used during link-editing. These \fBmapfiles\fR provide various capabilities, such as defining memory layouts, aligning bss, and defining non-executable stacks.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/linker
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBas\fR(1), \fBcrle\fR(1), \fBgprof\fR(1), \fBld.so.1\fR(1), \fBldd\fR(1), \fBmcs\fR(1), \fBpvs\fR(1), \fBstrip\fR(1), \fBexec\fR(2), \fBstat\fR(2), \fBdlopen\fR(3C), \fBdldump\fR(3C), \fBelf\fR(3ELF), \fBar.h\fR(3HEAD), \fBa.out\fR(4), \fBattributes\fR(5)
.sp
.LP
\fILinker and Libraries Guide\fR
.SH NOTES
.sp
.LP
Default options applied by \fBld\fR are maintained for historic reasons. In today's programming environment, where dynamic objects dominate, alternative defaults would often make more sense. However, historic defaults must be maintained to ensure compatibility with existing program development environments. Historic defaults are called out wherever possible in this manual. For a description of the current recommended options, see Chapter 7, \fILink-Editor Quick Reference,\fR in \fILinker and Libraries Guide\fR.
.sp
.LP
If the file being created by \fBld\fR already exists, the file is unlinked after all input files have been processed. A new file with the specified name is then created. This allows \fBld\fR to create a new version of the file, while simultaneously allowing existing processes that are accessing the old file contents to continue running. If the old file has no other links, the disk space of the removed file is freed when the last process referencing the file terminates.
.sp
.LP
The behavior of \fBld\fR when the file being created already exists was changed with Solaris 11. In older versions, the existing file was rewritten in place, an approach with the potential to corrupt any running processes that is using the file. This change has an implication for output files that have multiple hard links in the file system. Previously, all links would remain intact, with all links accessing the new file contents. The new \fBld\fR behavior \fBbreaks\fR such links, with the result that only the specified output file name references the new file. All the other links continue to reference the old file. To ensure consistent behavior, applications that rely on multiple hard links to linker output files should explicitly remove and relink the other file names.
