Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/nice.1
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at  http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.  This notice shall appear on any product containing this material. 
.TH nice 1 "12 Jul 2011" "SunOS 5.11" "User Commands"
.SH NAME
nice \- invoke a command with an altered scheduling priority
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/nice\fR [\fB-\fIincrement\fR\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR 
     [\fIargument\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/nice\fR [\fB-\fIincrement\fR\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR 
     [\fIargument\fR]...
.fi

.SS "csh Builtin"
.LP
.nf
\fBnice\fR [\fB-\fIincrement\fR\fR | +\fIincrement\fR] [\fIcommand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnice\fR utility invokes \fBcommand\fR, requesting that it be run with a different system scheduling priority. The \fBpriocntl\fR(1) command is a more general interface to scheduler functions.
.sp
.LP
The invoking process (generally the user's shell) must be in a scheduling class that supports \fBnice\fR.
.sp
.LP
If the C shell (see \fBcsh\fR(1)) is used, the full path of the command must be specified. Otherwise, the \fBcsh\fR built-in version of \fBnice\fR will be invoked. See \fBcsh Builtin\fR below.
.SS "/usr/bin/nice"
.sp
.LP
If \fBnice\fR executes commands with arguments, it uses the default shell \fB/usr/bin/sh\fR (see \fBsh\fR(1)).
.SS "/usr/xpg4/bin/nice"
.sp
.LP
If \fBnice\fR executes commands with arguments, it uses \fB/usr/xpg4/bin/sh\fR (see \fBksh88\fR(1)).
.SS "csh Builtin"
.sp
.LP
\fBnice\fR is also a \fBcsh\fR built-in command with behavior different from the utility versions.  See \fBcsh\fR(1) for description.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIincrement\fR | \fB-n\fR \fIincrement\fR\fR
.ad
.RS 29n
.rt  
\fIincrement\fR is a positive or negative decimal integer that has the same effect on the execution of the utility as if the utility had called the \fBnice()\fR function with the numeric value of the \fIincrement\fR option-argument. See \fBnice\fR(2). \fBnice()\fR errors, other than \fBEINVAL\fR, are ignored. If not specified, an increment of \fB10\fR is assumed.
.sp
The super-user may run commands with priority higher than normal by using a negative increment such as \fB-10\fR\&. A negative \fIincrement\fR assigned by an unprivileged user is ignored.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIcommand\fR\fR
.ad
.RS 12n
.rt  
The name of a command that is to be invoked. If \fIcommand\fR names any of the special built-in utilities (see \fBshell_builtins\fR(1)), the results are undefined.
.RE

.sp
.ne 2
.mk
.na
\fB\fIargument\fR\fR
.ad
.RS 12n
.rt  
Any string to be supplied as an argument when invoking \fIcommand\fR.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables that affect the execution of \fBnice\fR: \fBLANG\fR, \fBLC_ALL\fR, \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, \fBPATH\fR, and \fBNLSPATH\fR.
.SH EXIT STATUS
.sp
.LP
If \fIcommand\fR is invoked, the exit status of \fBnice\fR will be the exit status of \fIcommand\fR. Otherwise, \fBnice\fR will exit with one of the following values:
.sp
.ne 2
.mk
.na
\fB\fB1-125\fR\fR
.ad
.RS 9n
.rt  
An error occurred. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB126\fR\fR
.ad
.RS 9n
.rt  
\fIcommand\fR was found but could not be invoked.
.RE

.sp
.ne 2
.mk
.na
\fB\fB127\fR\fR
.ad
.RS 9n
.rt  
\fIcommand\fR could not be found.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.SS "/usr/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/xopen/xcu4
_
CSIEnabled
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
\fBcsh\fR(1), \fBksh88\fR(1), \fBnohup\fR(1), \fBpriocntl\fR(1), \fBsh\fR(1), \fBshell_builtins\fR(1), \fBnice\fR(2), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
