Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/rm.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.  This notice shall appear on any product containing this material.
.TH rm 1 "27 Jul 2011" "SunOS 5.11" "User Commands"
.SH NAME
rm, rmdir \- remove directory entries
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/rm\fR [\fB-f\fR] [\fB-i\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/rm\fR \fB-rR\fR [\fB-f\fR] [\fB-i\fR] \fIdirname\fR... [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/rm\fR [\fB-fiRr\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/rmdir\fR [\fB-ps\fR] \fIdirname\fR...
.fi

.SH DESCRIPTION
.SS "/usr/bin/rm /usr/xpg4/bin/rm"
.sp
.LP
The \fBrm\fR utility removes the directory entry specified by each \fIfile\fR argument. If a file has no write permission and the standard input is a terminal, the full set of permissions (in octal) for the file are printed followed by a question mark. This is a prompt for confirmation. If the answer is affirmative, the file is deleted, otherwise the file remains.
.sp
.LP
If \fIfile\fR is a symbolic link, the link is removed, but the file or directory to which it refers is not deleted. Users do not need write permission to remove a symbolic link, provided they have write permissions in the directory.
.sp
.LP
If multiple \fIfile\fRs are specified and removal of a \fIfile\fR fails for any reason, \fBrm\fR writes a diagnostic message to standard error, do nothing more to the current \fIfile\fR, and go on to any remaining \fIfile\fRs.
.sp
.LP
If the standard input is not a terminal, the utility operates as if the \fB-f\fR option is in effect.
.SS "/usr/bin/rmdir"
.sp
.LP
The \fBrmdir\fR utility removes the directory entry specified by each \fIdirname\fR operand, which must refer to an empty directory.
.sp
.LP
Directories are processed in the order specified. If a directory and a subdirectory of that directory are specified in a single invocation of \fBrmdir\fR, the subdirectory must be specified before the parent directory so that the parent directory is empty when \fBrmdir\fR tries to remove it.
.SH OPTIONS
.sp
.LP
The following options are supported for \fB/usr/bin/rm\fR and \fB/usr/xpg4/bin/rm\fR:
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
Recursively removes directories and subdirectories in the argument list. The directory is emptied of files and removed. The user is normally prompted for removal of any write-protected files which the directory contains. The write-protected files are removed without prompting, however, if the \fB-f\fR option is used, or if the standard input is not a terminal and the \fB-i\fR option is not used.
.sp
Symbolic links that are encountered with this option is not traversed.
.sp
If the removal of a non-empty, write-protected directory is attempted, the utility always fails (even if the \fB-f\fR option is used), resulting in an error message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
Same as \fB-r\fR option.
.RE

.SS "/usr/bin/rm"
.sp
.LP
The following options are supported for \fB/usr/bin/rm\fR only:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Removes files (even if write-protected) in a directory without prompting the user. In a write-protected directory, however, files are never removed (whatever their permissions are) and no messages are displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
Interactive. With this option, \fBrm\fR prompts for confirmation before removing any files. It overrides the \fB-f\fR option and remains in effect even if the standard input is not a terminal.
.RE

.SS "/usr/xpg4/bin/rm"
.sp
.LP
The following options are supported for \fB/usr/xpg4/bin/rm\fR only:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Does not prompt for confirmation. Does not write diagnostic messages or modify the exit status in the case of non-existent operands. Any previous occurrences of the \fB-i\fR option is ignored.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
Prompts for confirmation. Any occurrences of the \fB-f\fR option is ignored.
.RE

.SS "/usr/bin/rmdir"
.sp
.LP
The following options are supported for \fB/usr/bin/rmdir\fR only:
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
Allows users to remove the directory \fIdirname\fR and its parent directories which become empty. A message is printed to standard error if all or part of the path could not be removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Suppresses the message printed on the standard error when \fB-p\fR is in effect.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 11n
.rt  
Specifies the pathname of a directory entry to be removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdirname\fR\fR
.ad
.RS 11n
.rt  
Specifies the pathname of an empty directory to be removed.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBrm\fR and \fBrmdir\fR when encountering files greater than or equal to 2 Gbyte (2^31 bytes).
.SH EXAMPLES
.sp
.LP
The following examples are valid for the commands shown.
.SS "/usr/bin/rm, /usr/xpg4/bin/rm"
.LP
\fBExample 1 \fRRemoving Directories
.sp
.LP
The following command removes the directory entries \fBa.out\fR and \fBcore\fR:

.sp
.in +2
.nf
example% \fBrm a.out core\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRemoving a Directory without Prompting
.sp
.LP
The following command removes the directory \fBjunk\fR and all its contents, without prompting:

.sp
.in +2
.nf
example% \fBrm -rf junk\fR
.fi
.in -2
.sp

.SS "/usr/bin/rmdir"
.LP
\fBExample 3 \fRRemoving Empty Directories
.sp
.LP
If a directory \fBa\fR in the current directory is empty, except that it contains a directory \fBb\fR, and \fBa/b\fR is empty except that it contains a directory \fBc\fR, the following command removes all three directories:

.sp
.in +2
.nf
example% \fBrmdir -p a/b/c\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables that affect the execution of \fBrm\fR and \fBrmdir\fR: \fBLANG\fR, \fBLC_ALL\fR, \fBLC_COLLATE\fR, \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, and \fBNLSPATH\fR.
.sp
.LP
Affirmative responses are processed using the extended regular expression defined for the \fByesexpr\fR keyword in the \fBLC_MESSAGES\fR category of the user's locale. The locale specified in the \fBLC_COLLATE\fR category defines the behavior of ranges, equivalence classes, and multi-character collating elements used in the expression defined for \fByesexpr\fR. The locale specified in \fBLC_CTYPE\fR determines the locale for interpretation of sequences of bytes of text data a characters, the behavior of character classes used in the expression defined for the \fByesexpr\fR. See \fBlocale\fR(5).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
If the \fB-f\fR option was not specified, all the named directory entries were removed; otherwise, all the existing named directory entries were removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.SS "/usr/bin/rm, /usr/bin/rmdir"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/rm"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/xopen/xcu4
_
CSIEnabled
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
\fBrmdir\fR(2), \fBunlink\fR(2), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH DIAGNOSTICS
.sp
.LP
It is forbidden to remove the files "\fB\&.\fR" and "\fB\&..\fR" in order to avoid the consequences of inadvertently doing something like the following:
.sp
.in +2
.nf
example% \fBrm -r .*\fR
.fi
.in -2
.sp

.sp
.LP
It is forbidden to remove the file "\fB/\fR" in order to avoid the consequences of inadvertently doing something like:
.sp
.in +2
.nf
example% \fBrm -rf $x/$y\fR
.fi
.in -2
.sp

.sp
.LP
or
.sp
.in +2
.nf
example% \fBrm -rf /$y\fR
.fi
.in -2
.sp

.sp
.LP
when \fB$x\fR and \fB$y\fR expand to empty strings.
.SH NOTES
.sp
.LP
A \fB\(mi\fR permits the user to mark explicitly the end of any command line options, allowing \fBrm\fR to recognize file arguments that begin with a \fB\(mi\fR\&. As an aid to BSD migration, \fBrm\fR accepts \fB\(mi\|\(mi\fR as a synonym for \fB\(mi\fR\&. This migration aid may disappear in a future release. If a \fB\(mi\|\(mi\fR and a \fB\(mi\fR both appear on the same command line, the second is interpreted as a file.
