Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/userattr.1
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH userattr 1 "15 Jul 2010" "SunOS 5.11" "User Commands"
.SH NAME
userattr \- print attribute value granted to a user or role
.SH SYNOPSIS
.LP
.nf
\fBuserattr\fR [\fB-v\fR] \fIattribute_name\fR [\fIuser\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBuserattr\fR command prints on standard output the first value found for the attribute \fBattribute_name\fR. If user is not specified, the user is taken from the real user ID of the process. Attribute names are those found defined in \fBuser_attr\fR(4) and \fBprof_attr\fR(4). Use the \fBprofiles\fR(1) command for the profiles assigned to a user. Use the \fBauths\fR(1) command for the authorizations assigned to a user. The order of search is the user's \fBuser_attr\fR entry followed by the user's profiles.
.sp
.LP
If the attribute, \fIattribute_name\fR, is not assigned to the user, and for any errors, \fBuserattr\fR returns a \fBnon-zero\fR exit code. Otherwise, \fBuserattr\fR returns a \fBzero\fR exit code.
.sp
.LP
The \fB-v\fR option additionally prints where the attribute was found.
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBuserattr\fR
.sp
.in +2
.nf
example% userattr lock_after_retries root
no
.fi
.in -2
.sp

.SH FILES
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH EXIT STATUS
.sp
.LP
The following exit	values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilitySee below.
.TE

.sp
.LP
The exit code is Committed. The output for the \fB-v\fR option is Not-an-Interface.
.SH SEE ALSO
.sp
.LP
\fBauths\fR(1), \fBprofiles\fR(1), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
