Arquivotheca/solaris11/usr/man/man/usr/share/man/man1/zonestat.1
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH zonestat 1 "16 Jun 2011" "SunOS 5.11" "User Commands"
.SH NAME
zonestat \- report active zone statistics
.SH SYNOPSIS
.LP
.nf
\fBzonestat\fR [\fB-z\fR \fIzonelist\fR] [\fB-r\fR \fIreslist\fR] [\fB-n\fR \fInamelist\fR] [\fB-T u | d | i\fR] 
   [\fB-R\fR \fIreports\fR] [\fB-q\fR] [\fB-x\fR] [\fB-p\fR [\fB-P\fR \fIlines\fR]] 
   [\fB-S\fR \fIcols\fR] \fIinterval\fR [\fIduration\fR [\fIreport\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBzonestat\fR utility reports on the \fBcpu\fR, memory, networking, and resource control utilization of the currently running zones. Each zone's utilization is reported both as a percentage of system resources and the zone's configured limits.
.sp
.LP
The \fBzonestat\fR utility prints a series of interval reports at the specified interval. It optionally also prints one or more summary reports at a specified interval.
.sp
.LP
The default output is a summary of \fBcpu\fR, physical, and virtual memory, and networking utilization. The \fB-r\fR option can be used to choose detailed output for specific resources.
.SS "Security"
.sp
.LP
When run from within a non-global zone (\fBNGZ\fR), only processor sets visible to the \fBNGZ\fR are reported. The \fBNGZ\fR output includes all of other system resources, such as memory and limits.
.sp
.LP
For all reported resources, the \fBNGZ\fR's usage is output. Usage of each resource by the system, global zone, and all other zones, is reported as used by [system].
.sp
.LP
For networking resources, only \fBNGZ\fR's usage is output. \fBNGZ\fRs do not have visibility to other zones' networking resources and statistics.
.sp
.LP
\fBproc_info\fR privilege is required to use the \fBzonestat\fR utility. This privilege is a member of the basic privilege set. 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIname\fR[\fI,name\fR]\fR
.ad
.sp .6
.RS 4n
Specify a list resource names on which to report. For \fBpset\fR resources, this is the name of the processor set. For physical-memory, locked-memory, and virtual-memory resources, the only names are \fBmem_default\fR and \fBvm_default\fR. For network resources, this is name of a datalink.
.sp
Dedicated-cpu processor sets can be specified by their pset name (\fBSUNWtmp_zonename\fR or by just their \fBzonename\fR.
.sp
Processor sets created by \fBpsrset\fR can be specified by their pool \fBpset\fR name (\fBSUNWlegacy_pset\fR id), or just by their \fBpset\fR id.
.sp
In addition to a comma-separated list, multiple \fB-n\fR options can be specified to report on a set of resources.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Parseable output.
.sp
Print output in stable, machine--parseable format. Individual fields are delimited with a colon (\fB:\fR). The line format is:
.sp
.in +2
.nf
report type:resource:field[:field]*
.fi
.in -2
.sp

If -T is specified each line is prefixed with a timestamp:
.sp
The report types are: report-total, report-average, report-high, and interval,
.sp
The resource types are: header, footer, summary, physical-memory, virtual-memory, locked-memory, processor-set, processes, \fBlwps\fR, \fBsysv-shared-memory\fR, \fBsysv-shmids\fR, \fBsysv-semids\fR, \fBsysv-msgids\fR, \fBlofi\fR, network.
.sp
The header resource is a special resource used to state the beginning of an interval or summary report. All output lines between header resources belong to the same report. Each header has a matching footer.
.sp
The remaining fields are resource type specific. See the \fBzonestat\fR utility output for details.
.sp
All existing output fields are stable. Future versions might introduce new report and resource types. Future versions might also add additional new fields to the end of existing output n lines.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIline\fR[\fI,line\fR]\fR
.ad
.sp .6
.RS 4n
For parseable output, specify lines to output in parseable output. One or more of the following line types can be chosen:
.sp
.ne 2
.mk
.na
\fB\fBheader, footer\fR\fR
.ad
.RS 18n
.rt  
For each interval, and summary report has a header, which prints details such as the interval and count information. After each report, and \fBfooter\fR is also printed
.RE

.sp
.ne 2
.mk
.na
\fB\fBresource\fR\fR
.ad
.RS 18n
.rt  
The lines describing each resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsystem\fR\fR
.ad
.RS 18n
.rt  
The utilization of each resource by the system. This includes the kernel, and any resource consumption not contributed to a specific zone. When \fBzonestat\fR is run from within a non-global-zone, this value is the aggregate resource consumed by the system and all other zones. \fBsystem\fR utilization for network resource type is not supported.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtotal\fR\fR
.ad
.RS 18n
.rt  
The total utilization of each resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzones\fR\fR
.ad
.RS 18n
.rt  
Lines detailing the per-zone utilization of each resource.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
Quiet mode. Only print summary reports (requires the \fB-R\fR option). All interval reports are omitted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIresource\fR[\fI,resource\fR]\fR
.ad
.sp .6
.RS 4n
Specify resource types on which to report. The available resources are: \fBphysical-memory\fR, \fBvirtual-memory\fR, \fBlocked-memory\fR, \fBprocessor-set\fR, \fBprocesses\fR, \fBlwps\fR, \fBshm-memory\fR, \fBshm-ids\fR, \fBsem-ids\fR, \fBmsg-ids\fR, \fBlofi\fR, and \fBnetwork\fR.
.sp
.ne 2
.mk
.na
\fB\fBsummary\fR\fR
.ad
.RS 16n
.rt  
A summary of \fBcpu\fR, \fBphysical-memory\fR, \fBvirtual memory\fR, and \fBnetwork\fR usage.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmemory\fR\fR
.ad
.RS 16n
.rt  
\fBphysical-memory\fR, \fBvirtual-memory\fR, and \fBlocked-memory\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpsets\fR\fR
.ad
.RS 16n
.rt  
\fBprocessor-set\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefault-pset\fR\fR
.ad
.RS 16n
.rt  
The default \fBpset\fR only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlimits\fR\fR
.ad
.RS 16n
.rt  
\fBprocesses\fR, \fBlwps\fR, \fBlofi\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnetwork\fR\fR
.ad
.RS 16n
.rt  
network datalinks.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsysv\fR\fR
.ad
.RS 16n
.rt  
\fBshm-memory\fR, \fBshm-ids\fR, \fBsem-ids\fR \fBmsg-ids\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBall\fR\fR
.ad
.RS 16n
.rt  
All resource types.
.RE

By default the summary resource is printed.
.sp
In addition to a comma-separated list, multiple -r options can be specified to report on a set of resources types. 
.sp
The system's \fBcpu\fRs can be partitioned into processor sets (\fBpsets\fR). By default, all \fBcpu\fRs are in a single \fBpset\fR named \fBpset_default\fR.
.sp
Memory is not partition-able into sets. The \fBzonestat\fR utility output for these resources shows them as named \fBmem_default\fR and \fBvm_default\fR.
.sp
The all resource specifies that all resource types should be reported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIreport\fR[\fI,report\fR]\fR
.ad
.sp .6
.RS 4n
Print a summary report. The supported report types are described below. In addition to a comma-separated list, multiple -R options can be specified for a set of summary reports.
.sp
.ne 2
.mk
.na
\fB\fBtotal\fR\fR
.ad
.RS 11n
.rt  
Prints a summary report detailing the following for each resource:
.sp
.ne 2
.mk
.na
\fB\fBpsets\fR\fR
.ad
.RS 24n
.rt  
Total cpu used since start of command invocation. The percent used for each zone includes time that a zone was not running. For instance, if a zone used 100% of the cpu while it was running, but the zone was halted for half of the intervals, then the summary report shows the zone used 50% of the cpu time.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmemory, limits, sysv\fR\fR
.ad
.RS 24n
.rt  
Average resource used of all intervals reported since command invocation. This average factors in intervals in which a zone was not running. For example if a zone used on average of 100M of physical memory while it was running, and was only running for half the intervals, then the summary report shows that the zone used 50M of physical memory on average.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnetwork\fR\fR
.ad
.RS 24n
.rt  
Sum of all bytes that are transmitted and received by all datalink utilizing physical bandwidth. The sum is calculated since start of command invocation and is normalized to number of bytes per second. The percentage used is based on total available bandwidth.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBaverage\fR\fR
.ad
.RS 11n
.rt  
Similar to total, but only intervals in which a zone is running are factored in. For example, if a zone was only running for a single interval, and during that interval, the zone used 200M of virtual memory, then it's average virtual-memory is 200M, regardless of the number of intervals reported before the summary report.
.RE

.sp
.ne 2
.mk
.na
\fB\fBhigh\fR\fR
.ad
.RS 11n
.rt  
Print a summary report detailing the highest usage of each resource and zone during any interval of the \fBzonestat\fR utility invocation.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIcol\fR[\fI,col\fR]\fR
.ad
.sp .6
.RS 4n
Sort zones utilizing each resource.
.sp
The following sorting columns can be specified:
.sp
.ne 2
.mk
.na
\fB\fBname\fR\fR
.ad
.RS 11n
.rt  
Sort alpha-numerically by zone name.
.RE

.sp
.ne 2
.mk
.na
\fB\fBused\fR\fR
.ad
.RS 11n
.rt  
Sort by quantity of resource used. For networking resource, this is same as sort by bytes.
.sp
This is the default.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcap\fR\fR
.ad
.RS 11n
.rt  
Sort by configured cap.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpcap\fR\fR
.ad
.RS 11n
.rt  
Sort by percent of cap used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBshr\fR\fR
.ad
.RS 11n
.rt  
Sort by allocated share.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpshru\fR\fR
.ad
.RS 11n
.rt  
Sort by percent of share used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbytes\fR\fR
.ad
.RS 11n
.rt  
Sort networking by total bytes transmitted and received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBprbyte\fR\fR
.ad
.RS 11n
.rt  
Sort networking by percentage of received bytes over the wire.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpobyte\fR\fR
.ad
.RS 11n
.rt  
Sort networking by percentage of transmitted bytes over the wire.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmaxbw\fR\fR
.ad
.RS 11n
.rt  
Sort networking by percentage of bandwidth used.
.sp
.ne 2
.mk
.na
\fB\fBcpu\fR\fR
.ad
.RS 19n
.rt  
Sort by cpu usage in the summary, This is the default.
.RE

.sp
.ne 2
.mk
.na
\fB\fBphysical-memory\fR\fR
.ad
.RS 19n
.rt  
Sort by physical memory usage in the summary.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvirtual-memory\fR\fR
.ad
.RS 19n
.rt  
Sort by virtual memory usage in the summary.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnetwork\fR\fR
.ad
.RS 19n
.rt  
Sort by network usage in the summary.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBnetwork\fR\fR
.ad
.RS 11n
.rt  
Sort by network usage in the summary.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu | d | i\fR\fR
.ad
.sp .6
.RS 4n
Include timestamp of each report. The following formats are supported:
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
Standard date format. See \fBdate\fR(1). This option is not valid with \fB--p\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
Time formatted as the ISO 8601 compliant format:
.sp
.in +2
.nf
 YYYYMMDDThhmmssZ
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBu\fR\fR
.ad
.RS 5n
.rt  
A printed representation of the internal representation of time. See \fBtime\fR(2). This is also known as \fBunix\fR time.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
Display an extended view with more detailed information. For example, when used with network resource, the extended view list details of each virtual datalink.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzonename\fR[\fI,zonename\fR]\fR
.ad
.sp .6
.RS 4n
Specify a list of zones on which to report. By default all zones are reported.
.sp
In addition to a comma-separated list, multiple -z options can be specified to report on a set of zones. The output includes any resources which have usage by the specified zones.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
Specifies the length in seconds to pause between each interval report. An interval of default uses the configured interval of the zones monitoring service. See \fBzonestatd\fR(1M). 
.sp
\fIinterval\fR is required. An \fIinterval\fR of zero is not permitted. \fIinterval\fR can be specified as [\fIn\fR\fBh\fR][\fIn\fR\fBm\fR][\fIn\fR\fBs\fR], such as \fB10s\fR or \fB1m\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIduration\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of intervals to report. Defaults to infinity if not specified. The command duration is (\fIinterval * duration\fR). A \fIduration\fR of zero is invalid. A value of \fBinf\fR can also be specified to explicitly choose infinity.
.sp
Duration can also be specified as [\fIn\fR\fBh\fR][\fIn\fR\fBm\fR][\fIn\fR\fBs\fR]. In this case, \fIduration\fR is interpreted as the duration of execution time. The actual \fIduration\fR is rounded up to the nearest multiple of the interval.
.RE

.sp
.ne 2
.mk
.na
\fB\fIreport\fR\fR
.ad
.sp .6
.RS 4n
Specify the summary report period. For instance, a report of \fB4\fR produces reports every 4 intervals. If the command duration is not a multiple of report, then the last report is of any remaining intervals.
.sp
\fIreport\fR can also be specified as [\fIn\fR\fBh\fR][\fIn\fR\fBm\fR][\fIn\fR\fBs\fR]. In this case, reports are output at the specified time period, rounded up to the nearest interval. If the command \fIduration\fR is not a multiple of report, then the last report is of any remaining intervals.
.sp
Requires \fB-R\fR. If \fB-R\fR is specified and report is not, the report period is the entire command duration, producing the specified reports at the end of execution.
.RE

.SH OUTPUT
.sp
.LP
The following list defines the column heading of the command output:
.sp
.ne 2
.mk
.na
\fB\fBSYSTEM-MEMORY\fR\fR
.ad
.sp .6
.RS 4n
The total amount of memory available on the physical host.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYSTEM-LIMIT\fR\fR
.ad
.sp .6
.RS 4n
The maximum amount of resource available on the physical host.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCPUS\fR\fR
.ad
.sp .6
.RS 4n
The number of \fBcpu\fRs allocated to a processor set
.RE

.sp
.ne 2
.mk
.na
\fB\fBONLINE\fR\fR
.ad
.sp .6
.RS 4n
Of the \fBcpu\fRs allocated to a processor set, the number of \fBcpu\fRs which can execute processes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMIN/MAX\fR\fR
.ad
.sp .6
.RS 4n
The minimum and maximum number of \fBcpu\fRs which can be allocated to the processor set by the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.sp .6
.RS 4n
The zone using the resource. In addition to zone names, this column can also contain:
.sp
.ne 2
.mk
.na
\fB\fB[total]\fR\fR
.ad
.RS 12n
.rt  
The total quantity of resource used system-wide.
.RE

.sp
.ne 2
.mk
.na
\fB\fB[system]\fR\fR
.ad
.RS 12n
.rt  
The quantity of resource used by the kernel or in a manner not associated with any particular zone.
.sp
When \fBzonestat\fR is used within a non-global zone, [system] designates the aggregate resource used by the system and by all other zones.
.sp
For network resources, system usage of network is not available.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBUSED\fR\fR
.ad
.sp .6
.RS 4n
The amount of resource used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%USED\fR\fR
.ad
.sp .6
.RS 4n
The amount of resource used as a percent of the total resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPCT\fR\fR
.ad
.sp .6
.RS 4n
The amount of resource used as a percent of the total resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%PART\fR\fR
.ad
.sp .6
.RS 4n
The amount of \fBcpu\fR used as a percentage of the total \fBcpu\fR in a processor-set to which the zone is bound. A zone can only have processes bound to multiple processor sets if it is the global zone, or if \fBpsrset\fR(1M) \fBpsets\fR are used. If multiple binding are found for a zone, it's \fB%PART\fR is the fraction used of all bound \fBpsets\fR. For \fB[total]\fR and \fB[system]\fR, \fB%PART\fR is the percent used of all \fBcpu\fRs on the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCAP\fR\fR
.ad
.sp .6
.RS 4n
If a zone is configured to have a cap on the given resource, the cap is displayed in this column.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%CAP\fR\fR
.ad
.sp .6
.RS 4n
The amount of resource used as a percent of zone's configured cap.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHRS\fR\fR
.ad
.sp .6
.RS 4n
The number of shares allocated to the zone. For the [total] row, this is the total number of shares allocated to all zones sharing the resource. If a zone is not configured to use shares, and is sharing a resource with other zones that are configured to use shares, this column contains \fBno-fss\fR for the zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%SHRS\fR\fR
.ad
.sp .6
.RS 4n
The fraction of the total shares allocated to the zone. For instance, if 2 zones share a processor set, each with 10 shares, then each zone has a \fB%SHR\fR of 50%. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB%SHRU\fR\fR
.ad
.sp .6
.RS 4n
Of the share allocated to the zone, the fraction of resource 100%. Because shares are only enforced when there is resource contention, it is possible for a zone to have a \fB%SHRU\fR in excess of 100%.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTOBYTES\fR\fR
.ad
.sp .6
.RS 4n
The number of bytes transmitted and received by datalinks or virtual links.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRBYTE\fR\fR
.ad
.sp .6
.RS 4n
The number of received bytes that consumes physical bandwidth.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOBYTE\fR\fR
.ad
.sp .6
.RS 4n
The number of transmitted bytes that consumes physical bandwidth.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%PRBYE\fR\fR
.ad
.sp .6
.RS 4n
The percentage of available physical bandwidth used to receive \fBPRBYTE\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%POBYE\fR\fR
.ad
.sp .6
.RS 4n
The percentage of available physical bandwidth used to transmit \fBPOBYTE\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%PUSE\fR\fR
.ad
.sp .6
.RS 4n
The sum of \fBPRBYTE\fR and \fBPOBYTE\fR as a percent of the total available physical bandwidth.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
The name of a datalink.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAXBW\fR\fR
.ad
.sp .6
.RS 4n
The maximum bandwidth configured on a datalink.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%MAXBW\fR\fR
.ad
.sp .6
.RS 4n
The sum of all transmitted and received bytes as a percentage of configured maximum bandwidth.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBzonestat\fR to Display a Summary of \fBcpu\fR and Memory Utilization
.sp
.LP
The following command shows a summary of \fBcpu\fR and memory utilization every 5 seconds:

.sp
.in +2
.nf
 # zonestat 5 1
        SUMMARY   Cpus/Online: 4/4  Physical: 8063M  Virtual: 11.8G
                     ---CPU---   --PHYSMEM-- ---VMEM---  ---NET---
               ZONE  USED %PART  USED %USED  USED %USED PBYTE %PUSE
            [total]  0.23 5.76% 3211M 39.8% 4191M 34.6%  350M 18.7%     -
           [system]  0.03 0.83% 2791M 34.6% 3890M 32.1%     -     -
             global  0.19 4.86%  324M 4.01%  228M 1.89%  200M 10.7%
              zoneA  0.00 0.03% 47.9M 0.59% 36.3M 0.30%  100M  5.3%
              zoneB  0.00 0.02% 48.1M 0.59% 36.4M 0.30%   50M  2.7%
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUsing \fBzonestat\fR to Produce Parseable Output
.sp
.LP
The following command produces parseable output. It prints one line per zone using each \fBpset\fR resource for a 5 second interval:

.sp
.in +2
.nf
# zonestat -p -P zones -r psets 5 1
.fi
.in -2
.sp

.LP
\fBExample 3 \fRUsing \fBzonestat\fR to Report on the Default \fBpset\fR
.sp
.LP
The following command reports on the default \fBpset\fR once a second for one minute:

.sp
.in +2
.nf
# zonestat -r default-pset 1 1m
.fi
.in -2
.sp

.LP
\fBExample 4 \fRUsing \fBzonestat\fR to Report Total and High Utilization
.sp
.LP
The following command  monitors silently at a 10 second interval  for  24  hours,  producing a total and high report every 1 hour:

.sp
.in +2
.nf
# zonestat -q -R total,high 10s 24h 1h
.fi
.in -2
.sp

.LP
\fBExample 5 \fRUsing \fBzonestat\fR to Report Datalink Utilization
.sp
.LP
The following command reports on a datalink named \fBe1000g0\fR at a 5 second interval for 5 times:

.sp
.in +2
.nf
# zonestat -r network -n e1000g0 5 5
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Invalid usage.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.sp .6
.RS 4n
\fBsvc:system/zones_monitoring\fR: default not running or not responding.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availability\fBsystem/zones\fR
_
Interface StabilitySee below.
.TE

.sp
.LP
Command invocation and parseable output is Committed. Human readable output (default output) is Uncommitted.
.SH SEE ALSO
.sp
.LP
\fBdate\fR(1), \fBprctl\fR(1), \fBpooladm\fR(1M), \fBpoolcfg\fR(1M), \fBpsrset\fR(1M), \fBrcapadm\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBzonestatd\fR(1M), \fBtime\fR(2), \fBtimezone\fR(4), \fBattributes\fR(5), \fBprivileges\fR(5), \fBresource_controls\fR(5)
.SH NOTES
.sp
.LP
The \fBzonestat\fR utility depends on the zones monitoring service: \fBsvc/system/zonestat:default\fR. If the \fBzonestat\fR service is stopped while the \fBzonestat\fR utility is running, the \fBzonestat\fR command invocation quits without printing additional reports. The reports (\fB-R\fR) is printed if \fBzonestat\fR is interrupted (by CTRL/c, SIGINT) before reaching the next report period.
