Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/man1m/fpsd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH fpsd 1M "22 Feb 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
fpsd \- Fp-scrubber daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fps/fpsd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBfpsd\fR is a user-level daemon that periodically runs non-intrusive tests to validate proper functioning of FPU (Floating Point Unit) hardware in the system. A fault management action is initiated by means of \fBfmd\fR(1M), in case an error is detected by the test.
.sp
.LP
\fBfpsd\fR is not supported on all Sun systems. On a system on which it is not supported, \fBfpsd\fR is automatically disabled.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/floating-point-scrubber
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBfmd\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBfpsd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/fpsd:default
.fi
.in -2
.sp

.sp
.LP
You can use \fBsvccfg\fR(1M) to change the default \fBfpsd\fR behavior:
.sp
.in +2
.nf
Property Name            Type     Description
-------------            ----     -----------
config/exclude_cpus      astring  comma delimited list of
                                   CPU IDs to be excluded
                                   from proactive testing.
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
Disabling the service can increase system's vulnerability to silent data corruption, if a fault were to develop in an FPU within the system.
