Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/man1m/ldmad.1m
'\" te
.\" Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ldmad 1M "27 Apr 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
ldmad \- Logical Domains Agents daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldoms/ldmad\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBldmad\fR daemon is part of the framework that enables Logical Domain agents to run on a Logical Domain. A Logical Domain agent is a component that interacts with the control domain to provide features or information.
.sp
.LP
\fBldmad\fR is responsible for running agents on a Logical Domain. \fBldmad\fR must be enabled to ensure the proper functionality of all features provided by the domain manager on the control domain. The daemon is started at boot time and has no configuration options.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/ldoms
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyslog\fR(3C), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fIOracle VM Server for SPARC 2.0 Administration Guide\fR
.SH ERRORS
.sp
.LP
\fBldmad\fR uses \fBsyslog\fR(3C) to report status and error messages. Error messages are logged with the \fBLOG_ERR\fR and \fBLOG_NOTICE\fR priorities. Informational messages are logged with the \fBLOG_INFO\fR priority. The default entries in the \fB/etc/syslog.conf\fR file specify that all \fBldmad\fR error messages are written to the \fB/var/adm/messages\fR log.
.SH NOTES
.sp
.LP
The \fBldmad\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/ldoms/agents:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
