Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/man1m/sf880drd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH sf880drd 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
sf880drd \- Sun Fire 880 Dynamic Reconfiguration daemon
.SH SYNOPSIS
.LP
.nf
\fBsf880drd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The Sun Fire 880 Dynamic Reconfiguration daemon, \fBsf880drd\fR, is part of the \fBPCI\fR and system bus hotplug framework. \fBsf880drd\fR starts at boot time. It has no configuration options and does not report any system status.
.sp
.LP
\fBsf880drd\fR implements the Sun Fire \fB880\fR console-less system administration (per-slot pushbuttons and \fBLED\fR status indicators). It also manages various aspects of \fBCPU\fR/memory hotplug.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/platform/SUNW,Sun-Fire-880/lib/sf880drd\fR \fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
system/kernel/dynamic-reconfiguration/sun-fire-880
T}
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBcfgadm\fR(1M), \fBcfgadm_pci\fR(1M), \fBcfgadm_sbd\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBsf880drd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/platform/sun4u/sf880drd
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
