Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/acctsh.1m
'\" te
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH acctsh 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctsh, chargefee, ckpacct, dodisk, lastlogin, monacct, nulladm, prctmp, prdaily, prtacct, shutacct, startup, turnacct \- shell procedures for accounting
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/chargefee\fR \fIlogin-name\fR \fInumber\fR
.fi

.LP
.nf
\fB/usr/lib/acct/ckpacct\fR [\fIblocks\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/dodisk\fR [\fB-o\fR] [\fIfilename\fR]...
.fi

.LP
.nf
\fB/usr/lib/acct/lastlogin\fR 
.fi

.LP
.nf
\fB/usr/lib/acct/monacct\fR \fInumber\fR
.fi

.LP
.nf
\fB/usr/lib/acct/nulladm\fR \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/lib/acct/prctmp\fR \fIfilename\fR
.fi

.LP
.nf
\fB/usr/lib/acct/prdaily\fR [\fB-c\fR] [\fB-l\fR] [\fImmdd\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/prtacct\fR \fIfilename\fR ['' \fIheading\fR '']
.fi

.LP
.nf
\fB/usr/lib/acct/shutacct\fR ['' \fIreason\fR '']
.fi

.LP
.nf
\fB/usr/lib/acct/startup\fR 
.fi

.LP
.nf
\fB/usr/lib/acct/turnacct\fR on | off | switch
.fi

.SH DESCRIPTION
.SS "chargefee Command"
.sp
.LP
\fBchargefee\fR can be invoked to charge a \fInumber\fR of units to \fIlogin-name\fR. A record is written to \fB/var/adm/fee\fR, to be merged with other accounting records by \fBrunacct\fR(1M).
.SS "ckpacct Command"
.sp
.LP
\fBckpacct\fR should be initiated using \fBcron\fR(1M) to periodically check the size of \fB/var/adm/pacct\fR. If the size exceeds \fIblocks\fR, \fB500\fR by default, \fBturnacct\fR will be invoked with argument \fBswitch\fR. To avoid a conflict with \fBturnacct switch\fR execution in \fBrunacct\fR, do not run \fBckpacct\fR and \fBrunacct\fR simultaneously. If the number of free disk blocks in the \fB/var\fR file system falls below  \fB500\fR, \fBckpacct\fR will automatically turn off the collection of process accounting records via the \fBoff\fR argument to \fBturnacct\fR. When at least  \fB500\fR blocks are restored,  the accounting will be activated again on the next invocation of \fBckpacct\fR. This feature is sensitive to the frequency at which \fBckpacct\fR is executed, usually by the \fBcron\fR(1M) command.
.SS "dodisk Command"
.sp
.LP
\fBdodisk\fR should be invoked by \fBcron\fR(1M) to perform the disk accounting functions.
.SS "lastlogin Command"
.sp
.LP
\fBlastlogin\fR is invoked by \fBrunacct\fR(1M) to update \fB/var/adm/acct/sum/loginlog\fR, which shows the last date on which each person logged in.
.SS "monacct Command"
.sp
.LP
\fBmonacct\fR should be invoked once each month or each accounting period. \fInumber\fR indicates which month or period it is. If \fInumber\fR is not given, it defaults to the current month (01\(mi12). This default is useful if \fBmonacct\fR is to executed using \fBcron\fR(1M) on the first day of each month. \fBmonacct\fR creates summary files in \fB/var/adm/acct/fiscal\fR and restarts the summary files in \fB/var/adm/acct/sum\fR.
.SS "nulladm Command"
.sp
.LP
\fBnulladm\fR creates \fIfilename\fR with mode 664 and ensures that owner and group are \fBadm\fR. It is called by various accounting shell procedures.
.SS "prctmp Command"
.sp
.LP
\fBprctmp\fR can be used to print the session record file (normally \fB/var/adm/acct/nite/ctmp\fR created by \fBacctcon1\fR (see \fBacctcon\fR(1M)).
.SS "prdaily Command"
.sp
.LP
\fBprdaily\fR is invoked by \fBrunacct\fR(1M) to format a report of the previous day's accounting data. The report resides in \fB/var/adm/acct/sum/rprt/mmdd\fR where \fImmdd\fR is the month and day of the report. The current daily accounting reports may be printed by typing \fBprdaily\fR. Previous days' accounting reports can be printed by using the \fImmdd\fR option and specifying the exact report date desired.
.SS "prtacct Command"
.sp
.LP
\fBprtacct\fR can be used to format and print any total accounting (\fBtacct\fR)file.
.SS "shutacct Command"
.sp
.LP
\fBshutacct\fR is invoked during a system shutdown to turn process accounting off and append a  \fIreason\fR record to \fB/var/adm/wtmpx\fR.
.SS "startup Command"
.sp
.LP
\fBstartup\fR can be invoked when the system is brought to a multi-user state to turn process accounting on.
.SS "turnacct Command"
.sp
.LP
\fBturnacct\fR is an interface to \fBaccton\fR (see \fBacct\fR(1M)) to turn process accounting \fBon\fR or \fBoff\fR. The \fBswitch\fR argument moves the current \fB/var/adm/pacct\fR to the next free name in \fB/var/adm/pacct.\fIincr\fR\fR (where \fIincr\fR is a number starting with \fB0\fR and incrementing by one  for each additional \fBpacct\fR file), then turns accounting back on again. This procedure is called by \fBckpacct\fR and thus can be taken care of by the \fBcron\fR(1M) command and used to keep \fB pacct\fR to a reasonable size.   \fBshutacct\fR uses \fBturnacct\fR to stop process accounting.   \fBstartup\fR uses \fBturnacct\fR to start process accounting.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
This option prints a report of exceptional resource usage by command, and may be used on current day's accounting data only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
This option prints a report of exceptional usage by login id for the specified date. Previous daily reports are cleaned up and therefore inaccessible after each invocation of \fBmonacct\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 6n
.rt  
This option uses \fBacctdusg\fR (see \fBacct\fR(1M)) to do a slower version of disk accounting by login directory. \fIfilename\fRs specifies the one or more filesystem names where disk accounting will be done.  If \fIfilename\fRs are used, disk accounting will be done on these filesystems only. If the \fB-o\fR option is used, \fIfilename\fRs should be mount points of mounted filesystems. If the \fB-o\fR option is omitted, \fIfilename\fRs should be the special file names of mountable filesystems.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/logadm.conf\fR\fR
.ad
.RS 30n
.rt  
Configuration file for the \fBlogadm\fR(1M) command
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/acct\fR\fR
.ad
.RS 30n
.rt  
Holds all accounting commands listed in section \fB1M\fR of this manual
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/acct/ptecms.awk\fR\fR
.ad
.RS 30n
.rt  
Contains the limits for exceptional usage by command name
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/acct/ptelus.awk\fR\fR
.ad
.RS 30n
.rt  
Contains the limits for exceptional usage by login \fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/acct/fiscal\fR\fR
.ad
.RS 30n
.rt  
Fiscal reports directory
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/acct/nite\fR\fR
.ad
.RS 30n
.rt  
Working directory
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/acct/sum\fR\fR
.ad
.RS 30n
.rt  
Summary directory that contains information for \fBmonacct\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/acct/sum/loginlog\fR\fR
.ad
.RS 30n
.rt  
File updated by last login
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/fee\fR\fR
.ad
.RS 30n
.rt  
Accumulator for fees
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/pacct\fR\fR
.ad
.RS 30n
.rt  
Current file for per-process accounting
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/pacct\fR\fIincr\fR\fR
.ad
.RS 30n
.rt  
Used if \fBpacct\fR gets large and during execution of daily accounting procedure
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.RS 30n
.rt  
History of user access and administration information
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/accounting/legacy-accounting
.TE

.SH SEE ALSO
.sp
.LP
\fBacctcom\fR(1), \fBacct\fR(1M), \fBacctcms\fR(1M), \fBacctcon\fR(1M), \fBacctmerg\fR(1M), \fBacctprc\fR(1M), \fBcron\fR(1M), \fBfwtmp\fR(1M), \fBlogadm\fR(1M), \fBrunacct\fR(1M), \fBacct\fR(2), \fBacct.h\fR(3HEAD), \fButmpx\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
See \fBrunacct\fR(1M) for the main daily accounting shell script, which performs the accumulation of connect, process, fee, and disk accounting on a daily basis. It also creates summaries of command usage.
