Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/addbadsec.1m
'\" te
.\" Copyright (c) 1998, 2011, Oracle and/or its affiliates. All rights reserved.
.TH addbadsec 1M "24 Feb 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
addbadsec \- map out defective disk blocks
.SH SYNOPSIS
.LP
.nf
\fBaddbadsec\fR [\fB-p\fR] [\fB-a\fR \fIblkno\fR [\fIblkno\fR]...] [\fB-f\fR \fIfilename\fR] \fIraw_device\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBaddbadsec\fR is used by the system administrator to map out bad disk blocks. Normally, these blocks are identified during surface analysis, but occasionally the disk subsystem reports unrecoverable data errors indicating a bad block. A block number reported in this way can be fed directly into \fBaddbadsec\fR, and the block will be remapped. \fBaddbadsec\fR will first attempt hardware remapping. This is supported on \fBSCSI\fR drives and takes place at the disk hardware level. If the target is an \fBIDE\fR drive, then software remapping is used. In order for software remapping to succeed, the partition must contain an alternate slice and there must be room in this slice to perform the mapping. 
.sp
.LP
It should be understood that bad blocks lead to data loss. Remapping a defective block does not repair a damaged file. If a bad block occurs to a disk-resident file system structure such as a superblock, the entire slice might have to be recovered from a backup.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Adds the specified blocks to the hardware or software map. If more than one block number is specified, the entire list should be quoted and block numbers should be separated by white space.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Adds the specified blocks to the hardware or software map. The bad blocks are listed, one per line, in the specified file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
Causes \fBaddbadsec\fR to print the current software map. The output shows the defective block and the assigned alternate. This option cannot be used to print the hardware map.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
\fB\fIraw_device\fR\fR
.ad
.RS 14n
.rt  
The address of the disk drive (see \fBFILES\fR).
.RE

.SH FILES
.sp
.LP
The raw device should be \fB/dev/rdsk/c?[t?]d?p0\fR. See \fBdisks\fR(1M) for an explanation of \fBSCSI\fR and \fBIDE\fR device naming conventions.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBdisks\fR(1M), \fBdiskscan\fR(1M), \fBfdisk\fR(1M), \fBfmthard\fR(1M), \fBformat\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The \fBformat\fR(1M) utility is available to format, label, analyze, and repair \fBSCSI\fR disks. This utility is included with the \fBaddbadsec\fR, \fBdiskscan\fR(1M), \fBfdisk\fR(1M), and \fBfmthard\fR(1M) commands available for x86. To format an \fBIDE\fR disk, use the \fB DOS\fR "format" utility; however, to label, analyze, or repair \fBIDE\fR disks on x86 systems, use the Solaris \fBformat\fR(1M) utility.
