Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/atohexlabel.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH atohexlabel 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
atohexlabel \- convert a human readable label to its internal text equivalent
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/atohexlabel\fR [\fIhuman-readable-sensitivity-label\fR]
.fi

.LP
.nf
\fB/usr/sbin/atohexlabel\fR \fB-c\fR [\fIhuman-readable-clearance\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBatohexlabel\fR converts a human readable label into an internal text representation that is safe for storing in a public object. If no option is supplied, the label is assumed to be a sensitivity label.
.sp
.LP
Internal conversions can later be parsed to their same value. This internal form is often hexadecimal. The converted label is written to the standard output file. If no human readable label is specified, the label is read from the standard input file. The expected use of this command is emergency repair of labels that are stored in internal databases.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Identifies the human readable label as a clearance.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
On success.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
On failure, and writes diagnostics to the standard error file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/label_encodings\fR\fR
.ad
.sp .6
.RS 4n
The label encodings file contains the classification names, words, constraints, and values for the defined labels of this system.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilitySee below.
.TE

.sp
.LP
The command output is Committed for systems with the same \fBlabel_encodings\fR file. The command invocation is Committed for systems that implement the DIA MAC policy.
.SH SEE ALSO
.sp
.LP
\fBhextoalabel\fR(1M), \fBlabel_to_str\fR(3TSOL), \fBstr_to_label\fR(3TSOL), \fBlabel_encodings\fR(4), \fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
.sp
.LP
This file is part of the Defense Intelligence Agency (DIA) Mandatory Access Control (MAC) policy. This file might not be applicable to other MAC policies that might be developed for future releases of Solaris Trusted Extensions software.
