Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/auditd.1m
'\" te
.\" Copyright (c) 1999, 2011, Oracle and/or its affiliates. All rights reserved.
.TH auditd 1M "24 Feb 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
auditd \- audit daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/auditd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The audit daemon, \fBauditd\fR, controls the generation and location of audit trail files and the generation of \fBsyslog\fR messages based on its configuration (see \fBauditconfig\fR(1M)). If auditing is enabled, \fBauditd\fR reads its configuration to do the following:
.RS +4
.TP
.ie t \(bu
.el o
Configure audit policy.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure the audit queue control parameters.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure the event-to-class mappings.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set the default audit masks.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Load one or more plugins.
.sp
Solaris provides three plugins. \fBaudit_binfile\fR(5) writes binary audit data to a file. \fBaudit_remote\fR(5) sends binary audit data to an authenticated server with privacy and integrity protection. \fBaudit_syslog\fR(5) sends text summaries of audit records to the \fBsyslog\fR daemon.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Read audit data from the kernel and pass that data to each of the active plugins.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Execute the \fBaudit_warn\fR(1M) script to warn of various conditions.
.RE
.sp
.LP
\fBaudit\fR(1M) is used to control \fBauditd\fR. It can cause \fBauditd\fR to:
.RS +4
.TP
.ie t \(bu
.el o
Close the current audit file and open a new one.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Start and refresh the service based on the current properties.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Close the audit trail and terminate auditing.
.RE
.sp
.LP
\fBauditconfig\fR(1M) is used to configure \fBauditd\fR. It can configure the active and permanent:
.RS +4
.TP
.ie t \(bu
.el o
audit policy
.RE
.RS +4
.TP
.ie t \(bu
.el o
audit queue control parameters
.RE
.RS +4
.TP
.ie t \(bu
.el o
default audit masks
.RE
.RS +4
.TP
.ie t \(bu
.el o
which plugins are to be loaded
.RE
.RS +4
.TP
.ie t \(bu
.el o
plugin attributes
.RE
.SS "Audit Record Queue"
.sp
.LP
The maximum number of records to queue for audit data sent to the plugin is specified by the \fBqsize\fR parameter specified for the plugin. If omitted, the current \fBhiwater\fR mark is used. See the \fB-getqctrl\fR option in \fBauditconfig\fR(1M). When this maximum is reached, \fBauditd\fR will either block processes or discard data, depending on the \fBcnt\fR audit policy as described in \fBauditconfig\fR(1M).
.SS "Auditing Conditions"
.sp
.LP
The \fBaudit\fR daemon and \fBaudit\fR plugins invoke the program \fBaudit_warn\fR(1M) under certain conditions. See \fBaudit_warn\fR(1M) for more information.
.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
\fBetc/security/audit/audit_class\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBetc/security/audit/audit_event\fR
.RE
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBaudit\fR(1M), \fBaudit_warn\fR(1M), \fBauditconfig\fR(1M), \fBpraudit\fR(1M), \fBaudit_class\fR(4), \fBaudit_event\fR(4), \fBaudit.log\fR(4), \fBattributes\fR(5), \fBaudit_binfile\fR(5), \fBaudit_flags\fR(5), \fBaudit_remote\fR(5), \fBaudit_syslog\fR(5), \fBsmf\fR(5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide: Security Services\fR.
.SH NOTES
.sp
.LP
\fBauditd\fR is loaded in the global zone at boot time if auditing is enabled.
.sp
.LP
If the audit policy \fBperzone\fR is set, \fBauditd\fR runs in each zone, starting automatically when the local zone boots. If a zone is running when the \fBperzone\fR policy is set, auditing must be started manually in local zones. It is not necessary to reboot the system or the local zone to start auditing in a local zone. \fBauditd\fR can be started with \fBaudit\fR \fB-s\fR and will start automatically with future boots of the zone.
.sp
.LP
When \fBauditd\fR runs in a local zone, the configuration is taken from the local zone's \fBsmf\fR(5) repository and the \fB/etc/security\fR directory's files: \fBaudit_class\fR, \fBuser_attr\fR, and \fBaudit_event\fR.
.sp
.LP
Configuration changes do not affect audit sessions that are currently running, as the changes do not modify a process's preselection mask. To change the preselection mask on a running process, use the \fB-setpmask\fR option of the \fBauditconfig\fR command (see \fBauditconfig\fR(1M)). If the user logs out and logs back in, the new configuration changes will be reflected in the next audit session.
.sp
.LP
The audit service FMRI is \fBsvc:/system/auditd:default\fR.
