Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/auditstat.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH auditstat 1M "24 Feb 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
auditstat \- display kernel audit statistics
.SH SYNOPSIS
.LP
.nf
\fBauditstat\fR [\fB-c\fR \fIcount\fR] [\fB-h\fR \fInumlines\fR] [\fB-i\fR \fIinterval\fR] [\fB-n\fR]
     [\fB-T\fR u | d ] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBauditstat\fR displays kernel audit statistics. The fields displayed are as follows:
.sp
.ne 2
.mk
.na
\fB\fBaud\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records processed by the userland audit.
.RE

.sp
.ne 2
.mk
.na
\fB\fBctl\fR\fR
.ad
.RS 8n
.rt  
This field is obsolete.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdrop\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records that have been dropped. Records are dropped according to the kernel audit policy. See \fBauditconfig\fR(1M), \fBAUDIT_CNT\fR policy for details.
.RE

.sp
.ne 2
.mk
.na
\fB\fBenq\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records put on the kernel audit queue.
.RE

.sp
.ne 2
.mk
.na
\fB\fBgen\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records that have been constructed (not the number written).
.RE

.sp
.ne 2
.mk
.na
\fB\fBkern\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records produced by user processes (as a result of system calls).
.RE

.sp
.ne 2
.mk
.na
\fB\fBmem\fR\fR
.ad
.RS 8n
.rt  
The total number of Kbytes of memory currently in use by the kernel audit module.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnona\fR\fR
.ad
.RS 8n
.rt  
The total number of non-attributable audit records that have been constructed. These are audit records that are not attributable to any particular user.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrblk\fR\fR
.ad
.RS 8n
.rt  
The total number of times that the audit queue has blocked waiting to process audit data.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtot\fR\fR
.ad
.RS 8n
.rt  
The total number of Kbytes of audit data written to the audit trail.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwblk\fR\fR
.ad
.RS 8n
.rt  
The total number of times that user processes blocked on the audit queue at the high water mark.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwrtn\fR\fR
.ad
.RS 8n
.rt  
The total number of audit records written. The difference between \fBenq\fR and \fBwrtn\fR is the number of outstanding audit records on the audit queue that have not been written.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcount\fR\fR
.ad
.RS 15n
.rt  
Display the statistics a total of \fIcount\fR times. If \fIcount\fR is equal to zero, statistics are displayed indefinitely. A time interval must be specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fInumlines\fR\fR
.ad
.RS 15n
.rt  
Display a header for every \fInumlines\fR of statistics printed. The default is to display the header every 20 lines. If \fInumlines\fR is equal to zero, the header is never displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR\fR
.ad
.RS 15n
.rt  
Display the statistics every \fIinterval\fR where \fIinterval\fR is the number of seconds to sleep between each collection.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
Display the number of kernel audit events currently configured.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu\fR | \fBd\fR\fR
.ad
.RS 15n
.rt  
Display a time stamp.
.sp
Specify \fBu\fR for a printed representation of the internal representation of time. See \fBtime\fR(2). Specify \fBd\fR for standard date format. See \fBdate\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 15n
.rt  
Display the version number of the kernel audit module software.
.RE

.SH EXIT STATUS
.sp
.LP
\fBauditstat\fR returns \fB0\fR upon success and \fB1\fR upon failure.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBauditconfig\fR(1M), \fBpraudit\fR(1M), \fBattributes\fR(5)
