Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/captoinfo.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH captoinfo 1M "18 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
captoinfo \- convert a termcap description into a terminfo description
.SH SYNOPSIS
.LP
.nf
\fBcaptoinfo\fR [\fB-1\fR] [\fB-v\fR]... [\fB-V\fR] [\fB-w\fR \fIwidth\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBcaptoinfo\fR looks in \fIfilename\fR for  \fBtermcap\fR descriptions. For each one found, an equivalent  \fBterminfo\fR description is written to standard output, along with any comments found. A description which is expressed as relative to another description (as specified in the \fBtermcap\fR \fBtc = field\fR) is reduced to the minimum superset before being displayed.
.sp
.LP
If no  \fIfilename\fR is given, then the environment variable \fB\fR\fBTERM\fR\fBCAP \fR is used for the filename or entry. If \fB\fR\fBTERM\fR\fBCAP \fR is a full pathname to a file,  only the terminal whose name is specified in the environment variable \fBTERM\fR is extracted from that file. If the environment variable \fB\fR\fBTERM\fR\fBCAP \fR is not set, then the file \fB/usr/share/lib/termcap\fR is read.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB\(mi1\fR\fR
.ad
.RS 12n
.rt  
Display the fields one to a line. Otherwise, the fields are printed several to a line, with a maximum width of 60 characters.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 12n
.rt  
Display tracing information on the standard error as the program runs. Specifying additional \fB-v\fR options displays more detailed information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 12n
.rt  
Display the version of the program in use on the standard error and then exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fI width\fR\fR
.ad
.RS 12n
.rt  
Change the output to \fIwidth\fR characters.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/terminfo/?/*\fR\fR
.ad
.sp .6
.RS 4n
compiled terminal description database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/termcap\fR\fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBinfocmp\fR(1M), \fBcurses\fR(3CURSES), \fBterminfo\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
\fBcaptoinfo\fR should be used to convert \fBtermcap\fR entries to \fBterminfo\fR entries because the \fBtermcap\fR database may not be supplied in future releases.
