Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/chk_encodings.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH chk_encodings 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
chk_encodings \- check the label encodings file syntax
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/chk_encodings\fR [\fB-a\fR] [\fB-c\fR \fImaxclass\fR] [\fIpathname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBchk_encodings\fR checks the syntax of the label-encodings file that is specified by \fIpathname\fR. With the \fB-a\fR option, \fBchk_encodings\fR also prints a semantic analysis of the label-encodings file that is specified by \fIpathname\fR. If \fIpathname\fR is not specified, \fBchk_encodings\fR checks and analyzes the \fB/etc/security/tsol/label_encodings\fR file.
.sp
.LP
If label-encodings file analysis was requested, whatever analysis can be provided is written to the standard output file even if errors were found.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 15n
.rt  
Provide a semantic analysis of the label encodings file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fImaxclass\fR\fR
.ad
.RS 15n
.rt  
Accept a maximum classification value of \fImaxclass\fR (default 255) in the label encodings file \fBCLASSIFICATIONS\fR section.
.RE

.SH EXIT STATUS
.sp
.LP
When successful, \fBchk_encodings\fR returns an exit status of \fB0\fR (true) and writes to the standard output file a confirmation that no errors were found in \fIpathname\fR. Otherwise, \fBchk_encodings\fR returns an exit status of nonzero (false) and writes an error diagnostic to the standard output file.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/label_encodings\fR\fR
.ad
.sp .6
.RS 4n
The label encodings file contains the classification names, words, constraints, and values for the defined labels of this system.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilitySee below.
_
StandardT{
DDS-2600-6216-93, \fICompartmented Mode Workstation Labeling: Encodings Format\fR, September 1993
T}
.TE

.sp
.LP
The command output is Not-an-Interface. The command invocation is Committed for systems that implement the DIA MAC policy.
.SH SEE ALSO
.sp
.LP
\fBlabel_encodings\fR(4), \fBattributes\fR(5), \fBlabels\fR(5)
.sp
.LP
\fIHow to Analyze and Verify the label_encodings File\fR in \fISolaris Trusted Extensions Label Administration\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
.sp
.LP
This file is part of the Defense Intelligence Agency (DIA) Mandatory Access Control (MAC) policy. This file might not be applicable to other MAC policies that might be developed for future releases of Solaris Trusted Extensions software.
