Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/clear_locks.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.TH clear_locks 1M "6 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
clear_locks \- clear locks held on behalf of an NFS client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/clear_locks\fR [\fB-s\fR] \fIhostname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBclear_locks\fR command removes all file, record, and share locks created by the \fIhostname\fR and held on the current host, regardless of which process created or owns the locks.
.sp
.LP
This command can be run only by the super-user.
.sp
.LP
This command should only be used to repair the rare case of a client crashing and failing to clear held locks. Clearing locks held by an active client may cause applications to fail in an unexpected manner.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Remove all locks created by the current machine and held by the server \fIhostname\fR.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported: 
.sp
.ne 2
.mk
.na
\fB\fIhostname\fR\fR
.ad
.RS 12n
.rt  
name of host server
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
If not root.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Usage error.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
If unable to contact server (\fBRPC\fR).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBfcntl\fR(2), \fBattributes\fR(5)
