Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/consadm.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH consadm 1m "27 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
consadm \- select or display devices used as auxiliary console devices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/consadm\fR 
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-a\fR \fIdevice\fR.\|.\|.] [\fB-p\fR]
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-d\fR \fIdevice\fR.\|.\|.] [\fB-p\fR]
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-p\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBconsadm\fR selects the hardware \fIdevice\fR or devices to be used as auxiliary console devices, or displays the current device. Only superusers are allowed to make or display auxiliary console device selections.
.sp
.LP
Auxiliary console devices receive copies of \fBconsole\fR messages, and can be used as the console during \fBsingle user\fR mode. In particular, they receive kernel messages and messages directed to \fB/dev/sysmsg\fR. On Solaris x86 based systems they can also be used for interaction with the bootstrap.
.sp
.LP
By default, selecting a display device to be used as an auxiliary console device selects that device for the duration the system remains up. If the administrator needs the selection to persist across reboots the \fB-p\fR option can be specified.
.sp
.LP
\fBconsadm\fR runs a daemon in the background, monitoring auxiliary console devices. Any devices that are disconnected (hang up, lose carrier) are removed from the auxiliary console device list, though not from the persistent list. While auxiliary console devices may have been removed from the device list receiving copies of \fBconsole\fR messages, those messages will always continue to be displayed by the default console device.
.sp
.LP
The daemon will not run if it finds there are not any auxiliary devices configured to monitor. Likewise, after the last auxiliary console is removed, the daemon will shut itself down. Therefore the daemon persists for only as long as auxiliary console devices remain active.
.sp
.LP
See \fBeeprom\fR(1M) for instructions on assigning an auxiliary console device as the system console.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIdevice\fR\fR
.ad
.RS 13n
.rt  
Adds \fIdevice\fR to the list of auxiliary console devices. Specify \fIdevice\fR as the path name to the device or devices to be added to the auxiliary console device list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.RS 13n
.rt  
Removes \fIdevice\fR from the list of auxiliary console devices. Specify \fIdevice\fR as the path name to the device or devices to be removed from the auxiliary console device list. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 13n
.rt  
Prints the list of auxiliary consoles that will be auxiliary across reboots.
.sp
When invoked with the \fB-a\fR or \fB-d\fR options , tells the application to make the change persist across reboot.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAdding to the list of devices that will receive console messages
.sp
.LP
The following command adds \fB/dev/term/a\fR to the list of devices that will receive console messages. 

.sp
.in +2
.nf
example# \fBconsadm -a /dev/term/a\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRemoving from the list of devices that will receive console messages
.sp
.LP
The following command removes \fB/dev/term/a\fR from the list of devices that will receive console messages. This includes removal from the persistent list.

.sp
.in +2
.nf
example# \fBconsadm -d -p /dev/term/a\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRPrinting the list of devices selected as auxiliary console devices
.sp
.LP
The following command prints the name or names of the device or devices currently selected as auxiliary console devices.

.sp
.in +2
.nf
example# \fBconsadm\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables that affect the execution of \fBconsadm\fR: \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, and \fBNLSPATH\fR.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBkmdb\fR(1), \fBsvcs\fR(1), \fBeeprom\fR(1M), \fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBenviron\fR(5), \fBattributes\fR(5), \fBsmf\fR(5), \fBsysmsg\fR(7d), \fBconsole\fR(7d)
.SH NOTES
.sp
.LP
Auxiliary console devices are not usable for \fBkmdb\fR or firmware \fBI/O\fR, do not receive panic messages, and do not receive output directed to \fB/dev/console\fR.
.sp
.LP
The \fBconsadm\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/consadm
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
