Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/datadm.1m
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH datadm 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
datadm \- maintain DAT static registry file
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/datadm\fR [\fB-v\fR] [\fB-u\fR] [\fB-a\fR service_provider.conf] 
     [\fB-r\fR service_provider.conf]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdatadm\fR utility maintains the DAT static registry file, \fBdat.conf\fR(4).
.sp
.LP
This administrative configuration program allows uDAPL service providers to add and remove themselves to the \fBdat.conf\fR file.
.sp
.LP
You can add or remove interface adapters that a service provider supports from a system after its installation. You can use \fBdatadm\fR to update the \fBdat.conf\fR file to reflect the current state of the system. A new set of interface adapters for all the service providers currently installed is regenerated.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fBservice_provider.conf\fR\fR
.ad
.sp .6
.RS 4n
Enumerate each device entry in the \fBservice_provider.conf\fR(4) file into a list of interface adapters, that is, interfaces to external network that are available to uDAPL consumers. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fBservice_provider.conf\fR\fR
.ad
.sp .6
.RS 4n
Remove the list of interface adapters that corresponds to the device entry in the \fBservice_provider.conf\fR(4) file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Update the \fBdat.conf\fR to reflect the current state of the system with an up to date set of interface adapters for the service providers that are currently listed in the DAT static registry. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Display the DAT static registry file, \fBdat.conf\fR. 
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fREnumerating a Device Entry
.sp
.LP
The following example enumerates a device entry in the \fBservice_provider.conf\fR(4) file into interface adapters in the \fBdat.conf\fR(4) file. 

.sp
.LP
Assume that \fBSUNW\fR has a service provider library that supports the device \fBtavor\fR. It has a \fBservice_provider.conf\fR(4) file installed in the directory \fB/usr/share/dat/SUNWudaplt.conf\fR with a single entry as follows:

.sp
.in +2
.nf
driver_name=tavor u1.2 nonthreadsafe default\e
    udapl_tavor.so.1 SUNW.1.0 ""
.fi
.in -2
.sp

.sp
.LP
\fBtavor\fR is an Infiniband Host Channel Adapter with two ports. Both IB ports exist in a single IB partition, \fB0x8001\fR. If an IB partition is created and plumbed to each port (with the names \fBp8001.ibd0\fR and \fBp8001.ibd1\fR), there will be two IB partition instances. See \fBdladm\fR(1M) for more information on creating IB partition data links.

.sp
.in +2
.nf
# \fBdladm show-part\fR

LINK           PKEY      OVER       STATE      FLAGS
p8001.ibd0     8001      ibd0       unknown    ----
p8001.ibd1     8001      ibd1       unknown    ----
.fi
.in -2
.sp

.sp
.LP
Running the command:

.sp
.in +2
.nf
# \fBdatadm -a /usr/share/dat/SUNWudaplt.conf\fR
.fi
.in -2
.sp

.sp
.LP
\&...appends two new entries (if they do not already exist) in the \fB/etc/dat/dat.conf\fR file:

.sp
.in +2
.nf
p8001.ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
p8001.ibd1 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
.fi
.in -2

.LP
\fBExample 2 \fRUpdating the \fBdat.conf\fR to Reflect the Current State of the System
.sp
.LP
A new IB partition, \fB0x8002\fR, is added to the above example covering port 1 of the Host Channel Adapter. If a new IB partition is created on the port 1/partition \fB0x8002\fR with the partition link name specified as \fBp8002.ibd0\fR, there will be a third IB partition instance: \fBp8002.ibd0\fR.

.sp
.in +2
.nf
# \fBdladm show-part\fR
LINK           PKEY      OVER       STATE      FLAGS
p8001.ibd0     8001      ibd0       unknown    ----
p8001.ibd1     8001      ibd1       unknown    ----
p8002.ibd0     8000      ibd0       unknown    ----
.fi
.in -2
.sp

.sp
.LP
Running \fBdatadm -u\fR command, updates the \fB/etc/dat/dat.conf\fR file with a new entry added reflecting the current state of the system.

.sp
.LP
\fBdatadm -v\fR shows that there are now three entries in the \fB/etc/dat/dat.conf\fR file:

.sp
.in +2
.nf
p8001.ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor" 
p8001.ibd1 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
p8002.ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dat/dat.conf\fR\fR
.ad
.sp .6
.RS 4n
DAT static registry file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/io/infiniband/udapl
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBpkgadd\fR(1M), \fBpkgrm\fR(1M), \fBlibdat\fR(3LIB), \fBdat.conf\fR(4), \fBservice_provider.conf\fR(4), \fBattributes\fR(5)
