Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ddu-text.1m
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved
.TH ddu-text 1M "16 Sep 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
ddu-text \- text-based device driver utility
.SH SYNOPSIS
.LP
.nf
\fBddu-text\fR
.fi

.SH DESCRIPTION
.sp
.LP
The text-based device driver utility, \fBddu-text\fR, provides information about devices on a system running the Oracle Solaris operating system. \fBddu-text\fR enables a user to connect to the  Image Packaging System (IPS) and search device drivers for the devices that do not have drivers attached to them. By doing this, \fBddu-text\fR gives the user an opportunity to install missing drivers.
.sp
.LP
\fBddu-text\fR is text-based. It has a GUI counterpart, \fBddu\fR(1M), which is described in its own man page.
.sp
.LP
\fBddu-text\fR has no command-line options.
.SH EXAMPLES
.LP
\fBExample 1 \fRInvoking the \fBddu-text\fR
.sp
.LP
The following command invokes \fBddu-text\fR.

.sp
.in +2
.nf
% \fBddu-text\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Application exited successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
Application exited with a failure.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/ddu-text\fR\fR
.ad
.sp .6
.RS 4n
Executable for \fBddu-text\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydiagnostic/ddu
_
Interface StabilityExternal
.TE

.sp
.LP
Additional availability attribute values are: \fBdiagnostic/ddu/data\fR, \fBdiagnostic/ddu/library\fR, and \fBdiagnostic/ddu/locale\fR.
.SH SEE ALSO
.sp
.LP
\fBddu\fR(1M), \fBattributes\fR(5)
