Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ddu.1m
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved
.TH ddu 1M "16 Sep 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
ddu \- GUI-based device driver utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/ddu\fR [\fB--silent\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The GUI-based device driver utility, \fBddu\fR, provides information about devices on a system running the Oracle Solaris operating system. \fBddu\fR enables a user to connect to the  Image Packaging System (IPS) and search device drivers for the devices that do not have drivers attached to them. By doing this, \fBddu\fR gives the user an opportunity to install missing drivers.
.sp
.LP
\fBddu\fR is a GUI, with an easy-to-use interface. It has a text-based counterpart, \fBddu-text\fR(1M), which is described in its own man page.
.SH OPTIONS
.sp
.LP
The following options is supported:
.sp
.ne 2
.mk
.na
\fB\fB--silent\fR\fR
.ad
.sp .6
.RS 4n
\fBddu\fR runs silently. If it finds devices that are missing drivers a notification is posted. Clicking on the notification displays the DDU GUI.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRLaunching the \fBddu\fR GUI
.sp
.LP
The following command launches the \fBddu\fR GUI.

.sp
.in +2
.nf
% \fBddu\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRLaunching \fBddu\fR in Silent Mode
.sp
.LP
The following command launches \fBddu\fR in silent mode.

.sp
.in +2
.nf
% \fBddu --silent\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Application exited successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
Application exited with a failure.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/ddu\fR\fR
.ad
.sp .6
.RS 4n
Executable for \fBddu\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydiagnostic/ddu
_
Interface StabilityExternal
.TE

.sp
.LP
Additional availability attribute values are: \fBdiagnostic/ddu/data\fR, \fBdiagnostic/ddu/library\fR, and \fBdiagnostic/ddu/locale\fR.
.SH SEE ALSO
.sp
.LP
\fBddu-text\fR(1M), \fBattributes\fR(5)
