Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/devchassisd.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH devchassisd 1M "4 May 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
devchassisd \- devchassis daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/devchassis/devchassisd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdevchassis\fR daemon, \fBdevchassisd\fR, provides user-level services for the management of the \fB/dev/chassis\fR name space. It is a system daemon started by the Service Management Facility (see \fBsmf\fR(5)). Its fault management resource identifier (FMRI) is:
.sp
.in +2
.nf
svc:/system/devchassis:daemon
.fi
.in -2
.sp

.sp
.LP
Note that \fBdevchassisd\fR is a Consolidation Private interface. See \fBattributes\fR(5).
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--debug\fR\fR
.ad
.sp .6
.RS 4n
Run the daemon in standalone debug mode. Messages will be displayed on the controlling terminal instead of to syslog. And increased verbosity will be enabled to display more details about the internal operations of the daemon.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fREnabling the \fBdevchassis\fR Service
.sp
.LP
The following command enables the \fBdevchassis\fR service:

.sp
.in +2
.nf
# \fBsvcadm enable svc:/system/devchassis\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisabling the \fBdevchassis\fR Service
.sp
.LP
The following command disables the \fBdevchassis\fR service:

.sp
.in +2
.nf
# \fBsvcadm disable svc:/system/devchassis\fR
.fi
.in -2
.sp

.SH ERRORS
.sp
.LP
The \fBdevchassisd\fR daemon uses \fBsyslog\fR(3C) to report status and error messages. All of the messages are logged with the \fBLOG_DAEMON\fR facility. Error messages are logged with the \fBLOG_ERR\fR and \fBLOG_NOTICE\fR priorities, and informational messages are logged with the \fBLOG_INFO\fR priority. The default entries in the \fB/etc/syslog.conf\fR file log all of the \fBdevchassisd\fR daemon error messages to the \fB/var/adm/messages\fR log.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/devchassis/devchassisd\fR\fR
.ad
.sp .6
.RS 4n
\fBdevchassisd\fR daemon binary.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyslog\fR(3C), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBdevchassis\fR(7FS)
.SH NOTES
.sp
.LP
The \fBdevchassis\fR service is managed by the service management facility, \fBsmf\fR(5), under the fault management resource identifier (FMRI):
.sp
.in +2
.nf
svc:/system/devchassis
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
The \fBdevchassis\fR service is enabled by default.
