Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/devfsadm.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH devfsadm 1M "7 Feb 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
devfsadm, devfsadmd \- administration command for /dev
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/devfsadm\fR [\fB-C\fR] [\fB-c\fR \fIdevice_class\fR] [\fB-i\fR \fIdriver_name\fR] 
     [ \fB-n\fR] [\fB-r\fR \fIroot_dir\fR] [\fB-s\fR] [\fB-t\fR \fItable_file\fR] [\fB-u\fR] [\fB-v\fR]
.fi

.LP
.nf
\fB/usr/lib/devfsadm/devfsadmd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBdevfsadm\fR maintains the \fB/dev\fR namespace. It replaces the previous suite of \fBdevfs\fR administration tools including \fBdrvconfig\fR(1M), \fBdisks\fR(1M), \fBtapes\fR(1M), \fBports\fR(1M), \fBaudlinks\fR(1M), and \fBdevlinks\fR(1M).
.sp
.LP
The default operation is to attempt to load every driver in the system and attach to all possible device instances. Next, \fBdevfsadm\fR creates logical links to device nodes in \fB/dev\fR and \fB/devices\fR and loads the device policy.
.sp
.LP
\fBdevfsadmd\fR(1M) is the daemon version of \fBdevfsadm\fR(1M). The daemon is started during system startup and is responsible for handling both reconfiguration boot processing and updating \fB/dev\fR and \fB/devices\fR in response to dynamic reconfiguration event notifications from the kernel. 
.sp
.LP
For compatibility purposes, \fBdrvconfig\fR(1M), \fBdisks\fR(1M), \fBtapes\fR(1M), \fBports\fR(1M), \fBaudlinks\fR(1M), and \fBdevlinks\fR(1M) are implemented as links to \fBdevfsadm\fR. 
.sp
.LP
In addition to managing \fB/dev\fR, \fBdevfsadm\fR also maintains the \fBpath_to_inst\fR(4) database. 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
Cleanup mode. Prompt \fBdevfsadm\fR to cleanup dangling \fB/dev\fR links that are not normally removed. If the \fB-c\fR option is also used, \fBdevfsadm\fR only cleans up for the listed devices' classes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIdevice_class\fR\fR
.ad
.sp .6
.RS 4n
Restrict operations to devices of class \fIdevice_class\fR. Solaris defines the following values for \fIdevice_class\fR: \fBdisk\fR, \fBtape\fR, \fBport\fR, \fBaudio\fR, and \fBpseudo\fR. This option might be specified more than once to specify multiple device classes. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIdriver_name\fR\fR
.ad
.sp .6
.RS 4n
Configure only the devices for the named driver, \fIdriver_name\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Do not attempt to load drivers or add new nodes to the kernel device tree. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Suppress any changes to \fB/dev\fR. This is useful with the \fB-v\fR option for debugging. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItable_file\fR\fR
.ad
.sp .6
.RS 4n
Read an alternate \fBdevlink.tab\fR file. \fBdevfsadm\fR normally reads \fB/etc/devlink.tab\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Activate and attach devices for drivers added with \fBadd_drv\fR(1M) \fB-u\fR. Cannot be used together with \fB-n\fR or \fB-r\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIroot_dir\fR\fR
.ad
.sp .6
.RS 4n
Presume that the \fB/dev\fR directory trees are found under \fIroot_dir\fR, not directly under \fBroot\fR (\fB/\fR). No other use or assumptions are made about \fIroot_dir\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Print changes to \fB/dev\fR in verbose mode. 
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/devices\fR\fR
.ad
.sp .6
.RS 4n
device nodes directory
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev\fR\fR
.ad
.sp .6
.RS 4n
logical symbolic links to /devices
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/devfsadm/devfsadmd\fR\fR
.ad
.sp .6
.RS 4n
devfsadm daemon
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/.devfsadm_dev.lock\fR\fR
.ad
.sp .6
.RS 4n
update lock file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/.devfsadm_daemon.lock\fR\fR
.ad
.sp .6
.RS 4n
daemon lock file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/device_policy\fR\fR
.ad
.sp .6
.RS 4n
device policy file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/extra_privs\fR\fR
.ad
.sp .6
.RS 4n
additional device privileges
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBadd_drv\fR(1M), \fBmodinfo\fR(1M), \fBmodload\fR(1M), \fBmodunload\fR(1M), \fBrem_drv\fR(1M), \fBsvcadm\fR(1M), \fBtapes\fR(1M), \fBpath_to_inst\fR(4), \fBattributes\fR(5), \fBprivileges\fR(5), \fBsmf\fR(5), \fBdevfs\fR(7FS)
.SH NOTES
.sp
.LP
This document does not constitute an \fBAPI\fR. The \fB/devices\fR directory might not exist or might have different contents or interpretations in a future release. The existence of this notice does not imply that any other documentation that lacks this notice constitutes an \fBAPI\fR.
.sp
.LP
\fBdevfsadm\fR no longer manages the \fB/devices\fR name space. See \fBdevfs\fR(7FS).
.sp
.LP
As a daemon to support hot-plug and synchronous device naming, \fBdevfsadm\fR is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/devfsadm:default
.fi
.in -2
.sp

.sp
.LP
The status of the service can be queried using the \fBsvcs\fR(1) command.
