Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/df_ufs.1m
'\" te
.\" Copyright (c) 1989, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH df_ufs 1M "25 Feb 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
df_ufs \- report free disk space on ufs file systems
.SH SYNOPSIS
.LP
.nf
\fBdf\fR \fB-F\fR ufs [\fIgeneric_options\fR] [\fB-o\fR i] [\fIdirectory\fR | \fIspecial\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBdf\fR displays the amount of disk space occupied by \fBufs\fR file systems, the amount of used and available space, and how much of the file system's total capacity has been used.The amount of space reported as used and available is less than the amount of space in the file system; this is because the system reserves a fraction of the space in the file system to allow its file system allocation routines to work well. The amount reserved is typically about 10%; this can be adjusted using \fBtunefs\fR(1M). When all the space on the file system except for this reserve is in use, only the superuser can allocate new files and data blocks to existing files. When the file system is overallocated in this way, \fBdf\fR might report that the file system is more than 100% utilized.If neither \fIdirectory\fR nor \fIspecial\fR is specified, \fBdf\fR displays information for all mounted ufs file systems.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 19n
.rt  
Options supported by the generic \fBdf\fR command. See \fBdf\fR(1M) for a description of these options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 19n
.rt  
Specify \fBufs\fR file system specific options. The available option is: 
.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
Report the number of used and free inodes. This option can not be used with \fIgeneric_options\fR.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mnttab\fR\fR
.ad
.RS 15n
.rt  
list of file systems currently mounted
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os, system/xopen/xcu4
.TE

.SH SEE ALSO
.sp
.LP
\fBdf\fR(1M), \fBfsck\fR(1M), \fBfstyp\fR(1M), \fBtunefs\fR(1M), \fBmnttab\fR(4), \fBattributes\fR(5), \fBufs\fR(7FS), 
.SH NOTES
.sp
.LP
\fBdf\fR calculates its results differently for mounted and unmounted file systems. For unmounted systems, the numbers reflect the 10% reservation. This reservation is not reflected in \fBdf\fR output for mounted file systems. For this reason, the available space reported by the generic command can differ from the available space reported by this module.
.sp
.LP
\fBdf\fR might report remaining capacity even though \fBsyslog\fR warns \fBfilesystem full\fR. This issue can occur because \fBdf\fR only uses the available fragment count to calculate available space, but the file system requires contiguous sets of fragments for most allocations.
.sp
.LP
If you suspect that you have exhausted contiguous fragments on your file system, you can use the \fBfstyp\fR(1M) utility with the \fB-v\fR option. In the \fBfstyp\fR output, look at the \fBnbfree\fR (number of blocks free) and \fBnffree\fR (number of fragments free) fields. On unmounted filesystems, you can use \fBfsck\fR(1M) and observe the last line of output, which reports, among other items, the number of fragments and the degree of fragmentation. See \fBfsck\fR(1M).
