Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/dfmounts_nfs.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.TH dfmounts_nfs 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfmounts_nfs \- display mounted NFS resource information
.SH SYNOPSIS
.LP
.nf
\fBdfmounts\fR [\fB-F\fR nfs] [\fB-h\fR] [\fIserver\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBdfmounts\fR shows the local resources shared through  \fBNFS,\fR along with the list of clients that have mounted the resource. The \fB-F\fR flag may be omitted if  \fBNFS\fR is the only file system type listed in the file  \fB/etc/dfs/fstypes\fR.
.sp
.LP
\fBdfmounts\fR without options, displays all remote resources mounted on the local system, regardless of file system type.
.sp
.LP
The output of \fBdfmounts\fR consists of an optional header line (suppressed with the \fB-h\fR flag) followed by a list of lines containing whitespace-separated fields.  For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server pathname clients ...\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 12n
.rt  
Does not apply to  \fBNFS.\fR Printed as a hyphen (-).
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver\fR\fR
.ad
.RS 12n
.rt  
Specifies the system from which the resource was mounted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 12n
.rt  
Specifies the pathname that must be given to the \fBshare\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fIclients\fR\fR
.ad
.RS 12n
.rt  
Is a comma-separated list of systems that have mounted the resource.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fBnfs\fR\fR
.ad
.RS 10n
.rt  
Specifies the \fBnfs\fR-FSType.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 10n
.rt  
Suppress header line in output.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver\fR\fR
.ad
.RS 10n
.rt  
Displays information about the resources mounted from each server, where \fIserver\fR can be any system on the network.  If no server is specified, the \fIserver\fR is assumed to be the local system.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.RS 20n
.rt  

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/nfs
.TE

.SH SEE ALSO
.sp
.LP
\fBmount\fR(1M), \fBshare\fR(1M), \fBunshare\fR(1M), \fBattributes\fR(5)
