Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/diskscan.1m
'\" te
.\" Copyright (c) 1998, 2011, Oracle and/or its affiliates. All rights reserved.
.TH diskscan 1M "24 Feb 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
diskscan \- perform surface analysis
.SH SYNOPSIS
.LP
.nf
\fBdiskscan\fR [\fB-W\fR] [\fB-n\fR] [\fB-y\fR] \fIraw_device\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBdiskscan\fR is used by the system administrator to perform surface analysis on a portion of a hard disk. The disk portion may be a raw partition or slice; it is identified using its raw device name. By default, the specified portion of the disk is read (non-destructive) and errors reported on standard error. In addition, a progress report is printed on standard out. The list of bad blocks should be saved in a file and later fed into \fBaddbadsec\fR(1M), which will remap them.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Causes  \fBdiskscan\fR to suppress linefeeds when printing progress information on standard out.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-W\fR\fR
.ad
.RS 6n
.rt  
Causes \fBdiskscan\fR to perform write and read surface analysis. This type of surface analysis is destructive and should be invoked with caution.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.RS 6n
.rt  
Causes  \fBdiskscan\fR to suppress the warning regarding destruction of existing data that is issued when  \fB-W\fR is used.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIraw_device\fR\fR
.ad
.RS 14n
.rt  
The address of the disk drive (see \fBFILES\fR).
.RE

.SH FILES
.sp
.LP
The raw device should be \fB/dev/rdsk/c?[t?]d?[ps]?\fR. See \fBdisks\fR(1M) for an explanation of \fBSCSI\fR and \fBIDE\fR device naming conventions.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBaddbadsec\fR(1M), \fBdisks\fR(1M), \fBfdisk\fR(1M), \fBfmthard\fR(1M), \fBformat\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The \fBformat\fR(1M) utility is available to format, label, analyze, and repair \fBSCSI\fR disks. This utility is included with the \fBdiskscan\fR, \fBaddbadsec\fR(1M), \fBfdisk\fR(1M), and \fBfmthard\fR(1M) commands available for x86. To format an \fBIDE\fR disk, use the \fB DOS\fR \fBformat\fR utility; however, to label, analyze, or repair \fBIDE\fR disks on x86 systems, use the Solaris \fBformat\fR(1M) utility.
