Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/dlstat.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH dlstat 1M "4 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
dlstat \- report data links statistics
.SH SYNOPSIS
.LP
.nf
\fBdlstat\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat\fR [\fB-a\fR | \fB-A\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]]
     [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-phys\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR]
     [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-link\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR]
     [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-link\fR \fB-h\fR [\fB-Z\fR] [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR]
          [\fB-e\fR time] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-aggr\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]]
     [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdlstat\fR command reports run time statistics about data links. \fBdladm\fR(1M) \fBshow-phys\fR provides link-name information to \fBdlstat show-phys\fR. \fBdladm\fR(1M) \fBshow-link\fR provides link-name information to \fBdlstat show-link\fR. \fBdladm\fR(1M) \fBshow-aggr\fR provides link-aggregation information to \fBdlstat show-aggr\fR.
.sp
.LP
\fBdlstat\fR has the six forms of commands shown in the \fBSYNOPSIS\fR, above. The first two forms do not have subcommands, while the remaining forms do. All six forms are described under "Subcommands," below.
.SH OPTIONS
.sp
.LP
The \fBdlstat\fR command has the following options and operands that are common (unless explicitly marked otherwise) among a number of command forms shown under "Subcommands," below.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Dump all total statistics fields.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR\fR
.ad
.sp .6
.RS 4n
Specify an interval in seconds at which statistics are refreshed. The default interval is one second.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
Display a case-insensitive, comma-separated list of output fields to display. The field name must be one of the fields listed below, or the special value \fBall\fR to display all supported fields.
.sp
List of supported RX fields:
.RS +4
.TP
.ie t \(bu
.el o
\fBlink\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBindex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBrbytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBintrs\fR (only applicable without a subcommand or with \fBshow-link\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBpolls\fR (only applicable without a subcommand or with \fBshow-link\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBidrops\fR (only applicable without a subcommand or with \fBshow-link\fR)
.RE
List of TX side fields:
.RS +4
.TP
.ie t \(bu
.el o
\fBlink\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBindex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBobytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBopkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBodrops\fR (only applicable without a subcommand or with \fBshow-link\fR)
.RE
For the \fBshow-phys\fR subcommand, the \fBindex\fR column identifies individual RX and TX hardware rings within a physical device. For the \fBshow-link\fR subcommand, the \fBindex\fR column identifies RX and TX hardware lanes within a data link. See \fIOracle Solaris Administration: Network Interfaces and Network Virtualization\fR for an explanation of the difference between hardware rings and hardware lanes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Display output in a stable, machine-parseable format.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Display receive-side statistics only. Includes bytes and packets received, hardware and software drops, and so forth. See "Examples" for complete listing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Display transmit-side statistics only. Includes bytes and packets sent, drops, and so forth. See "Examples" for complete listing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR\fR
.ad
.sp .6
.RS 4n
If used, allows choosing the unit in which to display all statistics, for example, \fBR\fR:raw count, \fBK\fR:Kilobits, \fBM\fR:Megabits, \fBT\fR:Terabits, \fBP\fR:Petabits. If not used, then different units, as appropriate, are used to display the statistics, using the format \fIxy.zU\fR, where \fIx\fR, \fIy\fR, and \fIz\fR are numbers and \fIU\fR is the appropriate unit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
Display \fBZONE\fR column in the output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
Display the statistics only for links in the specified zone. By default, \fBdlstat\fR displays the statistics for links in all the zones when it is run from the global zone.
.sp
When run from a non-global zone, \fBdlstat\fR displays statistics only for links in that zone. A non-global zone cannot see links in other zones.
.RE

.sp
.ne 2
.mk
.na
\fB\fIlink\fR\fR
.ad
.sp .6
.RS 4n
If specified, display the statistics only for the named link, physical device (for \fBshow-phys\fR), or aggregation (for \fBshow-aggr\fR). Otherwise, display statistics for all links, devices, or aggregations.
.RE

.SH SUB-COMMANDS
.sp
.LP
\fBdlstat\fR supports the following command forms.
.sp
.ne 2
.mk
.na
\fB\fBdlstat\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Iteratively examine all links and report statistics. The output is sorted in descending order of link utilization. If no link is specified, the system displays statistics for all links. The traffic statistics are displayed per link and not per physical device. For example, for a VNIC configured on a physical link, traffic flowing through that VNIC is not reflected in the statistics for the underlying physical link. However, the link statistics will include traffic that matches user-defined flows configured on top of that link.
.sp
This command form has one option that is not described under "Options," above:
.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
Dump all statistics fields for this data-link. Output statistics of this command are inclusive of all the statistics reported by all other \fBdlstat\fR commands.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat\fR [\fB-a\fR | \fB-A\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Allows specifying which statistics to display.
.sp
The options for this command form are described under "Options," above.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat show-phys\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Display statistics for a physical device.
.sp
The options for this subcommand are described under "Options," above.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat show-link\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Display statistics for a link.
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdlstat show-link\fR \fB-h\fR [\fB-Z\fR] [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR] [\fB-e\fR \fItime\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Show the network usage history from a stored extended accounting file. Use of this syntax requires that net accounting has been previously configured and enabled by using \fBacctadm\fR(1M). The default output is the summary of network usage of the existing links for the entire period when extended accounting was enabled.
.sp
The \fIlink\fR argument is as described under "Options," above.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Display all historical network usage for the specified period when extended accounting is enabled. This includes usage information about links that have already been deleted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Specify the file from which extended accounting records of network usage history are read.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Display the dates for which there is logging information. The date is in the format \fImm\fR/\fIdd\fR/\fIyyyy\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
Specify the output format of the network usage history information. \fBgnuplot\fR is the only supported format.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fItime\fR\fR
.ad
.br
.na
\fB\fB-e\fR \fItime\fR\fR
.ad
.sp .6
.RS 4n
Specify start and stop times for data display. Time is in the format \fIMM\fR/\fIDD\fR/\fIYYYY\fR,\fIhh\fR:\fImm\fR:\fIss\fR. \fIhh\fR uses 24-hour clock notation.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdlstat show-aggr\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
Display per-port statistics for an aggregation.
.sp
The options for this subcommand are described under "Options," above.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying Statistics
.sp
.LP
To display statistics for all the links, enter following command. Statistics are displayed as 3-digits followed by decimal and then 2 digits with the appropriate unit.

.sp
.in +2
.nf
# \fBdlstat\fR
      LINK   IPKTS  RBYTES   OPKTS  OBYTES
   e1000g0 101.88K  32.86M  40.16K   4.37M
     nxge1   4.50M   6.78G   1.38M  90.90M
     vnic1       8     336       0       0
      net0  73.96K   6.81M       0       0
zone1/net0 144.47K  13.32M     247  16.29K
zone2/net0 132.89K  12.25M     236  15.82K
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisplaying RX-side Statistics
.sp
.LP
The following command displays receive-side statistics every one second.

.sp
.in +2
.nf
# \fBdlstat -r -i 1\fR
    LINK   IPKTS  RBYTES   INTRS   POLLS   IDROPS
e1000g0 101.91K  32.86M  87.56K  14.35K         0
  nxge1   9.61M  14.47G   5.79M   3.82M         0
  vnic1       8     336       0       0         0
e1000g0       0       0       0       0         0
  nxge1  82.13K 123.69M  50.00K  32.13K         0
  vnic1       0       0       0       0         0
      .       .       .       .       .         .
      .       .       .       .       .         .
.fi
.in -2
.sp

.LP
\fBExample 3 \fRDisplaying Statistics per Hardware Ring
.sp
.LP
The following commands displays statistics on a per receive-side hardware ring basis.

.sp
.in +2
.nf
# \fBdlstat show-phys -r nxge1\fR
 LINK TYPE   INDEX   IPKTS  RBYTES
nxge1   rx       0       0       0
nxge1   rx       1       0       0
nxge1   rx       2   1.73M   2.61G
nxge1   rx       3       0       0
nxge1   rx       4   8.44M  12.71G
nxge1   rx       5   5.68M   8.56G
nxge1   rx       6   4.90M   7.38G
nxge1   rx       7       0       0
.fi
.in -2
.sp

.LP
\fBExample 4 \fRDisplaying Statistics per Lane
.sp
.LP
The following commands displays statistics on a per receive-side lane basis. First, an interface with dedicated hardware lanes:

.sp
.in +2
.nf
# \fBdlstat show-link -r nxge1\fR
 LINK TYPE     ID INDEX   IPKTS  RBYTES   INTRS   POLLS  IDROPS
nxge1   rx  local    --       0       0       0       0       0
nxge1   rx     hw     1       0       0       0       0       0
nxge1   rx     hw     2   1.73M   2.61G   1.33M 400.22K       0
nxge1   rx     hw     3       0       0       0       0       0
nxge1   rx     hw     4   8.44M  12.71G   4.35M   4.09M       0
nxge1   rx     hw     5   5.68M   8.56G   3.72M   1.97M       0
nxge1   rx     hw     6   4.90M   7.38G   3.11M   1.80M       0
nxge1   rx     hw     7       0       0       0       0       0
.fi
.in -2
.sp

.sp
.LP
Then, an interface without dedicated hardware lanes, that is, a software lane only:

.sp
.in +2
.nf
# \fBdlstat show-link -r ixgbe0\fR
  LINK TYPE     ID INDEX   IPKTS  RBYTES   INTRS   POLLS IDROPS
ixgbe0   rx  local    --       0       0       0       0      0
ixgbe0   rx     sw    -- 794.28K   1.19G 794.28K       0      0
.fi
.in -2
.sp

.LP
\fBExample 5 \fRDisplaying Transmit-Side Statistics
.sp
.LP
The following command displays transmit-side statistics at five-second intervals.

.sp
.in +2
.nf
# \fBdlstat -t -i 5\fR
  LINK   OPKTS  OBYTES  ODROPS
e1000g0  40.24K   4.37M      0
  nxge1   9.76M 644.14M      0
  vnic1       0       0      0
e1000g0       0       0      0
  nxge1  26.82K   1.77M      0
  vnic1       0       0      0
      .       .       .      .
      .       .       .      .
      .       .       .      .
.fi
.in -2
.sp

.LP
\fBExample 6 \fRDisplaying Transmit-Side Ring Statistics
.sp
.LP
The following command displays transmit-side hardware ring statistics.

.sp
.in +2
.nf
# \fBdlstat show-phys -t nxge1\fR
 LINK TYPE INDEX   OPKTS  OBYTES
nxge1   tx     0      44   3.96K
nxge1   tx     1       0       0
nxge1   tx     2   1.48M 121.68M
nxge1   tx     3   2.45M 201.11M
nxge1   tx     4   1.47M 120.82M
nxge1   tx     5       0       0
nxge1   tx     6   1.97M 161.57M
nxge1   tx     7   4.59M 376.21M
nxge1   tx     8   2.43M 199.24M
nxge1   tx     9       0       0
nxge1   tx     10  3.23M 264.69M
nxge1   tx     11  1.88M 153.96M
.fi
.in -2
.sp

.LP
\fBExample 7 \fRDisplaying Transmit-Side Lane Statistics
.sp
.LP
The following command displays transmit-side lane statistics.

.sp
.in +2
.nf
# \fBdlstat show-link -t nxge1\fR
 LINK TYPE     ID INDEX   OPKTS  OBYTES  ODROPS
nxge1   tx     hw     0      32   1.44K       0
nxge1   tx     hw     1       0       0       0
nxge1   tx     hw     2   1.48M  97.95M       0
nxge1   tx     hw     3   2.45M 161.87M       0
nxge1   tx     hw     4   1.47M  97.25M       0
nxge1   tx     hw     5       3     276       0
nxge1   tx     hw     6   1.97M 130.05M       0
nxge1   tx     hw     7   4.59M 302.80M       0
nxge1   tx     hw     8   2.42M 302.80M       0
nxge1   tx     hw     9       0       0       0
nxge1   tx     hw     10  3.23M 213.05M       0
nxge1   tx     hw     11  1.88M 123.93M       0
.fi
.in -2
.sp

.LP
\fBExample 8 \fRSelecting a Particular Set of Statistics
.sp
.LP
The following command shows how you can select a set of statistics of particular interest.

.sp
.in +2
.nf
# \fBdlstat show-link -r -o LINK,TYPE,ID,INDEX,INTRS,POLLS nxge1\fR
 LINK TYPE     ID INDEX   INTRS   POLLS
nxge1   rx  local    --       0       0
nxge1   rx  other    --       0       0
nxge1   rx     hw     1       0       0
nxge1   rx     hw     2   2.47M 753.90K
nxge1   rx     hw     3       0       0
nxge1   rx     hw     4   8.24M   7.72M
nxge1   rx     hw     5   6.96M   3.68M
nxge1   rx     hw     6   5.82M   3.36M
nxge1   rx     hw     7       0       0
.fi
.in -2
.sp

.LP
\fBExample 9 \fRDisplaying Historical Network Usage
.sp
.LP
Network usage history statistics can be stored by using the extended accounting facility, \fBacctadm\fR(1M), with a command such as the following:

.sp
.in +2
.nf
# \fBacctadm -e basic -f /var/log/net.log net\fR
\fBacctadm net\fR
Network accounting: active
    Network accounting file: /var/log/net.log
  Tracked Network resources: basic
Untracked Network resources: src_ip,dst_ip,src_port,dst_port,protocol,
                             dsfield
.fi
.in -2
.sp

.sp
.LP
The saved historical data can then be retrieved in summary form with a command such as the following:

.sp
.in +2
.nf
# \fBdlstat show-link -h -f /var/log/net.log\fR
LINK      DURATION  IPACKETS RBYTES      OPACKETS OBYTES      BANDWIDTH
e1000g0   80        1031     546908      0        0           2.44 Kbps
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilitySee below
.TE

.sp
.LP
Screen output is Uncommitted. The invocation is Committed.
.SH SEE ALSO
.sp
.LP
\fBacctadm\fR(1M), \fBdladm\fR(1M), \fBifconfig\fR(1M), \fBkstat\fR(1M), \fBnetstat\fR(1M), \fBattributes\fR(5)
