Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/domainname.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH domainname 1M "15 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
domainname \- set or display name of the current domain
.SH SYNOPSIS
.LP
.nf
\fBdomainname\fR [\fIname-of-domain\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Without an argument, \fBdomainname\fR displays the name of the current domain name used in RPC exchanges, usually referred to as the NIS domain name. This name typically encompasses a group of \fBhosts\fR or \fBpasswd\fR entries under the same administration. The \fBdomainname\fR command is used by various components of Solaris to resolve names for entries such as are found in \fBpasswd\fR, \fBhosts\fR and \fBaliases\fR. By default, naming services such as \fBNIS\fR use \fBdomainname\fR to resolve names.
.sp
.LP
With \fBsolaris.smf.manage.domainname\fR \fBrbac\fR(5) privileges, you can set the name of the domain by specifying the domain name as the value of the  \fBconfig/domainname\fR property of the \fBnis/domain\fR service with a sequence  of commands such as the following:
.sp
.in +2
.nf
% \fBsvccfg -s nis/domain setprop config/domainname = \e\fR
\fBhostname: nisdomain.example.com\fR
% \fBsvccfg -s nis/domain:default refresh\fR
% \fBsvcadm enable nis/domain\fR
.fi
.in -2
.sp

.sp
.LP
In addition to setting the value of \fBconfig/domainname\fR, the preceding sequence enables the \fBnis/domain\fR service. This service is not enabled by default. The \fBnis/domain\fR service sets up all the shared NIS configuration, of which \fBdomainname\fR is the one mandatory configuration parameter.
.sp
.LP
The domain name for various naming services can also be set by other means. For example, \fBypinit\fR can be used to specify a different domain for all \fBNIS\fR calls. The domain name of the machine is usually set during boot time through the \fBdomainname\fR command by the \fBsvc:/system/identity:domain\fR service. If the new domain name is not saved in the \fB/etc/defaultdomain\fR file, the machine reverts to the old domain after it reboots.
.sp
.LP
The \fBsendmail\fR(1M) daemon, as shipped with Solaris, and the \fBsendmail\fR implementation provided by \fBsendmail.org\fR (formerly referred to as "Berkeley 8.x sendmail") both attempt to determine a local host's fully qualified host name at startup and both pursue follow-up actions if the initial search fails. It is in these follow-up actions that the two implementations differ.
.sp
.LP
Both implementations use a standard Solaris or Unix system call to determine its fully qualified host name at startup, following the name service priorities specified in \fBnsswitch.conf\fR(4). To this point, the Solaris and \fBsendmail.org\fR versions behave identically.
.sp
.LP
If the request for a fully qualified host name fails, the \fBsendmail.org\fR \fBsendmail\fR sleeps for 60 seconds, tries again, and, upon continuing failure, resorts to a short name. The Solaris version of \fBsendmail\fR makes the same initial request, but then, following initial failure, calls \fBdomainname\fR. If successful, the sleep is avoided.
.sp
.LP
On a Solaris machine, if you run the \fBsendmail.org\fR version of sendmail, you get the startup behavior (omitting the \fBdomainname\fR call) described above. If you run the Solaris \fBsendmail\fR, the \fBdomainname\fR call is made if needed.
.sp
.LP
If the Solaris \fBsendmail\fR cannot determine the fully qualified host name, use \fBcheck-hostname\fR(1M) as a troubleshooting aid. This script can offer guidance as to appropriate corrective action.
.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/defaultdomain\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/nsswitch.conf\fR
.RE
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBcheck-hostname\fR(1M), \fBhostconfig\fR(1M), \fBnamed\fR(1M), \fBsendmail\fR(1M),  \fBsvcadm\fR(1M),  \fBsvccfg\fR(1M),  \fBypinit\fR(1M), \fBaliases\fR(4), \fBdefaultdomain\fR(4), \fBhosts\fR(4), \fBnsswitch.conf\fR(4), \fBpasswd\fR(4), \fBattributes\fR(5), \fBrbac\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBdomainname\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/identity:domain
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
