Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/dsvclockd.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.TH dsvclockd 1M "3 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
dsvclockd \- DHCP service lock daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/dsvclockd\fR [\fB-d\fR 1 | 2] [\fB-f\fR ] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdsvclockd\fR daemon is a lock manager that works in conjunction with the Dynamic Host Configuration Protocol (\fBDHCP\fR) Data Service Library (\fBlibdhcpsvc\fR). It provides shared or exclusive access to the \fBdhcp_network\fR(4) and \fBdhcptab\fR(4) tables. This service is used by the \fBSUNWbinfiles\fR and \fBSUNWfiles\fR \fBDHCP\fR data store modules. See \fBdhcp_modules\fR(5). 
.sp
.LP
\fBdsvclockd\fR is started on demand by \fBlibdhcpsvc\fR. The \fBdsvclockd\fR daemon should be started manually only if command line options need to be specified. 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fB1\fR | \fB2\fR\fR
.ad
.RS 12n
.rt  
Set debug level. Two levels of debugging are currently available, \fB1\fR and \fB2\fR. Level \fB2\fR is more verbose.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 12n
.rt  
Run in the foreground instead of as a daemon process. When this option is used, messages are sent to standard error instead of to \fBsyslog\fR(3C).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 12n
.rt  
Provide verbose output.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/dhcp
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsyslog\fR(3C), \fBdhcp_network\fR(4), \fBdhcptab\fR(4), \fBdhcp_modules\fR(5), \fBattributes\fR(5)
