Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ff.1m
'\" te
.\" Copyright (c) 1993, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH ff 1M "10 Feb 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
ff \- list file names and statistics for a file system
.SH SYNOPSIS
.LP
.nf
\fBff\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBff\fR prints the pathnames and inode numbers of files in the file system which resides on the special device \fIspecial\fR. Other information about the files may be printed using options described below.  Selection criteria may be used to instruct  \fBff\fR to only print information for certain files. If no selection criteria are specified, information for all files considered will be printed (the default); the \fB-i\fR option may be used to limit files to those whose inodes are specified.
.sp
.LP
Output is sorted in ascending inode number order.   The default line produced by \fBff\fR is:
.sp
.LP
\fIpath-name\fR \|i-number
.sp
.LP
The maximum information the command will provide is:
.sp
.LP
\fIpath-name\fR \|i-number \|size \|uid
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 19n
.rt  
Specify the  \fIFSType\fR on which to operate. The  \fIFSType\fR should either be specified here or be determinable from  \fB/etc/vfstab\fR by matching the  \fIspecial\fR with an entry in the table, or by consulting \fB/etc/default/fs\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 19n
.rt  
Echo the complete command line, but do not execute the command. The command line is generated by using the options and arguments provided by the user and adding to them information derived from  \fB/etc/vfstab\fR. This option may be used to verify and validate the command line.
.RE

.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 19n
.rt  
Options that are supported by most FSType-specific modules of the command.  The following options are available:  
.sp
.ne 2
.mk
.na
\fB\fB-I\fR\fR
.ad
.RS 18n
.rt  
Do not print the i-node number after each path name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 18n
.rt  
Generate a supplementary list of all path names for multiply-linked files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fI prefix\fR\fR
.ad
.RS 18n
.rt  
The specified \fIprefix\fR will be added to each generated path name. The default is `.' (dot).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 18n
.rt  
Print the file size, in bytes, after each path name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 18n
.rt  
Print the owner's login name after each path name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fB-\fR\fIn\fR\fR
.ad
.RS 18n
.rt  
Select if the file has been accessed in \fIn\fR days.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fB-\fR\fIn\fR\fR
.ad
.RS 18n
.rt  
Select if the file has been written or created in \fIn\fR days.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fB-\fR\fIn\fR\fR
.ad
.RS 18n
.rt  
Select if file's status has been changed in \fIn\fR days.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fI file\fR\fR
.ad
.RS 18n
.rt  
Select if the file has been modified more recently than the argument \fBfile\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fI i-node-list\fR\fR
.ad
.RS 18n
.rt  
Generate names for only those i-nodes specified in \fIi-node-list\fR. \fIi-node-list\fR is a list of numbers separated by commas (with no intervening spaces).
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 19n
.rt  
Specify  \fIFSType\fR-specific options in a comma separated (without spaces) list of suboptions and keyword-attribute pairs for interpretation by the \fIFSType\fR-specific module of the command.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIspecial\fR\fR
.ad
.RS 11n
.rt  
A special device.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBff\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/fs\fR\fR
.ad
.RS 19n
.rt  
default local file system type. Default values can be set for the following flags in \fB/etc/default/fs\fR. For example: \fBLOCAL=ufs\fR  
.sp
.ne 2
.mk
.na
\fB\fBLOCAL\fR\fR
.ad
.RS 9n
.rt  
The default partition for a command if no FSType is specified.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.RS 19n
.rt  
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBfind\fR(1), \fBncheck\fR(1M), \fBstat\fR(2), \fBvfstab\fR(4), \fBattributes\fR(5), \fBlargefile\fR(5) Manual pages for the  \fIFSType\fR-specific modules of \fBff\fR.
.SH NOTES
.sp
.LP
This command may not be supported for all  \fIFSTypes\fR.
.sp
.LP
The  \fB-a\fR, \fB-m\fR, and \fB-c\fR flags examine the  \fBst_atime\fR, \fBst_mtime\fR, and \fBst_ctime\fR fields of the \fBstat\fR structure respectively.  (See \fBstat\fR(2).)
