Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ff_ufs.1m
'\" te
.\" Copyright (c) 1997, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH ff_ufs 1M "10 Feb 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
ff_ufs \- list file names and statistics for a ufs file system
.SH SYNOPSIS
.LP
.nf
\fBff\fR \fB-F\fR ufs [\fIgeneric_options\fR] [\fB-o\fR a,m,s] \fIspecial\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBff\fR prints the pathnames and inode numbers of files in the file system which resides on the special device \fIspecial\fR.  
.sp
.LP
See  \fBff\fR(1M) for information regarding the \fBff\fR command. See \fBOPTIONS\fR for information regarding the ufs-specific options.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 6n
.rt  
Specify \fBufs\fR file system specific options. The following options available are:  
.sp
.ne 2
.mk
.na
\fB\fBa\fR\fR
.ad
.RS 5n
.rt  
Print the `\fI\&.\fR' and `\fI\&.\|.\fR' directory entries.
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
Print mode information.  This option must be specified in conjunction with the \fB\fR\fB-i\fR\fB \fR\fIi-node-list\fR option (see \fBff\fR(1M)).
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
Print only special files and files with set-user-ID mode.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBfind\fR(1), \fBff\fR(1M), \fBncheck\fR(1M), \fBattributes\fR(5)
