Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/fiocompress.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fiocompress 1M "31 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
fiocompress \- file compression utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/fiocompress\fR \fB-c\fR [\fB-m\fR] [\fB-b\fR \fIblock_size\fR] \fIinput_file\fR \fIoutput_file\fR
.fi

.LP
.nf
\fB/usr/sbin/fiocompress\fR \fB-d\fR \fIinput_file\fR \fIoutput_file\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfiocompress\fR utility is a file compression tool that works together with the \fBdcfs\fR(7FS) file system to perform per-file compression. You can use \fBfiocompress\fR to decompress a compressed file or mark a compressed file as compressed, causing automatic decompression on read. The primary use of \fBfiocompress\fR is to compress files in the boot archive.
.sp
.LP
Note that this utility is not a Committed interface. See \fBattributes\fR(5).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIblock_size\fR\fR
.ad
.sp .6
.RS 4n
Specify a block size for compression. The default block size is 8192.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Compress the specified file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Decompress the specified file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Mark the compressed file for automatic decompression on read. Can be used only in conjunction with \fB-c\fR.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
The command completed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.sp .6
.RS 4n
The command exited due to an error.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBboot\fR(1M), \fBbootadm\fR(1M), \fBdcfs\fR(7FS), \fBufs\fR(7FS), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
This compression/decompression utility works only with files stored in a UFS file system.
.sp
.LP
There is no obvious way to determine whether a given file is compressed, other than copying the file and comparing the number of disk blocks of the copy against the original.
