Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/fmadm.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fmadm 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmadm \- fault management configuration tool
.SH SYNOPSIS
.LP
.nf
\fBfmadm\fR [\fB-q\fR] [\fIsubcommand\fR [\fIarguments\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfmadm\fR utility can be used by administrators and service personnel to view and modify system configuration parameters maintained by the Solaris Fault Manager, \fBfmd\fR(1M). \fBfmd\fR receives telemetry information relating to problems detected by the system software, diagnoses these problems, and initiates proactive self-healing activities such as disabling faulty components.
.sp
.LP
\fBfmadm\fR can be used to:
.RS +4
.TP
.ie t \(bu
.el o
view the set of diagnosis engines and agents that are currently participating in fault management,
.RE
.RS +4
.TP
.ie t \(bu
.el o
view the list of system components that have been diagnosed as faulty, and
.RE
.RS +4
.TP
.ie t \(bu
.el o
perform administrative tasks related to these entities.
.RE
.sp
.LP
The Fault Manager attempts to automate as many activities as possible, so use of \fBfmadm\fR is typically not required. When the Fault Manager needs help from a human administrator, service repair technician, or Oracle, it produces a message indicating its needs. It also refers you to a knowledge article on Sun's web site. The web site might ask you to use \fBfmadm\fR or one of the other fault management utilities to gather more information or perform additional tasks. The documentation for \fBfmd\fR(1M), \fBfmdump\fR(1M), and \fBfmstat\fR(1M) describe more about tools to observe fault management activities.
.sp
.LP
One responsibility of the Fault Manager is to keep track of the location of components. At the chassis level, the \fBfmadm\fR *\fB-alias\fR subcommands manages a chassis \fIproduct-id\fR.\fIchassis-id\fR to \fIalias-id\fR mapping.  The administered \fIalias-id\fR is intended to describe, in some meaningful way, the physical location of a chassis.
.sp
.LP
The \fBfmadm\fR utility requires the user to possess the \fBSYS_CONFIG\fR privilege. Refer to the \fI\fR for more information about how to configure Solaris privileges. The \fBfmadm\fR \fBload\fR subcommand requires that the user possess all privileges.
.SS "SUBCOMMANDS"
.sp
.LP
\fBfmadm\fR accepts the following subcommands. Some of the subcommands accept or require additional options and operands. The \fBload\fR, \fBunload\fR, \fBreset\fR, and \fBrotate\fR subcommands are intended for trained technical personnel. We recommend against use of these subcommands without the specific guidance of, for example, a Knowledge Base article.
.sp
.ne 2
.mk
.na
\fB\fBfmadm acquit\fR \fIfmri\fR \fB|\fR \fIlabel\fR [\fIuuid\fR]\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the specified resource is not to be considered to be a suspect in the fault event identified by \fIuuid\fR, or if no UUID is specified, then in any fault or faults that have been detected. The \fBfmadm acquit\fR subcommand should be used only at the direction of a documented Sun repair procedure. Administrators might need to apply additional commands to re-enable a previously faulted resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm acquit\fR \fIuuid\fR\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the fault event identified by \fIuuid\fR can be safely ignored. The \fBfmadm acquit\fR subcommand should be used only at the direction of a documented Sun repair procedure. Administrators might need to apply additional commands to re-enable any previously faulted resources.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm config\fR\fR
.ad
.sp .6
.RS 4n
Display the configuration of the Fault Manager itself, including the module name, version, and description of each component module. Fault Manager modules provide services such as automated diagnosis, self-healing, and messaging for hardware and software present on the system. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm faulty\fR [\fB-afgiprsv\fR] [\fB-n\fR \fImax\fR] [\fB-u\fR \fIuid\fR]\fR
.ad
.sp .6
.RS 4n
Display status information for resources that the Fault Manager currently believes to be faulty.
.sp
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 10n
.rt  
Display all faults. By default, the \fBfmadm faulty\fR command only lists output for resources that are currently present and faulty. If you specify the \fB-a\fR option, all resource information cached by the Fault Manager is listed, including faults which have been automatically corrected or where no recovery action is needed. The listing includes information for resources that might no longer be present in the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 10n
.rt  
Display faulty \fBfru's\fR (Field replaceable units).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 10n
.rt  
Group together faults which have the same fru, class and fault message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 10n
.rt  
Display persistent cache identifier for each resource in the Fault Manager.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fImax\fR\fR
.ad
.RS 10n
.rt  
If faults or resources are grouped together with the \fB-a\fR or \fB-g\fR options, limit the output to \fImax\fR entries. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 10n
.rt  
Pipe output through pager with form feed between each fault.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 10n
.rt  
Display Fault Management Resource with their Identifier (FMRI) and their fault management state.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 10n
.rt  
Display 1 line fault summary for each fault event.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuid\fR\fR
.ad
.RS 10n
.rt  
Only display fault with given \fBuid\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 10n
.rt  
Display full output.
.RE

The percentage certainty is displayed if a fault has multiple suspects, either of different classes or on different \fBfru\fR's. If more than one resource is on the same \fBfru\fR and it is not 100% certain that the fault is associated with the \fBfru\fR, the maximum percentage certainty of the possible suspects on the \fBfru\fR is displayed.
.RE

.sp
.LP
The Fault Manager associates the following states with every resource for which telemetry information has been received:
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.sp .6
.RS 4n
The resource is present and in use and has no known problems so far as the Fault Manager is concerned.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
The resource is not present or not usable but has no known problems. This might indicate the resource has been disabled or deconfigured by an administrator. Consult appropriate management tools for more information.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfaulted\fR\fR
.ad
.sp .6
.RS 4n
The resource is present but is not usable because one or more problems have been diagnosed by the Fault Manager. The resource has been disabled to prevent further damage to the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdegraded\fR\fR
.ad
.sp .6
.RS 4n
The resource is present and usable, but one or more problems have been diagnosed in the resource by the Fault Manager.
.sp
If all affected resources are in the same state, this is reflected in the message at the end of the list. Otherwise the state is given after each affected resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm flush\fR \fIfmri\fR\fR
.ad
.sp .6
.RS 4n
Flush the information cached by the Fault Manager for the specified resource, named by its FMRI. This subcommand should only be used when indicated by a documented Sun repair procedure. Typically, the use of this command is not necessary as the Fault Manager keeps its cache up-to-date automatically. If a faulty resource is flushed from the cache, administrators might need to apply additional commands to enable the specified resource. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm load\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Load the specified Fault Manager module. \fIpath\fR must be an absolute path and must refer to a module present in one of the defined directories for modules. Typically, the use of this command is not necessary as the Fault Manager loads modules automatically when Solaris initially boots or as needed. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm unload\fR \fImodule\fR\fR
.ad
.sp .6
.RS 4n
Unload the specified Fault Manager module. Specify \fImodule\fR using the basename listed in the \fBfmadm config\fR output. Typically, the use of this command is not necessary as the Fault Manager loads and unloads modules automatically based on the system configuration
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm repaired\fR \fIfmri\fR \fB|\fR \fIlabel\fR\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that a repair procedure has been carried out on the specified resource. The \fBfmadm repaired\fR subcommand should be used only at the direction of a documented Sun repair procedure. Administrators might need to apply additional commands to re-enable a previously faulted resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm replaced\fR \fIfmri\fR \fB|\fR \fIlabel\fR\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the specified resource has been replaced. This command should be used in those cases where the Fault Manager is unable to automatically detect the replacement. The \fBfmadm replaced\fR subcommand should be used only at the direction of a documented Sun repair procedure. Administrators might need to apply additional commands to re-enable a previously faulted resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm reset\fR [\fB-s\fR \fIserd\fR\fB]\fR \fImodule\fR\fR
.ad
.sp .6
.RS 4n
Reset the specified Fault Manager module or module subcomponent. If the \fB-s\fR option is present, the specified Soft Error Rate Discrimination (SERD) engine is reset within the module. If the \fB-s\fR option is not present, the entire module is reset and all persistent state associated with the module is deleted. The \fBfmadm reset\fR subcommand should only be used at the direction of a documented Sun repair procedure. The use of this command is typically not necessary as the Fault Manager manages its modules automatically. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm rotate\fR \fBerrlog | fltlog | infolog | infolog_hival\fR\fR
.ad
.sp .6
.RS 4n
The \fBrotate\fR subcommand is a helper command for \fBlogadm\fR(1M), so that \fBlogadm\fR can rotate live log files correctly. It is not intended to be invoked directly (and invoking it directly is likely to lose log history). Use one of the following commands to cause the appropriate logfile to be rotated, if the current one is not zero in size:
.sp
.in +2
.nf
# \fBlogadm -p now -s 1b /var/fm/fmd/errlog\fR
# \fBlogadm -p now -s 1b /var/fm/fmd/fltlog\fR
# \fBlogadm -p now -s 1b /var/fm/fmd/infolog\fR
# \fBlogadm -p now -s 1b /var/fm/fmd/infolog_hival\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm add-alias\fR \fIproduct-id\fR.\fIchassis-id\fR \fIalias-id\fR ['\fIcomment\fR']\fR
.ad
.sp .6
.RS 4n
The \fBadd-alias\fR subcommand is used to establish \fIalias-id\fR as a managed alias for the \fIproduct-id\fR.\fIchassis-id\fR chassis. When a managed alias is defined, the \fB/dev/chassis\fR \fBdevchassis\fR(7FS) name space representation of the chassis will use the more meaningful \fIalias-id\fR instead of the \fIproduct-id\fR.\fIchassis-id\fR.
.sp
.in +2
.nf
# \fBfmadm add-alias SUN-Storage-J4410.1039QAQ007 RACK29.U25-28\fR
.fi
.in -2
.sp

The command shown above will verify that the new mapping does not conflict with existing mappings. In the case of conflict, no mapping change occurs. This subcommand completes when the associated name space updates are complete. If the updated name space does not use the new \fIalias-id\fR, a warning if printed, but the mapping is updated. If the name space update takes too long, a warning is printed.
.sp
If an optional comment is provided, the comment is preserved and will be displayed by a subsequent \fBlookup-alias\fR or \fBlist-alias\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm remove-alias\fR \fIalias-id\fR | \fIproduct-id\fR.\fIchassis-id\fR\fR
.ad
.sp .6
.RS 4n
The \fBremove-alias\fR subcommand is used to remove an \fIproduct-id\fR.\fIchassis-id\fR to \fIalias-id\fR mapping.
.sp
.in +2
.nf
# \fBfmadm remove-alias RACK29.U25-28\fR
.fi
.in -2
.sp

The subcommand above completes when the associated name space updates are complete.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm lookup-alias\fR \fIalias-id\fR | \fIproduct-id\fR.\fIchassis-id\fR\fR
.ad
.sp .6
.RS 4n
The \fBlookup-alias\fR subcommand can be used to determine what the current mapping is. The following is an example command.
.sp
.in +2
.nf
# \fBfmadm lookup-alias SUN-Storage-J4410.1039QAQ007\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm list-alias\fR\fR
.ad
.sp .6
.RS 4n
The \fBlist-alias\fR subcommand is used to display all comments and mappings.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm sync-alias\fR\fR
.ad
.sp .6
.RS 4n
The \fBsync-alias\fR subcommand is used to hand-import a set of mappings in bulk. Two copies of the current mappings are maintained:
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/dev/chassis_aliases\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/dev/.chassis_aliase\fR
.RE
To import a set of mappings in bulk, you can update the \fB/etc/dev/chassis_aliases\fR file and then run \fBsync-alias\fR.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Set quiet mode. \fBfmadm\fR does not produce messages indicating the result of successful operations to standard output.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIcmd\fR\fR
.ad
.RS 8n
.rt  
The name of a subcommand listed in \fBSUBCOMMANDS\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fIargs\fR\fR
.ad
.RS 8n
.rt  
One or more options or arguments appropriate for the selected \fIsubcommand\fR, as described in \fBSUBCOMMANDS\fR. Among these arguments are \fBfmri\fR, \fBuuid\fR, and \fBlabel\fR. These identify resources that are the objects of \fBfmadm\fR subcommands. Use \fBfmadm faulty\fR to obtain the \fBfmri\fR, \fBuuid\fR, and \fBlabel\fR for a targeted resource. See \fBEXAMPLES\fR. In general, \fBlabel\fR is the most user-friendly of these operands.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRInvoking \fBfaulty\fR Subcommand
.sp
.LP
The following command invokes the \fBfaulty\fR subcommand, which displays the \fBuuid\fR, \fBlabel\fR, and \fBfmri\fR for a component.

.sp
.in +2
.nf
# \fBfmadm faulty\fR
------------ ------------------------------------  ------------ ---------
TIME         EVENT-ID                              MSG-ID       SEVERITY
------------ ------------------------------------  ------------ ---------
Sep 09 16:15 96609fae-113c-e48c-b1cf-ebf4b0902d72  DISK-8000-3E Critical
                                                                injected

Host      : x4170-brm-02
Platform  : SUN-FIRE-X4170-SERVER     Chassis_id  : 0920XF508B
Product_sn:

Fault class: fault.io.scsi.cmd.disk.dev.rqs.derr
Affects : dev:///:devid=id1,sd@n5000c5000940edbb//scsi_vhci/disk@g5000c\e
5000940edbb  out of service, but associated components no longer faulty
FRU     : "DISK 11"
(hc://:product-id=SUN-Storage-J4410:server-id=:chassis-id=:serial=000930\e
G01CN4----3SJ01CN4:part=SEAGATE-ST330057SSUN300G:revision=0205/\e
ses-enclosure=0/bay=11/disk=0)
replaced
\&...
\&...
.fi
.in -2
.sp

.sp
.LP
In the preceding output, the \fBuuid\fR is the first item in the \fBEVENT-ID\fR column, \fB96609fae-113c-e48c-b1cf-ebf4b0902d72\fR. The \fBlabel\fR is in the \fBFRU\fR row, \fBDISK 11\fR.  The \fBfmri\fRs are:

.sp
.in +2
.nf
dev:///:devid=id1,sd@n5000c5000940edbb//scsi_vhci/disk@g5000c\e
5000940edbb

hc://:product-id=SUN-Storage-J4410:server-id=:chassis-id=:serial=000930\e
G01CN4--------3SJ01CN4:part=SEAGATE-ST330057SSUN300G:revision=0205/\e
ses-enclosure=0/bay=11/disk=0)
.fi
.in -2
.sp

.sp
.LP
The same values are available with \fBfmdump\fR \fB-v\fR:

.sp
.in +2
.nf
# \fBfmdump -v\fR
Sep 09 16:15:36.9252 96609fae-113c-e48c-b1cf-ebf4b0902d72 DISK-8000-3E \e
Diagnosed 100%  fault.io.scsi.cmd.disk.dev.rqs.derr

Problem in: hc://:scheme=:product-id=SUN-Storage-J4410:chassis-id=:\e
server-id=/ses-enclosure=0/bay=11/disk=0

Affects: dev:///:devid=id1,sd@n5000c5000940edbb//\e
scsi_vhci/disk@g5000c5000940edbb
FRU: hc://:product-id=SUN-Storage-J4410:server-id=:chassis-id=:\e
serial=000930G01CN4--------3SJ01CN4:part=SEAGATE-ST330057SSUN300G:\e
revision=0205/ses-enclosure=0/bay=11/disk=0

Location: DISK 11
.fi
.in -2
.sp

.sp
.LP
Note that \fBlabel\fR is the easiest-to-use identifier.

.LP
\fBExample 2 \fRObtaining Module Name
.sp
.LP
The following command displays the module name for each component. The module name is specified as input to the \fBfmadm unload\fR command.

.sp
.in +2
.nf
# \fBfmadm config\fR
MODULE                   VERSION STATUS  DESCRIPTION
cpumem-retire            1.1     active  CPU/Memory Retire Agent
disk-transport           1.0     active  Disk Transport Agent
eft                      1.16    active  eft diagnosis engine
\&..
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
An error occurred. Errors include a failure to communicate with \fBfmd\fR or insufficient privileges to perform the requested operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/fault-management
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line options are Committed. The human-readable output is not-an-interface.
.SH SEE ALSO
.sp
.LP
\fBfmd\fR(1M), \fBfmdump\fR(1M), \fBfmstat\fR(1M), \fBlogadm\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBdevchassis\fR(7FS)
.sp
.LP
\fISystem Administration Guide: Common Management Tasks\fR
