Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/fsck_pcfs.1m
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fsck_pcfs 1M "6 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsck_pcfs \- file system consistency check and interactive repair
.SH SYNOPSIS
.LP
.nf
\fBfsck\fR \fB-F\fR pcfs [\fIgeneric_options\fR] \fIspecial\fR
.fi

.LP
.nf
\fBfsck\fR \fB-F\fR pcfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfsck\fR utility audits and interactively repairs inconsistent conditions on file systems. \fIspecial\fR represents the character special device on which the file system resides, for example \fB/dev/disk\fR. The character special device, not the block special device, should be used. 
.sp
.LP
In the case of correcting serious inconsistencies, by default, \fBfsck\fR asks for confirmation before making a repair and waits for the operator to respond either \fByes\fR or \fBno\fR. If the operator does not have write permission on the file system, \fBfsck\fR defaults to a \fB-n\fR (no corrections) action. See \fBfsck\fR(1M). 
.sp
.LP
Repairing some file system inconsistencies may result in loss of data. The amount and severity of data loss may be determined from the diagnostic output. 
.sp
.LP
When executed with the verify option (\fB\fR\fB-o\fR \fBv\fR), \fBfsck_pcfs\fR automatically scans the entire file system to verify that all of its allocation units are accessible. If it finds any units inaccessible, it updates the file allocation table (\fBFAT\fR) appropriately. It also updates any effected directory entries to reflect the problem. This directory update includes truncating the file at the point in its allocation chain where the file data is no longer accessible. Any remaining accessible allocation units become orphaned. 
.sp
.LP
Orphaned chains of accessible allocation units are, with the operator's concurrence, linked back into the file system as files in the root directory. These files are assigned names of the form file\fINNNN\fR.chk, where the \fIN\fRs are digits in the integral range from \fB0\fR through \fB9\fR. 
.sp
.LP
After successfully scanning and correcting any errors in the file system, \fBfsck\fR displays a summary of information about the file system. This summary includes the size of the file system in bytes, the number of bytes used in directories and individual files, and the number of available allocation units remaining in the file system. 
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 23n
.rt  
The following generic options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 11n
.rt  
Check but do not repair. This option checks that the file system is suitable for mounting, returning the appropriate exit status. If the file system is ready for mounting, \fBfsck\fR  displays a message such as: 
.sp
.in +2
.nf
pcfs fsck: sanity check:
\fB/dev/disk\fR okay 
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR | \fB-N\fR\fR
.ad
.RS 11n
.rt  
Assume a no response to  all  questions  asked  by \fBfsck\fR; do not open the file system for writing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 11n
.rt  
Echo the expanded command line, but do not execute  the command. This option may be used to verify and  to validate the command line. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR | \fB-Y\fR\fR
.ad
.RS 11n
.rt  
Assume a \fByes\fR response to all  questions  asked  by \fBfsck\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIspecific_options\fR\fR
.ad
.RS 23n
.rt  
Specify \fBpcfs\fR file system specific options in a comma-separated list, in any combination, with no intervening spaces.
.sp
.ne 2
.mk
.na
\fBv\fR
.ad
.RS 5n
.rt  
Verify all allocation units are accessible prior to correcting inconsistencies in the metadata.
.RE

.sp
.ne 2
.mk
.na
\fBp\fR
.ad
.RS 5n
.rt  
Check and fix the file system non-interactively (\fBpreen\fR). Exit immediately if there is a problem requiring intervention.
.RE

.sp
.ne 2
.mk
.na
\fBw\fR
.ad
.RS 5n
.rt  
Check writable file systems only.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fIspecial\fR\fR
.ad
.RS 11n
.rt  
The device which contains the pcfs.  A hard disk device or high-capacity removable device name much be qualified with a suffix to indicate the proper \fBFDISK\fR partition.
.sp
For example, in the names: \fB/dev/rdsk/c0t0d0p0:c\fR and \fB/dev/rdsk/c0t4d0s2:c\fR, the \fB:c\fR suffix indicates the first partition on the disk contains the \fBpcfs\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/pcfs
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBfsck\fR(1M), \fBfstyp\fR(1M), \fBfdisk\fR(1M), \fBmkfs\fR(1M), \fBmkfs_pcfs\fR(1M), \fBmountall\fR(1M), \fBattributes\fR(5), \fBpcfs\fR(7FS),
.SH WARNINGS
.sp
.LP
The operating system buffers file system data. Running \fBfsck\fR on a mounted file system can cause the operating system's buffers to become out of date with respect to the disk. For this reason, the file system should be unmounted when \fBfsck\fR is used. If this is not possible, care should be taken that the system is quiescent and that it is rebooted immediately after \fBfsck\fR is run. Quite often, however, this is not sufficient. A panic will probably occur if running \fBfsck\fR on a file system modifies the file system.
