Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/fsirand.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fsirand 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsirand \- install random inode generation numbers
.SH SYNOPSIS
.LP
.nf
\fBfsirand\fR [\fB-p\fR] \fIspecial\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBfsirand\fR installs random inode generation numbers on all the inodes on device \fIspecial\fR, and also installs a file system \fBID\fR in the superblock. This helps increase the security of file systems exported by \fBNFS.\fR
.sp
.LP
\fBfsirand\fR must be used only on an unmounted file system that has been checked with \fBfsck\fR(1M) The only exception is that it can be used on the root file system in single-user mode, if the system is immediately re-booted afterwards.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
Print out the generation numbers for all the inodes, but do not change the generation numbers.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBfsirand\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBfsck\fR(1M), \fBattributes\fR(5), \fBlargefile\fR(5)
