Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/groupadd.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1998, 2011, Oracle and/or its affiliates. All rights reserved.
.TH groupadd 1M "23 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
groupadd \- add (create) a new group definition on the system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/groupadd\fR [\fB-g\fR \fIgid\fR [\fB-o\fR]] [\fB-S\fR \fIrepository\fR]
     [\fB-U\fR \fIuser1\fR[,\fIuser2\fR..] ] \fIgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBgroupadd\fR command creates a new group definition on the system by adding the appropriate entry to the group database in the \fBfiles\fR and \fBldap\fR repositories.
.sp
.LP
An administrator must be granted the User Management rights profile or have \fBsolaris.group.manage\fR authorization to be able to add a group. Once the group is successfully added, the administrator is granted the authorization to modify and delete the group. The format of the authorization is \fBsolaris.group.assign\fR/\fIgroupname\fR, and can be managed by means of \fBusermod\fR(1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgid\fR\fR
.ad
.sp .6
.RS 4n
Assigns the group id \fIgid\fR for the new group. This group id must be a non-negative decimal integer below \fBMAXUID\fR as defined in \fB/usr/include/sys/param.h\fR. The group \fBID\fR defaults to the next available (unique) number above the highest number currently assigned. For example, if groups \fB100\fR, \fB105\fR, and \fB200\fR are assigned as groups, the next default group number is \fB201\fR. (Group \fBIDs\fR from \fB0\fR\(mi\fB99\fR are reserved by SunOS for future applications.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.sp .6
.RS 4n
Allows the \fIgid\fR to be duplicated (non-unique). An administrator must have \fBsolaris.group.assign\fR authorization to use this option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIrepository\fR\fR
.ad
.sp .6
.RS 4n
The valid repositories are \fBfiles\fR and \fBldap\fR. The repository specifies which name service will be updated. When \fIrepository\fR is not specified, the \fBfiles\fR repository is used. When the repository is \fBfiles\fR, the user name and other items can be present in other name service repositories and can be assigned to a group in the \fBfiles\fR repository. When the repository is \fBldap\fR, all the assignable attributes must be present in the \fBldap\fR repository.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR \fIuser1\fR[,\fIuser2\fR]\fR
.ad
.sp .6
.RS 4n
Adds a list of users \fIuser1\fR, \fIuser2\fR to the group.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIgroup\fR\fR
.ad
.RS 9n
.rt  
A string consisting of characters from the set of lower case alphabetic characters and numeric characters. A warning message is written if the string exceeds \fBMAXGLEN-1\fR, which is usually eight characters. The \fIgroup\fR field must contain at least one character; it accepts lower case or numeric characters or a combination of both, and must not contain a colon (\fB:\fR) or \fBNEWLINE.\fR
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command syntax. A usage message for the \fBgroupadd\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 6n
.rt  
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 6n
.rt  
The \fIgid\fR is not unique (when \fB-o\fR option is not used).
.RE

.sp
.ne 2
.mk
.na
\fB\fB9\fR\fR
.ad
.RS 6n
.rt  
The \fIgroup\fR is not unique.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
The group database cannot be updated.
.RE

.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/group\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/include/userdefs.h\fR
.RE
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBusers\fR(1B), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBgrpck\fR(1M), \fBlogins\fR(1M), \fBpwck\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBgroup\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
\fBgroupadd\fR adds a group definition to the system. If a network name service is being used to supplement the local \fB/etc/group\fR file with additional entries, \fBgroupadd\fR verifies the uniqueness of a specified group name and group \fBID\fR against the external name service and uses the entries in the \fBfiles\fR repository.
.sp
.LP
If the number of characters in a \fBgroup\fR entry exceeds 2047, group maintenance commands, such as \fBgroupdel\fR(1M) and \fBgroupmod\fR(1M), fail.
