Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/groupdel.1m
'\" te
.\" Copyright (c) 1997, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH groupdel 1M "23 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
groupdel \- delete a group definition from the system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/groupdel\fR [\fB-S\fR \fIrepository\fR] \fIgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBgroupdel\fR utility deletes a group definition from the system. It deletes the appropriate entry from the \fB/etc/group\fR file.
.sp
.LP
In addition to \fBsolaris.group.manage\fR authorization, an administrator must have either \fBsolaris.group.assign\fR or a matching authorization of the form \fBsolaris.group.assign\fR/\fIgroupname\fR to delete a group. The authorization \fBsolaris.group.assign\fR/\fIgroupname\fR is automatically assigned to the administrator who created the group.
.SH OPTIONS
.sp
.LP
\fBgroupdel\fR supports the following option.
.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIrepository\fR\fR
.ad
.sp .6
.RS 4n
The valid repositories are \fBfiles\fR and \fBldap\fR. The repository specifies which name service will be updated. When \fIrepository\fR is not specified, \fBgroupdel\fR consults \fBnsswitch.conf\fR(4).
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIgroup\fR\fR
.ad
.RS 9n
.rt  
An existing group name to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Success.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command syntax. A usage message for the \fBgroupdel\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 6n
.rt  
\fIgroup\fR does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
Cannot update the \fB/etc/group\fR file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 14n
.rt  
system file containing group definitions
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupmod\fR(1M), \fBlogins\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBnsswitch.conf\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The \fBgroupdel\fR utility deletes a group definition that is in the group database in the repository.
.sp
.LP
\fBgroupdel\fR fails if a group entry (a single line in \fB/etc/group\fR) exceeds 2047 characters.
