Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/gssd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH gssd 1M "25 Apr 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
gssd \- generates and validates GSS-API tokens for kernel RPC
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/gss/gssd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB\fR\fBgssd\fR is the user mode daemon that operates between the kernel rpc and the Generic Security Service Application Program Interface (\fBGSS-API\fR) to generate and validate \fBGSS-API\fR security tokens. In addition, \fBgssd\fR maps the \fBGSS-API\fR principal names to the local user and group ids. By default, all groups that the requested user belongs to will be included in the grouplist credential. \fBgssd\fR is invoked by the Internet daemon \fBinetd\fR(1m) the first time that the kernel \fBRPC\fR requests \fBGSS-API\fR services.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/kernel/security/gss
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBkill\fR(1), \fBpkill\fR(1), \fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBgsscred\fR(1M), \fBsvcadm\fR(1M), \fBgsscred.conf\fR(4), \fBresolv.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fIRFC 2078\fR
.SH NOTES
.sp
.LP
The following signal has the specified effect when sent to the server process using the \fBkill\fR(1) command:
.sp
.ne 2
.mk
.na
\fB\fBSIGHUP\fR\fR
.ad
.RS 10n
.rt  
\fBgssd\fR rereads the \fBgsscred.conf\fR(4) options.
.RE

.sp
.LP
When one of the mechanisms being used is Kerberos, then the \fBgssd\fR process must be restarted after adding or changing the \fBresolv.conf\fR(4) file.
.sp
.LP
The \fBgssd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/gss:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
