Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/hal-fdi-validate.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-fdi-validate 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-fdi-validate \- validate HAL device information files
.SH SYNOPSIS
.LP
.nf
\fBhal-fdi-validate\fR  [\fB-f\fR \fIdtd\fR] \fIfile\fR [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhal-fdi-validate\fR command validates one or more device information files. See \fBfdi\fR(4). The standard DTD file will be used unless the \fB-f\fR option is used to specify a different file.
.SH OPTIONS
.sp
.LP
The following option is supported: 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIdtd\fR\fR
.ad
.RS 10n
.rt  
Specify path to a DTD file.
.RE

.SH OPERANDS
.sp
.LP
The \fBhal-fdi-validate\fR command accepts the following operand(s):
.sp
.ne 2
.mk
.na
\fB\fIfile\fR [\fIfile\fR...]\fR
.ad
.RS 18n
.rt  
One or more DTD files to be validated.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/hal
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBhald\fR(1M), \fBfdi\fR(4), \fBattributes\fR(5), \fBhal\fR(5)
