Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/hal-find.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-find 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-find, hal-find-by-capability, hal-find-by-property \- search HAL global device list
.SH SYNOPSIS
.LP
.nf
\fBhal-find-by-capability\fR \fB--capability\fR \fIcapability\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.LP
.nf
\fBhal-find-by-property\fR  \fB--key\fR \fIkey\fR \fB--string\fR \fIvalue\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhal-find\fR commands, \fBhal-find-by-capability\fR and \fBhal-find-by-property\fR, search the Hardware Abstraction Layer (HAL) device list by specified criteria and displays results on the standard output. \fBhal-find-by-capability\fR searches by capability, such as \fBvolume\fR or \fBblock\fR. \fBhal-find-by-property\fR searches by property, such as \fBblock.is_volume\fR or \fBvolume.disc.has_audio\fR.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB--capability\fR \fIcapability\fR\fR
.ad
.RS 27n
.rt  
HAL device capability to search for.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.RS 27n
.rt  
Display list of options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--key\fR \fIkey\fR\fR
.ad
.RS 27n
.rt  
The \fIkey\fR to the property that is the basis of the search.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--string\fR \fIvalue\fR\fR
.ad
.RS 27n
.rt  
The string \fIvalue\fR associated with the property that is the basis of the search.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--verbose\fR\fR
.ad
.RS 27n
.rt  
Verbose mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.RS 27n
.rt  
Display version and exit.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/hal
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBhald\fR(1M), \fBattributes\fR(5), \fBhal\fR(5)
