Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/hal-device.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-device 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-device \- manage HAL devices
.SH SYNOPSIS
.LP
.nf
\fBhal-device\fR  [\fB-h\fR] [\fB--a\fR \fIudi\fR |  \fB--r\fR \fIudi\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The Hardware Abstraction Layer (HAL) provides a view of the various hardware attached to a system. The \fBhal-device\fR command enables you to manage devices that conform to the HAL standard. Specifically, \fBhal-device\fR lets you add or remove a device to or from the HAL global device list. Device properties are read from stdin in \fBlshal(1M)\fR syntax.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-a\fR, \fB--add\fR \fIudi\fR\fR
.ad
.RS 20n
.rt  
Add device specified by Universal Device Identifier \fIudi\fR to HAL's global device list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 20n
.rt  
Display usage information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR, \fB--remove\fR \fIudi\fR\fR
.ad
.RS 20n
.rt  
Remove device specified by Universal Device Identifier \fIudi\fR from HAL's global device list.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/hal
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBhald\fR(1M), \fBattributes\fR(5), \fBhal\fR(5)
