Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/hald.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hald 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
hald \- daemon that supports hardware abstraction layer
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/hal/hald\fR [\fB--daemon\fR={\fByes\fR | \fBno\fR}]] [\fB--help\fR] [\fB--use-syslog\fR]
 [\fB--verbose\fR={\fByes\fR | \fBno\fR}] [\fB--version\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhald\fR daemon supports the recognition of hardware changes for devices that conform to the Hardware Abstraction Layer (HAL) specification.
.sp
.LP
The enabling and disabling of \fBhald\fR can be performed through the service management facility (SMF) (see \fBsmf\fR(5)). \fBhald\fR is managed using the fault management resource identifier (FMRI) \fBsvc:/system/hal\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB--daemon\fR=\fByes\fR|\fBno\fR\fR
.ad
.RS 20n
.rt  
Run as a daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.RS 20n
.rt  
Display usage information and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--use-syslog\fR\fR
.ad
.RS 20n
.rt  
Display debug messages to \fBsyslog\fR instead of \fBstderr\fR. Use this option to record debug messages if HAL runs as daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--verbose\fR=\fByes\fR|\fBno\fR\fR
.ad
.RS 20n
.rt  
Display debug information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.RS 20n
.rt  
Display version information and exit.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/hal\fR\fR
.ad
.RS 16n
.rt  
HAL-related files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/hal/fdi\fR\fR
.ad
.RS 16n
.rt  
Device information files
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/hal
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBsvccfg\fR(1M), \fBattributes\fR(5), \fBhal\fR(5), \fBsmf\fR(5)
