Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/halt.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH halt 1M "25 Jun 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
halt, poweroff \- stop the processor
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/halt\fR [\fB-dlnqy\fR]
.fi

.LP
.nf
\fB/usr/sbin/poweroff\fR [\fB-dlnqy\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities write any pending information to the disks and then stop the processor. The \fBpoweroff\fR utility has the machine remove power, if possible.
.sp
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities normally log the system shutdown to the system log daemon, \fBsyslogd\fR(1M), and place a shutdown record in the login accounting file \fB/var/adm/wtmpx\fR. These actions are inhibited if the \fB-n\fR or \fB-q\fR options are present.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Force a system crash dump before rebooting. See \fBdumpadm\fR(1M) for information on configuring system crash dumps.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Suppress sending a message to the system log daemon, \fBsyslogd\fR(1M), about who executed \fBhalt\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Prevent the \fBsync\fR(1M) before stopping.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Quick halt. No graceful shutdown is attempted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.RS 6n
.rt  
Halt the system, even from a dialup terminal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.RS 18n
.rt  
History of user access and administration information.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBdumpadm\fR(1M), \fBinit\fR(1M), \fBreboot\fR(1M), \fBshutdown\fR(1M), \fBsync\fR(1M), \fBsyslogd\fR(1M), \fBinittab\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities do not cleanly shutdown \fBsmf\fR(5) services, execute the scripts in \fB/etc/rc\fInum\fR.d\fR,  or execute shutdown actions in \fBinittab\fR(4). To ensure a complete shutdown of system services, use \fBshutdown\fR(1M) or \fBinit\fR(1M) to reboot a Solaris system.
