Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/hotplugd.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hotplugd 1M "21 Aug 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
hotplugd \- hotplug daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/hotplugd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The hotplug daemon, \fBhotplugd\fR, provides user-level services for the management of hotplug connections. It is a system daemon started by the Service Management Facility (see \fBsmf\fR(5)). Its fault management resource identifier (FMRI) is:
.sp
.in +2
.nf
svc:/system/hotplug:default
.fi
.in -2
.sp

.sp
.LP
Note that \fBhotplugd\fR is a Consolidation Private interface. See \fBattributes\fR(5).
.sp
.LP
The \fBhotplug\fR(1M) command and any other client program that uses the private \fBlibhotplug\fR library to query information about hotplug connections or initiate hotplug commands depends upon this daemon. The hotplug daemon is a door server which services requests from all \fBlibhotplug\fR clients. The door interface is private.
.sp
.LP
Client applications use the private \fBlibhotplug\fR interface to administer hotplug connections. \fBlibhotplug\fR uses the door interface to administer hotplug connections through the hotplug daemon service. The hotplug daemon acts as a central location to serialize all hotplug operations and coordinate activities with all other parts of the system.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--debug\fR\fR
.ad
.sp .6
.RS 4n
Run the daemon in standalone debug mode. Messages will be displayed on the controlling terminal instead of to syslog. And increased verbosity will be enabled to display more details about the internal operations of the daemon.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fREnabling the Hotplug Service
.sp
.LP
The following command enables the hotplug service:

.sp
.in +2
.nf
# \fBsvcadm enable svc:/system/hotplug:default\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisabling the Hotplug Service
.sp
.LP
The following command disables the hotplug service:

.sp
.in +2
.nf
# \fBsvcadm disable svc:/system/hotplug:default\fR
.fi
.in -2
.sp

.SH ERRORS
.sp
.LP
The hotplug daemon uses \fBsyslog\fR(3C) to report status and error messages. All of the messages are logged with the \fBLOG_DAEMON\fR facility. Error messages are logged with the \fBLOG_ERR\fR and \fBLOG_NOTICE\fR priorities, and informational messages are logged with the \fBLOG_INFO\fR priority. The default entries in the \fB/etc/syslog.conf\fR file log all of the hotplug daemon error messages to the \fB/var/adm/messages\fR log.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/run/hotplugd_door\fR\fR
.ad
.sp .6
.RS 4n
Hotplug daemon door
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/hotplugd_pid\fR\fR
.ad
.sp .6
.RS 4n
Hotplug daemon lock file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/hotplugd\fR\fR
.ad
.sp .6
.RS 4n
Hotplug daemon binary
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBhotplug\fR(1M), \fBsvcadm\fR(1M), \fBsyslog\fR(3C), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBhotplugd\fR service is managed by the service management facility, \fBsmf\fR(5), under the fault management resource identifier (FMRI):
.sp
.in +2
.nf
svc:/system/hotplug:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command. To administer the service, the authorization \fBsolaris.smf.manage.hotplug\fR must be granted. Alternatively, the rights profile "Hotplug Management" can be granted.
.sp
.LP
The hotplug service must be enabled for the \fBhotplug\fR(1M) command and any other \fBlibhotplug\fR client applications to function properly.
