Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ickey.1m
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ickey 1M "7 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ickey \- install a client key for WAN boot
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/wanboot/ickey\fR [\fB-d\fR] [\fB-o\fR type=3des]
.fi

.LP
.nf
\fB/usr/lib/inet/wanboot/ickey\fR [\fB-d\fR] [\fB-o\fR type=aes]
.fi

.LP
.nf
\fB/usr/lib/inet/wanboot/ickey\fR [\fB-d\fR] [\fB-o\fR type=sha1]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBickey\fR command is used to install WAN boot keys on a running UNIX system so that they can be used the next time the system is installed. You can store three different types of keys: 3DES and AES for encryption and an HMAC SHA-1 key for hashed verification.
.sp
.LP
\fBickey\fR reads the key from standard input using \fBgetpassphrase\fR(3C) so that it does not appear on the command line. When installing keys on a remote system, you must take proper precautions to ensure that any keying materials are kept confidential. At a minimum, use \fBssh\fR(1) to prevent interception of data in transit.
.sp
.LP
Keys are expected to be presented as strings of hexadecimal digits; they can (but need not) be preceded by a \fB0x\fR or \fB0X\fR.
.sp
.LP
The \fBickey\fR command has a single option, described below. An argument of the type \fB-o\fR\ \fBtype=\fR\fIkeytype\fR is required.
.SH OPTIONS
.sp
.LP
The \fBickey\fR command the following option.
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Delete the key specified by the \fIkeytype\fR argument.
.RE

.SH EXIT STATUS
.sp
.LP
On success, \fBickey\fR exits with status 0; if a problem occurs, a diagnostic message is printed and \fBickey\fR exits with non-zero status. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/openprom\fR\fR
.ad
.RS 17n
.rt  
WAN boot key storage driver
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/boot/wanboot
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBssh\fR(1), \fBopenprom\fR(7D),  \fBattributes\fR(5)
