Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/if_mpadm.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH if_mpadm 1M "5 Jan 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
if_mpadm \- administer interfaces in an IP multipathing group
.SH SYNOPSIS
.LP
.nf
\fBif_mpadm\fR \fB-d\fR | \fB-r\fR \fIifname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBif_mpadm\fR utility administers IP interfaces that are part of an IP Multipathing (IPMP) group. Currently, administration is limited to offlining IP interfaces and undoing previous offline operations.
.sp
.LP
When an IP interface is taken offline, all IP data traffic that was flowing over the IP interface is moved to another IP interface in the IPMP group. In addition, all \fBUP\fR IP addresses hosted on the IP interface are brought down, causing \fBin.mpathd\fR(1M) to stop probe-based failure detection on the IP interface. As a result, an offline IP interface will not be used for any inbound or outbound IP traffic. Only IP interfaces that are in an IPMP group may be brought offline. If the IP interface is the last functioning interface in the IPMP group, the offline operation will fail.
.sp
.LP
When an offline operation is undone, any IP addresses hosted on that IP interface are brought \fBUP\fR and will be considered by \fBin.mpathd\fR for probe-based failure detection. In addition, provided the IP interface is otherwise active (see \fBin.mpathd\fR(1M)), it will again be used to send and receive IP data traffic for the IPMP group. Note that not all offline operations can be undone. For instance, \fBin.mpathd\fR may have offlined an IP interface because its hardware address was not unique within its IPMP group. The \fBipmpstat\fR utility can be used to determine why an IP interface is offline, identify which IP interfaces in a group are being used for inbound and outbound IP traffic, and more; see \fBipmpstat\fR(1M).
.SH OPTIONS
.sp
.LP
The \fBif_mpadm\fR utility supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIifname\fR\fR
.ad
.RS 13n
.rt  
Offline the IP interface specified by \fIifname\fR. If \fIifname\fR is not in an IPMP group, or the offline would cause the IPMP group to lose network connectivity, the operation will fail.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIifname\fR\fR
.ad
.RS 13n
.rt  
Undo a previous offline of the IP interface specified by \fIifname\fR. If \fIifname\fR is not offline, the operation will fail.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fROfflining an IP Interface
.sp
.LP
The following command offlines the IP interface \fBunder0\fR, causing any IP packets that were being sent and received through it to be handled by another IP interface in its group.

.sp
.in +2
.nf
example% \fBif_mpadm -d under0\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUndoing a Previous Offline Operation
.sp
.LP
Use the following command to undo the operation in the previous example:

.sp
.in +2
.nf
example% \fBif_mpdadm -r under0\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBin.mpathd\fR(1M), \fBipmpstat\fR(1M), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
cannot offline: no other functioning interfaces are in its IPMP group.
.RS +4
\fBDescription: \fR
.sp
.LP
This message means that offlining the IP interface would leave the IPMP group without network connectivity.
.RE

.sp
.LP
cannot offline: not a physical interface or not in an IPMP group
.RS +4
\fBDescription: \fR
.sp
.LP
This means that the IP interface is not an underlying interface in an IPMP group, and therefore is not eligible to be offlined.
.RE

