Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ifparse.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ifparse 1M "31 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ifparse \- parse \fBifconfig\fR command line
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ifparse\fR [\fB-fs\fR] \fIaddr_family\fR \fIcommands\fR
.fi

.SH DESCRIPTION
.sp
.LP
Use the \fBifparse\fR command to parse the \fBifconfig\fR(1M) command line options and output substrings, one per line, as appropriate. If no options are specified, \fBifparse\fR returns the entire \fBifconfig\fR command line as a series of substrings, one per line.
.SH OPTIONS
.sp
.LP
The \fBifparse\fR command supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Lists only substrings of the \fBifconfig\fR command line that are relevant to IP network multipath failover
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Lists only substrings of the \fBifconfig\fR command line that are not relevant to IP network multipath failover
.RE

.SH OPERANDS
.sp
.LP
The \fBifparse\fR command \fBdoes not\fR support the \fIinterface\fR operand of the \fBifconfig\fR command. 
.SH EXAMPLES
.LP
\fBExample 1 \fRParsing Command Line Options Relevant to Failover
.sp
.LP
The following example shows the use of the \fBifparse\fR command to parse the command line options relevant to IP network multipath failover:

.sp
.in +2
.nf
example# \fBifparse -f inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
set 1.2.3.4 up
.fi
.in -2
.sp

.LP
\fBExample 2 \fRParsing Command Line Options That Are Not Relevant to Failover
.sp
.LP
The following example shows the use of the \fBifparse\fR command to parse the command line options that are not relevant to IP network multipath failover:

.sp
.in +2
.nf
example# \fBifparse -s inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
group one
addif 1.2.3.5 -failover up
.fi
.in -2
.sp

.LP
\fBExample 3 \fRParsing the Command Line For All Options
.sp
.LP
The following example shows the use of the \fBifparse\fR command to parse the command line for all \fBifconfig\fR options:

.sp
.in +2
.nf
example# \fBifparse inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
group one
set 1.2.3.4 up
addif 1.2.3.5 -failover up
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
usage: \fB-fs\fR <addr_family> <commands>
.RS +4
\fBDescription: \fR
.sp
.LP
This message indicates an invalid command line.
.RE

.sp
.LP
\fBifparse\fR: Not enough space
.RS +4
\fBDescription: \fR
.sp
.LP
This message indicates insufficient memory.
.RE

.sp
.LP
\fBifparse\fR: dhcp not supported for inet6
.RS +4
\fBDescription: \fR
.sp
.LP
DHCP operations are not supported for the \fBinet6\fR address family.
.RE

.sp
.LP
\fBifparse\fR: Operation <operation> not supported for <addr_family>
.RS +4
\fBDescription: \fR
.sp
.LP
Most operations cannot be used with all address families. For example, the \fBbroadcast\fR operation is not supported on the \fBinet6\fR address family.
.RE

.sp
.LP
\fBifparse\fR: no argument for <operation>
.RS +4
\fBDescription: \fR
.sp
.LP
Some operations, for example \fBbroadcast\fR, require an argument.
.RE

.SH NOTES
.sp
.LP
The \fBifparse\fR command is classified as an obsolete interface. It will likely be removed in a future release. You should not develop applications that depend upon this interface.
