Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ilomconfig.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH ilomconfig 1M "29 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ilomconfig \- ILOM LAN configuration utility
.SH SYNOPSIS
.LP
.nf
\fBilomconfig\fR \fBlist\fR \fIsubcommand\fR [\fIoptions\fR]
.fi

.LP
.nf
\fBilomconfig\fR \fBmodify\fR \fIsubcommand\fR [\fIoptions\fR]
.fi

.LP
.nf
\fBilomconfig\fR \fBenable\fR \fIsubcommand\fR [\fIoptions\fR]
.fi

.LP
.nf
\fBilomconfig\fR \fBdisable\fR \fIsubcommand\fR [\fIoptions\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBilomconfig\fR is an Oracle Integrated Lights Out Management (ILOM) configuration utility that allows an administrator to configure the LAN interface between the Service  Processor (SP) and host. The administrator can view the LAN configuration settings by means of the \fBlist\fR command and configure the interface using the \fBenable\fR, \fBdisable\fR, and \fBmodify\fR commands.
.SH SUB-COMMANDS
.sp
.LP
The following subcommands are available under the \fBlist\fR command:
.sp
.ne 2
.mk
.na
\fB\fBsystem-summary\fR\fR
.ad
.sp .6
.RS 4n
List product summary information and ILOM version.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterconnect\fR\fR
.ad
.sp .6
.RS 4n
List Host-to-ILOM interconnect settings.
.RE

.sp
.LP
The following subcommands are available under the \fBmodify\fR command:
.sp
.ne 2
.mk
.na
\fB\fBinterconnect\fR\fR
.ad
.sp .6
.RS 4n
Modifies Host-to-ILOM interconnect settings.
.RE

.sp
.LP
The following subcommand is available under the \fBenable\fR command:
.sp
.ne 2
.mk
.na
\fB\fBinterconnect\fR\fR
.ad
.sp .6
.RS 4n
Enables the Host-to-ILOM interconnect.
.RE

.sp
.LP
The following subcommand is available under the \fBdisable\fR command:
.sp
.ne 2
.mk
.na
\fB\fBinterconnect\fR\fR
.ad
.sp .6
.RS 4n
Disables the Host-to-ILOM interconnect.
.RE

.SH OPTIONS
.sp
.LP
The following options are available for the \fBenable\fR and \fBmodify\fR commands:
.sp
.ne 2
.mk
.na
\fB\fB-ipaddress\fR=\fIipaddress\fR\fR
.ad
.sp .6
.RS 4n
Set the IP address for the SP side of the LAN interconnect.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-hostipaddress\fR=\fIipaddress\fR\fR
.ad
.sp .6
.RS 4n
Set the IP address for the host side of the LAN interconnect.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-netmask\fR=\fInetmask\fR\fR
.ad
.sp .6
.RS 4n
Set the network mask for the IP addresses used for the LAN.
.RE

.sp
.LP
The following are general options:
.sp
.ne 2
.mk
.na
\fB\fB-?\fR, \fB-h\fR, \fB--help\fR\fR
.ad
.sp .6
.RS 4n
Display a brief usage message and then exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR, \fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
Suppress informational message output and return only error codes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR, \fB--version\fR\fR
.ad
.sp .6
.RS 4n
Display version information for \fBilomconfig\fR and then exit.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/log/ilomconfig/ilomconfig.log\fR\fR
.ad
.sp .6
.RS 4n
\fBilomconfig\fR-specific log file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/management/ilomconfig
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
