Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/in.discardd.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH in.discardd 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.discardd \- UDP or TCP discard protocol service
.SH SYNOPSIS
.LP
.nf
\fBin.discardd\fR 
.fi

.LP
.nf
FMRI \fIsvc\fR:/internet/discard:default
.fi

.SH DESCRIPTION
.sp
.LP
FMRI stands for Fault Management Resource Identifier. It is used to identify resources managed by the Fault Manager. See \fBfmd\fR(1M) and \fBsmf\fR(5).
.sp
.LP
The \fBin.discardd\fR service provides the server-side of the discard protocol. This protocol is used for debugging and bandwidth measurement and is available on both TCP and UDP transports through port 9.
.sp
.LP
The \fBin.discardd\fR service is an \fBinetd\fR(1M) \fBsmf\fR(5) delegated service. The \fBin.discardd\fR detects which transport is requested by examining the socket it is passed by the \fBinetd\fR daemon.
.sp
.LP
The discard service simply throws away any data it receives from the client.
.sp
.ne 2
.mk
.na
\fBTCP-based service\fR
.ad
.RS 21n
.rt  
Once a connection is established, the \fBin.discardd\fR discards any data received. No response is generated. The connection remains open until the client terminates it.
.RE

.sp
.ne 2
.mk
.na
\fBUDP-based service\fR
.ad
.RS 21n
.rt  
The \fBin.discardd\fR listens for UDP datagrams. When a datagram is received, the server discards it. No response is sent.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/legacy-network-services
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBinetd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
RFC 863
