Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/in.talkd.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 2004Sun Microsystems, Inc.  All Rights Reserved.
.TH in.talkd 1M "31 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.talkd, talkd \- server for talk program
.SH SYNOPSIS
.LP
.nf
\fBin.talkd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBtalkd\fR is a server used by the \fBtalk\fR(1) program.  It listens at the  \fBUDP\fR port indicated in the ``talk'' service description; see \fBservices\fR(4). The actual conversation takes place on a  \fBTCP\fR connection that is established by negotiation between the two machines involved.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/network-servers
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBtalk\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M), \fBservices\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The protocol is architecture dependent.
.sp
.LP
The \fBin.talkd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/talk
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
