Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/in.tftpd.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH in.tftpd 1M "5 Nov 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.tftpd, tftpd \- Internet Trivial File Transfer Protocol server
.SH SYNOPSIS
.LP
.nf
\fBin.tftpd\fR [\fB-d\fR] [\fB-T\fR \fIrexmtval\fR] [\fB-s\fR] [\fIhomedir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBtftpd\fR is a server that supports the Internet Trivial File Transfer Protocol (TFTP).
.sp
.LP
Before responding to a request, the server attempts to change its current directory to \fIhomedir\fR; the default directory is \fB/tftpboot\fR.
.sp
.LP
The use of \fBtftp\fR does not require an account or password on the remote system. Due to the lack of authentication information, \fBin.tftpd\fR will allow only publicly readable files to be accessed. Files may be written only if they already exist and are publicly writable. Note that this extends the concept of "public" to include all users on all hosts that can be reached through the network. This may not be appropriate on all systems, and its implications should be considered before enabling this service.
.sp
.LP
\fBin.tftpd\fR runs with the user \fBID\fR and group \fBID\fR set to \fB[GU]ID_NOBODY\fR under the assumption that no files exist with that owner or group. However, nothing checks this assumption or enforces this restriction.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
Debug. When specified it sets the \fBSO_DEBUG\fR socket option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 15n
.rt  
Secure. When specified, the directory change to \fIhomedir\fR must succeed. The daemon also changes its root directory to \fIhomedir\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fIrexmtval\fR\fR
.ad
.RS 15n
.rt  
Specifies the value of the retransmission timeout in seconds. This also affects the maximum session timeout in that the latter is set to five times the retransmission timeout value.
.RE

.SH USAGE
.sp
.LP
The \fBin.tftpd\fR server is IPv6-enabled. See \fBip6\fR(7P).
.sp
.LP
\fBin.tftpd\fR supports transfers of greater than 32 MB, per RFC 2348.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/tftp
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBtftp\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M), \fBnetconfig\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBip6\fR(7P)
.sp
.LP
Malkin, G. and Harkin, A. \fIRFC 2347, TFTP Option Extension\fR. The Internet Society. May 1998
.sp
.LP
Malkin, G. and Harkin, A. \fIRFC 2348, TFTP Blocksize Option\fR. The Internet Society. May 1998
.sp
.LP
Malkin, G. and Harkin, A. \fIRFC 2349, TFTP Timeout Interval and Transfer Size Options\fR. The Internet Society. May 1998
.sp
.LP
Sollins, K.R. \fIRFC 1350, The TFTP Protocol (Revision 2)\fR. Network Working Group. July 1992.
.SH NOTES
.sp
.LP
The \fBtftpd\fR server only acknowledges the transfer size option that is sent with a \fBread\fR request when the octet transfer mode is specified.
.sp
.LP
The \fBin.tftpd.1m\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/tftp/udp6:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
Unlike most \fBsmf\fR(5) services, a manifest for the \fBtftp\fR service is not included in the system. To create one and enable this service, the administrator should:
.RS +4
.TP
1.
Edit \fB/etc/inet/inetd.conf\fR and uncomment the \fBtftp\fR entry.
.RE
.RS +4
.TP
2.
Run \fB/usr/sbin/inetconv\fR. 
.RE
.sp
.LP
After you run \fBinetconv\fR, the \fBsvc:/network/tftp/udp6:default\fR service is created and enabled.
