Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/installboot.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH installboot 1M "6 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
installboot \- install bootblocks in a disk partition
.SH SYNOPSIS
.LP
.nf
\fBinstallboot\fR [\fB-F\fR zfs|ufs|hsfs] \fIbootblk\fR \fIraw-disk-device\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBboot\fR(1M) program, \fBufsboot\fR, is loaded from disk by the bootblock program which resides in the boot area of a disk partition. This program is filesystem-specific, and must match the type of filesystem on the disk to be booted.
.sp
.LP
The boot objects are platform-dependent and reside in the \fB/usr/platform/\fR\fIplatform-name\fR\fB/lib/fs/\fR\fIfile-system\fR directory. The platform name can be found using the \fB-i\fR option of \fBuname\fR(1). The filesystem type can be found using:
.sp
.in +2
.nf
% fstyp \fIraw-disk-device\fR
.fi
.in -2
.sp

.sp
.LP
See \fBfstyp\fR(1M).
.sp
.LP
The \fBinstallboot\fR utility is a SPARC only program. It is not supported on the x86 architecture. x86 users should use \fBinstallgrub\fR(1M) instead.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fBzfs|ufs|hsfs\fR\fR
.ad
.sp .6
.RS 4n
Specifies the file system type of the boot block to be installed. Required if you wish to specify \fBzfs\fR or \fBhsfs\fR. The default is \fBufs\fR.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIbootblk\fR\fR
.ad
.sp .6
.RS 4n
The name of the bootblock code.
.RE

.sp
.ne 2
.mk
.na
\fB\fIraw-disk-device\fR\fR
.ad
.sp .6
.RS 4n
The name of the disk device onto which the bootblock code is to be installed; it must be a character device which is readable and writable. Naming conventions for a \fBSCSI\fR or \fBIPI\fR drive are \fBc\fR\fI?\fR\fBt\fR\fI?\fR\fBd\fR\fI?\fR\fBs\fR\fI?\fR and \fBc\fR\fI?\fR\fBd\fR\fI?\fR\fBs\fR\fI?\fR for an \fBIDE\fR drive.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRInstalling UFS Boot Block
.sp
.LP
To install a \fBufs\fR boot block on slice \fB0\fR of target \fB0\fR on controller \fB1\fR of the platform where the command is being run, use:

.sp
.in +2
.nf
# \fBinstallboot /usr/platform/`uname -i`/lib/fs/ufs/bootblk \e
	/dev/rdsk/c1t0d0s0\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRInstalling ZFS Boot Block
.sp
.LP
To install a ZFS boot block on slice 0 of target 0 on controller 1 of the platform where the command is being run, use syntax such as the following:

.sp
.in +2
.nf
# \fBinstallboot -F zfs /usr/platform/`uname -i`/lib/fs/zfs/bootblk \e
      /dev/rdsk/c1t1d0s0\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/platform/\fR\fIplatform-name\fR\fB/lib/fs/\fR\fR
.ad
.sp .6
.RS 4n
Directory where boot objects reside.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBkmdb\fR(1), \fBod\fR(1), \fBuname\fR(1), \fBboot\fR(1M), \fBfstyp\fR(1M), \fBinit\fR(1M), \fBkernel\fR(1M), \fBmonitor\fR(1M), \fBreboot\fR(1M), \fBrpc.bootparamd\fR(1M), \fBinit.d\fR(4), \fBattributes\fR(5)
.sp
.LP
\fIInstalling Oracle Solaris 11 Systems\fR
.SH WARNINGS
.sp
.LP
The \fBinstallboot\fR utility fails if the \fIbootblk\fR or \fIopenfirmware\fR files do not exist or if the raw disk device is not a character device.
