Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ipmpstat.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ipmpstat 1M "31 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ipmpstat \- display IPMP subsystem status
.SH SYNOPSIS
.LP
.nf
\fBipmpstat\fR [\fB-n\fR] [\fB-o\fR \fIfield\fR[,...] [\fB-P\fR]] \fB-a\fR|\fB-g\fR|\fB-i\fR|\fB-p\fR|\fB-t\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBipmpstat\fR command concisely displays information about the IPMP subsystem. It supports five different output modes, each of which provides a different view of the IPMP subsystem (address, group, interface, probe, and target), described below. At most one output mode may be specified per invocation, and the displayed information is guaranteed to be self-consistent. It also provides a parseable output format which may be used by scripts to examine the state of the IPMP subsystem. Only basic privileges are needed to invoke \fBipmpstat\fR, with the exception of probe mode which requires all privileges.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Display IPMP data address information ("address" output mode).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
Display IPMP group information ("group" output mode).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
Display IP interface information ("interface" output mode).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Display IP addresses numerically, rather than attempting to resolve them to hostnames. This option may be used in any output mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
Display only the specified output fields, in order. The list of field names is case-insensitive and comma-separated. The field names that are supported depend on the selected output mode, described below. The special field name \fBall\fR may be used to display all fields for a given output mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Display IPMP probe information ("probe" output mode).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Display IPMP target information ("target" output mode).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
Display using a machine-parseable format, described below. If this option is specified, an explicit list of fields must be specified using the \fB-o\fR option.
.RE

.SH OUTPUT MODES
.sp
.LP
The \fBipmpstat\fR utility supports the output modes listed below. Note that these modes map to some of the options described above.
.sp
.ne 2
.mk
.na
\fBAddress Mode\fR
.ad
.sp .6
.RS 4n
Address mode displays the state of all IPMP data addresses on the system. The following output fields are supported:
.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
The hostname (or IP address) associated with the information. Note that because duplicate down addresses may exist, the address must be taken together with the \fBGROUP\fR to form a unique identity. For a given IPMP group, if duplicate addresses exist, at most one will be displayed, and an up address will always take precedence.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
The state of the address. Either \fBup\fR if the address is \fBIFF_UP\fR (see \fBifconfig\fR(1M)), or \fBdown\fR if the address is not \fBIFF_UP\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
The IPMP IP interface hosting the address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBINBOUND\fR\fR
.ad
.sp .6
.RS 4n
The underlying IP interface that will receive packets for this address. This may change in response to external events such as IP interface failure. If this field is empty, then the system will not accept IP packets sent to this address (for example, because the address is down or because there are no active IP interfaces left in the IPMP group).
.RE

.sp
.ne 2
.mk
.na
\fB\fBOUTBOUND\fR\fR
.ad
.sp .6
.RS 4n
The underlying IP interfaces that will send packets using this source address. This may change in response to external events such as IP interface failure. If this field is empty, then the system will not send packets with this address as a source (for example, because the address is down or because there are no active IP interfaces left in the IPMP group).
.RE

If \fB-o\fR is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
\fBGroup Mode\fR
.ad
.sp .6
.RS 4n
Group mode displays the state of all IPMP groups on the system. The following output fields are supported:
.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
The IPMP IP interface name associated with the information. For the anonymous group (see \fBin.mpathd\fR(1M)), this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUPNAME\fR\fR
.ad
.sp .6
.RS 4n
The IPMP group name. For the anonymous group, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
The state of the group:
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.RS 12n
.rt  
All interfaces in the group are usable.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdegraded\fR\fR
.ad
.RS 12n
.rt  
Some (but not all) interfaces in the group are usable.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.RS 12n
.rt  
No interfaces in the group are usable.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBFDT\fR\fR
.ad
.sp .6
.RS 4n
The probe-based failure detection time. If probe-based failure detection is disabled, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBINTERFACES\fR\fR
.ad
.sp .6
.RS 4n
The list of underlying IP interfaces in the group. The list is divided into three parts:
.RS +4
.TP
1.
Active interfaces are listed first and not enclosed in any brackets or parenthesis. Active interfaces are those being used by the system to send or receive data traffic.
.RE
.RS +4
.TP
2.
\fBINACTIVE\fR interfaces are listed next and enclosed in parenthesis. \fBINACTIVE\fR interfaces are those that are functioning, but not being used according to administrative policy.
.RE
.RS +4
.TP
3.
Unusable interfaces are listed last and enclosed in brackets. Unusable interfaces are those that cannot be used at all in their present configuration (for example, \fBFAILED\fR or \fBOFFLINE\fR).
.RE
.RE

If \fB-o\fR is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
\fBInterface Mode\fR
.ad
.sp .6
.RS 4n
Interface mode displays the state of all IP interfaces that are tracked by \fBin.mpathd\fR on the system. The following output fields are supported:
.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
The IP interface name associated with the information.
.RE

.sp
.ne 2
.mk
.na
\fB\fBACTIVE\fR\fR
.ad
.sp .6
.RS 4n
Either \fByes\fR or \fBno\fR, depending on whether the IP interface is being used by the system for IP data traffic.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
The IPMP IP interface associated with the IP interface. For IP interfaces in the anonymous group (see \fBin.mpathd\fR(1M)), this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
Assorted information about the IP interface:
.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
Unusable due to being \fBINACTIVE\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
Marked \fBSTANDBY\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
Nominated to send/receive IPv4 multicast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 5n
.rt  
Nominated to send/receive IPv4 broadcast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
Nominated to send/receive IPv6 multicast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
Unusable due to being \fBdown\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBh\fR\fR
.ad
.RS 5n
.rt  
Unusable due to being brought \fBOFFLINE\fR by \fBin.mpathd\fR because of a duplicate hardware address.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
The state of link-based failure detection:
.sp
.ne 2
.mk
.na
\fB\fBup\fR\fR
.ad
.sp .6
.RS 4n
The link is up.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdown\fR\fR
.ad
.sp .6
.RS 4n
The link is down.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
The network driver does not report link state changes.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBPROBE\fR\fR
.ad
.sp .6
.RS 4n
The state of probe-based failure detection:
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.sp .6
.RS 4n
Probes detect no problems.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.sp .6
.RS 4n
Probes detect failure.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
Probes cannot be sent since no suitable probe targets are known.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisabled\fR\fR
.ad
.sp .6
.RS 4n
Probes have been disabled because a unique IP test address has not been configured.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
The overall state of the interface:
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.sp .6
.RS 4n
The interface is online and functioning properly based on the configured failure detection methods.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.sp .6
.RS 4n
The interface is online but has a link state of \fBdown\fR or a probe state of \fBfailed\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoffline\fR\fR
.ad
.sp .6
.RS 4n
The interface is offline.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
The interface is online but may or may not be functioning because the configured failure detection methods are in \fBunknown\fR states.
.RE

.RE

If \fB-o\fR is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
\fBProbe Mode\fR
.ad
.sp .6
.RS 4n
Probe mode displays information about the probes being sent by \fBin.mpathd\fR. Unlike other output modes, this mode runs until explicitly terminated using \fBCtrl-C\fR. The following output fields are supported:
.sp
.ne 2
.mk
.na
\fB\fBTIME\fR\fR
.ad
.sp .6
.RS 4n
The time the probe was sent, relative to when \fBipmpstat\fR was started. If the probe was sent prior to starting \fBipmpstat\fR, the time will be negative.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROBE\fR\fR
.ad
.sp .6
.RS 4n
An identifier representing the probe. The identifier embeds a prefix denoting the probe type, followed by a numerical identifier for the probe. The permissible values for the probe type are:
.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
ICMP probes
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
transitive probes
.RE

ICMP probes are sent from active interfaces; the numeric identifier of the probe is incremented for each IP probe sent by \fBin.mpathd\fR over a given active interface. The numeric identifier matches the \fBicmp_seq\fR field of the ICMP probe packet and can be used for a more detailed analysis by packet monitoring tools.
.sp
When the IPMP group does not have any \fBNOFAILOVER\fR test addresses configured on any of the interfaces in the group, transitive probes are sent from all interfaces that are not actively being used for receiving data packets. The numeric identifier of transitive probes is incremented for each transitive probe sent from a given interface. The format of a probe packet is internal to the implementation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
The IP interface the probe was sent on.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGET\fR\fR
.ad
.sp .6
.RS 4n
The hostname (or IP address) of the target to which an ICMP probe is sent from an active interface or the name of the IP interface to which the transitive probe is sent.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNETRTT\fR\fR
.ad
.sp .6
.RS 4n
The network round-trip-time for the probe. This is the time between when the IP module sends the probe and when the IP module receives the acknowledgment. If \fBin.mpathd\fR has concluded that the probe has been lost, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTT\fR\fR
.ad
.sp .6
.RS 4n
The total round-trip-time for the probe. This is the time between when \fBin.mpathd\fR starts executing the code to send the probe, and when it completes processing the \fBack\fR. If \fBin.mpathd\fR has concluded that the probe has been lost, this field will be empty. Spikes in the total round-trip time that are not present in the network round-trip time indicate that the local system itself is overloaded.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTTAVG\fR\fR
.ad
.sp .6
.RS 4n
The average round-trip-time to \fBTARGET\fR over \fBINTERFACE\fR. This aids identification of slow targets. If there is insufficient data to calculate the average, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTTDEV\fR\fR
.ad
.sp .6
.RS 4n
The standard deviation for the round-trip-time to \fBTARGET\fR over \fBINTERFACE\fR. This aids identification of jittery targets. If there is insufficient data to calculate the standard deviation, this field will be empty.
.RE

If \fB-o\fR is not specified, all fields except for \fBRTTAVG\fR and \fBRTTDEV\fR are displayed.
.RE

.sp
.ne 2
.mk
.na
\fBTarget Mode\fR
.ad
.sp .6
.RS 4n
Target mode displays IPMP probe target information. The following output fields are supported:
.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
The IP interface name associated with the information.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
The probe target discovery mode:
.sp
.ne 2
.mk
.na
\fB\fBroutes\fR\fR
.ad
.RS 14n
.rt  
Probe targets found by means of the routing table.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmulticast\fR\fR
.ad
.RS 14n
.rt  
Probe targets found by means of multicast ICMP probes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisabled\fR\fR
.ad
.RS 14n
.rt  
All probe-based failure detection is disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtransitive\fR\fR
.ad
.RS 14n
.rt  
Failure detection is by means of transitive probing, where the health of the IP interface is determined by probing other active interfaces in the group.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBTESTADDR\fR\fR
.ad
.sp .6
.RS 4n
The source address used in outgoing probes. Active interfaces that are being used for data traffic, as well as interfaces that have been explicitly configured with \fBNOFAILOVER\fR test addresses, will have the hostname (or IP address) that is used for sending and receiving the ICMP probes. All other interfaces in the group will display the name of the interface from which the probes are sent. Note that if an active IP interface is configured with both IPv4 and IPv6 test addresses, probe target information will be displayed separately for each test address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGETS\fR\fR
.ad
.sp .6
.RS 4n
A space-separated list of probe target hostnames (or IP addresses) for ICMP probes, or target interfaces for transitive probes. The IP targets will be listed in firing order, and, if no probe targets could be found, this field will be empty.
.RE

If \fB-o\fR is not specified, all output fields are displayed.
.RE

.SH OUTPUT FORMAT
.sp
.LP
By default, \fBipmpstat\fR uses a human-friendly tabular format for its output modes, where each row contains one or more fields of information about a given object, which is in turn uniquely identified by one or more of those fields. In this format, a header identifying the fields is displayed above the table (and after each screenful of information), fields are separated by whitespace, empty fields are represented by \fB--\fR (double hyphens), and other visual aids are used. If the value for a field cannot be determined, its value will be displayed as "\fB?\fR" and a diagnostic message will be output to standard error.
.sp
.LP
Machine-parseable format also uses a tabular format, but is designed to be efficient to programmatically parse. Specifically, machine-parseable format differs from human-friendly format in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
No headers are displayed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Fields with empty values yield no output, rather than showing \fB--\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Fields are separated by a single colon (\fB:\fR), rather than variable amounts of whitespace.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If multiple fields are requested, and a literal \fB:\fR or a backslash (\fB\e\fR) occur in a field's value, they are escaped by prefixing them with \fB\e\fR\&.
.RE
.SH EXAMPLES
.LP
\fBExample 1 \fRObtaining Failure Detection Time of a Specific Interface
.sp
.LP
The following code uses the machine-parseable output format to create a \fBksh\fR function that outputs the failure detection time of a given IPMP IP interface:

.sp
.in +2
.nf
     getfdt() {
         ipmpstat -gP -o group,fdt | while IFS=: read group fdt; do
             [[ "$group" = "$1" ]] && { echo "$fdt"; return; }
         done
     }
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp
.LP
\fB/usr/sbin/ipmpstat\fR:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
_
Machine-Parseable FormatCommitted
_
Human-Friendly FormatNot-an-Interface
.TE

.sp
.LP
\fB/usr/sbin/ipmpstat\fR is not a Committed interface.
.SH SEE ALSO
.sp
.LP
\fBif_mpadm\fR(1M), \fBifconfig\fR(1M), \fBin.mpathd\fR(1M), \fBattributes\fR(5)
