Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/k5srvutil.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH k5srvutil 1M "29 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
k5srvutil \- host key table (keytab) manipulation utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/k5srvutil\fR \fIoperation\fR [\fB-ik\fR] [\fB-f\fR \fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBk5srvutil\fR command allows a system manager to list or change keys currently in his keytab or to add new keys to the keytab.
.sp
.LP
The operand \fIoperation\fR must be one of the following:
.sp
.ne 2
.mk
.na
\fB\fBlist\fR\fR
.ad
.RS 10n
.rt  
Lists the keys in a keytab, showing version number and principal name.
.RE

.sp
.ne 2
.mk
.na
\fB\fBchange\fR\fR
.ad
.RS 10n
.rt  
Changes all the keys in the keytab to new randomly-generated keys, updating the keys in the Kerberos server's database to match those by using the \fBkadmin\fR protocol. If a key's version number does not match the version number stored in the Kerberos server's database, the operation fails. The old keys are retained so that existing tickets continue to work. If the \fB-i\fR flag is specified, \fBk5srvutil\fR prompts for \fByes\fR or \fBno\fR before changing each key. If the \fB-k\fR option is used, the old and new keys are displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelold\fR\fR
.ad
.RS 10n
.rt  
Deletes keys that are not the most recent version from the keytab. This operation should be used at some point after a change operation to remove old keys. If the \fB-i\fR flag is specified, \fBk5srvutil\fR asks the user whether the old keys associated with each principal should be removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete\fR\fR
.ad
.RS 10n
.rt  
Deletes particular keys in the keytab, interactively prompting for each key.
.RE

.sp
.LP
In all cases, the default keytab file is \fB/etc/krb5.keytab\fR file unless this is overridden by the \fB-f\fR option.
.sp
.LP
\fBk5srvutil\fR uses the \fBkadmin\fR(1M) program to edit the keytab in place. However, old keys are retained, so they are available in case of failure.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 15n
.rt  
Specify a keytab file other than the default file, \fB/etc/krb5.keytab\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 15n
.rt  
Prompts user before changing keys when using the \fBchange\fR or \fBdelold\fR operands.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 15n
.rt  
Displays old and new keys when using the \fBchange\fR operand.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/security/kerberos-5
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBktutil\fR(1), \fBkadmin\fR(1M), \fBattributes\fR(5)
