Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/kmscfg.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH kmscfg 1M "18 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
kmscfg \- configure the PKCS#11 KMS provider
.SH SYNOPSIS
.LP
.nf
\fBkmscfg\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-p\fR[\fBrofile\fR] \fIProfile_Name\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-a\fR[\fBgent\fR] \fIAgent_ID\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-i\fR[\fBpaddr\fR] \fIAgent_Address\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-t\fR[\fBimeout\fR] \fITransaction_Timeout\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-f\fR[\fBailover\fR] \fIFailover_Limit\fR
.fi

.LP
.nf
\fBkmscfg\fR \fB-d\fR[\fBiscovery\fR] \fIDiscovery_Freq\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBkmscfg\fR command is used to initialize the PKCS#11 KMS provider (\fBpkcs11_kms\fR) for use with the Solaris Cryptographic Framework. In order for the KMS provider to communicate with the Oracle Key Manager (OKM), it must have some configuration information available. This configuration data contains information such as the name of the profile to be used, the name of the OKM Agent, the IP address of an OKM appliance (KMA) and some other parameters (see \fBSYNOPSIS\fR).
.sp
.LP
By default, \fBkmscfg\fR stores the configuration information in \fB/var/user/kms/$USERNAME\fR. This directory will be created if it is not already present. If the configuration is already detected, the user will be given the option to override the existing data. The default location can be overriden by using the \fBKMSTOKEN_DIR\fR environment variable, which must be set prior to invoking \fBkmscfg\fR.
.sp
.LP
Prior to running \fBkmscfg\fR, the OKM administrator must have performed the required initialization and configuration steps on the appliance itself to setup the individual Profiles and Agents that PKCS11 KMS consumers will use. The instructions for configuring these profiles are available in the \fIOracle Key Manager Administration Guide\fR on the Oracle website (\fBhttp://docs.oracle.com\fR).
.sp
.LP
Once the administrator has configured the KMA, the necessary identification information (profile name, agent ID, IP address) must be provided to be able to run \fBkmscfg\fR and initialize the provider on the Oracle Solaris client.
.SH OPTIONS
.sp
.LP
The options listed below are supported. Note that, if the profile, agent id, or KMA address are not specified on the command line, \fBkmscfg\fR prompts you to provide these items.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIAgent_ID\fR\fR
.ad
.sp .6
.RS 4n
The user agent ID as configured on the OKM to be used for the KMS token being configured. It is not unusual for the Profile and Agent ID to be the same, for example, \fBMyAgent\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIDiscovery_Freq\fR\fR
.ad
.sp .6
.RS 4n
Frequency in seconds with which the client will try to discover the availability of other KMAs in an OKM cluster. If not specified, \fIDiscovery_Freq\fR defaults to 10.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIFailover_Limit\fR\fR
.ad
.sp .6
.RS 4n
The number of times communications to the KMA can fail before the client gives up. If not specified, \fIFailover_Limit\fR defaults to 3.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIAgent_Addr\fR\fR
.ad
.sp .6
.RS 4n
Address of the KMA. This can be an IPv4 address (\fIxxx\fR.\fIxxx\fR.\fIxxx\fR.\fIxxx\fR) or an IPv6 address. A fully qualified host name can also be used, as long as that name can be resolved by the name service configured on the client. If an OKM cluster is being used, the address of any member of the cluster can be specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIProfile_Name\fR\fR
.ad
.sp .6
.RS 4n
A name for the profile to be used for the KMS token being configured. Typically, the profile name and the Agent ID will be the same, though they are not required to be.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fITransaction_Timeout\fR\fR
.ad
.sp .6
.RS 4n
Timeout period for individual KMS commands, in seconds. If not specified, this value defaults to 10.
.RE

.SH EXIT STATUS
.sp
.LP
After completing the requested operation, \fBkmscfg\fR exits with one of the following status values.
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful termination.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
Failure. The requested operation could not be completed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/kms/$USERNAME\fR\fR
.ad
.sp .6
.RS 4n
Default KMS token configuration directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB${KMSTOKEN_DIR}\fR\fR
.ad
.sp .6
.RS 4n
Alternate KMS token configuration directory.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
/system/library/security/crypto/pkcs11_kms
T}
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBpktool\fR(1), \fBattributes\fR(5), \fBpkcs11_kms\fR(5)
.sp
.LP
\fIOracle Key Manager Administration Guide\fR (\fBhttp://docs.oracle.com\fR)
.SH NOTES
.sp
.LP
PKCS#11 clients require Oracle Key Manager Software Version 2.4 be installed on the OKM.
.sp
.LP
If PKCS#11 clients will use the same Agent ID from multiple systems, that agent should be created without the "One Time Passphrase" flag set. This option will not be available in OKM clusters with some members running versions of the OKM software prior to 2.4. Please refer to the \fIOKM Administration Guide\fR for assistance in creating Agents.
.sp
.LP
OKM Agents must have a Default Key Group assigned prior to being used to create keys with a PKCS#11 client. If a Default Key Group is not assigned to the Agent, operations will fail with a \fBCKR_PIN_INCORRECT\fR error. Please refer to the \fIOKM Administration Guide\fR for assistance in assigning key groups to agents.
