Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/kprop.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the Massachusetts Institute of Technology.  For copying and distribution information,  please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.TH kprop 1M "14 Nov 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
kprop \- Kerberos database propagation program
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/kprop\fR [\fB-d\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIport-number\fR] 
     [\fB-r\fR \fIrealm\fR] [\fB-s\fR \fIkeytab\fR] [\fIhost\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBkprop\fR is a command-line utility used for propagating a Kerberos database from a master \fBKDC\fR to a slave \fBKDC\fR. This command must be run on the master \fBKDC\fR. See the \fISolaris System Administration Guide, Vol. 6\fR on how to set up periodic propagation between the master \fBKDC\fR and slave \fBKDC\fRs.
.sp
.LP
To propagate a Kerberos database, the following conditions must be met: 
.RS +4
.TP
.ie t \(bu
.el o
The slave \fBKDC\fRs must have an \fB/etc/krb5/kpropd.acl\fR file that contains the principals for the master \fBKDC\fR and all the slave \fBKDC\fRs.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A keytab containing a host principal entry must exist on each slave \fBKDC\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The database to be propagated must be dumped to a file using \fBkdb5_util\fR(1M).
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 18n
.rt  
Enable debug mode. Default is debug mode disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.RS 18n
.rt  
File to be sent to the slave \fBKDC\fR. Default is the \fB/var/krb5/slave_datatrans\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIport-number\fR\fR
.ad
.RS 18n
.rt  
Propagate \fIport-number\fR. Default is port \fB754\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIrealm\fR\fR
.ad
.RS 18n
.rt  
Realm where propagation will occur. Default \fIrealm\fR is the local realm.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIkeytab\fR\fR
.ad
.RS 18n
.rt  
Location of the keytab. Default location is \fB/etc/krb5/krb5.keytab\fR.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIhost\fR\fR
.ad
.RS 8n
.rt  
Name of the slave \fBKDC\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRPropagating the Kerberos Database
.sp
.LP
The following example propagates the Kerberos database from the \fB/tmp/slave_data\fR file to the slave \fBKDC\fR \fBlondon\fR. The machine \fBlondon\fR must have a host principal keytab entry and the \fBkpropd.acl\fR file must contain an entry for the all the \fBKDC\fRs. 

.sp
.in +2
.nf
# kprop -f /tmp/slave_data london
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/kpropd.acl\fR\fR
.ad
.RS 29n
.rt  
List of principals of all the KDCs; resides on each slave KDC.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/krb5.keytab\fR\fR
.ad
.RS 29n
.rt  
Keytab for Kerberos clients.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/krb5/slave_datatrans\fR\fR
.ad
.RS 29n
.rt  
Kerberos database propagated to the KDC slaves.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/security/kerberos-5
.TE

.SH SEE ALSO
.sp
.LP
\fBkpasswd\fR(1), \fBsvcs\fR(1), \fBgkadmin\fR(1M), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBkadmind\fR(1M), \fBkadmin.local\fR(1M), \fBkdb5_util\fR(1M), \fBsvcadm\fR(1M), \fBkadm5.acl\fR(4), \fBkdc.conf\fR(4), \fBattributes\fR(5), \fBkerberos\fR(5), \fBsmf\fR(5)
.sp
.LP
\fI\fR
