Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/labelit_ufs.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH labelit_ufs 1M "15 Apr 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
labelit_ufs \- provide and print labels for ufs file systems
.SH SYNOPSIS
.LP
.nf
\fBlabelit\fR \fB-F\fR ufs [\fIgeneric_options\fR] \fIspecial\fR [\fIfsname\fR \fIvolume\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBlabelit\fR is used to write labels on unmounted disk file systems. Such labels may be used to uniquely identify volumes and are used by volume-oriented programs such as \fBvolcopy\fR(1M).
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 19n
.rt  
options supported by the generic  \fBlabelit\fR command. See  \fBlabelit\fR(1M).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIspecial\fR\fR
.ad
.RS 11n
.rt  
name should be the physical disk section (for example, \fB/dev/dsk/c0d0s6\fR). The device may not be on a remote machine.
.RE

.sp
.ne 2
.mk
.na
\fB\fIfsname\fR\fR
.ad
.RS 11n
.rt  
represents the mount point (for example, \fBroot\fR, \fBu1\fR, and so on) of the file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fIvolume\fR\fR
.ad
.RS 11n
.rt  
may be used to represent the physical volume name.
.RE

.sp
.LP
If  \fIfsname\fR and  \fIvolume\fR are not specified, \fBlabelit\fR prints the current values of these labels.  Both  \fIfsname\fR and  \fIvolume\fR are limited to six or fewer characters.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Write or display of labels was successful.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBlabelit\fR(1M), \fBvolcopy\fR(1M), \fBattributes\fR(5), \fBufs\fR(7FS)
