Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/labeld.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH labeld 1M "26 Jun 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
labeld \- Trusted Extensions label daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/labeld\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlabel\fR daemon is a system daemon which is started at boot time when Trusted Extensions is enabled. This daemon is started automatically and should not be invoked directly. It does not constitute a programming interface.
.sp
.LP
To enable Trusted Extensions, enter the following at the command line:
.sp
.in +2
.nf
% svcadm enable svc:/system/labeld
.fi
.in -2
.sp

.sp
.LP
Because Trusted Extensions affects the initialization and operation of zones, all zones must be removed before enabling Trusted Extensions. After enabling, the system should be rebooted to allow Trusted Extensions to come up properly initialized.
.sp
.LP
Enabling or disabling Trusted Extensions can only be done by a user or role with the \fBsolaris.smf.manage.labels\fR authorization. (For example, a user or role that has either the Information Security or Object Label Management Rights Profile, or superuser.)
.sp
.LP
Other configuration steps are needed before using Trusted Extensions functionality. For more information, see the \fISolaris Trusted Extensions Installation and Configuration Guide\fR.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface Stability Uncommitted 
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator's Procedures\fR
.SH NOTES
.sp
.LP
The \fBlabels\fR(5) service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/labeld:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
