Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/lldpd.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH lldpd 1M "8 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
lldpd \- Link Layer Discovery Protocol daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/lldpd\fR
.fi

.LP
.nf
svc:/network/lldp:default
.fi

.SH DESCRIPTION
.sp
.LP
\fBlldpd\fR is a system daemon that  implements the Link Layer Discovery Protocol as specified in IEEE Std. 802.1AB. The daemon also manages LLDP agents on physical datalinks. Please see \fBlldpadm\fR(1M) for more information on administering LLDP on LLDP agents.
.sp
.LP
The \fBlldpd\fR daemon is controlled through the service management facility (SMF) service instance:
.sp
.in +2
.nf
svc:/network/lldp:default
.fi
.in -2
.sp

.sp
.LP
This means, \fBsvcadm\fR(1M) must be used to start, stop, restart, and refresh this daemon. This daemon is disabled by default. To enable LLDP on any of the physical datalinks, this daemon should be running.
.sp
.LP
The \fBlldpd\fR daemon is a project private interface and has no user-accessible options.
.SH EXAMPLES
.LP
\fBExample 1 \fREnabling the Daemon
.sp
.LP
The following command enables the \fBlldpd\fR daemon.

.sp
.in +2
.nf
# \fBsvcadm enable network/lldp\fR
# \fBsvcs network/lldp\fR
STATE          STIME    FMRI
online         Jan_26   svc:/network/lldp:default
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisabling the Daemon
.sp
.LP
The following command disables the \fBlldpd\fR daemon.

.sp
.in +2
.nf
# \fBsvcadm disable network/lldp\fR
# \fBsvcs network/lldp\fR
STATE          STIME    FMRI
disabled       5:11:35  svc:/network/lldp:default
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/lldp
_
Interface StabilityProject Private
.TE

.SH SEE ALSO
.sp
.LP
\fBlldpadm\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5)
.sp
.LP
IEEE Std 802.1AB-2009, \fIIEEE Standard for Local and Metropolitan Area Networks: Station and Media Access Control Connectivity Discovery\fR
