Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/locator.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH locator 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
locator \- location indicator control
.SH SYNOPSIS
.LP
.nf
\fB /usr/sbin/locator\fR [\fB-f\fR | \fB-n\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The locator command sets or queries the state of the system locator if such a device exists.
.sp
.LP
Without options, the locator command reports the current state of the system.
.sp
.LP
The privileges required to use this command are hardware dependent. Typically, only the super user can get or set a locator.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Turns the locator off.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Turns the locator on.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing the \fBlocator\fR Command on a Platform Which Has a System Locator LED
.sp
.LP
When issued on a platform which has a system locator \fBLED\fR, the following command turns the locator on:

.sp
.in +2
.nf
# \fBlocator \fR\fB-n\fR
# \fBlocator\fR
The 'system' locator is on
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUsing the \fBlocator\fR Command on a Platform Which Does Not Have a System Locator LED
.sp
.LP
When issued on a platform which does not have a system locator \fBLED\fR, the following command attempts to turn the locator on. The command returns an error message.

.sp
.in +2
.nf
# \fBlocator \fR\fB-n\fR
\&'system' locator not found
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Invalid command line input.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
The requested operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/picl
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
