Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/mdmonitord.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH mdmonitord 1M "25 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
mdmonitord \- daemon to monitor metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mdmonitord\fR [\fB-t\fR \fItime_interval\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmdmonitord\fR utility is part of Solaris Volume Manager. It monitors and checks RAID1 (mirrors), RAID5 and hot spares. 
.sp
.LP
There are two methods for checking:
.RS +4
.TP
.ie t \(bu
.el o
At fixed time intervals.
.RE
.RS +4
.TP
.ie t \(bu
.el o
When a RAID-1 (mirror), RAID-5, or hot spare fails. A failure generates  an error event which triggers a check of these metadevices.
.RE
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 6n
.rt  
Time interval in seconds.  The default value is 0, which causes probes to occur only upon an error. If you want to run \fBmdmonitord\fR at a regular interval, a value of 1800 (seconds, every half hour) is recommended as a starting point.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/svm
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBsvcadm\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBmd\fR(7D)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
Since frequent probes can affect performance, it is recommended that the intervals between probes be limited.
.sp
.LP
The \fBmdmonitord\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/mdmonitor
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
