Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/mdnsd.1m
'\" te
.\" Copyright (c) 2003-2004 Apple Computer, Inc. All Rights Reserved. 
.\" Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
.\" Copyright (c) 2007, 2010, Oracle and/or its affiliates. All rights reserved.
.TH mdnsd 1M "21 Aug 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
mdnsd \- Multicast DNS daemon
.SH SYNOPSIS
.LP
.nf
mdnsd [-\fBdebug\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBmdnsd\fR is the daemon program for Multicast DNS and DNS Service Discovery.
.sp
.LP
The \fBmdnsd\fR daemon listens on UDP port 5353 for Multicast DNS Query packets. When it receives a query for which it knows an answer, \fBmdnsd\fR issues the appropriate Multicast DNS Reply packet.
.sp
.LP
The \fBmdnsd\fR daemon also performs Multicast DNS Queries on behalf of client processes, and maintains a cache of the replies.
.sp
.LP
The \fBmdnsd\fR daemon has no user-specifiable command-line argument, and users should not run \fBmdnsd\fR manually. The \fBmdnsd\fR daemon should be managed by the Solaris Management Facility (SMF) and should be administered by the \fBsvcadm\fR(1M) command using the following fault management resource identifier (FMRI):
.sp
.in +2
.nf
svc:/network/dns/multicast:default
.fi
.in -2
.sp

.sp
.LP
To examine \fBmdnsd\fR's internal state for debugging and diagnostic purposes, send it a SIGUSR1 signal, and it will then log a snapshot summary of its internal state using the \fBsyslog\fR(3C) facility. \fBmdnsd\fR uses the syslog facility code daemon and info priority level.
.SH OPTIONS
.sp
.LP
The \fBmdnsd\fR daemon recognizes the following option:
.sp
.ne 2
.mk
.na
\fB\fB-debug\fR\fR
.ad
.RS 10n
.rt  
Debug mode. The \fBmdnsd\fR daemon sends output to the standard error, and does not run in the background. This option is only intended for debugging the daemon.
.RE

.SS "CONFIGURATION"
.sp
.LP
Multicast \fBDNS\fR can be used to look up host names and host addresses by specifying \fBmdns\fR as a source for hosts and ipnodes in the name service switch configuration file \fB nsswitch.conf\fR(4). The configuration options for host name and host address queries using Multicast \fBDNS\fR are stored in the \fBSMF\fR repository. This configuration can be modified by the \fBsvccfg\fR(1M) command using the following fault management resouce identfier (FMRI): 
.sp
.in +2
.nf
svc:/network/dns/multicast:default
.fi
.in -2
.sp

.sp
.LP
The configuration options for host name and host address queries using Multicast \fBDNS\fR are stored in a property group named "\fBnss_mdns_config\fR". The properties that make up the configuration options are as follows:
.sp
.ne 2
.mk
.na
\fBsearch\fR
.ad
.RS 10n
.rt  
A list of search domains for host name look up. By default, no search domains are included in the configuration. The search list is currently limited to six domains.
.RE

.sp
.ne 2
.mk
.na
\fBvalid\fR
.ad
.RS 10n
.rt  
A list of valid domains checked before Multicast \fBDNS\fR is used to look up the host name or host address for a domain. Domains specified in the search list are always included in the valid list. The  valid domain list is currently limited to ten domains.
.RE

.sp
.LP
Please note the above configuration options are Volatile and may change in a future release.
.SH FILES
.sp
.LP
/usr/lib/inet/mdnsd
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/dns/mdns
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBdns-sd\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsyslog\fR(3C),\fB nsswitch.conf\fR(4), \fBattributes\fR(5)
.sp
.LP
For information on Multicast DNS, see http://www.multicastdns.org/
.sp
.LP
For information on DNS Service Discovery, see \fBhttp://www.dns-sd.org/\fR.
