Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/medstat.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH medstat 1M "18 Jan 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
medstat \- check the status of mediator hosts for a given diskset
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/medstat\fR [\fB-q\fR] \fB-s\fR \fIsetname\fR
.fi

.SH DESCRIPTION
.sp
.LP
If a specified diskset has been configured for mediators, \fBmedstat\fR attempts to contact these hosts to see if they are accessible and returns the results of the communication.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 14n
.rt  
This optional argument disables the printing of informative text. When used with \fB-q\fR, \fBmedstat\fR still prints error messages and returns a result code.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB\fIsetname\fR\fR\fR
.ad
.RS 14n
.rt  
Specifies the name of a diskset on which \fBmedstat\fR will work.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRChecking diskset
.sp
.LP
This example checks the mediator hosts for the selected diskset.

.sp
.in +2
.nf
# medstat -s relo-red
.fi
.in -2
.sp

.sp
.LP
The name of the diskset is \fBrelo-red\fR. The \fBmedstat\fR command prints the status for each mediator host. Additionally, if the mediator quorum is met, either through a ``golden'' mediator host or because half+1 of the mediator hosts respond, the exit code is 0. If the quorum is not met, then the exit code is 1. If no mediator hosts have been configured for the named diskset, the exit code is 2. The status field will contain one of the following values: Unreachable, Bad, Fatal, or Ok, where Unreachable indicates an RPC/communication problem, Bad indicates an error in the mediator data, Fatal indicates any other error condition, and Ok indicates no error conditions.

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/lvm/meddb\fR\fR
.ad
.RS 18n
.rt  
Contains the mediator data for a host that has been selected as a mediator host.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
Availabilitystorage/svm
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetareplace\fR(1M), \fBmetaset\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.cf\fR(4), \fBmd.tab\fR(4), \fBmddb.cf\fR(4), \fBmeddb\fR(4), \fBmediator\fR(7D)
.sp
.LP
Sun Cluster documentation, \fISolaris Volume Manager Administration Guide\fR
.SH NOTES
.sp
.LP
This command is designed for use in the high availability product.
