Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/metaoffline.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH metaoffline 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaoffline, metaonline \- place submirrors offline and online
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaoffline\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaoffline\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fImirror\fR \fIsubmirror\fR
.fi

.LP
.nf
\fB/usr/sbin/metaonline\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaonline\fR [\fB-s\fR \fIsetname\fR] \fImirror\fR \fIsubmirror\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmetaoffline\fR command prevents Solaris Volume Manager from reading and writing to the submirror that has been taken offline. While the submirror is offline, all writes to the mirror will be kept track of (by region) and will be written when the submirror is brought back online. The \fBmetaoffline\fR command can also be used to perform online backups: one submirror is taken offline and backed up while the mirror remains accessible. (However, if this is a two-way mirror, data redundancy is lost while one submirror is offline.) The \fBmetaoffline\fR command differs from the \fBmetadetach\fR command because it does not sever the logical association between the submirror and the mirror. To completely remove a submirror from a mirror, use the \fBmetadetach\fR command.
.sp
.LP
A submirror that has been taken offline will only remain offline until the \fBmetaonline\fR command is invoked or the system is rebooted.
.sp
.LP
When the \fBmetaonline\fR command is used, reading from and writing to the submirror resumes. A resync is automatically invoked to resync the regions written while the submirror was offline. Writes are directed to the submirror during resync. Reads, however, will come from a different submirror. Once the resync operation completes, reads and writes are performed on that submirror. The \fBmetaonline\fR command is only effective on a submirror of a mirror that has been taken offline.
.sp
.LP
The \fBmetaoffline\fR and \fBmetaonline\fR commands can not be used on RAID 1 volumes in application-based recovery (ABR) mode.
.sp
.LP
A submirror that has been taken offline with the \fBmetaoffline\fR command can only be mounted as read-only.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except \fB-h\fR. 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 14n
.rt  
Forces offlining of submirrors that have slices requiring maintenance.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 14n
.rt  
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB\fIsetname\fR\fR\fR
.ad
.RS 14n
.rt  
Specifies the name of the diskset on which \fBmetaoffline\fR and \fBmetaonline\fR will work. Using the \fB-s\fR option will cause the command to perform its administrative function within the specified diskset. Without this option, the command will perform its function on local metadevices.
.RE

.sp
.ne 2
.mk
.na
\fB\fImirror\fR\fR
.ad
.RS 14n
.rt  
Specifies the metadevice name of the mirror from which the submirror will be either taken offline or put online.
.RE

.sp
.ne 2
.mk
.na
\fB\fIsubmirror\fR\fR
.ad
.RS 14n
.rt  
Specifies the metadevice name of the submirror to be either taken offline or put online.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRTaking a Submirror Offline
.sp
.LP
This example takes one submirror, \fBmymirror_sub1\fR, offline from mirror \fBmymirror\fR.

.sp
.in +2
.nf
# metaoffline mymirror mymirror_sub1
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/svm
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
The \fBmetaonline\fR and \fBmetaoffline\fR commands are not applicable to mirrors in application-based recovery (ABR) mode.
