Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/metaclear.1m
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH metaclear 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaclear \- delete active metadevices and hot spare pools
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaclear\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-a\fR [\fB-f\fR]
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fImetadevice...\fR \fIhot_spare_pool...\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-r\fR [\fB-f\fR] \fImetadevice...\fR \fIhot_spare_pool...\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-p\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-p\fR \fImetadevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmetaclear\fR command deletes the specified metadevice or \fIhot_spare_pool\fR, or purges all soft partitions from the designated component. Once a metadevice or hot spare pool is deleted, it must be re-created using \fBmetainit\fR before it can be used again.
.sp
.LP
Any metadevice currently in use (open) cannot be deleted. 
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except \fB-h\fR.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 14n
.rt  
Deletes all metadevices and configured hot spare pools in the set named by \fB-s\fR, or the local set by default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 14n
.rt  
Deletes (forcibly) a metadevice that contains a subcomponent in an error state.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 14n
.rt  
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 14n
.rt  
Deletes (purges) all soft partitions from the specified metadevice or component.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 14n
.rt  
Recursively deletes specified metadevices and hot spare pools, but does not delete metadevices on which others depend.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB\fIsetname\fR\fR\fR
.ad
.RS 14n
.rt  
Specifies the name of the diskset on which \fBmetaclear\fR will work. Using the \fB-s\fR option causes the command to perform its administrative function within the specified diskset. Without this option, the command performs its function on local metadevices and/or hot spare pools.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fImetadevice\fR \fI\&...\fR\fR
.ad
.RS 24n
.rt  
Specifies the name(s) of the metadevice(s) to be deleted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomponent\fR\fR
.ad
.RS 24n
.rt  
Specifies the \fBc*d*t*s*\fR name(s) of the components containing soft partitions to be deleted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIhot_spare_pool\fR \fI\&...\fR\fR
.ad
.RS 24n
.rt  
Specifies the name(s) of the hot spare pools to be deleted. Names for hot spare pools can be any legal file name that is composed of alphanumeric characters, a dash ("-"), an underscore ("_"), or a period ("."). Names must begin with a letter. The words "all" and "none" are reserved and cannot be used.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDeleting Various Devices
.sp
.LP
The following example deletes a metadevice named \fBd10\fR.

.sp
.in +2
.nf
# metaclear /dev/md/dsk/d10
.fi
.in -2
.sp

.sp
.LP
The following example deletes all local metadevices and hot spare pools on the system.

.sp
.in +2
.nf
# metaclear -a
.fi
.in -2
.sp

.sp
.LP
The following example deletes a mirror, \fBmymirror\fR, with a submirror in an error state.

.sp
.in +2
.nf
# metaclear -f mymirror
.fi
.in -2
.sp

.sp
.LP
The following example deletes a hot spare pool, \fBhsp001\fR.

.sp
.in +2
.nf
# metaclear hsp001
.fi
.in -2
.sp

.sp
.LP
The following example deletes a soft partition, \fBd23\fR.

.sp
.in +2
.nf
# metaclear d23
.fi
.in -2
.sp

.sp
.LP
The following example purges all soft partitions on the slice \fBc2t3d5s2\fR if those partitions are not being used by other metadevices or are not open.

.sp
.in +2
.nf
# metaclear -p c2t3d5s2
.fi
.in -2
.sp

.sp
.LP
The following example purges soft partitions from a metadevice.

.sp
.in +2
.nf
# metaclear -p d2
d3: Soft Partition is cleared
d4: Soft Partition is cleared
d5: Soft Partition is cleared
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/svm
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fI\fR
