Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/metareplace.1m
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH metareplace 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metareplace \- enable or replace components of submirrors or RAID5 metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metareplace\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fB-e\fR \fImirror\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fImirror\fR \fIcomponent-old\fR \fIcomponent-new\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fB-e\fR \fIRAID\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fIRAID\fR \fIcomponent-old\fR \fIcomponent-new\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmetareplace\fR command is used to enable or replace components (slices) within a submirror or a RAID5 metadevice.
.sp
.LP
When you replace a component, the \fBmetareplace\fR command automatically starts resyncing the new component with the rest of the metadevice. When the resync completes, the replaced component becomes readable and writable. If the failed component has been hot spare replaced, the hot spare is placed in the available state and made available for other hot spare replacements.
.sp
.LP
Note that the new component must be large enough to replace the old component.
.sp
.LP
A component may be in one of several states. The \fBLast\fR \fBErred\fR and the \fBMaintenance\fR states require action. Always replace components in the \fBMaintenance\fR state first, followed by a resync and validation of data. After components requiring maintenance are fixed, validated, and resynced, components in the \fBLast\fR \fBErred\fR state should be replaced. To avoid data loss, it is always best to back up all data before replacing \fBLast\fR \fBErred\fR devices.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except \fB-h\fR. 
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 17n
.rt  
Transitions the state of \fIcomponent\fR to the available state and resyncs the failed component. If the failed component has been hot spare replaced, the hot spare is placed in the available state and made available for other hot spare replacements. This command is useful when a component fails due to human error (for example, accidentally turning off a disk), or because the component was physically replaced. In this case, the replacement component must be partitioned to match the disk being replaced before running the \fBmetareplace\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 17n
.rt  
Forces the replacement of an errored component of a metadevice in which multiple components are in error. The component determined by the \fBmetastat\fR display to be in the ``Maintenance'' state must be replaced first. This option may cause data to be fabricated since multiple components are in error.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 17n
.rt  
Display help message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB\fIsetname\fR\fR\fR
.ad
.RS 17n
.rt  
Specifies the name of the diskset on which \fBmetareplace\fR will work. Using the \fB-s\fR option will cause the command to perform its administrative function within the specified diskset. Without this option, the command will perform its function on local metadevices.
.RE

.sp
.ne 2
.mk
.na
\fB\fImirror\fR\fR
.ad
.RS 17n
.rt  
The metadevice name of the mirror.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomponent\fR\fR
.ad
.RS 17n
.rt  
The logical name for the physical slice (partition) on a disk drive, such as \fB/dev/dsk/c0t0d0s2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomponent-old\fR\fR
.ad
.RS 17n
.rt  
The physical slice that is being replaced.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomponent-new\fR\fR
.ad
.RS 17n
.rt  
The physical slice that is replacing \fIcomponent-old\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIRAID\fR\fR
.ad
.RS 17n
.rt  
The metadevice name of the RAID5 device.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRRecovering from Error Condition in RAID5 Metadevice
.sp
.LP
This example shows how to recover when a single component in a RAID5 metadevice is errored.

.sp
.in +2
.nf
# metareplace d10 c3t0d0s2 c5t0d0s2
.fi
.in -2
.sp

.sp
.LP
In this example, a RAID5 metadevice \fBd10\fR has an errored component, \fBc3t0d0s2\fR, replaced by a new component, \fBc5t0d0s2\fR.

.LP
\fBExample 2 \fRUse of \fB-e\fR After Physical Disk Replacement
.sp
.LP
This example shows the use of the \fB-e\fR option after a physical disk in a submirror (a submirror of mirror \fBmymirror1\fR, in this case) has been replaced.

.sp
.in +2
.nf
# metareplace -e mymirror1 c1t4d0s2
.fi
.in -2
.sp

.sp
.LP
Note: The replacement disk must be partitioned to match the disk it is replacing before running the \fBmetareplace\fR command.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/svm
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fI\fR
