Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/mkpwdict.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH mkpwdict 1M "1 Jun 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkpwdict \- maintain password-strength checking database
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mkpwdict\fR [\fB-s\fR \fIdict1\fR,... ,\fIdictN\fR] 
     [\fB-d\fR \fIdestination-path\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmkpwdict\fR command adds words to the dictionary-lookup database used by \fBpam_authtok_check\fR(5) and \fBpasswd\fR(1).
.sp
.LP
Files containing words to be added to the database can be specified on the command-line using the \fB-s\fR flag. These source files should have a single word per line, much like \fB/usr/share/lib/dict/words\fR.
.sp
.LP
If \fB-s\fR is omitted, \fBmkpwdict\fR will use the value of \fBDICTIONLIST\fR specified in \fB/etc/default/passwd\fR (see \fBpasswd\fR(1)).
.sp
.LP
The database is created in the directory specified by the \fB-d\fR option. If this option is omitted, \fBmkpwdict\fR uses the value of \fBDICTIONDBDIR\fR specified in \fB/etc/default/passwd\fR (see \fBpasswd\fR(1)). The default location is \fB/var/passwd\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Specifies a comma-separated list of files containing words to be added to the dictionary-lookup database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Specifies the target location of the dictionary-database.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/passwd\fR\fR
.ad
.RS 23n
.rt  
See \fBpasswd\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/passwd\fR\fR
.ad
.RS 23n
.rt  
default destination directory
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1), \fBattributes\fR(5), \fBpam_authtok_check\fR(5)
