Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/mvdir.1m
'\" te
.\" Copyright (c) 1992, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH mvdir 1M "14 Mar 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
mvdir \- move a directory
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mvdir\fR \fIdirname\fR \fIname\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBmvdir\fR moves directories within a file system. \fBdirname\fR must be a directory. If \fIname\fR does not exist, it will be created as a directory. If \fIname\fR does exist, and is a directory, \fBdirname\fR will be created as \fIname/dirname\fR. \fBdirname\fR and  \fIname\fR may not be on the same path; that is, one may not be subordinate to the other. For example:
.sp
.LP
\fBexample%\fR \fBmvdir\fR \fBx/y\fR \fBx/z\fR
.sp
.LP
is legal, but
.sp
.LP
\fBexample%\fR \fBmvdir\fR \fBx/y\fR \fBx/y/z\fR
.sp
.LP
is not.
.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fBdirname\fR\fR
.ad
.RS 11n
.rt  
The name of the directory that is to be moved to another directory in the filesystem.
.RE

.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 11n
.rt  
The name of the directory into which \fBdirname\fR is to be moved. If \fIname\fR does not exist, it will be created. It may not be on the same path as \fBdirname\fR.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBmvdir\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
Operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBmkdir\fR(1), \fBmv\fR(1), \fBattributes\fR(5), \fBlargefile\fR(5)
