Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ncaconfd.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ncaconfd 1M "11 Feb 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ncaconfd \- Solaris Network Cache and Accelerator (NCA) configuration daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/ncaconfd\fR [\fB-al\fR ] \fIinterface1\fR [\fIinterface2 ...\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the \fBncaconfd\fR utility to set up NCA on a system. At boot time, the \fBncakmod\fR initialization script reads in \fBnca.if\fR(4) to determine on which interface(s) NCA should run. \fBncaconfd\fR then sets up the interface.
.sp
.LP
\fBncaconfd\fR also operates as a daemon if the \fBnca_active\fR key is set to enabled in \fBncakmod.conf\fR(4) file. In this case, \fBncaconfd\fR will continue as a daemon after all the NCA interfaces have been set up, listening for routing changes. The changes are then passed to NCA to control which interface NCA should use to make active outgoing TCP connections.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Enable active connections.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Enable logging.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/ncakmod.conf\fR\fR
.ad
.RS 25n
.rt  
 
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/http-cache-accelerator
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBncakmod\fR(1), \fBnca.if\fR(4), \fBncakmod.conf\fR(4), \fBattributes\fR(5), \fBnca\fR(7D)
