Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ndd.1m
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ndd 1M "21 Feb 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndd \- get and set driver configuration parameters
.SH SYNOPSIS
.LP
.nf
\fBndd\fR [\fB-set\fR] \fIdriver\fR \fIparameter\fR [\fIvalue\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBndd\fR gets and sets selected configuration parameters in some kernel drivers. Currently, \fBndd\fR only supports the drivers that implement the \fBTCP/IP\fR Internet protocol family. Each driver chooses which parameters to make visible using \fBndd\fR. Since these parameters are usually tightly coupled to the implementation, they are likely to change from release to release. Some parameters may be read-only.
.LP
Note - 
.sp
.RS 2
It is strongly encouraged that you use \fBipadm\fR(1M), rather than \fBndd\fR, to modify or retrieve TCP/IP Internet protocols. The current \fBndd\fR command will be made obsolete in a future release, replaced by \fBipadm\fR(1M). Please see \fBNOTES\fR for more information.
.RE
.sp
.LP
If the \fBndd\fR \fB-set\fR option is omitted, \fBndd\fR queries the named \fIdriver\fR, retrieves the value associated with the specified \fIparameter\fR, and prints it. If the \fB-set\fR option is given, \fBndd\fR passes \fIvalue\fR, which must be specified, down to the named \fIdriver\fR which assigns it to the named \fIparameter\fR.
.sp
.LP
By convention, drivers that support \fBndd\fR also support a special read-only \fIparameter\fR named ``\fB?\fR'' which can be used to list the parameters supported by the driver.
.SH EXAMPLES
.LP
\fBExample 1 \fRGetting Parameters Supported By The TCP Driver
.sp
.LP
To see which parameters are supported by the TCP driver, use the following command:

.sp
.in +2
.nf
example% \fBndd /dev/tcp \e?\fR
.fi
.in -2
.sp

.sp
.LP
The parameter name ``\fB?\fR'' may need to be escaped with a backslash to prevent its being interpreted as a shell meta character.

.sp
.LP
The following command sets the value of the parameter \fIip_forwarding\fR in the dual stack IP driver to zero. This disables IPv4 packet forwarding.

.sp
.in +2
.nf
example% \fBndd -set /dev/ip ip_forwarding 0\fR
.fi
.in -2
.sp

.sp
.LP
Similarly, in order to disable IPv6 packet forwarding, the value of parameter \fIip6_forwarding\fR

.sp
.in +2
.nf
example% \fBndd -set /dev/ip ip6_forwarding 0\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBipadm\fR(1M), \fBioctl\fR(2), \fBattributes\fR(5), \fBnca\fR(7D), \fBarp\fR(7P), \fBip\fR(7P), \fBip6\fR(7P), \fBtcp\fR(7P), \fBudp\fR(7P)
.SH NOTES
.sp
.LP
The parameters supported by each driver may change from release to release. Like programs that read \fB/dev/kmem\fR, user programs or shell scripts that execute \fBndd\fR should be prepared for parameter names to change.
.sp
.LP
The \fBioctl()\fR command that \fBndd\fR uses to communicate with drivers is likely to change in a future release. User programs should avoid making dependencies on it.
.sp
.LP
The use of \fBndd\fR to administer Layer 2 (Data Link layer) drivers is strongly discouraged as this capability is to be obsoleted in a future release, replaced by \fBdladm\fR(1M). Please refer to the driver-specific man page in section 7D of the SunOS man pages.
.sp
.LP
The use of \fBndd\fR to administer the drivers that implement the TCP/IP Internet protocol family (IP/TCP/SCTP/UDP/ICMP) is strongly discouraged as this capability is to be obsoleted in a future release, replaced by \fBipadm\fR. Please see \fBipadm\fR(1M) for instructions for modifying and retrieving supported protocol properties.
.sp
.LP
The meanings of many \fBndd\fR parameters make sense only if you understand how the driver is implemented.
