Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ndmpadm.1m
'\" te
.\" Copyright (c) 2007, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ndmpadm 1M "25 May 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndmpadm \- administer Network Data Management Protocol activities
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ndmpadm\fR [\fB-?\fR ] \fIsubcommand\fR [\fIoptions\fR] [\fIdirect-object\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBndmpadm\fR command can be used to query the \fBndmpd\fR(1M) daemon to get the status of active sessions, terminate a session, query backup devices, and set or get the current NDMP (Network Data Management Protocol) service variables and properties. \fBndmpadm\fR is implemented as a set of subcommands, many with their own direct object, which are described in the section for a given subcommand. Certain subcommands support options, which are described along with the subcommand.
.sp
.LP
The \fBndmpadm\fR command supports the following subcommands:
.sp
.ne 2
.mk
.na
\fB\fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Disable the specified authentication password handling.
.RE

.sp
.ne 2
.mk
.na
\fB\fBenable\fR\fR
.ad
.sp .6
.RS 4n
Enable the specified authentication password handling.
.RE

.sp
.ne 2
.mk
.na
\fB\fBget\fR\fR
.ad
.sp .6
.RS 4n
Get the value of an NDMP configuration property.
.RE

.sp
.ne 2
.mk
.na
\fB\fBkill-sessions\fR\fR
.ad
.sp .6
.RS 4n
Terminate an active session.
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR\fR
.ad
.sp .6
.RS 4n
Set the value of an NDMP configuration property.
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-devices\fR\fR
.ad
.sp .6
.RS 4n
Get a list of tape devices connected to the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-sessions\fR\fR
.ad
.sp .6
.RS 4n
Display the details of active NDMP sessions.
.RE

.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.RS 6n
.rt  
Display a list of all subcommands and options.
.RE

.SH SUB-COMMANDS
.sp
.LP
The \fBndmpadm\fR command supports the subcommands described below.
.SS "\fBdisable\fR Subcommand"
.sp
.LP
The syntax for the \fBdisable\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm disable -a \fIauth-type\fR\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand disables the authentication type specified by \fIauth-type\fR for an NDMP client's remote access. Valid values for \fIauth-type\fR are \fBcram-md5\fR or \fBcleartext\fR.
.SS "\fBenable\fR Subcommand"
.sp
.LP
The syntax for the \fBenable\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm enable -a \fIauth-type\fR -u \fIusername\fR\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand prompts for the user's password twice for confirmation and activates the specified authentication type with the given username and password for NDMP client access. Valid values for \fIauth-type\fR are \fBcram-md5\fR or \fBcleartext\fR.
.SS "\fBget\fR Subcommand"
.sp
.LP
The syntax for the \fBget\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm get [-p] [\fIproperty\fR] [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
The property names are the same as used for the \fBset\fR subcommand and are described below. If you do not specify a property, the \fBget\fR subcommand returns all configuration properties.
.SS "\fBkill-sessions\fR Subcommand"
.sp
.LP
The \fBkill-sessions\fR subcommand allows you to terminate the session number \fIID\fR.
.sp
.LP
The syntax for the \fBkill-sessions\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm kill-sessions \fIID\fR\fR
.fi
.in -2
.sp

.SS "\fBset\fR Subcommand"
.sp
.LP
The syntax for the \fBset\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm set [-p] \fIproperty\fR=\fIvalue\fR [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
The properties you can set with the \fBset\fR subcommand are described in the \fBndmp\fR(4) man page.
.SS "\fBshow-devices\fR Subcommand"
.sp
.LP
The syntax for the \fBshow-devices\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand lists the name, vendor, serial number, and other information about the current tape drive and libraries connected to the system.
.SS "\fBshow-sessions\fR Subcommand"
.sp
.LP
The \fBshow-sessions\fR subcommand displays details of a session. The syntax for the \fBshow-sessions\fR subcommand is:
.sp
.in +2
.nf
# \fBndmpadm show-sessions [-i tape,scsi,data,mover] [\fIID\fR]\fR
.fi
.in -2
.sp

.sp
.LP
The \fBshow-sessions\fR subcommand supports the following arguments:
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fBtape\fR,\fBscsi\fR,\fBdata\fR,\fBmover\fR\fR
.ad
.sp .6
.RS 4n
Identify a type of interface about which to obtain data. If no interface is specified, \fBshow-sessions\fR displays information for all types of interfaces.
.RE

.sp
.ne 2
.mk
.na
\fB\fIID\fR\fR
.ad
.sp .6
.RS 4n
Identifies a particular session about which to display data. If no \fIID\fR is specified, \fBshow-sessions\fR displays data for all sessions.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRObtaining the Status of All NDMP Connections
.sp
.LP
The following command obtains status on all connections.

.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRObtaining the Status of Certain Types of Connections
.sp
.LP
The following command obtains status on tape and SCSI interfaces.

.sp
.in +2
.nf
# \fBndmpadm show-sessions -i scsi,tape\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRLimiting Protocol Version
.sp
.LP
The following command limits the use of the NDMP protocol to version 3.

.sp
.in +2
.nf
# \fBndmpadm set -p version=3\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRObtaining Current Version Number
.sp
.LP
The following command obtains the version number of the currently running NDMP.

.sp
.in +2
.nf
# \fBndmpadm get -p version\fR
.fi
.in -2
.sp

.LP
\fBExample 5 \fRDisconnecting a Specific Session
.sp
.LP
The command shown below disconnects session 5. The session number was previously obtained from an \fBndmpadm show-sessions\fR command.

.sp
.in +2
.nf
# \fBndmpadm kill-session 5\fR
.fi
.in -2
.sp

.LP
\fBExample 6 \fRObtaining the Values for All NDMP Properties
.sp
.LP
The following command obtains the values for all NDMP properties.

.sp
.in +2
.nf
# \fBndmpadm get\fR
.fi
.in -2
.sp

.LP
\fBExample 7 \fREnabling CRAM-MD5 Authentication
.sp
.LP
The following command enables CRAM-MD5 authentication.

.sp
.in +2
.nf
# \fBndmpadm enable -a cram-md5 -u admin\fR
Enter new password:\fB*****\fR
Re-enter password:\fB*****\fR
.fi
.in -2
.sp

.LP
\fBExample 8 \fRDisabling Clear Text Password Authentication
.sp
.LP
The following command disables clear text password authentication.

.sp
.in +2
.nf
# \fBndmpadm disable -a cleartext\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
An error occurred, such as the \fBndmpd\fR daemon is not running, that prevented \fBndmpadm\fR from contacting the demon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/storage/ndmp
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdump\fR(1), \fBtar\fR(1), \fBndmpd\fR(1M), \fBndmpstat\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBndmp\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBndmpd\fR(1M) daemon is managed by the service management facility (\fBsmf\fR(5)), under the service identifier:
.sp
.in +2
.nf
svc:/system/ndmpd
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as setting and getting a property can be alternatively performed using \fBsvccfg\fR(1M). For example to enable Direct Access Recovery (DAR) mode:
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBsetprop ndmpd/dar-support = yes\fR
.fi
.in -2
.sp

.sp
.LP
\&...and to get the list of properties:
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBlistprop\fR
.fi
.in -2
.sp

