Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ndmpd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ndmpd 1M "4 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndmpd \- Network Data Management Protocol daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ndmp/ndmpd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBndmpd\fR daemon handles client Network Data Management Protocol (NDMP) requests. NDMP is an open, enterprise-wide, network-based data management protocol used for backup and recovery. The \fBndmpd\fR daemon enables users to manage data backup and recovery using Data Management Application (DMA) clients. The NDMP protocol is used to coordinate data movement and control between a DMA and an NDMP server or between two NDMP servers.
.sp
.LP
By default, \fBndmpd\fR is disabled.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
An error occurred that prevented the \fBndmpd\fR daemon from initializing, such as failure to fork a process, mutex initialization.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Invalid command-line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ndmp/ndmpd\fR\fR
.ad
.sp .6
.RS 4n
Network data management protocol server binary.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/ndmp.log\fR\fR
.ad
.sp .6
.RS 4n
Network data management protocol log messages file. This file is deleted upon reboot.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/dumpdates\fR\fR
.ad
.sp .6
.RS 4n
A text file that stores information about the date and the level of dump backups.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/storage/ndmp
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBndmpadm\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBndmpd\fR daemon is managed by the service management facility (\fBsmf\fR(5)), under the service identifier:
.sp
.in +2
.nf
svc:/system/ndmpd:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
