Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/netcfgd.1m
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH netcfgd 1M "24 Feb 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
netcfgd \- network configuration management daemon
.SH SYNOPSIS
.LP
.nf
\fB/lib/inet/netcfgd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBnetcfgd\fR is a system daemon to manage network configuration. This daemon is started automatically by svc:/network/netcfg:default and should not be invoked directly. It does not constitute a programming interface.
.sp
.LP
\fBnetcfgd\fR manages access to a network configuration repository, insuring that readers and writers have the appropriate authorizations. Specifically, an application wishing to read network configuration must have the \fBsolaris.network.autoconf.read\fR authorization; while an application wishing to write network configuration must have the \fBsolaris.network.autoconf.write\fR authorization. These authorizations are registered in \fBauth_attr\fR(4), and are included in the \fBNetwork Autoconf\fR profile found in \fBprof_attr\fR(4).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBnetcfg\fR(1M), \fBnwamd\fR(1M), \fBsvcadm\fR(1M), \fBauth_attr\fR(4), \fBprof_attr\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
See also \fBnwam-manager(1M)\fR, available in the JDS/GNOME  man page collection.
