Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/netservices.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH netservices 1M "31 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
netservices \- enable or disable network services
.SH SYNOPSIS
.LP
.nf
\fBnetservices\fR open
.fi

.LP
.nf
\fBnetservices\fR limited
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnetservices\fR command uses the Solaris service management facility, \fBsmf\fR(5), to control services that accept over the network from remote clients.
.sp
.LP
When \fBnetservices\fR is invoked with the \fBlimited\fR command-line argument, all network services except the secure shell daemon, sshd(1M), are either disabled or constrained to respond to local requests only.
.sp
.LP
Invoking netservices with the \fBopen\fR command-line argument enables a large set of network services, as in previous releases of Solaris.
.sp
.LP
To customize the configuration set enabled by \fBnetservices\fR, use \fBsvcadm\fR(1M) to enable or disable individual services. Use \fBsvccfg\fR(1M) to set properties that determine whether a service accepts input from remote clients. See the man pages for individual services for the names of service instances and their properties.
.sp
.LP
Note that the \fBnetservices\fR command has an interface stability of Obsolete.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsshd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
