Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/newkey.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH newkey 1M "11 Dec 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
newkey \- create a new Diffie-Hellman key pair in the publickey database
.SH SYNOPSIS
.LP
.nf
\fBnewkey\fR \fB-h\fR \fIhostname\fR [\fB-s\fR nis | files | ldap]
.fi

.LP
.nf
\fBnewkey\fR \fB-u\fR \fIusername\fR [\fB-s\fR nis | files | ldap]
.fi

.SH DESCRIPTION
.sp
.LP
\fBnewkey\fR establishes new public keys for users and machines on the network. These keys are needed when using secure \fBRPC\fR or secure \fBNFS\fR service.
.sp
.LP
\fBnewkey\fR prompts for a password for the given \fIusername\fR or \fBhostname\fR and then creates a new public/secret Diffie-Hellman 192 bit key pair for the user or host. The secret key is encrypted with the given password. The key pair can be stored in the \fB/etc/publickey\fR file or the NIS \fBpublickey\fR map.
.sp
.LP
\fBnewkey\fR consults the \fBpublickey\fR entry in the name service switch configuration file (see \fBnsswitch.conf\fR(4)) to determine which naming service is used to store the secure \fBRPC\fR keys. If the \fBpublickey\fR entry specifies a unique name service, \fBnewkey\fR will add the key in the specified name service. However, if there are multiple name services listed, \fBnewkey\fR cannot decide which source to update and will display an error message. The user is required to specify the source explicitly with the \fB-s\fR option.
.sp
.LP
In the case of NIS, \fBnewkey\fR should be run by the superuser on the master NIS server for that domain.
.sp
.LP
In the case of LDAP, \fBnewkey\fR should be run by the superuser on a machine that also recognizes the directory manager's bind distinguished name (DN) and password to perform an LDAP update for the host. 
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhostname\fR\fR
.ad
.RS 15n
.rt  
Create a new public/secret key pair for the privileged user at the given \fBhostname\fR. Prompts for a password for the given \fBhostname\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIusername\fR\fR
.ad
.RS 15n
.rt  
Create a new public/secret key pair for the given \fIusername\fR. Prompts for a password for the given \fIusername\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fBnis\fR\fR
.ad
.br
.na
\fB\fB-s\fR \fBfiles\fR\fR
.ad
.br
.na
\fB\fB-s\fR \fBldap\fR\fR
.ad
.RS 15n
.rt  
Update the database in the specified source: \fBnis\fR (for NIS), \fBfiles\fR, or \fBldap\fR (LDAP). Other sources may be available in the future.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBchkey\fR(1), \fBkeylogin\fR(1), \fBnsswitch.conf\fR(4), \fBpublickey\fR(4), \fBattributes\fR(5)
