Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/nfs4cbd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH nfs4cbd 1M "11 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfs4cbd \- NFS Version 4 callback daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/nfs4cbd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnfs4cbd\fR daemon manages communication endpoints for the NFS Version 4 protocol callback program. \fBnfs4cbd\fR runs on the NFS Version 4 client and creates a listener port for each transport over which callbacks can be sent.
.sp
.LP
The \fBnfs4cbd\fR daemon is provided for the exclusive use of the NFS version 4 client.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/nfs
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBmount_nfs\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBnfs4cbd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/cbd
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
If it is disabled, it will be enabled by \fBmount_nfs\fR(1M) and \fBautomountd\fR(1M) on the first NFSv4 mount, unless its \fBapplication/auto_enable\fR property is set to \fBfalse\fR.
.sp
.LP
This daemon might not exist in a future release of Solaris.
