Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ping.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH ping 1M "6 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ping \- send ICMP (ICMP6) ECHO_REQUEST packets to network hosts
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ping\fR \fIhost\fR [\fItimeout\fR]
.fi

.LP
.nf
\fB/usr/sbin/ping\fR \fB-s\fR [\fB-l\fR | \fB-U\fR] [\fB-abdlLnrRv\fR] [\fB-A\fR \fIaddr_family\fR] 
     [\fB-c\fR \fItraffic_class\fR] [\fB-g\fR \fIgateway\fR [\fB-g\fR \fIgateway\fR...]] 
     [\fB-N\fR \fInext_hop_router\fR] [\fB-F\fR \fIflow_label\fR] [\fB-I\fR \fIinterval\fR] 
     [\fB-i\fR \fIinterface\fR] [\fB-P\fR \fItos\fR] [\fB-p\fR \fIport\fR] [\fB-t\fR \fIttl\fR] \fIhost\fR 
     [\fIdata_size\fR] [\fInpackets\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The utility \fBping\fR utilizes the \fBICMP\fR (\fBICMP6\fR in IPv6) protocol's \fBECHO_REQUEST\fR datagram to elicit an \fBICMP\fR (\fBICMP6\fR) \fBECHO_RESPONSE\fR from the specified \fIhost\fR or network \fIgateway\fR. If \fIhost\fR responds, \fBping\fR will display:
.sp
.in +2
.nf
\fIhost\fR is alive
.fi
.in -2
.sp

.sp
.LP
\&...on the standard output and exit. Otherwise, after \fItimeout\fR seconds, it will write:
.sp
.in +2
.nf
no answer from \fIhost\fR
.fi
.in -2
.sp

.sp
.LP
The default value of \fItimeout\fR is \fB20\fR seconds.
.sp
.LP
When you specify the \fBs\fR flag, sends one datagram per second (adjust with \fB-I\fR) and prints one line of output for every \fBECHO_RESPONSE\fR that it receives. \fBping\fR produces no output if there is no response. In this second form, \fBping\fR computes round trip times and packet loss statistics; it displays a summary of this information upon termination or timeout. The default \fIdata_size\fR is \fB56\fR bytes, or you can specify a size with the \fIdata_size\fR command-line argument. If you specify the optional \fInpackets\fR, \fBping\fR sends \fBping\fR requests until it either sends \fInpackets\fR requests or receives \fInpackets\fR replies.
.sp
.LP
When using \fBping\fR for fault isolation, first \fBping\fR the local host to verify that the local network interface is running.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-A\fR\ \fIaddr_family\fR\fR
.ad
.sp .6
.RS 4n
Specify the address family of the target host. \fIaddr_family\fR can be either \fBinet\fR or \fBinet6\fR. Address family determines which protocol to use. For an argument of \fBinet\fR, IPv4 is used. For \fBinet6\fR, IPv6 is used.
.sp
By default, if the name of a host is provided, not the literal \fBIP\fR address, and a valid IPv6 address exists in the name service database, \fBping\fR will use this address. Otherwise, if the name service database contains an IPv4 address, it will try the IPv4 address.
.sp
Specify the address family \fBinet\fR or \fBinet6\fR to override the default behavior. If the argument specified is \fBinet\fR, \fBping\fR will use the IPv4 address associated with the host name. If none exists, \fBping\fR will state that the host is unknown and exit. It does not try to determine if an IPv6 address exists in the name service database.
.sp
If the specified argument is \fBinet6\fR, \fBping\fR uses the IPv6 address that is associated with the host name. If none exists, \fBping\fR states that the host is unknown and exits.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\ \fIflow_label\fR\fR
.ad
.sp .6
.RS 4n
Specify the flow label of probe packets. The value must be an integer in the range from 0 to 1048575. This option is valid only on IPv6.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
Turn off fragmentation. For IPv4, this means setting the Don't Fragment bit. For IPv4 and IPv6, this means do not allow fragmentation as the datagrams are sent. If the \fIdata_size\fR exceeds the MTU, then \fBping\fR might report that sending failed due to Message too long.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIinterval\fR\fR
.ad
.sp .6
.RS 4n
Turn on the statistics mode and specify the interval between successive transmissions. The default is one second. See the discussion of the \fB-s\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
Turn off loopback of multicast packets. Normally, members are in the host group on the outgoing interface, a copy of the multicast packets will be delivered to the local machine.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR \fInext_hop_router\fR\fR
.ad
.sp .6
.RS 4n
Specify a next-hop router so that the probe packet goes through the specified router along its path to the target host. This option essentially bypasses the system routing table and leaves the probe packet header unmodified. Only one next-hop router can be specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\ \fItos\fR\fR
.ad
.sp .6
.RS 4n
Set the type of service (\fItos\fR) in probe packets to the specified value. The default is zero. The value must be an integer in the range from 0 to 255. Gateways also in the path can route the probe packet differently, depending upon the value of \fItos\fR that is set in the probe packet. This option is valid only on IPv4.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
Record route. Sets the IPv4 record route option, which stores the route of the packet inside the IPv4 header. The contents of the record route are only printed if the \fB-v\fR and \fB-s\fR options are given. They are only set on return packets if the target host preserves the record route option across echos, or the \fB-l\fR option is given. This option is valid only on IPv4.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.sp .6
.RS 4n
Send \fBUDP\fR packets instead of \fBICMP\fR (\fBICMP6\fR) packets. \fBping\fR sends \fBUDP\fR packets to consecutive ports expecting to receive back \fBICMP\fR (\fBICMP6\fR) \fBPORT_UNREACHABLE\fR from the target host.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
\fBping\fR all addresses, both IPv4 and IPv6, of the multihomed destination. The output appears as if \fBping\fR has been run once for each \fBIP\fR address of the destination. If this option is used together with \fB-A\fR, \fBping\fR probes only the addresses that are of the specified address family. When used with the \fB-s\fR option and \fInpackets\fR is not specified, \fBping\fR continuously probes the destination addresses in a round robin fashion. If \fInpackets\fR is specified, \fBping\fR sends \fInpackets\fR number of probes to each \fBIP\fR address of the destination and then exits.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
Bypass the global IPsec policy and send and receive packets in the clear for this connection only. This option can be used to troubleshoot network connectivity independent of IPsec. Because this option bypasses system-wide policy for this connection, it can only be used by superuser or a user granted the sys_net_config privilege.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\ \fItraffic_class\fR\fR
.ad
.sp .6
.RS 4n
Specify the traffic class of probe packets. The value must be an integer in the range from 0 to 255. Gateways along the path can route the probe packet differently, depending upon the value of \fItraffic_class\fR set in the probe packet. This option is valid only on IPv6.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Set the \fBSO_DEBUG\fR socket option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\ \fIgateway\fR\fR
.ad
.sp .6
.RS 4n
Specify a loose source route gateway so that the probe packet goes through the specified host along the path to the target host. The maximum number of gateways is 8 for IPv4 and 127 for IPv6. Note that some factors such as the link \fBMTU\fR can further limit the number of gateways for IPv6.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterface_address\fR\fR
.ad
.sp .6
.RS 4n
Specify the outgoing interface address to use for multicast packets for IPv4 and both multicast and unicast packets for IPv6. The default interface address for multicast packets is determined from the (unicast) routing tables. \fIinterface_address\fR can be a literal \fBIP\fR address, for example, \fB10.123.100.99\fR, or an interface name, for example, \fBeri0\fR, or an interface index, for example \fB2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
Use to send the probe packet to the given host and back again using loose source routing. Usually specified with the \fB-R\fR option. If any gateways are specified using \fB-g\fR, they are visited twice, both to and from the destination. This option is ignored if the \fB-U\fR option is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Show network addresses as numbers. \fBping\fR normally does a reverse name lookup on the IP addresses it extracts from the packets received. The \fB-n\fR option blocks the reverse lookup, so \fBping\fR prints IP addresses instead of host names.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\ \fIport\fR\fR
.ad
.sp .6
.RS 4n
Set the base \fBUDP\fR \fIport\fR number used in probes. This option is used with the \fB-U\fR option. The default base \fIport\fR number is 33434. The \fBping\fR utility starts setting the destination port number of \fBUDP\fR packets to this base and increments it by one at each probe.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Bypass the normal routing tables and send directly to a host on an attached network. If the host is not on a directly attached network, an error is returned. This option can be used to \fBping\fR a local host through an interface that has been dropped by the router daemon. See \fBin.routed\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Send one datagram per second and collect statistics.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\ \fIttl\fR\fR
.ad
.sp .6
.RS 4n
Specify the IPv4 time to live, or IPv6 hop limit, for unicast and multicast packets. The default time to live (hop limit) for unicast packets can be set with the \fBipadm\fR(1M) \fBset-prop\fR subcommand, using the \fBicmp_ipv4_ttl\fR property for IPv4 and the \fBicmp_ipv6_hoplimit\fR property for IPv6. The default time to live (hop limit) for multicast is one hop. See \fBEXAMPLES\fR. For further information, see\fBipadm\fR(1M).
.LP
Note - 
.sp
.RS 2
You might observe property names that begin with "\fB_\fR" (underbar). These properties are private to a protocol and are subject to change or removal. See \fBipadm\fR(1M).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Verbose output. List any \fBICMP\fR (\fBICMP6\fR) packets, other than replies from the target host. 
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIhost\fR\fR
.ad
.sp .6
.RS 4n
The network host
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBping\fR With IPv6
.sp
.LP
This example shows \fBping\fR sending probe packets to all the IPv6 addresses of the host \fBxyz\fR, one at a time. It sends an \fBICMP6\fR \fBECHO_REQUEST\fR every second until the user interrupts it.

.sp
.in +2
.nf
istanbul% \fBping -s -A inet6 -a xyz\fR
PING xyz: 56 data bytes
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=0. time=0.479 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=1. time=0.843 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=2. time=0.516 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=3. time=4.943 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=4. time=0.485 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=5. time=2.201 ms
^C     
----xyz PING Statistics----     
6 packets transmitted, 6 packets received, 0% packet loss     
round-trip (ms)  min/avg/stddev = 0.479/1.583/4.943/1.823
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUsing \fBipadm\fR to Set Hop Limits
.sp
.LP
The following commands use \fBipadm\fR(1M) to set IPv4 and IPv6 hop limits.

.sp
.in +2
.nf
# \fBipadm set-prop -p _ipv6_hoplimit=100 icmp\fR
# \fBipadm set-prop -p _ipv4_ttl=100 icmp\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful operation; the machine is alive.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.sp .6
.RS 4n
An error has occurred. Either a malformed argument has been specified, or the machine was not alive.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitynetwork/ping
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBin.routed\fR(1M), \fBipadm\fR(1M), \fBndd\fR(1M), \fBnetstat\fR(1M), \fBrpcinfo\fR(1M), \fBtraceroute\fR(1M), \fBattributes\fR(5), \fBicmp\fR(7P), \fBicmp6\fR(7P)
