Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/pkg2du.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pkg2du 1M "30 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
pkg2du \- convert driver packages to Driver Update format
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/pkg2du\fR [\fB-f\fR] [\fB-v\fR] [\fB-d\fR \fIdir\fR] [\fB-o\fR \fIiso\fR] [\fB-l\fR \fIlabel\fR]
     [\fB-r\fR \fIrelease\fR] \fIpkg\fR [\fIpkg\fR ...]
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/usr/bin/pkg2du\fR utility takes one or more packages as input and converts them to Driver Update (DU) format. If the \fB-d\fR option is specified, the resulting DU directory tree is placed in the directory \fIdir\fR. If the \fB-o\fR option is specified, a Solaris ISO image of the DU directory tree is written in the file \fIiso\fR. The ISO image can be burned onto CD/DVD using \fBcdrw\fR(1) or \fBcdrecord(1)\fR (not a SunOS man page) and used during Solaris installation.
.sp
.LP
At least one of the \fB-d\fR and \fB-o\fR options must be specified. If both are specified, then both an ISO image and a directory tree are generated.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdir\fR\fR
.ad
.sp .6
.RS 4n
Directory where the DU directory should be created.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIiso\fR\fR
.ad
.sp .6
.RS 4n
Create a Solaris ISO image of the DU directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
If \fB\fIdir\fR/DU\fR or \fIiso\fR exists, remove it without asking first.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlabel\fR\fR
.ad
.sp .6
.RS 4n
Label/volume name of the ISO image (if \fB-o\fR option is specified).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIrelease\fR\fR
.ad
.sp .6
.RS 4n
Solaris release number to use. It takes the form of the return from \fBuname\fR \fB-r\fR command, for example, \fB5.10\fR. If unspecified, the release number of the currently running Solaris is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Verbose. Multiple \fB-v\fR options increase verbosity.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIpkg\fR [\fIpkg\fR...]\fR
.ad
.sp .6
.RS 4n
One or more packages to be converted to DU format.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRCreating a DU CD/DVD
.sp
.LP
The following commands create a DU CD or DVD containing packages \fBSUNWfoo\fR and \fBSUNWbar\fR.

.sp
.in +2
.nf
# \fB/usr/bin/pkg2du -r 5.10 -o my.iso SUNWfoo SUNWbar\fR
# \fB/usr/bin/cdrw -i my.iso\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcdrw\fR(1), \fBmkbootmedia\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fBmkisofs(8)\fR (not a SunOS man page)
