Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/pkgask.1m
'\" te
.\" Copyright (c) 1993, 2011, Oracle and/or its affiliates. All rights reserved.
.\"  Copyright 1989 AT&T
.TH pkgask 1M "6 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
pkgask \- stores answers to a request script
.SH SYNOPSIS
.LP
.nf
\fBpkgask\fR [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] \fB-r\fR \fIresponse\fR \fIpkginst\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBpkgask\fR allows the administrator to store answers to an interactive package (one with a \fBrequest\fR script, that is, a user-created file that must be named \fBrequest\fR). Invoking this command generates a response file that is then used as input at installation time. The use of this response file prevents any interaction from occurring during installation since the file already contains all of the information the package needs.
.SH OPTIONS
.sp
.LP
The following options are supported
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.RS 16n
.rt  
Run the request script for a package on \fIdevice\fR. \fIdevice\fR can be a directory pathname or the identifiers for tape or removable medium (for example, \fB/var/tmp\fR and \fB/dev/dsk/c1d0s0\fR). The default device is the installation spool directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.RS 16n
.rt  
Define the full path name of a directory to use as the \fIroot_path\fR. All files, including package system information files, are relocated to a directory tree starting in the specified \fIroot_path\fR.
.LP
Note - 
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-R\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIresponse\fR\fR
.ad
.RS 16n
.rt  
Identify a file or directory which should be created to contain the responses to interaction with the package. The name must be a full pathname. The file, or directory of files, can later be used as input to the \fBpkgadd\fR(1M) command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
Specify the package instance, or list of instances for which \fBrequest\fR scripts will be created. The token \fBall\fR may be used to refer to all packages available on the source medium.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBpkginfo\fR(1), \fBpkgmk\fR(1), \fBpkgparam\fR(1), \fBpkgproto\fR(1), \fBpkgtrans\fR(1), \fBinstallf\fR(1M), \fBpkgadd\fR(1M), \fBpkgchk\fR(1M), \fBpkgrm\fR(1M), \fBremovef\fR(1M), \fBadmin\fR(4),\fBattributes\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
The \fB-r\fR option can be used to indicate a directory name as well as a filename. The directory name is used to create numerous response files, each sharing the name of the package with which it should be associated. This would be used, for example, when you will be adding multiple interactive packages with one invocation of \fBpkgadd\fR(1M). Each package would need a response file. To create multiple response files with the same name as the package instance, name the directory in which the files should be created and supply multiple instance names with the \fBpkgask\fR command. When installing the packages, you will be able to identify this directory to the \fBpkgadd\fR(1M) command.
.sp
.LP
If the default \fBadmin\fR file is too restrictive, the administration file may need to be modified to allow for total non-interaction during a package installation. See\fBadmin\fR(4) for details.
