Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/projdel.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.TH projdel 1M "4 May 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
projdel \- delete a project from the system
.SH SYNOPSIS
.LP
.nf
\fBprojdel\fR [\fB-f\fR \fIfilename\fR] \fIproject\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBprojdel\fR utility deletes a project from the system and makes the appropriate changes to the system file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 15n
.rt  
Specify the project file to modify. If no \fIfilename\fR is specified, the system project file, \fB/etc/project\fR, is modified.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIproject\fR\fR
.ad
.RS 11n
.rt  
The name of the project to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
The command syntax was invalid. A usage message for \fBprojdel\fR is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 6n
.rt  
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 6n
.rt  
The \fIprojid\fR given with the \fB-p\fR option is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 6n
.rt  
The project files contain an error. See \fBproject\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 6n
.rt  
The project to be modified, group, user, or resource does not exist. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB9\fR\fR
.ad
.RS 6n
.rt  
The project is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
Cannot update the \fB/etc/project\fR file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/project\fR\fR
.ad
.RS 16n
.rt  
System project file
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fR
.ad
.RS 16n
.rt  

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface stabilty		See below.
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.sp
.LP
\fBprojects\fR(1), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBgrpck\fR(1M), \fBlogins\fR(1M), \fBprojadd\fR(1M), \fBprojmod\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBproject\fR(4), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
In case of an error, \fBprojdel\fR prints an error message and exits with a non-zero status. 
.SH NOTES
.sp
.LP
\fBprojdel\fR deletes a project definition only on the local system. If a network name service such as \fBNIS\fR or \fBLDAP\fR is being used to supplement the local \fB/etc/project\fR file with additional entries, \fBprojdel\fR cannot change information supplied by the network name service.
