Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/prtfru.1m
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved
.TH prtfru 1M "30 May 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
prtfru \- print FRUID-specific information about the FRUs on a system or domain
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/prtfru\fR [\fB-d\fR] | [\fB-clx\fR] [\fIcontainer\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBprtfru\fR utility is used to obtain \fBFRUID\fR data from the system or domain. Its output is that of a tree structure echoing the path in the \fBFRU\fR (Field-Replaceable Unit) tree to each container. When  a container is found, the data from that container is printed in a tree-like structure as well.
.sp
.LP
\fBprtfru\fR without any arguments will print the \fBFRU\fR hierarchy and all of the \fBFRUID\fR container data. \fBprtfru\fR prints to stdout which may be redirected to a file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fR
.ad
.RS 7n
.rt  
Prints \fIonly\fR the containers and their data. This option does not print the \fBFRU\fR tree hierarchy.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fR
.ad
.RS 7n
.rt  
Prints a \fBDTD\fR for the current registry to stdout.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fR
.ad
.RS 7n
.rt  
Prints \fIonly\fR the \fBFRU\fR tree hierarchy. This option does not print the container data.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fR
.ad
.RS 7n
.rt  
Prints in \fBXML\fR format with a system identifier (SYSTEM) of \fBprtfrureg.dtd\fR.
.RE

.sp
.LP
Options \fB-c\fR and \fB-l\fR can be used together to obtain a list of the containers.
.SH OPERANDS
.sp
.LP
The folowing operand is supported:
.sp
.ne 2
.mk
.na
\fB\fIcontainer\fR\fR
.ad
.RS 13n
.rt  
The name of a particular container in the \fBFRU\fR hierarchy, that is, either the name or path/name of a container as displayed in the \fB-l\fR option.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
All information was found and printed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error has occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/fru-id
.TE

.SH SEE ALSO
.sp
.LP
\fBfruadm\fR(1M), \fBattributes\fR(5)
