Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/pwconv.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH pwconv 1M "9 Mar 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
pwconv \- installs and updates /etc/shadow with information from /etc/passwd
.SH SYNOPSIS
.LP
.nf
\fBpwconv\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpwconv\fR command creates and updates \fB/etc/shadow\fR with information from \fB/etc/passwd\fR.
.sp
.LP
\fBpwconv\fR relies on a special value of 'x' in the password field of \fB/etc/passwd.\fR This value of 'x' indicates that the password for the user is already in \fB/etc/shadow\fR and should not be modified.
.sp
.LP
If the \fB/etc/shadow\fR file does not exist, this command will create \fB/etc/shadow\fR with information from \fB/etc/passwd\fR. The command populates \fB/etc/shadow\fR with the user's login name, password, and password aging information. If password aging information does not exist in \fB/etc/passwd\fR for a given user, none will be added to \fB/etc/shadow\fR. However, the last changed information will always be updated.
.sp
.LP
If the \fB/etc/shadow\fR file does exist, the following tasks will be performed:
.sp
.ne 2
.mk
.na
\fB\fR
.ad
.sp .6
.RS 4n
Entries that are in the \fB/etc/passwd\fR file and not in the \fB/etc/shadow\fR file will be added to the \fB/etc/shadow\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.sp .6
.RS 4n
Entries that are in the \fB/etc/shadow\fR file and not in the \fB/etc/passwd\fR file will be removed from \fB/etc/shadow\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.sp .6
.RS 4n
Password attributes (for example, password and aging information) that exist in an \fB/etc/passwd\fR entry will be moved to the corresponding entry in \fB/etc/shadow\fR.
.RE

.sp
.LP
The \fBpwconv\fR command can only be used by the super-user.
.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/opasswd\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/oshadow\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/passwd\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/shadow\fR
.RE
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBpasswd\fR(1),  \fBusermod\fR(1M), \fBpasswd\fR(4), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
\fBpwconv\fR exits with one of the following values:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
\fBSUCCESS.\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Permission denied.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Invalid command syntax.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
Unexpected failure. Conversion not done.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 5n
.rt  
Unexpected failure. Password file(s) missing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 5n
.rt  
Password file(s) busy. Try again later.
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 5n
.rt  
Bad entry in \fB/etc/shadow\fR file.
.RE

