Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rem_drv.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rem_drv 1M "4 Oct 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
rem_drv \- remove a device driver from the system
.SH SYNOPSIS
.LP
.nf
\fBrem_drv\fR [\fB-b\fR \fIbasedir\fR] [\fB-C\fR] [\fB-n\fR] \fIdevice_driver\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrem_drv\fR command informs the system that the device driver \fIdevice_driver\fR is no longer valid. If possible, \fBrem_drv\fR unloads \fIdevice_driver\fR from memory. \fBrem_drv\fR also updates the system driver configuration files.
.sp
.LP
If \fBrem_drv\fR has been executed, the next time the system is rebooted it automatically performs a reconfiguration boot (see \fBkernel\fR(1M)).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIbasedir\fR\fR
.ad
.sp .6
.RS 4n
Sets the path to the root directory of the diskless client. Used on the server to execute \fBrem_drv\fR for a client. The client machine must be rebooted to unload the driver.
.LP
Note - 
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-b\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
Remove dangling device attribute nodes bound to the driver being removed. This causes any device ownership or permissions customizations made to any node not to be preserved if the driver is added back. Recommended for use when reprovisioning a machine from one configuration or use to another where past administrative customizations might not be desired.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Do not try to detach and unload \fIdevice_driver\fR, just modify the system configuration files for that driver.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRRemoving the \fBsd\fR Driver
.sp
.LP
The following example removes the \fBsd\fR driver from use:

.sp
.in +2
.nf
example% rem_drv sd
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRemoving a Diskless Client
.sp
.LP
The following example removes the driver from the \fBsun1\fR diskless client. The driver is not uninstalled or unloaded until the client machine is rebooted.

.sp
.in +2
.nf
example% rem_drv \fB-b\fR /export/root/sun1 sd
.fi
.in -2
.sp

.sp
.LP
Note the caveat on the use of the \fB-b\fR option in the description of that option, above.

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fBkernel\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5), \fBzones\fR(5), \fBdevfs\fR(7FS)
