Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/removef.1m
'\" te
.\" Copyright (c) 1989, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH removef 1M "30 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
removef \- remove a file from software database
.SH SYNOPSIS
.LP
.nf
\fBremovef\fR [ [\fB-M\fR] \fB-R\fR \fIroot_path\fR] [\fB-V\fR \fIfs_file\fR] \fIpkginst\fR \fIpath\fR...
.fi

.LP
.nf
\fBremovef\fR [ [\fB-M\fR] \fB-R\fR \fIroot_path\fR] [\fB-V\fR \fIfs_file\fR] \fB-f\fR \fIpkginst\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBremovef\fR informs the system that the user, or software, intends to remove a pathname. Output from \fBremovef\fR is the list of input pathnames that may be safely removed (no other packages have a dependency on them).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
After all files have been processed, \fBremovef\fR should be invoked with the \fB-f\fR option to indicate that the removal phase is complete.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.sp .6
.RS 4n
Instruct \fBremovef\fR not to use the \fB$\fR\fIroot_path\fR\fB/etc/vfstab\fR file for determining the client's mount points. This option assumes the mount points are correct on the server and it behaves consistently with Solaris 2.5 and earlier releases.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-R\fR \fIroot_path\fR\fR
.ad
.sp .6
.RS 4n
Define the full path name of a directory to use as the \fIroot_path\fR. All files, including package system information files, are relocated to a directory tree starting in the specified \fIroot_path\fR. The \fIroot_path\fR may be specified when installing to a client from a server (for example, \fB/export/root/client1\fR).
.sp
\fBremovef\fR inherits the value of the \fBPKG_INSTALL_ROOT\fR environment variable. (See ENVIRONMENT VARIABLES, below.) If \fBPKG_INSTALL_ROOT\fR is set, such as when the \fB-R\fR option is used with \fBpkgadd\fR(1M) or \fBpkgrm\fR(1M), there is no need to use the \fBremovef\fR \fB-R\fR option.
.LP
Note - 
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-R\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fIfs_file\fR\fR
.ad
.sp .6
.RS 4n
Specify an alternative \fIfs_file\fR to map the client's file systems. For example, used in situations where the \fB$\fR\fIroot_path\fR\fB/etc/vfstab\fR file is non-existent or unreliable.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIpath\fR\fR
.ad
.sp .6
.RS 4n
The pathname to be removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.sp .6
.RS 4n
The package instance from which the pathname is being removed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBremovef\fR
.sp
.LP
The following example uses the \fBremovef\fR command in an optional pre-install script:

.sp
.in +2
.nf
echo "The following files are no longer part of this package
      and are being removed."
removef $PKGINST /myapp/file1 /myapp/file2 |
while read pathname
do
     echo "$pathname"
     rm \fB-f\fR $pathname
done
removef \fB-f\fR $PKGINST || exit 2
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
\fBremovef\fR inherits the value of the following environment variable. This variable is set when \fBpkgadd\fR(1M) or \fBpkgrm\fR(1M) is invoked with the \fB-R\fR option.
.sp
.ne 2
.mk
.na
\fB\fBPKG_INSTALL_ROOT\fR\fR
.ad
.sp .6
.RS 4n
If present, defines the full path name of a directory to use as the system's \fBPKG_INSTALL_ROOT\fR path. All product and package information files are then looked for in the directory tree, starting with the specified \fBPKG_INSTALL_ROOT\fR path. If not present, the default system path of \fB/\fR is used.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBpkginfo\fR(1), \fBpkgmk\fR(1), \fBpkgparam\fR(1), \fBpkgproto\fR(1), \fBpkgtrans\fR(1), \fBinstallf\fR(1M), \fBpkgadd\fR(1M), \fBpkgask\fR(1M), \fBpkgchk\fR(1M), \fBpkgrm\fR(1M), \fBattributes\fR(5), \fBlargefile\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
Package commands are \fBlargefile\fR(5)-aware. They handle files larger than 2 GB in the same way they handle smaller files. In their current implementations, \fBpkgadd\fR(1M), \fBpkgtrans\fR(1) and other package commands can process a datastream of  up to 4 GB.
