Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/remove_allocatable.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH remove_allocatable 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
remove_allocatable \- remove entries from allocation databases
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] \fB-n\fR \fIname\fR
.fi

.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] [\fB-d\fR] \fB-t\fR \fIdev-type\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBremove_allocatable\fR removes entries of user allocatable devices from the device allocation mechanism. \fBremove_allocatable\fR also removes entries of some non-allocatable devices, such as printers, whose label range is managed by the mechanism.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
Removes  system-supplied  default attributes of the device type that is specified with \fB-t\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 15n
.rt  
Force the removal of an entry. \fBremove_allocatable\fR exits with an error if this option is not specified when an entry with the specified device name no longer exists.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIname\fR\fR
.ad
.RS 15n
.rt  
Removes the entry for the device \fIname\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdev-type\fR\fR
.ad
.RS 15n
.rt  
Removes devices of type \fIdev-type\fR.
.RE

.SH EXIT STATUS
.sp
.LP
When successful, \fBremove_allocatable\fR returns an exit status of \fB0\fR (true). \fBremove_allocatable\fR returns a nonzero exit status in the event of an error. The exit codes are as follows:
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Invocation syntax error
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Unknown system error
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
Device \fIname\fR or \fIdev-type\fR not found. This error occurs only when the \fB-f\fR option is not specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 5n
.rt  
Permission denied. User does not have DAC or MAC access to database.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.82i) |cw(2.68i) 
lw(2.82i) |lw(2.68i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilitySee below.
.TE

.sp
.LP
The invocation is Uncommitted. The options are Uncommitted. The output is Not-an-Interface.
.SH SEE ALSO
.sp
.LP
\fBallocate\fR(1), \fBdeallocate\fR(1), \fBadd_allocatable\fR(1M), \fBattributes\fR(5), \fBdevice_clean\fR(5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
