Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/reparsed.1m
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH reparsed 1M "18 Feb 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
reparsed \- reparse point daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/reparse/reparsed\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBreparsed\fR daemon processes kernel upcalls to interpret "reparse points", which are the basis of Microsoft DFS referrals and NFS referrals support on Solaris SMB and NFS file servers. Only the root user or a user with equivalent privileges can run this daemon. The daemon is under SMF control.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
Daemon failed to start.
.RE

.sp
.LP
Error information is reported to \fBsyslog\fR at level \fBLOG_ERR\fR.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/reparsed/*.so.1\fR\fR
.ad
.sp .6
.RS 4n
Per-service plugins for \fBreparsed\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBnfsref\fR(1M), \fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBlibreparse\fR(3LIB), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Do not manually stop, start or restart the \fBreparsed\fR daemon. If you need to change the state of the daemon, use these commands:
.sp
.in +2
.nf
# \fBsvcadm disable svc:/system/filesystem/reparse\fR
# \fBsvcadm enable svc:/system/filesystem/reparse\fR
# \fBsvcadm restart svc:/system/filesystem/reparse\fR
.fi
.in -2
.sp

.sp
.LP
See \fBsvcadm\fR(1M) for additional information.
