Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/repquota.1m
'\" te
.\" Copyright (c) 1999, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH repquota 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
repquota \- summarize quotas for a ufs file system
.SH SYNOPSIS
.LP
.nf
\fBrepquota\fR [\fB-v\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBrepquota\fR \fB-a\fR [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBrepquota\fR prints a summary of the disk usage and quotas for the specified ufs file systems. The current number of files and amount of space (in kilobytes) is printed for each user along with any quotas created with \fBedquota\fR(1M).
.sp
.LP
The \fIfilesystem\fR must have the file  \fBquotas\fR in its root directory.
.sp
.LP
Only the super-user may view quotas which are not their own.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Report on all mounted ufs file systems that have \fBrq\fR in the  \fBmntopts\fR field of the \fB/etc/vfstab\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
Report quotas for all users, even those who do not consume resources.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBrepquota\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBedquota\fR(1M), \fBquota\fR(1M), \fBquotacheck\fR(1M), \fBquotaon\fR(1M), \fBattributes\fR(5), \fBlargefile\fR(5), \fBquotactl\fR(7I)
