Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rmvolmgr.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rmvolmgr 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmvolmgr \- HAL-aware removable volume manager
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmvolmgr\fR [\fB-chns\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrmvolmgr\fR command is a volume manager that can automatically mount and unmount removable media and hot-pluggable storage. The default mount point is \fB/media\fR.
.sp
.LP
\fBrmvolmgr\fR is one of a number of Hardware Abstraction Layer (HAL)-aware tools that are shipped with the Solaris operating system. See \fBhald\fR(1M).
.sp
.LP
Multiple instances of \fBrmvolmgr\fR can be run simultaneously. A system instance of \fBrmvolmgr\fR runs by default as a service management facility (SMF) service (see \fBsmf\fR(5)). Its fault management resource identifier (FMRI) is:
.sp
.in +2
.nf
svc:/system/filesystem/rmvolmgr
.fi
.in -2
.sp

.sp
.LP
You can run your own instance of \fBrmvolmgr\fR by adding it to the \fB\&.xinitrc\fR file or a similar session startup script. In such a case, the \fBsystem\fR \fBrmvolmgr\fR instance will not manage volumes that belong to you, the owner of the startup script. For example, a user logged on to the workstation console (\fB/dev/console\fR) who invokes his own instance of \fBrmvolmgr\fR will own locally connected devices, such as CD-ROM drives and devices connected to the local USB or FireWire ports.
.sp
.LP
In addition to mounting volumes under \fB/media\fR, \fBrmvolmgr\fR also creates legacy symbolic links under \fB/cdrom\fR and \fB/rmdisk\fR.
.sp
.LP
\fBrmvolmgr\fR also provides backwards compatibility with CDE removable media interfaces by maintaining notification files under \fB/tmp/.removable\fR. This functionality can be disabled by using the \fB-c\fR option.
.sp
.LP
The \fB-c\fR and \fB-n\fR options can also be specified as SMF properties. See "Examples."
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Disable CDE compatibility.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
Display help information and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Do not create legacy mountpoint symbolic links.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Invoke in system instance mode.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing SMF Properties to Set Options
.sp
.LP
The following \fBsvccfg\fR(1M) command and subcommands use SMF properties to set the \fB-c\fR and \fB-n\fR options.

.sp
.in +2
.nf
example# \fBsvccfg\fR
svc:> \fBselect rmvolmgr\fR
svc:/system/filesystem/rmvolmgr> \fBlistprop rmvolmgr/*\fR
rmvolmgr/legacy_mountpoints     boolean  true
rmvolmgr/cde_compatible         boolean  true
svc:/system/filesystem/rmvolmgr> \fBsetprop \e
  rmvolmgr/legacy_mountpoints=false\fR
svc:/system/filesystem/rmvolmgr> \fBsetprop rmvolmgr/cde_compatible=false\fR
svc:/system/filesystem/rmvolmgr> \fBexit\fR
example#
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/storage/media-volume-manager
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBhald\fR(1M), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBhal\fR(5), \fBsmf\fR(5)
