Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/roledel.1m
'\" te
.\" Copyright 1989 AT&T All Rights Reserved.
.\" Copyright (c) 1989, 2011, Oracle and/or its affiliates. All rights reserved.
.TH roledel 1M "21 Dec 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
roledel \- delete a role's login from the system
.SH SYNOPSIS
.LP
.nf
\fBroledel\fR [\fB-r\fR] [\fB-S\fR \fIrepository\fR] \fIrole\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBroledel\fR utility deletes a role account from the system and makes the appropriate account-related changes to the system file and file system. \fBroledel\fR also removes the role from each user's list of assumable roles.
.sp
.LP
An administrator must be granted the User Management Profile to be able to delete an existing role.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Remove the role's home directory from the system. This directory must exist. The files and directories under the home directory will no longer be accessible following successful execution of the command. The ZFS dataset that was created for the role's home directory will be removed. 
.sp
The \fBauto_home\fR entry for the role will be deleted. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIrepository\fR\fR
.ad
.sp .6
.RS 4n
The valid repositories are \fBfiles\fR, \fBldap\fR. The repository  specifies which name service will be updated. The default repository is \fBfiles\fR.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIrole\fR\fR
.ad
.RS 8n
.rt  
An existing role name to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command syntax. A usage message for the \fBroledel\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 6n
.rt  
The account to be removed does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB8\fR\fR
.ad
.RS 6n
.rt  
The account to be removed is in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
Cannot update the \fB/etc/group\fR or \fB/etc/user_attr\fR file but the login is removed from the \fB/etc/passwd\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB12\fR\fR
.ad
.RS 6n
.rt  
Cannot remove or otherwise modify the home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 18n
.rt  
system password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 18n
.rt  
system file containing roles' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 18n
.rt  
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/user_attr\fR\fR
.ad
.RS 18n
.rt  
system file containing additional role attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBauths\fR(1), \fBpasswd\fR(1), \fBprofiles\fR(1), \fBroles\fR(1), \fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBlogins\fR(1M), \fBroleadd\fR(1M), \fBrolemod\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBpasswd\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The \fBroledel\fR utility only deletes an account definition that is in the \fBgroup\fR, \fBpasswd\fR, \fBshadow\fR, and \fBuser_attr\fR databases in the repository.
