Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rolemod.1m
'\" te
.\" Copyright 1989 AT&T All Rights Reserved
.\" Copyright (c) 1989, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rolemod 1M "24 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
rolemod \- modify a role's login information on the system
.SH SYNOPSIS
.LP
.nf
\fBrolemod\fR [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-g\fR \fIgroup\fR] [\fB-G\fR [+|-]\fIgroup\fR [, \fIgroup\fR...]] 
     [\fB-d\fR \fIdir\fR [\fB-m\fR]] [\fB-s\fR \fIshell\fR] [\fB-c\fR \fIcomment\fR] [\fB-l\fR \fInew_name\fR] 
     [\fB-f\fR \fIinactive\fR] [\fB-e\fR \fIexpire\fR] 
     [\fB-A\fR [+|-]\fIauthorization\fR [, \fIauthorization\fR]]
     [\fB-S\fR \fIrepository\fR]
     [\fB-P\fR [+|-]\fIprofile\fR [, \fIprofile\fR]] [\fB-K\fR \fIkey\fR[+|-]=\fIvalue\fR] \fIrole\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrolemod\fR utility modifies a role's login information on the system. It changes the definition of the specified login and makes the appropriate login-related system file and file system changes.
.sp
.LP
The system file entries created with this command have a limit of 512 characters per line. Specifying long arguments to several options may exceed this limit.
.sp
.LP
An administrator must be granted the User Security Profile to be able to modify the security attributes for an existing role. To be able to modify non-security attributes of an existing user requires the User Management Profile. The authorizations required to set the various fields in \fBpasswd\fR, \fBshadow\fR and \fBuser_attr\fR can be found in \fBpasswd\fR(4), \fBshadow\fR(4), \fBuser_attr\fR(4). The authorizations required to assign groups can be found in \fBgroup\fR(4).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-A\fR [+|]\fIauthorization\fR\fR
.ad
.sp .6
.RS 4n
One or more comma separated authorizations as deined in \fBauth_attr\fR(4). Only role with \fBgrant\fR rights to the \fBauthorization\fR can assign it to an account. This replaces any existing authorization setting. If no authorization list is specified, the existing setting is removed.
.sp
A prefix \fB+\fR adds the authorization to the existing authorization; a prefix \fB-\fR removes the authorization from the existing authorization. With no prefix, the value for \fIauthorization\fR replaces the existing authorization.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcomment\fR\fR
.ad
.sp .6
.RS 4n
Specify a comment string. \fIcomment\fR can be any text string. It is generally a short description of the login, and is currently used as the field for the user's full name. This information is stored in the user's \fB/etc/passwd\fR entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdir\fR\fR
.ad
.sp .6
.RS 4n
Specify the new home directory of the role. It defaults to \fIbase_dir/login\fR, where \fIbase_dir\fR is the base directory for new login home directories, and \fBlogin\fR is the new login. This creates or modifies an \fBauto_home\fR entry for the user.
.sp
The argument to the option can be specified as \fIserver\fR:\fIdir\fR where \fIserver\fR is the hostname of the machine on which the home directory resides and \fIdir\fR is the path to the user's home directory. If the server is a remote host then the home directory needs to be created on the remote host for the system to mount it, when the user logs in. If no server name is specified then the home directory will be created on the host where the command is executed, when the \fB-m\fR option is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIexpire\fR\fR
.ad
.sp .6
.RS 4n
Specify the expiration date for a role. After this date, no role will be able to access this login. The expire option argument is a date entered using one of the date formats included in the template file \fB/etc/datemsk\fR. See \fBgetdate\fR(3C).
.sp
For example, you may enter \fB10/6/90\fR or \fBOctober 6, 1990\fR. A value of \fB`` ''\fR defeats the status of the expired date.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIinactive\fR\fR
.ad
.sp .6
.RS 4n
Specify the maximum number of days allowed between uses of a login \fBID\fR before that login \fBID\fR is declared invalid. Normal values are positive integers. A value of \fB0\fR defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgroup\fR\fR
.ad
.sp .6
.RS 4n
Specify an existing group's integer \fBID\fR or character-string name. It redefines the role's primary group membership.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR [+|-]\fIgroup\fR\fR
.ad
.sp .6
.RS 4n
An existing group's integer ID or character-string name. It defines the new user's supplementary group membership. Duplicates between group with the \fB-g\fR and \fB-G\fR options are ignored. No more than \fBNGROUPS_MAX\fR groups can be specified. GIDs 0-99 are reserved for allocation by the Solaris Operating System.
.sp
A prefix \fB+\fR adds the group to the existing group; a prefix \fB-\fRremoves the group from the existing group. With no prefix, \fIgroup\fR replaces the existing group.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR \fIkey\fR[+|-]=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Replace existing or add to a role's \fIkey=value\fR pair attributes. Multiple \fB-K\fR options can be used to replace or add multiple \fIkey=value\fR pairs. However, keys must not be repeated. The generic \fB-K\fR option with the appropriate key may be used instead of the specific implied key options (\fB-A\fR and \fB-P\fR). See \fBuser_attr\fR(4) for a list of valid \fIkey=value\fR pairs. If no value is specified, the existing key is removed.
.sp
The keyword \fBtype\fR can be specified with the value \fBrole\fR or the value \fBnormal\fR. When using the value \fBnormal\fR, the account changes from a role user to a normal user; using the value \fBrole\fR keeps the account a role user.
.sp
A prefix \fB+\fR adds the value to the existing value; a prefix \fB-\fR removes the value from the existing value. With no prefix, \fIvalue\fR replaces the existing value.
.sp
The prefix \fB+\fR/\fB-\fR operation is applicable only to the following keys: \fBauths\fR, \fBprofiles\fR, \fBroles\fR, \fBproject\fR, \fBlimitpriv\fR, and \fBdefaultpriv\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fInew_logname\fR\fR
.ad
.sp .6
.RS 4n
Specify the new login name for the role. The \fInew_logname\fR argument is a string no more than eight bytes consisting of characters from the set of alphabetic characters, numeric characters, period (\fB\&.\fR), underline (\fB_\fR), and hypen (\fB\(mi\fR). The first character should be alphabetic and the field should contain at least one lower case alphabetic character. A warning message will be written if these restrictions are not met. A future Solaris release may refuse to accept login fields that do not meet these requirements. The \fInew_logname\fR argument must contain at least one character and must not contain a colon (\fB:\fR) or \fBNEWLINE\fR (\fB\en\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Move the role's home directory to the new directory specified with the \fB-d\fR option. If the directory already exists, it must have permissions read/write/execute by \fIgroup\fR, where \fIgroup\fR is the role's primary group. If the server name specified to the \fB-d\fR option is a remote host then the system will not attempt to create the home directory.
.sp
If the directory does not already exist, a new ZFS dataset will be created. In the global zone, the dataset is created as \fBrpool/export/home/\fR\fIrolename\fR. For non-global zones, the dataset will be created as \fIROOT-dataset\fR\fB/export/home/\fR\fIrolename\fR. The mountpoint for the ZFS dataset is \fB/export/home/\fR\fIrolename\fR by default. If \fB-d\fR \fIpath\fR is specified and it is a path on the local machine, the dataset will be mounted at the specified location. The role is delegated permissions to create ZFS snapshots and promote them. The newly created dataset will inherit the encryption setting from its parent. If it is encrypted, the role is granted permission to change its wrapping key.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.sp .6
.RS 4n
This option allows the specified \fBUID\fR to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR [+|-]\fIprofile\fR\fR
.ad
.sp .6
.RS 4n
One or more comma-separated execution profiles defined in \fBauth_attr\fR(4). This replaces any existing profile setting. If no profile list is specified, the existing setting is removed.
.sp
A prefix \fB+\fR adds the profile to the existing profile; a prefix \fB-\fR removes the profile from the existing profile. With no prefix, \fIprofile\fR replaces the existing profile.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIshell\fR\fR
.ad
.sp .6
.RS 4n
Specify the full pathname of the program that is used as the role's shell on login. The value of \fIshell\fR must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIrepository\fR\fR
.ad
.sp .6
.RS 4n
The valid repositories are \fBfiles\fR, \fBldap\fR. The repository specifies which name service will be updated. The default repository is \fBfiles\fR. When the repository is \fBfiles\fR, the authorizations, profiles, and roles can be present in other name service repositories and can be assigned to a user in the \fBfiles\fR repository. When the repository is \fBldap\fR, all the assignable attributes must be present in the \fBldap\fR repository.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuid\fR\fR
.ad
.sp .6
.RS 4n
Specify a new \fBUID\fR for the role. It must be a non-negative decimal integer less than \fBMAXUID\fR as defined in \fB<param.h>\fR\&. The \fBUID\fR associated with the role's home directory is not modified with this option; a role will not have access to their home directory until the \fBUID\fR is manually reassigned using \fBchown\fR(1).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fBlogin\fR\fR
.ad
.sp .6
.RS 4n
An existing login name to be modified.
.RE

.SH EXIT STATUS
.sp
.LP
In case of an error, \fBrolemod\fR prints an error message and exits with one of the following values:
.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
The command syntax was invalid. A usage message for the \fBrolemod\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.sp .6
.RS 4n
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.sp .6
.RS 4n
The \fIuid\fR given with the \fB-u\fR option is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.sp .6
.RS 4n
The password files contain an error. \fBpwconv\fR(1M) can be used to correct possible errors. See \fBpasswd\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.sp .6
.RS 4n
The login to be modified does not exist, the \fIgroup\fR does not exist, or the login shell does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB8\fR\fR
.ad
.sp .6
.RS 4n
The login to be modified is in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB9\fR\fR
.ad
.sp .6
.RS 4n
The \fInew_logname\fR is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.sp .6
.RS 4n
Cannot update the \fB/etc/group\fR or \fB/etc/user_attr\fR file. Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB11\fR\fR
.ad
.sp .6
.RS 4n
Insufficient space to move the home directory (\fB-m\fR option). Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB12\fR\fR
.ad
.sp .6
.RS 4n
Unable to complete the move of the home directory to the new home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.sp .6
.RS 4n
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/datemsk\fR\fR
.ad
.sp .6
.RS 4n
system file of date formats
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
system password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.sp .6
.RS 4n
system file containing users' and roles' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/user_attr\fR\fR
.ad
.sp .6
.RS 4n
system file containing additional user and role attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBchown\fR(1), \fBpasswd\fR(1), \fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBlogins\fR(1M), \fBpwconv\fR(1M), \fBroleadd\fR(1M), \fBroledel\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBgetdate\fR(3C), \fBauth_attr\fR(4), \fBgroup\fR(4), \fBpasswd\fR(4), \fBshadow\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5) 
