Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/root_archive.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH root_archive 1M "4 May 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
root_archive \- manage bootable miniroot archives
.SH SYNOPSIS
.LP
.nf
\fB/boot/solaris/bin/root_archive\fR pack \fIarchive\fR \fIroot\fR
.fi

.LP
.nf
\fB/boot/solaris/bin/root_archive\fR unpack \fIarchive\fR \fIroot\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBroot_archive\fR utility is used to manipulate boot archives. The utility can pack and unpack boot archives and image miniroots. Both \fBufs\fR and \fBhsfs\fR (\fBiso9660\fR) format archives can be unpacked, although only \fBufs\fR format is generated when packing.
.sp
.LP
For normal, boot-related system administration, \fBbootadm\fR(1M) is recommended.
.SH SUBCOMMANDS
.sp
.LP
The \fBroot_archive\fR command has the following subcommands:
.sp
.ne 2
.mk
.na
\fB\fBpack\fR \fIarchive\fR \fIroot\fR\fR
.ad
.RS 21n
.rt  
Pack the contents of the root directory into the boot archive \fIarchive\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunpack\fR \fIarchive\fR \fIroot\fR\fR
.ad
.RS 23n
.rt  
Unpack the contents of the boot archive named \fIarchive\fR to the directory named \fIroot\fR.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
The command completed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
The command exited due to an error.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcpio\fR(1), \fBbootadm\fR(1M), \fBmount\fR(1M), \fBattributes\fR(5), \fBlofi\fR(7D)
