Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rpc.mdcommd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH rpc.mdcommd 1M "29 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.mdcommd \- multi-node disk set services
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.mdcommd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpc.mdcommd\fR is an \fBrpc\fR(4) daemon that functions as a server process. \fBrpc.mdcommd\fR manages communication among hosts participating in a multi-node disk set configuration. 
.sp
.LP
\fBrpc.mdcommd\fR is invoked by \fBinetd\fR(1M).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/svm
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBmetaset\fR(1M), \fBsvcadm\fR(1M), \fBrpc\fR(3NSL), \fBrpc\fR(4), \fBservices\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
The \fBrpc.mdcommd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/mdcomm
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
