Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rpc.smserverd.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rpc.smserverd 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.smserverd \- removable media device server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smedia/rpc.smserverd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpc.smserverd\fR is a server that handles requests from client applications, such as volume management software, for access to removable media devices. In addition to volume management software, \fBrmformat\fR(1) and the CDE Filemanager (when performing removable media operations) are \fBrpc.smserverd\fR clients. The \fBrpc.smserverd\fR daemon is started by \fBinetd\fR(1M) when a client makes a call to a Solaris-internal library to access a SCSI, IDE, or USB device. The daemon is not started if a client attempts to access a PCMCIA device. Once started, the daemon remains active until such time as it is idle for three minutes or more.
.sp
.LP
The \fBrpc.smserverd\fR daemon is provided for the exclusive use of the client applications mentioned above. It has no external, customer-accessible interfaces, including no configuration file.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/storage/removable-media
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBrpc.smserverd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/smserver
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
