Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rpc.rusersd.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH rpc.rusersd 1M "4 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.rusersd, rusersd \- network username server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/rusers/rpc.rusersd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpc.rusersd\fR is a server that returns a list of users on the host. The \fBrpc.rusersd\fR daemon may be started by \fBinetd\fR(1M).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/network-servers
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBrpc.rusersd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/rusers:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
