Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/rwall.1m
'\" te
.\" Copyright (c) 1988, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH rwall 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
rwall \- write to all users over a network
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rwall\fR \fIhostname\fR...
.fi

.LP
.nf
\fB/usr/sbin/rwall\fR \fB-n\fR \fInetgroup\fR...
.fi

.LP
.nf
\fB/usr/sbin/rwall\fR \fB-h\fR \fIhostname\fR \fB-n\fR \fInetgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBrwall\fR reads a message from standard input until EOF. It then sends this message, preceded by the line:
.sp
.ne 2
.mk
.na
\fB\fR
.ad
.sp .6
.RS 4n
\fBBroadcast Message .\|.\|.\fR
.RE

.sp
.LP
to all users logged in on the specified host machines. With the \fB-n\fR option, it sends to the specified network groups.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInetgroup\fR\fR
.ad
.RS 15n
.rt  
Send the broadcast message to the specified network groups.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhostname\fR\fR
.ad
.RS 15n
.rt  
Specify the \fBhostname\fR, the name of the host machine.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/network-clients
.TE

.SH SEE ALSO
.sp
.LP
\fBinetd\fR(1M), \fBwall\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The timeout is fairly short to allow transmission to a large group of machines (some of which may be down) in a reasonable amount of time. Thus the message may not get through to a heavily loaded machine.
