Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/sbdadm.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sbdadm 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
sbdadm \- SCSI Block Disk command line interface
.SH SYNOPSIS
.LP
.nf
\fBsbdadm\fR \fBcreate-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBdelete-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBimport-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBlist-lu\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBmodify-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsbdadm\fR command creates and manages SCSI-block-device-based logical units that are registered with the SCSI Target Mode Framework (STMF).
.SH SUB-COMMANDS
.sp
.LP
The \fBsbdadm\fR command supports the subcommands listed below. Note that if you enter a question mark as an argument to the command (\fBsbdadm ?\fR), \fBsbdadm\fR responds with a help display.
.sp
.ne 2
.mk
.na
\fB\fBcreate-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Create a logical unit that can be registered with the STMF. For the \fB-s\fR option, \fIsize\fR is an integer followed by one of the following letters, to indicate a unit of size:
.sp
.ne 2
.mk
.na
\fB\fBk\fR\fR
.ad
.RS 5n
.rt  
kilobyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
megabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBg\fR\fR
.ad
.RS 5n
.rt  
gigabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
terabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.RS 5n
.rt  
petabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBe\fR\fR
.ad
.RS 5n
.rt  
exabyte
.RE

If you do not specify \fIsize\fR, the size defaults to the size of \fIfilename\fR.
.sp
The size specified can exceed the size of the file or device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Deletes an existing logical unit that was created using \fBsbdadm create-lu\fR. This effectively unloads the logical unit from the STMF framework. Any existing data on the logical unit remains intact.
.RE

.sp
.ne 2
.mk
.na
\fB\fBimport-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Imports and loads a logical unit into the STMF that was previously created using \fBsbdadm create-lu\fR and was since deleted from the STMF using \fBsbdadm delete-lu\fR. On success, the logical unit is again made available to the STMF. \fIfilename\fR is the filename used in the \fBsbdadm create-lu\fR command for this logical unit.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-lu\fR\fR
.ad
.sp .6
.RS 4n
List all logical units that were created using the \fBsbdadm create-lu\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Modifies attributes of an logical unit created using the \fBsbdadm create-lu\fR command. For the \fB-s\fR option, \fIsize\fR is an integer value followed by a unit specifier. The unit specifiers are as described above under \fBcreate-lu\fR. When this option is specified, the existing size of the logical unit is changed to the new size.
.sp
The size specified can exceed the size of the file or device represented by \fIlu_name\fR.
.RE

.SH OPERANDS
.sp
.LP
\fBsbdadm\fR use the following operands:
.sp
.ne 2
.mk
.na
\fB\fIfilename\fR\fR
.ad
.sp .6
.RS 4n
Name of an existing file or a fully qualified path to a raw block device.
.RE

.sp
.ne 2
.mk
.na
\fB\fIlu_name\fR\fR
.ad
.sp .6
.RS 4n
The 32-byte hexadecimal representation of the logical unit.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRCreating a Logical Unit
.sp
.LP
The following series of commands creates a 10-gigabyte logical unit.

.sp
.in +2
.nf
# \fBtouch /export/lun/0\fR
# \fBsbdadm create-lu -s 10g /export/lun/0\fR
# \fBsbdadm create-lu /dev/rdsk/c1t1d0s0\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRListing Logical Units
.sp
.LP
The following command lists all logical units.

.sp
.in +2
.nf
# \fBsbdadm list-lu\fR
Found 2 LU(s) 

              	GUID           	   DATA SIZE    SOURCE 
--------------------------------  -----------  ------ 
6000ae4000144f21d92c47b0dd650002  10737352704  /export/lun/0
6000ae4000144f21d92c47b0de300032  134283264    /dev/rdsk/c1t1d0s0
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
system/storage/scsi-target-mode-framework
T}
_
Interface StabilityObsolete Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBstmfadm\fR(1M), \fBattributes\fR(5)
