Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/shadowd.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH shadowd 1M "4 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
shadowd \- shadow migration daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fs/shadowd\fR 
.fi

.LP
.nf
svc:/system/filesystem/shadowd:default
.fi

.SH DESCRIPTION
.sp
.LP
\fBshadowd\fR is a daemon that provides background worker threads to migrate data for a shadow migration. A shadow migration gradually moves data from a source file system into a new "shadow" file system. Users can access and change their data within the shadow file system while migration is occurring.
.sp
.LP
The \fBshadowd\fR service is managed by the service management  facility, \fBsmf\fR(5). Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
The \fBsvccfg\fR(1M) command can be used to manage the following parameter related to \fBshadowd\fR:
.sp
.in +2
.nf
config_params/shadow_threads
.fi
.in -2
.sp

.sp
.LP
Number of threads to devote to background migration of data. These threads are global to the entire system, and increasing the number can increase concurrency and the overall speed of migration at the expense of increased resource consumption (network, I/O, and CPU).
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/zfs
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
\fBshadowstat\fR(1M), \fBzfs\fR(1M), \fBattributes\fR(5)
