Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/shareall.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1995, 2011, Oracle and/or its affiliates. All rights reserved.
.TH shareall 1M "3 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
shareall, unshareall \- publish or unpublish multiple shares
.SH SYNOPSIS
.LP
.nf
\fBshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR]...] [\fB-|\fR \fIfile\fR]
.fi

.LP
.nf
\fBunshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR]...]
.fi

.SH DESCRIPTION
.sp
.LP
When used with no arguments, \fBshareall\fR publishes shares from a specified file that contains a list of share command lines. If the operand is a hyphen (\fB-\fR), then the \fBshare\fR command lines are obtained from standard input. Otherwise, if neither a file nor a hyphen is specified, then shares are published from the SMF shares repository.
.sp
.LP
Shares can be specified by identifying the file system type in a comma-separated list as an argument to \fB-F\fR.
.sp
.LP
\fBunshareall\fR unpublishes all published file system shares. Without an \fB-F\fR flag, it unpublishes all distributed file system shares.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.RS 13n
.rt  
Specify file system type. Defaults to the first entry in \fB/etc/dfs/fstypes\fR.
.RE

.SH FILES
.sp
.LP
\fB/etc/dfs/dfstab\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcs
.TE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBunshare\fR(1M), \fBattributes\fR(5)
