Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/slpd.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH slpd 1M "23 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
slpd \- Service Location Protocol Daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/slpd\fR [\fB-f\fR \fIconfiguration-file\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBslpd\fR daemon provides common server functionality for the Service Location Protocol ("\fBSLP\fR") versions 1 and 2, as defined by \fBIETF\fR in \fIRFC 2165\fR and \fIRFC 2608\fR. \fBSLP\fR provides a scalable framework for the discovery and selection of network services. 
.sp
.LP
\fBslpd\fR provides the following framework services:
.sp
.ne 2
.mk
.na
\fBDirectory Agent\fR
.ad
.sp .6
.RS 4n
This service automatically caches service advertisements from service agents to provide them to user agents, and makes directory agent advertisements of its services. This service is optional. \fBslpd\fR does not provide directory agent service by default. Directory agents are not databases, and they do not need to be maintained.
.RE

.sp
.ne 2
.mk
.na
\fBService Agent Server\fR
.ad
.sp .6
.RS 4n
All service agents on the local host register and deregister with this server. This service responds to all requests for services, and forwards registrations to directory agents. By default, \fBslpd\fR is a service agent server. 
.RE

.sp
.ne 2
.mk
.na
\fBPassive Directory Agent Discovery \fR
.ad
.sp .6
.RS 4n
This service listens for directory agent advertisements and maintains a table of active directory agents.  When a user agent wishes to discover a directory agent, it can simply query \fBslpd\fR, obviating the need to perform discovery by means of multicast. By default, \fBslpd\fR performs this service.
.RE

.sp
.ne 2
.mk
.na
\fBProxy Registration\fR
.ad
.sp .6
.RS 4n
This service can act as a proxy service agent for services that cannot register themselves. \fBslpd\fR reads the proxy registration file for information on services it is to proxy. By default, no services are registered by proxy.
.RE

.sp
.LP
All configuration options are available from the configuration file. \fBslpd\fR reads its configuration file upon startup.
.sp
.LP
Stop and start the slpd daemon using \fBsvcadm\fR(1M).  Use the command  \fBsvcadm enable network/slp\fR to start the slpd daemon.  Use the command  \fBsvcadm disable network/slp\fR to stop it.
.sp
.LP
The file \fB/etc/inet/slp.conf\fR must exist before the \fBslp\fR service can start the daemon. Only the example file \fB/etc/inet/slp.conf.example\fR is present by default. To enable \fBSLP\fR, copy \fB/etc/inet/slp.conf.example\fR to \fB/etc/inet/slp.conf\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIconfiguration-file\fR\fR
.ad
.RS 25n
.rt  
Specify an alternate configuration file
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRStopping the \fBslpd\fR daemon
.sp
.LP
The following command stops the \fBslpd\fR daemon: 

.sp
.in +2
.nf
example# svcadm disable network/slp
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRestarting the \fBslpd\fR daemon
.sp
.LP
The following command restarts the \fBslpd\fR daemon: 

.sp
.in +2
.nf
example# svcadm restart network/slp
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/slp.conf\fR\fR
.ad
.RS 22n
.rt  
The default configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fBslpd.reg\fR\fR
.ad
.RS 22n
.rt  
The proxy registration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/slp, service/network/slp
_
CSIEnabled
_
Interface Stability		Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBslp_api\fR(3SLP), \fBslp.conf\fR(4), \fBslpd.reg\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBslp\fR(7P)
.sp
.LP
\fI\fR
.sp
.LP
Guttman, E.,  Perkins, C., Veizades, J., and Day, M., \fIRFC 2608, Service Location Protocol, Version 2\fR, The Internet Society, June 1999.
.SH NOTES
.sp
.LP
The \fBslpd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/slp
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
