Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/smbd.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbd 1M "23 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbd \- SMB server daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbd\fR daemon handles \fBCIFS\fR/\fBSMB\fR requests from \fBSMB\fR clients, such as Windows clients. Only processes with \fB{PRIV_SYS_SMB}\fR and sufficient privileges to write the \fB/var/run\fR directory can run this daemon.
.sp
.LP
The \fBsmbd\fR daemon is automatically invoked by using the \fBshare\fR(1M) command or the \fBzfs\fR(1M) \fBset share\fR command over all available transports. By default, \fBsmbd\fR starts over the NetBIOS-Over-TCP (\fBNBT\fR) and \fBTCP\fR transports.
.sp
.LP
When \fBsmbd\fR is started over \fBNBT\fR, the following services are started:
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS name service is started on \fBUDP\fR port 137.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS datagram service is started on \fBUDP\fR port 138.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS session service is started on \fBTCP\fR port 139.
.RE
.sp
.LP
When the \fBsmbd\fR daemon is started over TCP, the SMB service is started on TCP port 445.
.sp
.LP
Only one instance of \fBsmbd\fR may be running at a time.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
Daemon exited cleanly.
.RE

.sp
.ne 2
.mk
.na
\fB95\fR
.ad
.RS 13n
.rt  
Daemon exited with a fatal error.
.RE

.sp
.ne 2
.mk
.na
\fB96\fR
.ad
.RS 13n
.rt  
Daemon exited with a configuration error.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/smb
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBsvcs\fR(1), \fBshare\fR(1M), \fBsharectl\fR(1M), \fBsmbadm\fR(1M), \fBsmbstat\fR(1M), \fBsvcadm\fR(1M), \fBzfs\fR(1M), \fBsmb\fR(4), \fBsmbautohome\fR(4), \fBsystem\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
Use the \fBsvcadm\fR command to perform administrative actions on the \fBsmbd\fR service, such as enabling, disabling, or restarting the service. Use the \fBsvcs\fR command to query the service status.
.sp
.LP
The \fBsmbd\fR service is managed by the service management facility under the service identifier \fBsvc:/network/smb/server\fR.
.sp
.LP
If the \fBsmbd\fR service is disabled, it will be enabled by the \fBshare\fR(1M) command or the \fBzfs set share\fR command, unless its \fBauto_enable\fR property is set to false.
