Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/smbiod.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbiod 1M "28 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbiod, smbiod-svc \- SMB client I/O daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbfs/smbiod\fR
.fi

.LP
.nf
/usr/lib/smbfs/smbiod-svc
.fi

.SH DESCRIPTION
.sp
.LP
\fBsmbiod\fR and \fBsmbiod-svc\fR are internal components of the SMB client. They have no external, customer-accessible interfaces. For more information about the SMB client, see the \fBmount_smbfs\fR(1M) man pages.
.sp
.LP
\fBsmbiod-svc\fR is run by the SMF service, \fBsvc:/network/smb/client:default\fR, and starts and manages the \fBsmbiod\fR processes that are required by the SMB client.
.sp
.LP
\fBsmbiod\fR is started by \fBsmbiod-svc\fR, which runs as a separate process for each user who requests SMB client connections. These \fBsmbiod\fR processes continue to run until the owning user no longer has any SMB client connections.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/smbfs/smbiod\fR\fR
.ad
.sp .6
.RS 4n
SMB I/O daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/smbfs/smbiod-svc\fR\fR
.ad
.sp .6
.RS 4n
SMF service program.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/smbiod/.svc\fR\fR
.ad
.sp .6
.RS 4n
File on which \fBsmbiod-svc\fR instantiates a door.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/smbiod/$\fIUID\fR\fR\fR
.ad
.sp .6
.RS 4n
File on which a user's \fBsmbiod\fR process instantiates a door. \fB$\fR\fIUID\fR is the numeric representation of the owner's user ID.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/smb
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBmount_smbfs\fR(1M), \fBattributes\fR(5), \fBsmbfs\fR(7FS)
