Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/smbios.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbios 1M "31 Aug 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbios \- display the contents of a System Management BIOS image
.SH SYNOPSIS
.LP
.nf
\fBsmbios\fR [\fB-BeOsx\fR] [\fB-i\fR \fIid\fR] [\fB-t\fR \fItype\fR] [\fB-w\fR \fIfile\fR] [\fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbios\fR utility displays the contents of the System Management BIOS (SMBIOS) image exported by the current system or stored in a file. SMBIOS is an industry-standard mechanism for low-level system software to export hardware configuration information to higher-level system management software. The SMBIOS data format itself is defined by the Distributed Management Task Force (DMTF). Refer to http://www.dmtf.org for more information about SMBIOS and to obtain a copy of the SMBIOS specification and implementation guidelines. 
.sp
.LP
The SMBIOS image consists of a table of structures, each describing some aspect of the system software or hardware configuration. By default, \fBsmbios\fR displays the entire contents of the current SMBIOS image. If the \fB-s\fR option is specified, \fBsmbios\fR displays a summary of the structures that are present in the image. If the \fB-w\fR option is specified, \fBsmbios\fR writes a copy of the SMBIOS image to the specified file. \fBsmbios\fR can then be applied to the resulting file to display its content. 
.sp
.LP
\fBsmbios\fR attempts to display each structure and its content in a human- readable fashion. If \fBsmbios\fR does not recognize a structure's type or content, the raw hexadecimal data for the structure is displayed. 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.RS 11n
.rt  
Disable header validation for broken BIOSes. 
.sp
By default, \fBsmbios\fR attempts to validate the SMBIOS header by verifying the anchor strings, header checksums, and version number. This option might be necessary when a BIOS has a non-compliant header. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 11n
.rt  
 Display the contents of the SMBIOS entry point rather than the contents of the SMBIOS structure table. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIid\fR\fR
.ad
.RS 11n
.rt  
Display only the specified structure, named by its integer id.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR\fR
.ad
.RS 11n
.rt  
 Display obsolete structure types. 
.sp
By default, \fBsmbios\fR elides output for structures whose type is marked as obsolete in the DMTF SMBIOS specification. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 11n
.rt  
Display only a summary listing of the structure identifiers and types, instead of the content of each selected structure. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR\fR
.ad
.RS 11n
.rt  
Display only those structures whose type matches the specified integer type, as defined the DMTF SMBIOS specification. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIfile\fR\fR
.ad
.RS 11n
.rt  
Write a copy of the SMBIOS image to the specified file and exit. 
.sp
The SMBIOS entry point is written to the start of the file with its structure table address set to the file offset of the structure table, and a new entry point checksum is computed. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 11n
.rt  
Display raw hexadecimal data for the selected structures in addition to human-readable output. 
.sp
By default, hexadecimal data is only displayed if \fBsmbios\fR cannot display human-readable output for the selected structures. 
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
Specifies an alternate SMBIOS image to display instead of the current system's SMBIOS image. 
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. All structures in the SMBIOS image were examined successfully. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
A fatal error occurred, such as failure to open the specified file or device, or corruption in the image. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command-line options were specified. 
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/smbios\fR \fR
.ad
.RS 16n
.rt  
Kernel SMBIOS image device. This device special file is used to export a snapshot of the current system SMBIOS image. 
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilitySee below. 
.TE

.sp
.LP
The command-line options are Committed. The human-readable output is Uncommitted. 
.SH SEE ALSO
.sp
.LP
\fBprtdiag\fR(1M), \fBattributes\fR(5), \fBsmbios\fR(7D)
.sp
.LP
\fISystem Management BIOS Reference Specification\fR (see http://www.dmtf.org)
.SH NOTES
.sp
.LP
The implementation of a System Management BIOS image is entirely at the discretion of the system and BIOS vendors. Not all systems export an SMBIOS. The SMBIOS structure content varies widely between systems and BIOS vendors and frequently does not comply with the guidelines included in the specification. Some structure fields might not be filled in by the BIOS at all, and others might be filled inwith non-conforming values. 
