Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/sndrd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sndrd 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
sndrd \- Remote Mirror daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sndrd\fR [\fB-c\fR \fImax_connections\fR] [\fB-l\fR \fIlisten_backlog\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsndrd\fR daemon processes client Remote Mirror requests. Only the root user or a user with equivalent privileges can run this daemon. The daemon is automatically invoked in run level 2. \fBsndrd\fR restarts the TCP transport layers.
.sp
.LP
Administrators wanting to change startup parameters for \fBsndrd\fR should, as root or equivalent, make changes in the \fB/etc/default/sndr\fR file rather than editing the \fB/lib/svc/method/svc-rdcsyncd\fR file. See \fBsndr\fR(4).
.SH OPTIONS
.sp
.LP
The \fBsndrd\fR daemon supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fImax_connections\fR\fR
.ad
.sp .6
.RS 4n
Sets the maximum number of connections allowed to the server over connection-oriented transports. By default, the number of connections is 16.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlisten_backlog\fR\fR
.ad
.sp .6
.RS 4n
Sets connection queue length for the RDC TCP over a connection-oriented transport. The default value is 10 entries.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
Daemon failed to start.
.RE

.sp
.LP
Error information is reported to \fBsyslog\fR at level \fBLOG_ERR\fR.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
Shell script for starting \fBsndrd\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
Shell script for stopping \fBsndrd\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitystorage/avs/avs-remote-mirror
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBds.log\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Do not manually stop the sndrd daemon. If you need to manually stop sndrd perform these steps. This stops both the \fBsndrd\fR and \fBsndrsyncd\fR daemons.
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
Do not manually start or restart the sndrd daemon. If you need to manually start sndrd perform these steps. This starts both the sndrd and sndrsyncd daemons.
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
See \fBsvcadm\fR(1M) for additional information.
