Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/snmp-notify.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH snmp-notify 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
snmp-notify \- SNMP notification daemon for software events
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fm/notify/snmp-notify\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBsnmp-notify\fR is a daemon that subscribes to software events and FMA diagnosis and repair events and generates SNMP trap notifications based on a set of notification preferences that are stored in the SMF service configuration repository.
.sp
.LP
SNMP notification preferences are set using \fBsvccfg\fR(1M).
.sp
.LP
\fBsnmp-notify\fR is managed by the service management facility, \fBsmf\fR(5), under the service FMRI:
.sp
.in +2
.nf
svc:/system/fm/snmp-notify:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.SS "Properties"
.sp
.LP
The following service properties can be set:
.sp
.ne 2
.mk
.na
\fB\fBconfig/rootdir\fR\fR
.ad
.sp .6
.RS 4n
This is an \fBastring\fR property that defaults to \fB/\fR. When set, the specified root directory will be used for all pathnames evaluated by \fBsnmp-notify\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRConfiguring Notification Preferences
.sp
.LP
The following command configures notification preferences for SMF service state transition events.

.sp
.in +2
.nf
# \fBsvccfg setnotify -g from-online,to-maintenance snmp:active\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fREnabling SNMP Notifications
.sp
.LP
The following command enables notifications for Fault Management diagnosis events.

.sp
.in +2
.nf
# \fBsvccfg setnotify problem-diagnosed snmp:active\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRListing Notification Settings
.sp
.LP
The following command lists all notification settings for Fault Management diagnosis events.

.sp
.in +2
.nf
# \fBsvccfg listnotify fma-diagnosis\fR
.fi
.in -2
.sp

.sp
.LP
Refer to \fBsvccfg\fR(1M) for more information on configuring SNMP notification preferences.

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/fault-management/snmp-notify
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
