Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/soconfig.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH soconfig 1M "31 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
soconfig \- configure transport providers for use by sockets
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/soconfig\fR \fB-d\fR \fIdir\fR
.fi

.LP
.nf
\fB/usr/sbin/soconfig\fR \fB-f\fR \fIfile\fR
.fi

.LP
.nf
\fB/usr/sbin/soconfig\fR \fIfamily\fR \fItype\fR \fIprotocol\fR [\fImodule\fR | \fIpath\fR]
.fi

.LP
.nf
\fB/usr/sbin/soconfig\fR \fB-l\fR [\fB-np\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsoconfig\fR utility configures the transport provider driver for use with sockets. It specifies how the family, type, and protocol parameters in the \fBsocket\fR(3SOCKET) call are mapped to the name of a transport provider such as \fB/dev/tcp\fR. This utility can be used to add an additional mapping or remove a previous mapping.
.sp
.LP
The \fBinit\fR(1M) utility uses \fBsoconfig\fR with the \fBsock2path.d\fR(4) file during the booting sequence.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdir\fR\fR
.ad
.sp .6
.RS 4n
Set up the \fBsoconfig\fR configuration for each driver according to the information stored in the files in \fIdir\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
Set up the \fBsoconfig\fR configuration for each driver according to the information stored in \fIfile\fR. A \fBsoconfig\fR file consists of lines of at least the first three fields listed below, separated by spaces:
.sp
\fIfamily  type  protocol\fR [\fImodule\fR | \fIpath\fR]
.sp
These fields are described in the \fBOPERANDS\fR section below.
.sp
An example of \fIfile\fR can be found in the \fBEXAMPLES\fR section below.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR [\fB-np\fR]\fR
.ad
.sp .6
.RS 4n
Dump the in-kernel socket configuration table. This option has the following suboptions:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Do not convert socket family, type, and protocol to string representation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Display machine-parseable output.
.RE

.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIfamily\fR\fR
.ad
.sp .6
.RS 4n
The protocol family as listed in the \fB/usr/include/sys/socket.h\fR file, expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fItype\fR\fR
.ad
.sp .6
.RS 4n
The socket type as listed in the \fB/usr/include/sys/socket.h\fR file, expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
The protocol number as specified in the family-specific \fBinclude\fR file, expressed as an integer. For example, for \fBAF_INET\fR this number is specified in \fB/usr/include/netinet/in.h\fR. An unspecified protocol number is denoted with the value zero.
.RE

.sp
.ne 2
.mk
.na
\fB\fImodule\fR | \fIpath\fR\fR
.ad
.sp .6
.RS 4n
The module name or path name of a device that corresponds to the transport provider, such as \fBtcp\fR or \fB/dev/tcp\fR. Modules must reside in \fBkernel/socketmod\fR. A device name must begin with \fB/dev\fR. If this parameter is specified, the configuration will be added for the specified family, type, and protocol. If this parameter is not specified, the configuration will be removed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBsoconfig\fR
.sp
.LP
The following example sets up a module for family \fBAF_INET\fR and type \fBSOCK_STREAM\fR:

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following example sets up \fB/dev/tcp\fR for family \fBAF_INET\fR and type \fBSOCK_STREAM\fR:

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 /dev/tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following is a sample file used with the \fB-f\fR option. Comment lines begin with a hash mark (\fB#\fR):

.sp
.in +2
.nf
#   Family  Type  Protocol   Module | Path
      2       2       0          tcp
      2       2       6          tcp

      2       1       0          udp
      2       1       17         udp

      1       2       0          /dev/ticotsord
      1       1       0          /dev/ticlts

      2       4       0          icmp
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/sock2path.d\fR\fR
.ad
.sp .6
.RS 4n
Directory containing files with mappings from sockets to transport providers.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBinit\fR(1M), \fBsock2path.d\fR(4), \fBattributes\fR(5)
.sp
.LP
\fINetwork Interface Guide\fR
