Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/spray.1m
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\"  Copyright 1989 AT&T  Copyright (c) 
.TH spray 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
spray \- spray packets
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/spray\fR [\fB-c\fR \fIcount\fR] [\fB-d\fR \fIdelay\fR] [\fB-l\fR \fIlength\fR] 
     [\fB-t\fR \fInettype\fR] \fIhost\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBspray\fR sends a one-way stream of packets to \fIhost\fR using RPC, and reports how many were received, as well as the transfer rate. The \fIhost\fR argument can be either a name or an Internet address.
.sp
.LP
\fBspray\fR is not useful as a networking benchmark, as it uses unreliable connectionless transports, UDP for example. \fBspray\fR can report a large number of packets dropped when the drops were caused by \fBspray\fR sending packets faster than they can be buffered locally, that is, before the packets get to the network medium.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcount\fR\fR
.ad
.RS 14n
.rt  
Specify how many packets to send. The default value of \fIcount\fR is the number of packets required to make the total stream size 100000 bytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdelay\fR\fR
.ad
.RS 14n
.rt  
Specify how many microseconds to pause between sending each packet. The default is \fB0\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlength\fR\fR
.ad
.RS 14n
.rt  
The \fIlength\fR parameter is the numbers of bytes in the Ethernet packet that holds the RPC call message. Since the data is encoded using XDR, and XDR only deals with 32 bit quantities, not all values of \fIlength\fR are possible, and \fBspray\fR rounds up to the nearest possible value. When \fIlength\fR is greater than 1514, then the RPC call can no longer be encapsulated in one Ethernet packet, so the \fIlength\fR field no longer has a simple correspondence to Ethernet packet size. The default value of \fIlength\fR is \fB86 bytes\fR, the size of the RPC and UDP headers.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fInettype\fR\fR
.ad
.RS 14n
.rt  
Specify class of transports. Defaults to  \fBnetpath\fR. See \fBrpc\fR(3NSL) for a description of supported classes.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/network-clients
.TE

.SH SEE ALSO
.sp
.LP
\fBrpc\fR(3NSL), \fBattributes\fR(5)
