Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/srptadm.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH srptadm 1M "16 Aug 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
srptadm \- administer SRP targets
.SH SYNOPSIS
.LP
.nf
\fBsrptadm modify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
     [\fB-r\fR, \fB--reset\fR] \fIhca_guid\fR
.fi

.LP
.nf
\fBsrptadm list-target\fR [\fIhca_guid\fR]
.fi

.LP
.nf
\fBsrptadm modify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
.fi

.LP
.nf
\fBsrptadm list-defaults\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsrptadm\fR command manages SCSI RDMA Protocol (SRP) target ports within the SCSI Target Mode Framework described in \fBstmfadm\fR(1M) and \fBlibstmf\fR(3LIB). This allows SRP initiators to access SCSI Target Mode Framework (STMF) logical units using the SRP protocol.
.sp
.LP
\fBsrptadm\fR is implemented as a set of subcommands with options and operands for each subcommand. These subcommands are described in their own section, below.
.SH SUB-COMMANDS
.sp
.ne 2
.mk
.na
\fB\fBlist-defaults\fR\fR
.ad
.sp .6
.RS 4n
Lists information about the default properties. This subcommand has no options.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-target\fR [\fIhca_guid\fR]\fR
.ad
.sp .6
.RS 4n
If \fIhca_guid\fR is specified, lists the properties of the target HCA. Otherwise, properties are listed for all HCAs.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]\fR
.ad
.sp .6
.RS 4n
Modify default parameters.
.sp
.ne 2
.mk
.na
\fB\fB-e\fR, \fB--enable\fR\fR
.ad
.sp .6
.RS 4n
Enable SRP target creation for all HCAs that have not been explicitly disabled with \fBmodify-target\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--disable\fR\fR
.ad
.sp .6
.RS 4n
Disable SRP target creation for all HCAs that have not been explicitly enabled with \fBmodify-target\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR] [\fB-r\fR, \fB--reset\fR \fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
Sets SRP Target properties for the specified HCA.
.sp
.ne 2
.mk
.na
\fB\fB-e\fR, \fB--enable\fR\fR
.ad
.sp .6
.RS 4n
Enables SRP target creation on this HCA.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--disable\fR\fR
.ad
.sp .6
.RS 4n
Disables SRP target creation on this HCA.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR, \fB--reset\fR\fR
.ad
.sp .6
.RS 4n
Clears HCA-specific information and resets to defaults. The SRP Target, if any, associated with this HCA will not be modified as a result of this option until the SRP Target SMF service is restarted.
.RE

.RE

.SH OPERANDS
.sp
.LP
The list-target and modify-target subcommands have the following operand.
.sp
.ne 2
.mk
.na
\fB\fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
GUID of the InfiniBand Host Channel Adapter (HCA) on this system for which SRP Target Services can be provided. The GUID must be in one of the following forms:
.sp
.ne 2
.mk
.na
\fB\fB3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
Base hex form.
.RE

.sp
.ne 2
.mk
.na
\fB\fB0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
Base hex form with leading zeroes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBhca:3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
Form from \fBcfgadm\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fBeui.0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
EUI form.
.RE

.RE

.SH USAGE
.sp
.LP
If the default state is changed when the SRP service is \fBonline\fR, the state of existing targets is not changed until the service is restarted.
.sp
.LP
Changing the target state takes effect immediately if the SRP target service is \fBonline\fR. Targets set to \fBdisabled\fR will be offlined and removed; targets set to \fBenabled\fR will be immediately created.
.SH EXAMPLES
.LP
\fBExample 1 \fRListing Default Properties
.sp
.LP
The following command lists the default SRP Target Service properties.

.sp
.in +2
.nf
# \fBsrptadm list-defaults\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRChanging Default Behavior
.sp
.LP
The following command changes the default behavior of the SRP Target service to not create SRP Targets when the service is enabled.

.sp
.in +2
.nf
# \fBsrptadm modify-defaults -d\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRListing Properties for Specific HCA
.sp
.LP
The following command lists SRP Target properties for a specific HCA.

.sp
.in +2
.nf
# \fBcfgadm | grep hca\fR
hca:3BA000100CD18              IB-HCA       connected    configured   ok
hca:3BA000100D030              IB-HCA       connected    configured   ok

# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online
.fi
.in -2
.sp

.LP
\fBExample 4 \fRDisabling Services for Specific HCA
.sp
.LP
The following command disables SRP Target services for a specific HCA.

.sp
.in +2
.nf
# \fBsrptadm modify-target -d 3BA000100CD18\fR
.fi
.in -2
.sp

.sp
.LP
Use the \fBlist-target\fR command to see the changes:

.sp
.in +2
.nf
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : false
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : -
.fi
.in -2
.sp

.LP
\fBExample 5 \fRRe-enabling Target Services
.sp
.LP
The following command sequence re-enables SRP Target services and displays the SRP and STMF target properties.

.sp
.in +2
.nf
# \fBsrptadm modify-target -e 3BA000100CD18\fR
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online

# \fBstmfadm list-target -v eui.0003BA000100CD18\fR
Target: eui.0003BA000100CD18
    Operational Status: Online
    Provider Name     : srpt
    Alias             : -
    Protocol          : SRP
    Sessions          : 0
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
system/storage/scsi-rdma/scsi-rdma-target
T}
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBstmfadm\fR(1M), \fBlibsrpt\fR(3LIB), \fBlibstmf\fR(3LIB), \fBattributes\fR(5), \fBsrpt\fR(7D)
