Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/strclean.1m
'\" te
.\" Copyright (c) 1994, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH strclean 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
strclean \- STREAMS error logger cleanup program
.SH SYNOPSIS
.LP
.nf
\fBstrclean\fR [\fB-a\fR \fIage\fR] [\fB-d\fR \fIlogdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBstrclean\fR is used to clean up the STREAMS error logger directory on a regular basis (for example, by using \fBcron\fR. By default, all files with names matching \fBerror.*\fR in  \fB/var/adm/streams\fR that have not been modified in the last three days are removed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIage\fR\fR
.ad
.RS 13n
.rt  
The maximum age in days for a log file can be changed using the \fB-a\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIlogdir\fR\fR
.ad
.RS 13n
.rt  
A directory other than \fB/var/adm/streams\fR can be specified using the \fB-d\fR option.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRA sample of using the \fBstrclean\fR command.
.sp
.LP
This example has the same result as running  \fBstrclean\fR with no arguments:

.sp
.in +2
.nf
example%  \fBstrclean \fR\fB-d\fR\fB /var/adm/streams \fR\fB-a\fR\fB 3\fR
.fi
.in -2
.sp

.SH FILES
.sp
.LP
\fB/var/adm/streams/error.\fR*
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBcron\fR(1M), \fBstrerr\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
\fBstrclean\fR is typically run from \fBcron\fR on a daily or weekly basis.
