Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/strerr.1m
'\" te
.\" Copyright (c) 1991, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH strerr 1M "4 Oct 1994" "SunOS 5.11" "System Administration Commands"
.SH NAME
strerr \- STREAMS error logger daemon
.SH SYNOPSIS
.LP
.nf
\fBstrerr\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBstrerr\fR receives error log messages from the STREAMS-based log driver (see \fBlog\fR(7D)) and appends them to a log file. The resultant error log files  reside in the directory \fB/var/adm/streams\fR, and are named \fBerror.\fR\fImm\fR\fB-\fR\fBdd\fR, where \fImm\fR is the month and \fBdd\fR is the day of the messages contained in each log file.
.sp
.LP
The format of an error log message is:
.sp
.LP
<\fIseq\fR> <\fBtime\fR> <\fIticks\fR> <\fIflags\fR> <\fImid\fR> <\fIsid\fR> <\fItext\fR>
.sp
.ne 2
.mk
.na
\fB<\fIseq\fR>\fR
.ad
.RS 11n
.rt  
error sequence number
.RE

.sp
.ne 2
.mk
.na
\fB<\fBtime\fR>\fR
.ad
.RS 11n
.rt  
time of message in hh:mm:ss
.RE

.sp
.ne 2
.mk
.na
\fB<\fIticks\fR>\fR
.ad
.RS 11n
.rt  
time of message in machine ticks since boot priority level
.RE

.sp
.ne 2
.mk
.na
\fB<\fIflags\fR>\fR
.ad
.RS 11n
.rt  
\fBT\fR : the message was also sent to a tracing process \fBF\fR : indicates a fatal error \fBN\fR : send mail to the system administrator (hardcoded as root)
.RE

.sp
.ne 2
.mk
.na
\fB<\fImid\fR>\fR
.ad
.RS 11n
.rt  
module  \fBID\fR number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fIsid\fR>\fR
.ad
.RS 11n
.rt  
sub-ID number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fItext\fR>\fR
.ad
.RS 11n
.rt  
formatted text of the error message
.RE

.sp
.LP
Messages that appear in the error log are intended to report exceptional conditions that require the attention of the system administrator.   Those messages which indicate the total failure of a STREAMS-based driver or module should have the \fBF\fR flag set. Those messages requiring the immediate attention of the administrator will have the \fBN\fR flag set, which causes the error logger to send the message to the system administrator using \fBmail\fR. The priority level usually has no meaning in the error log but will have meaning if the message is also sent to a tracer process.
.sp
.LP
Once initiated, \fBstrerr\fR continues to execute until terminated by the user. It is commonly executed asynchronously.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/streams/error.\fR\fImm\fR\fB-\fR\fBdd\fR\fR
.ad
.sp .6
.RS 4n
error log file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBlog\fR(7D)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
There is no restriction to the number of \fBstrerr\fR processes opening the  \fBSTREAMS\fR-based log driver at a time.
.sp
.LP
If a module or driver is generating a large number of error messages, running the error logger will cause a degradation in STREAMS performance. If a large burst of messages are generated in a short time, the log driver may not be able to deliver some of the messages. This situation is indicated by gaps in the sequence numbering of the messages in the log files.
