Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/sulogin.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH sulogin 1M "21 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
sulogin \- access single-user mode
.SH SYNOPSIS
.LP
.nf
\fBsulogin\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsulogin\fR utility is automatically invoked by \fBinit\fR when the system is first started. It prompts the user to type a user name and password to enter system maintenance mode (single-user mode) or to type \fBEOF\fR (typically CTRL-D) for normal startup (multi-user mode). The user should never directly invoke \fBsulogin\fR. The user must have the \fBsolaris.system.maintenance\fR authorization.
.sp
.LP
The \fBsulogin\fR utility can prompt the user to enter the root password on a variable number of serial console devices, in addition to the traditional console device. See \fBconsadm\fR(1M) and \fBmsglog\fR(7D) for a description of how to configure a serial device to display the single-user login prompt.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/sulogin\fR\fR
.ad
.sp .6
.RS 4n
Default value can be set for the following flag:
.sp
.ne 2
.mk
.na
\fBPASSREQ\fR
.ad
.sp .6
.RS 4n
Determines if login requires a password. Default is \fBPASSREQ=YES\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/login\fR\fR
.ad
.sp .6
.RS 4n
Default value can be set for the following flag:
.sp
.ne 2
.mk
.na
\fB\fBSLEEPTIME\fR\fR
.ad
.sp .6
.RS 4n
If present, sets the number of seconds to wait before login failure is printed to the screen and another login attempt is allowed. Default is \fB4\fR seconds. Minimum is \fB0\fR seconds. Maximum is \fB5\fR seconds.
.sp
Both \fBsu\fR(1M) and \fBlogin\fR(1) are affected by the value of \fBSLEEPTIME\fR.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBauths\fR(1), \fBlogin\fR(1), \fBconsadm\fR(1M), \fBinit\fR(1M), \fBsu\fR(1M), \fBattributes\fR(5), \fBmsglog\fR(7D)
.SH NOTES
.sp
.LP
By default, the root user has all authorizations.
.sp
.LP
Granting the \fBsolaris.system.maintenance\fR authorization to the Console User Rights Profile may have an undesirable side effect of granting the currently logged in user maintenance mode access. The \fBsolaris.system.maintenance\fR authorization should be directly granted to appropriate users rather than through the Console User Rights Profile.
