Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/syseventd.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH syseventd 1M "6 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
syseventd \- kernel system event notification daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sysevent/syseventd\fR [\fB-d\fR \fIdebug_level\fR] [\fB-r\fR \fIrootdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBsyseventd\fR is a user-level daemon that accepts delivery of system event buffers from the kernel. Once an event buffer has been delivered to \fBsyseventd\fR, it, in turn, attempts to propagate the event to all interested end event subscribers.
.sp
.LP
Event subscribers take the form of a \fBsyseventd\fR loadable module (\fBSLM\fR). \fBsyseventd\fR passes the event buffer to each of its subscribers and in return expects a notification as to the successful or unsuccessful delivery attempt.
.sp
.LP
Upon successful delivery of the event buffer to all interested event subscribers, \fBsyseventd\fR frees the event buffer from the kernel event queue.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdebug_level\fR\fR
.ad
.RS 18n
.rt  
Enable debug mode. Messages are printed to the invoking user's terminal.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/sysevent/syseventd_daemon.lock\fR\fR
.ad
.sp .6
.RS 4n
daemon lock file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/sysevent/sysevent_door\fR\fR
.ad
.sp .6
.RS 4n
kernel to \fBsyseventd\fR door file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/sysevent/modules\fR\fR
.ad
.sp .6
.RS 4n
\fBSLM\fR directory repository
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/platform/\fR\fB`\fR\fBuname \(emi\fR\fB`\fR\fB/lib/sysevent/modules\fR\fR
.ad
.sp .6
.RS 4n
\fBSLM\fR directory repository
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/platform/\fR\fB`\fR\fBuname \(emm\fR\fB`\fR\fB/lib/sysevent/modules\fR\fR
.ad
.sp .6
.RS 4n
\fBSLM\fR directory repository
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyseventconfd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBsyseventd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/sysevent:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
