Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/tic.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH tic 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
tic \- terminfo compiler
.SH SYNOPSIS
.LP
.nf
\fBtic\fR [\fB-v\fR [\fIn\fR]] [\fB-c\fR] \fIfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
The command \fBtic\fR translates a \fBterminfo\fR file from the source format into the compiled format. The results are placed in the directory \fB/usr/share/lib/terminfo\fR. The compiled format is necessary for use with the library routines in \fBcurses\fR(3CURSES).
.sp
.LP
If the environment variable \fBTERMINFO\fR is set, the compiled results are placed there instead of \fB/usr/share/lib/terminfo\fR.
.sp
.LP
Total compiled entries cannot exceed 4096 bytes. The name field cannot exceed 128 bytes. Terminal names exceeding 14 characters will be truncated to 14 characters and a warning message will be printed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 9n
.rt  
Specifies to check only \fBfile\fR for errors. Errors in \fBuse=\fR links are not detected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR[\fIn\fR]\fR
.ad
.RS 9n
.rt  
Specify that (verbose) output be written to standard error trace information showing \fBtic\fR's progress. The optional integer \fIn\fR is a number from 1 to 10, indicating the desired level of detail of information. If \fIn\fR is omitted, the default level is 1. If \fIn\fR is specified and greater than 1, the level of detail is increased.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fBfile\fR\fR
.ad
.RS 8n
.rt  
Contains one or more \fBterminfo\fR terminal descriptions in source format [see \fBterminfo\fR(4)]. Each description in the file describes the capabilities of a particular terminal. When a \fBuse\fR\fI=entry-name\fR field is discovered in a terminal entry currently being compiled, \fBtic\fR reads in the binary from \fB/usr/share/lib/terminfo\fR to complete the entry. (Entries created from \fBfile\fR will be used first. If the environment variable \fB\fR\fBTERM\fR\fBINFO \fR is set, that directory is searched instead of \fB/usr/share/lib/terminfo\fR.) \fBtic\fR duplicates the capabilities in \fIentry-name\fR for the current entry, with the exception of those capabilities that are explicitly defined in the current entry.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/terminfo/?/*\fR\fR
.ad
.sp .6
.RS 4n
Compiled terminal description database
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBcaptoinfo\fR(1M), \fBinfocmp\fR(1M), \fBcurses\fR(3CURSES), \fBterminfo\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
When an entry, for example, \fBentry_name_1\fR, contains a \fBuse=\fR\fIentry_name_2\fR field, any canceled capabilities in \fIentry_name_2\fR must also appear in \fBentry_name_1\fR before \fBuse=\fR for these capabilities to be canceled in \fBentry_name_1\fR.
