Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/tnd.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tnd 1M "9 Apr 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
tnd \- trusted network daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tnd\fR [\fB-p\fR \fIpoll-interval\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtnd\fR (trusted network daemon) initializes the kernel with trusted network databases and also reloads the databases on demand from an LDAP server and local files. \fBtnd\fR follows the order specified in the nsswitch.conf file when loading configuration databases.
.sp
.LP
\fBtnd\fR is intended to be started from the \fBsvc:/network/tnd\fR \fBsmf\fR(5) service during the boot process in the global zone only when the system has been configured as an LDAP client. Systems that use only local files for the trusted network databases use \fBtnctl\fR(1M) instead of \fBtnd\fR.
.sp
.LP
\fBtnd\fR loads the following databases into the kernel: the remote host database, \fBtnrhdb\fR, and the remote-host template database, \fBtnrhtp\fR. \fBtnd\fR also periodically scans for changes in the associated LDAP database or local databases and updates the kernel cache accordingly.
.sp
.LP
If a local trusted networking database file is modified, the administrator should run \fBtnchkdb\fR(1M) to check the syntax, and should also run \fBsvcadm refresh svc:/network/tnd\fR to initiate an immediate database scan by \fBtnd\fR.
.sp
.LP
\fBtnd\fR is intended to be started from an \fBsmf\fR(5) script and to run in the global zone. The following \fBsvcadm\fR commands signal \fBtnd\fR to perform specific actions:
.sp
.ne 2
.mk
.na
\fB\fBsvcadm refresh svc:/network/tnd\fR\fR
.ad
.sp .6
.RS 4n
Initiates a rescan of the local and LDAP \fBtnrhdb\fR and \fBtnrhtp\fR databases. \fBtnd\fR updates the kernel database with any changes found.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsvcadm disable svc:/network/tnd\fR\fR
.ad
.sp .6
.RS 4n
Terminates the \fBtnd\fR daemon. No changes are made to the kernel database.
.RE

.sp
.LP
Running \fBtnd\fR in debug mode is determined by the value of the following service management facility (SMF) property:
.sp
.in +2
.nf
tnd/debug_level = 0
.fi
.in -2

.sp
.LP
A value of \fB0\fR, as above, prevents debug information from being collected; \fB1\fR turns on debugging. The default value is \fB0\fR. Debug output is sent to the \fB/var/tsol/tndlog\fR log file.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpoll-interval\fR\fR
.ad
.RS 20n
.rt  
Set poll interval to \fIpoll-interval\fR seconds. The default \fIpoll-interval\fR is 1800 seconds (30 minutes).
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRChanging the Poll Interval
.sp
.LP
The following command changes the polling interval to one hour, and puts this interval in the SMF repository. At the next boot, the \fBtnd\fR poll interval will be one hour.

.sp
.in +2
.nf
# \fBsvccfg -s network/tnd setprop tnd/poll_interval=3600\fR
.fi
.in -2
.sp

.sp
.LP
The following command changes the polling interval, but does not update the repository. At the next boot, the \fBtnd\fR poll interval remains the default, 30 minutes.

.sp
.in +2
.nf
# tnd -p 3600
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file for the name service switch
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilitySee below.
.TE

.sp
.LP
The command invocation is Committed. The service is Private.
.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBtninfo\fR(1M), \fBtnctl\fR(1M), \fBtnchkdb\fR(1M), \fBnsswitch.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
.sp
.LP
The \fBtnd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/tnd
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried by using \fBsvcs\fR(1). Administrative actions on this service, such as requests to restart the daemon, can be performed using \fBsvcadm\fR(1M), as in:
.sp
.in +2
.nf
svcadm restart svc:/network/tnd
.fi
.in -2
.sp

