Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/tninfo.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tninfo 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
tninfo \- print kernel-level network information and statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tninfo\fR [\fB-h\fR \fIhostname\fR] [\fB-m\fR \fIzone-name\fR] [\fB-t\fR \fItemplate\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBtninfo\fR provides an interface to retrieve and display kernel-level network information and statistics.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhostname\fR\fR
.ad
.RS 16n
.rt  
Display the security structure for the specified host in the remote-host cache. The output should reflect what is specified in the \fBtnrhdb\fR database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIzone-name\fR\fR
.ad
.RS 16n
.rt  
Display the MLP configuration associated with the specified zone. The output should reflect what is specified in the \fBtnzonecfg\fR database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItemplate\fR\fR
.ad
.RS 16n
.rt  
Display the structure associated with the specified \fItemplate\fR. The output should reflect what is specified in the \fBtnrhtp\fR database.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying Remote Host Structures Cached in the Kernel
.sp
.LP
This example shows the remote host structures cached in the kernel. The output reflects the definition in the \fBtnrhdb\fR database.

.sp
.in +2
.nf
# \fBtninfo -h machine1\fR
   IP address= 192.168.8.61
   Template = cipso
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisplaying Multilevel Ports for the Global Zone
.sp
.LP
This example shows the kernel-cached MLPs for the global zone. The output reflects the definition in the \fBtnzonecfg\fR database, plus any dynamically allocated MLPs. \fBprivate\fR indicates zone-specific MLPs.

.sp
.in +2
.nf
# \fBtninfo -m global\fR
private:23/tcp;111/tcp;111/udp;515/tcp;2049/tcp;6000-6003/tcp;
        32812/tcp;36698/ip;38634/tcp;64365/ip
shared: 6000-6003/tcp
.fi
.in -2
.sp

.LP
\fBExample 3 \fRDisplaying the \fBcipso\fR Template Definition
.sp
.LP
This example shows the kernel-cached \fBcipso\fR template definition. The output reflects the definition in the \fBtnrhtp\fR database.

.sp
.in +2
.nf
# \fBtninfo -t cipso\fR
=====================================
   Remote Host Template Table Entries:
   __________________________
   template: cipso
   host_type: CIPSO
   doi: 1
   min_sl: ADMIN_LOW
   hex: ADMIN_LOW
   max_sl: ADMIN_HIGH
   hex: ADMIN_HIGH
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilitySee below.
.TE

.sp
.LP
The command line is Committed. The output is Uncommitted.
.SH SEE ALSO
.sp
.LP
\fBtnd\fR(1M), \fBtnctl\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
