Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/txzonemgr.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH txzonemgr 1M "12 May 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
txzonemgr \- Trusted Extensions Zone Manager configuration utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/txzonemgr\fR [\fB-c\fR | \fB-d[f]\fR | \fB-Z\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtxzonemgr\fR shell script provides a simple, menu-based \fBGUI\fR wizard for creating, installing, initializing, and booting labeled zones on a system on which Trusted Extensions is enabled. The script also provides menu items for networking options, name services options, and making the global zone a client of an existing LDAP server. By default, all zones are configured to use the same name service and IP address as the global zone.
.sp
.LP
\fBtxzonemgr\fR can also perform a limited set of commands in command-line mode instead of GUI mode, by using appropriate options, described below.
.sp
.LP
\fBtxzonemgr\fR is run by roles granted in the Zone Management Rights Profile, or by root in the global zone.
.SH OPTIONS
.sp
.LP
Without options, \fBtxzonemgr\fR operates as a menu-based GUI. Using any options will result in command-line operation only. Except as specified below, options cannot be combined.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Create default zones. Requires that no zones already exist. The number, names, and attributes of the zones created is subject to change. However, typically a "public" zone and at least one other zone is created.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Destroy all zones. All zones will be halted, uninstalled, and deleted. Prompts for confirmation unless the \fB-f\fR option is also specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Force. Can be used with \fB-d\fR to override prompt for confirmation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
Create a set of zones using the list specified in the file. Each line in the file must contain a zone name and its corresponding label, separated by whitespace. The label should not be quoted even if it contains whitespace. If an existing zone named "snapshot" exists, all the specified zones are cloned from it. Otherwise the first zone in the list is installed, and then a snapshot zone is cloned from it. The remaining zones are then cloned from the snapshot. The zones are configured to require manual booting. However, when an authorized user assigns a valid label to a GNOME workspace, the corresponding zone is booted automatically.
.RE

.SH EXIT STATUS
.sp
.LP
No values are returned for GUI mode. For command-line operation, the following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Invalid usage.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Command Interface Stability Committed 
_
Interactive DialogueNot an Interface
.TE

.SH SEE ALSO
.sp
.LP
\fBzenity\fR(1) (not a SunOS man page), \fBipadm\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBrbac\fR(5), \fBzones\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator's Procedures\fR
.SH NOTES
.sp
.LP
If administering zones from \fBJDS\fR, use \fBtxzonemgr\fR rather than \fBCDE\fR actions.
.sp
.LP
\fBtxzonemgr\fR uses the \fBzenity\fR command. For details, see the \fBzenity\fR(1) man page, which is not part of the SunOS collection.
