Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/tzreload.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tzreload 1M "3 May 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
tzreload \- notify timezone update
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tzreload\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtzreload\fR command notifies active (running) processes to reread timezone information. The timezone information is cached in each process, absent a \fBtzreload\fR command, is never reread until a process is restarted. In response to a \fBtzreload\fR command, active processes reread the current timezone information at the next call to \fBctime\fR(3C) and \fBmktime\fR(3C). The \fBtzreload\fR notification is sent to processes within the current zone.
.sp
.LP
\fBtzreload\fR causes processes which are using the system timezone (in \fB/etc/default/init\fR) to reread the contents of that file.
.sp
.LP
In addition to notifying active processes, the \fBtzreload\fR command also notifies \fBcron\fR(1M), to reinitialize the job scheduler with the new timezone information.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/zoneinfo\fR\fR
.ad
.sp .6
.RS 4n
Standard zone information directory.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcron\fR(1M), \fBzdump\fR(1M), \fBzic\fR(1M), \fBctime\fR(3C), \fBmktime\fR(3C), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
Although \fBtzreload\fR reinitializes \fBcron\fR(1M), applications that are affected by timezone changes still need to be restarted or reinitialized if they do not reread the new timezone information before timezone changes take place.
.sp
.LP
The \fBtimezone\fR update service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/timezone:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting refresh, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
Refreshing this service causes the \fBtzreload\fR command to be run, notifying running processes to reload their \fBtimezone\fR caches. Disabling this service is not recommended.
