Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/unshare.1m
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH unshare 1M "20 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
unshare \- make local resource unavailable for mounting by remote systems
.SH SYNOPSIS
.LP
.nf
\fBunshare\fR [\fB-F\fR \fIprotocol\fR] [\fB-a\fR | [\fB-t\fR] [\fIpathname\fR | \fIsharename\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBunshare\fR command unpublishes a file system share, which makes a shared local file system unavailable for file sharing \fIprotocol\fR. If the \fB-F\fR \fIprotocol\fR option is omitted, then the first file sharing procotol listed in the \fB/etc/dfs/fstypes\fR file used as the default sharing protocol.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
Identify the file sharing protocol.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Unpublish all active shares.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Temporarily unpublish a share. By default, all shares are permanently unpublished.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.sp .6
.RS 4n
List of file sharing protocols. NFS is the default file-sharing protocol.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/sharetab\fR\fR
.ad
.sp .6
.RS 4n
Contains a table of local resources published by the \fBshare\fR command.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcs
.TE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
If \fIpathname\fR or \fIresourcename\fR is not found in the share information, an error message is sent to standard error.
.sp
.LP
When an \fBunshare\fR command completes successfully, a client mounting a file system specified in that \fBunshare\fR command no longer has access to that file system.
