Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/uucleanup.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH uucleanup 1M "19 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
uucleanup \- uucp spool directory clean-up
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uucleanup\fR [\fB-C\fR\fItime\fR] [\fB-D\fR\fItime\fR] [\fB-m\fR\fIstring\fR] 
     [\fB-o\fR\fItime\fR] [\fB-s\fR\fIsystem\fR] [\fB-W\fR\fItime\fR] [\fB-x\fR\fIdebug-level\fR] [\fB-X\fR\fItime\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBuucleanup\fR will scan the spool directories for old files and take appropriate action to remove them in a useful way:
.RS +4
.TP
.ie t \(bu
.el o
Inform the requester of send/receive requests for systems that can not be reached.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Return undeliverable mail to the sender.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Deliver \fBrnews\fR files addressed to the local system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Remove all other files.
.RE
.sp
.LP
In addition, there is a provision to warn users of requests that have been waiting for a given number of days (default 1 day). Note: \fBuucleanup\fR will process as if all option \fBtimes\fR were specified to the default values unless \fBtime\fR is specifically set.
.sp
.LP
This program is typically started by the shell \fBuudemon.cleanup\fR, which should be started by \fBcron\fR(1M).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fBtime\fR\fR
.ad
.RS 17n
.rt  
Remove any \fBC.\fR files greater or equal to \fBtime\fR days old and send appropriate information to the requester (default 7 days).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fBtime\fR\fR
.ad
.RS 17n
.rt  
Remove any \fBD.\fR files greater or equal to \fBtime\fR days old, make an attempt to deliver mail messages, and execute  \fBrnews\fR when appropriate (default 7 days).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fIstring\fR\fR
.ad
.RS 17n
.rt  
Include \fIstring\fR in the warning message generated by the \fB-W\fR option. The default line is "See your local administrator to locate the problem".
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fBtime\fR\fR
.ad
.RS 17n
.rt  
Delete other files whose age is more than \fBtime\fR days (default 2 days).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fIsystem\fR\fR
.ad
.RS 17n
.rt  
Execute for \fIsystem\fR spool directory only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-W\fR\fBtime\fR\fR
.ad
.RS 17n
.rt  
Any \fBC.\fR files equal to \fBtime\fR days old will cause a mail message to be sent to the requester warning about the delay in contacting the remote. The message includes the \fIJOBID\fR, and in the case of mail, the mail message. The administrator may include a message line telling whom to call to check the problem (\fB-m\fR option) (default 1 day).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fIdebug-level\fR\fR
.ad
.RS 17n
.rt  
Produce debugging output on standard ouput. \fIdebug-level\fR is a single digit between 0 and 9; higher numbers give more detailed debugging information. (This option may not be available on all systems.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-X\fR\fBtime\fR\fR
.ad
.RS 17n
.rt  
Any \fBX.\fR files greater or equal to \fBtime\fR days old will be removed. The \fBD.\fR files are probably not present (if they were, the \fBX.\fR could get executed). But if there are \fBD.\fR files, they will be taken care of by D. processing (default 2 days).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/uucp\fR\fR
.ad
.RS 19n
.rt  
directory with commands used by \fBuucleanup\fR internally
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/spool/uucp\fR\fR
.ad
.RS 19n
.rt  
spool directory
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/uucp
.TE

.SH SEE ALSO
.sp
.LP
\fBuucp\fR(1C), \fBuux\fR(1C), \fBcron\fR(1M), \fBattributes\fR(5)
