Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/virtinfo.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH virtinfo 1M "20 Jul 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
virtinfo \- virtualization domain information
.SH SYNOPSIS
.LP
.nf
virtinfo [ -acdpstu ]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBvirtinfo\fR utility provides virtualization information returned by \fBlibv12n\fR(3LIB) about the current domain. When options are specified, symbols that represent one or more virtualization domain characteristics are written to standard output. If no options are specified, \fBvirtinfo\fR shows only the virtualization domain type.
.SH OPTIONS
.sp
.LP
The \fBvirtinfo\fR command supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Shows all information that is currently available from the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Shows the network node name of the control domain. This name is identical to the string shown by running the \fBuname -n\fR command on the control domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Shows the domain name for this virtual domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
Shows information in a parseable format.
.sp
The parseable output for Logical Domains (LDoms) has the following format:
.sp
.in +2
.nf
VERSION 1.0
DOMAINROLE|impl=LDoms|control={true|false}|
    io={true|false}|service={true|false}|
    root={true|false}
DOMAINNAME|name=\fIdomain-name\fR
DOMAINUUID|uuid=\fIuuid\fR
DOMAINCONTROL|name=\fIcontrol-domain-nodename\fR
DOMAINCHASSIS|serialno=\fIserial-no\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Shows the platform serial number.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 6n
.rt  
Shows the domain type.
.sp
The domain type for Logical Domains is a string of one or more of the following blank-separated values:
.sp
.ne 2
.mk
.na
\fB\fBLDoms\fR\fR
.ad
.RS 11n
.rt  
LDoms implementation
.RE

.sp
.ne 2
.mk
.na
\fB\fBcontrol\fR\fR
.ad
.RS 11n
.rt  
Control domain
.RE

.sp
.ne 2
.mk
.na
\fB\fBguest\fR\fR
.ad
.RS 11n
.rt  
Guest domain
.RE

.sp
.ne 2
.mk
.na
\fB\fBI/O\fR\fR
.ad
.RS 11n
.rt  
I/O domain
.RE

.sp
.ne 2
.mk
.na
\fB\fBservice\fR\fR
.ad
.RS 11n
.rt  
Service domain
.RE

.sp
.ne 2
.mk
.na
\fB\fBroot\fR\fR
.ad
.RS 11n
.rt  
Root I/O domain
.RE

Note that the \fBcontrol\fR and \fBguest\fR values are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
Shows the universally unique identifier (UUID) of the domain. See the \fBlibuuid\fR(3LIB) man page.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 13n
.rt  
An error occurred.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRViewing Default Information
.sp
.LP
The following example shows the default information about the domain:

.sp
.in +2
.nf
$ \fBvirtinfo\fR
Domain role: LDoms control I/O service root

The current domain is the control domain, which is also an
I/O domain, the service domain and a root I/O domain.
.fi
.in -2
.sp

.LP
\fBExample 2 \fRViewing All Information
.sp
.LP
The following example shows all available information about the domain:

.sp
.in +2
.nf
$ \fBvirtinfo -a\fR
Domain role: LDoms control I/O service root
Domain name: primary
Domain UUID: 8e0d6ec5-cd55-e57f-ae9f-b4cc050999a4
Control domain: san-t2k-6
Chassis serial#: 0704RB0280
.fi
.in -2
.sp

.LP
\fBExample 3 \fRViewing All Information In a Parsable Format
.sp
.LP
The following example shows all available information about the domain in a parsable format:

.sp
.in +2
.nf
$ \fBvirtinfo -ap\fR
VERSION 1.0
DOMAINROLE|impl=LDoms|control=true|io=true|service=true|root=true
DOMAINNAME|name=primary
DOMAINUUID|uuid=8e0d6ec5-cd55-e57f-ae9f-b4cc050999a4
DOMAINCONTROL|name=san-t2k-6
DOMAINCHASSIS|serialno=0704RB0280
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBlibuuid\fR(3LIB), \fBlibv12n\fR(3LIB)
