Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/volcopy.1m
'\" te
.\" Copyright (c) 1996, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH volcopy 1M "20 Mar 1995" "SunOS 5.11" "System Administration Commands"
.SH NAME
volcopy \- make an image copy of file system
.SH SYNOPSIS
.LP
.nf
\fBvolcopy\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fIgeneric_options\fR] 
     [\fB-o\fR \fIFSType-specific_options\fR] \fIoperands\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBvolcopy\fR makes a literal copy of the file system. This command may not be supported for all \fIFSTypes\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.RS 30n
.rt  
Specify the \fIFSType\fR on which to operate. The \fIFSType\fR should either be specified here or be determinable from \fB/etc/vfstab\fR by matching the \fIoperands\fR with an entry in the table. Otherwise, the default file system type specified in \fB/etc/default/fs\fR will be used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 30n
.rt  
Echo the complete command line, but do not execute the command. The command line is generated by using the options and arguments provided by the user and adding to them information derived from \fB/etc/vfstab\fR. This option should be used to verify and validate the command line.
.RE

.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 30n
.rt  
Options that are commonly supported by most \fIFSType\fR-specific command modules.  The following options are available:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Require the operator to respond "yes" or "no" instead of simply waiting ten seconds before the copy is made.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
(Default) Invoke the DEL if wrong verification sequence.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIFSType-specific_options\fR\fR
.ad
.RS 30n
.rt  
Specify \fIFSType\fR-specific options in a comma separated (without spaces) list of suboptions and keyword-attribute pairs for interpretation by the \fIFSType\fR-specific module of the command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIoperands\fR\fR
.ad
.RS 12n
.rt  
generally include the device and volume names and are file system specific. A detailed description of the \fIoperands\fR can be found on the \fIFSType\fR-specific man pages of \fBvolcopy\fR.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful file system copy
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
An error has occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.RS 19n
.rt  
list of default parameters for each file system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/fs\fR\fR
.ad
.RS 19n
.rt  
default local file system type. Default values can be set for the following flags in \fB/etc/default/fs\fR. For example: \fBLOCAL=ufs.\fR
.sp
.ne 2
.mk
.na
\fB\fBLOCAL:\fR\fR
.ad
.RS 10n
.rt  
The default partition for a command if no \fIFSType\fR is specified.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBlabelit\fR(1M), \fBvfstab\fR(4), \fBattributes\fR(5) Manual pages for the \fIFSType\fR-specific modules of \fBvolcopy\fR.
