Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/wall.1m
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH wall 1M "13 Jul 1994" "SunOS 5.11" "System Administration Commands"
.SH NAME
wall \- write to all users
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/wall\fR [\fB-a\fR] [\fB-g\fR \fIgrpname\fR] [\fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBwall\fR reads its standard input until an end-of-file. It then sends this message to all currently logged-in users preceded by:
.sp
.in +2
.nf
Broadcast Message from .\|.\|.
.fi
.in -2

.sp
.LP
If \fIfilename\fR is given, then the message is read in from that file. Normally, pseudo-terminals that do not correspond to rlogin sessions are ignored. Thus, when using a window system, the message appears only on the console window. However, \fB-a\fR will send the message even to such pseudo-terminals.
.sp
.LP
It is used to warn all users, typically prior to shutting down the system.
.sp
.LP
The sender must be superuser to override any protections the users may have invoked See \fBmesg\fR(1).
.sp
.LP
\fBwall\fR runs \fBsetgid()\fR to the group  \fBID\fR \fBtty\fR, in order to have write permissions on other user's terminals. See \fBsetuid\fR(2).
.sp
.LP
\fBwall\fR will detect non-printable characters before sending them to the user's terminal. Control characters will appear as a  "\fB ^ \fR" followed by the appropriate \fBASCII\fR character; characters with the high-order bit set will appear in "meta" notation.  For example, `\fB\e003\fR\&' is displayed as `\fB^C\fR' and  `\fB\e372\fR\&' as  `\fBM\(miz\fR'.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 14n
.rt  
Broadcast message to the console and pseudo-terminals.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fBg\fR \fIgrpname\fR\fR
.ad
.RS 14n
.rt  
Broadcast to the users in a specified group only, per the group database (see \fBgroup\fR(4)).
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
If the  \fBLC_*\fR variables (\fBLC_CTYPE\fR, \fBLC_TIME\fR, \fBLC_COLLATE\fR, \fBLC_NUMERIC\fR, and \fBLC_MONETARY\fR) are not set in the environment, the operational behavior of \fBwall\fR for each corresponding locale category is determined by  the value of the \fBLANG\fR environment variable. See \fBenviron\fR(5). If \fBLC_ALL\fR is set, its contents are used to override both the  \fBLANG\fR and the other \fBLC_*\fR variables. If none of the above variables are set in the environment, the "C" (U.S. style) locale determines how \fBwall\fR behaves.
.SH FILES
.sp
.LP
\fB/dev/tty*\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBmesg\fR(1), \fBwrite\fR(1), \fBsetuid\fR(2), \fBattributes\fR(5), \fBenviron\fR(5)
.SH NOTES
.sp
.LP
\fBwall\fR displays ``Cannot send to \|.\|.\|.'' when the open on a user's \fBtty\fR file fails.
