Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/whodo.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH whodo 1M "18 Jun 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
whodo \- who is doing what
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/whodo\fR [\fB-h\fR] [\fB-l\fR] [\fIuser\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBwhodo\fR command produces formatted and dated output from information in the \fB/var/adm/utmpx\fR and \fB/proc/pid\fR files.
.sp
.LP
The display is headed by the date, time, and machine name. For each user logged in, device name, user-ID and login time is shown, followed by a list of active processes associated with the user-ID. The list includes the device name, process-ID, CPU minutes and seconds used, and process name.
.sp
.LP
If \fIuser\fR is specified, output is restricted to all sessions pertaining to that user.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
Suppress the heading.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Produce a long form of output. The fields displayed are: the user's login name, the name of the tty the user is on, the time of day the user logged in (in \fIhours\fR\fB:\fR\fIminutes\fR), the idle time \(em that is, the time since the user last typed anything (in \fIhours\fR\fB:\fR\fIminutes\fR), the CPU time used by all processes and their children on that terminal (in \fIminutes\fR\fB:\fR\fIseconds\fR), the CPU time used by the currently active processes (in \fIminutes\fR\fB:\fR\fIseconds\fR), and the name and arguments of the current process.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing the whodo Command
.sp
.LP
The command:

.sp
.in +2
.nf
example% whodo
.fi
.in -2
.sp

.sp
.LP
produces a display like this:

.sp
.in +2
.nf
Tue Mar 12 15:48:03 1985
bailey
tty09    mcn       8:51
    tty09   28158    0:29 sh

tty52    bdr      15:23
    tty52   21688    0:05 sh
    tty52   22788    0:01 whodo
    tty52   22017    0:03 vi
    tty52   22549    0:01 sh

xt162    lee      10:20
    tty08    6748    0:01 layers
    xt162    6751    0:01 sh
    xt163    6761    0:05 sh
    tty08    6536    0:05 sh
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
If any of the \fBLC_*\fR variables ( \fB\fR\fBLC_CTYPE\fR\fB,\fR \fBLC_MESSAGES\fR\fB,\fR \fBLC_TIME\fR\fB,\fR \fBLC_COLLATE\fR\fB,\fR \fBLC_NUMERIC\fR\fB,\fR and \fBLC_MONETARY\fR ) (see \fBenviron\fR(5)) are not set in the environment, the operational behavior of \fBtar\fR(1) for each corresponding locale category is determined by the value of the \fBLANG\fR environment variable. If \fBLC_ALL\fR is set, its contents are used to override both the \fBLANG\fR and the other \fBLC_*\fR variables. If none of the above variables is set in the environment, the "C" (U.S. style) locale determines how \fBwhodo\fR behaves.
.sp
.ne 2
.mk
.na
\fB\fBLC_CTYPE\fR\fR
.ad
.RS 15n
.rt  
Determines how \fBwhodo\fR handles characters. When \fBLC_CTYPE\fR is set to a valid value, \fBwhodo\fR can display and handle text and filenames containing valid characters for that locale. The \fBwhodo\fR command can display and handle Extended Unix code (EUC) characters where any individual character can be 1, 2, or 3 bytes wide. \fBwhodo\fR can also handle EUC characters of 1, 2, or more column widths. In the "C" locale, only characters from ISO 8859-1 are valid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLC_MESSAGES\fR\fR
.ad
.RS 15n
.rt  
Determines how diagnostic and informative messages are presented. This includes the language and style of the messages, and the correct form of affirmative and negative responses. In the "C" locale, the messages are presented in the default form found in the program itself (in most cases, U.S. English).
.RE

.sp
.ne 2
.mk
.na
\fB\fBLC_TIME\fR\fR
.ad
.RS 15n
.rt  
Determines how \fBwhodo\fR handles date and time formats. In the "C" locale, date and time handling follow the U.S. rules.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 18n
.rt  
System password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/utmpx\fR\fR
.ad
.RS 18n
.rt  
User access and administration information
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc/pid\fR\fR
.ad
.RS 18n
.rt  
Contains PID
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBwho\fR(1), \fBattributes\fR(5), \fBenviron\fR(5)
