Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/wpad.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH wpad 1M "11 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
wpad \- WPA and WPA2 protocol daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/wpad\fR [\fB-i\fR \fIinterface\fR] [\fB-k\fR \fIpre_shared_key_name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBwpad\fR daemon provides common client functionality for the WiFi Protected Access (WPA) versions 1 and 2, as defined by IEEE802.11i standard. WPA was created by the WiFi Alliance, an industry trade group. WPA implements the majority of the IEEE 802.11i standard, and was intended as an intermediate measure to take the place of Wired Equivalent Privacy (WEP) while 802.11i was prepared. WPA2 implements the full standard.
.sp
.LP
\fBwpad\fR provides the following WPA/IEEE 802.11i features:
.RS +4
.TP
.ie t \(bu
.el o
WPA-PSK ("WPA-Personal")
.RE
.RS +4
.TP
.ie t \(bu
.el o
Key management for CCMP, TKIP, WEP104, WEP40
.RE
.sp
.LP
Stop and start the \fBwpad\fR daemon using \fBdladm\fR(1M). Use:
.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&...to start the \fBwpad\fR daemon. Use:
.sp
.in +2
.nf
# \fBdladm disconnect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&...to stop the daemon.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterface\fR\fR
.ad
.sp .6
.RS 4n
Specify a WiFi Link interface to start the \fBwpad\fR daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIpre_shared_key_name\fR\fR
.ad
.sp .6
.RS 4n
Specify the pre-shared key used for the WiFi Link.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRStarting the \fBwpad\fR Daemon on Specific WiFi Link
.sp
.LP
To create the WPA key \fBpsk\fR, enter the  following command:

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
To use key \fBpsk\fR to connect to ESSID \fBwlan\fR on link \fBath0\fR, enter the following command:

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRStopping the \fBwpad\fR Daemon on Specific WiFi Link
.sp
.LP
To stop the daemon on the link \fBath0\fR, enter:

.sp
.in +2
.nf
# \fBdladm disconnect-wifi ath0\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/wpa
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBdladm\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBwpad\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/wpa:\fI<link>\fR
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
