Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ypmake.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.TH ypmake 1M "11 Dec 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypmake \- rebuild NIS database
.SH SYNOPSIS
.LP
.nf
\fBcd\fR \fB/var/yp\fR ; \fBmake\fR [\fImap\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The file called \fBMakefile\fR in \fB/var/yp\fR is used by \fBmake\fR(1S) to build the  Network Information Service (\fBNIS\fR) database. With no arguments, \fBmake\fR creates \fBdbm\fR databases for any \fBNIS\fR maps that are out-of-date, and then executes \fByppush\fR(1M) to notify slave databases that there has been a change.
.sp
.LP
If you supply a \fImap\fR on the command line, \fBmake\fR will update that map only. Typing \fBmake passwd\fR will create and \fByppush\fR the password database (assuming it is out of date). Likewise, \fBmake ipnodes\fR and \fBmake networks\fR will create and \fByppush\fR the \fBipnodes\fR and \fBnetwork\fR files, \fB$(INETDIR)/ipnodes\fR and \fB$(DIR)/networks\fR.
.sp
.LP
There are four special variables used by \fBmake\fR: \fBDIR\fR, which gives the directory of the source files; \fBNOPUSH\fR, which when non-null inhibits doing a \fByppush\fR of the new database files; \fBINETDIR\fR, which gives the directory of the \fBipnodes\fR source file; and \fBDOM\fR, which is used to construct a domain other than the master's default domain. The default for \fBDIR\fR is \fB/etc\fR, and the default for \fBINETDIR\fR is \fB/etc/inet\fR. The default for \fBNOPUSH\fR is the null string.
.sp
.LP
Refer to \fBypfiles\fR(4) and \fBypserv\fR(1M) for an overview of the  \fBNIS\fR service.
.sp
.LP
If a \fBNIS\fR to LDAP (N2L) configuration file, \fB/var/yp/NISLDAPmapping\fR, is present, the \fBNIS\fR server components run in N2L mode. In N2L mode, the server components use a new set of map files with an LDAP-prefix, based on the LDAP DIT. In N2L mode, authoritative NIS information is obtained from the DIT. The NIS source files and \fBypmake\fR have no role, and they should not be used. If \fBypmake\fR is accidentally run, then the server components will detect this, and will log a warning message. For additional information, see \fBypfiles\fR(4).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/yp\fR\fR
.ad
.RS 19n
.rt  
Directory containing  \fBNIS\fR configuration files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/hosts\fR\fR
.ad
.RS 19n
.rt  
System hosts file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc\fR\fR
.ad
.RS 19n
.rt  
Default directory for source files.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/nis
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmake\fR(1S), \fBmakedbm\fR(1M), \fBypbind\fR(1M), \fByppush\fR(1M), \fBypserv\fR(1M), \fBypclnt\fR(3NSL), \fBNISLDAPmapping\fR(4), \fBypfiles\fR(4), \fBypserv\fR(4)
.SH NOTES
.sp
.LP
The  \fBNIS\fR makefile is only used when running the  \fBypserv\fR(1M) server to provide  \fBNIS\fR services. See  \fBypfiles\fR(4) for more details.
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun Yellow Pages (\fBYP\fR).  The functionality of the two remains the same. Only the name has changed. The name Yellow Pages is a registered trademark in the United Kingdom of British Telecommunications plc, and may not be used without permission.
