Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/yppush.1m
'\" te
.\"  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.TH yppush 1M "26 Aug 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
yppush \- force propagation of changed NIS map
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/yppush\fR [\fB-v\fR] [\fB-h\fR \fIhost\fR] [\fB-d\fR \fIdomain\fR] 
     [\fB-p\fR \fI#parallel-xfrs\fR] \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fByppush\fR copies a new version of a  Network Information Service (\fBNIS\fR) map from the master \fBNIS\fR server to the slave \fBNIS\fR servers. It is normally run only on the master \fBNIS\fR server by the \fBMakefile\fR in \fB/var/yp\fR after the master databases are changed. It first constructs a list of \fBNIS\fR server hosts by reading the \fBNIS\fR \fBypservers\fR map within the \fIdomain\fR. Keys within the \fBypservers\fR map are the \fBASCII\fR names of the machines on which the \fBNIS\fR servers run.
.sp
.LP
A "transfer map" request is sent to the \fBNIS\fR server at each host, along with the information needed by the transfer agent (the program that actually moves the map) to call back the \fByppush\fR. When the attempt has completed (successfully or not), and the transfer agent has sent \fByppush\fR a status message, the results can be printed to \fBstdout\fR. Messages are also printed when a transfer is not possible, for instance, when the request message is undeliverable, or when the timeout period on responses has expired.
.sp
.LP
Refer to \fBypfiles\fR(4) and \fBypserv\fR(1M) for an overview of the \fBNIS\fR service.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdomain\fR\fR
.ad
.RS 21n
.rt  
Specifies a \fIdomain\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhost\fR\fR
.ad
.RS 21n
.rt  
Propagates only to the named \fIhost\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fI#parallel-xfrs\fR\fR
.ad
.RS 21n
.rt  
Allows the specified number of map transfers to occur in parallel.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 21n
.rt  
Verbose.  This prints messages when each server is called, and for each response. If this flag is omitted, only error messages are printed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/yp\fR\fR
.ad
.sp .6
.RS 4n
Directory where \fBNIS\fR configuration files reside.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/yp/\fIdomain\fR/ypservers.\|{\fIdir\fR,\fI pag\|\fR}\fR\fR
.ad
.sp .6
.RS 4n
Map containing list of  \fBNIS\fR servers to bind to when running in server mode.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/nis
.TE

.SH SEE ALSO
.sp
.LP
\fBypserv\fR(1M), \fBypxfr\fR(1M), \fBypfiles\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun Yellow Pages (\fBYP\fR). The functionality of the two remains the same; only the name has changed. The name Yellow Pages is a registered trademark in the United Kingdom of British Telecommunications PLC, and must not be used without permission.
.SH BUGS
.sp
.LP
In the current implementation (version 2 \fBNIS\fR protocol), the transfer agent is \fBypxfr\fR(1M), which is started by the \fBypserv\fR program. If \fByppush\fR detects that it is speaking to a version 1 \fBNIS\fR protocol server, it uses the older protocol, sending a version 1 \fBYPPROC_GET\fR request and issues a message to that effect. Unfortunately, there is no way of knowing if or when the map transfer is performed for version 1 servers. \fByppush\fR prints a message saying that an "old-style" message has been sent. The system administrator should later check to see that the transfer has actually taken place.
