Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ypserv_resolv.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ypserv_resolv 1M "22 Mar 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypserv_resolv \- DNS forwarding service daemon for NIS
.SH SYNOPSIS
.LP
.nf
\fBypserv_resolv\fR [\fB-v\fR | \fB-V\fR] [\fB-F\fR [\fB-C\fR \fIfd\fR]] [\fB-t\fR \fIxx\fR] [\fB-p\fR \fIyy\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBypserv_resolv\fR is an auxiliary process that provides \fBDNS\fR forwarding service for NIS hosts requests to \fBypserv\fR that is running in the NIS compatibility mode. It is generally started by invoking \fBypserv\fR(1M) with the \fB-d\fR option. Although it is not recommended, \fBypserv_resolv\fR can also be started independently with the options shown below.
.sp
.LP
This command requires that the \fB/etc/resolv.conf\fR file be setup for communication with a DNS nameserver. The \fBdig\fR(1M) utility can be used to verify communication with a DNS nameserver. See \fBresolv.conf\fR(4) and \fBdig\fR(1M).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 9n
.rt  
Run in foreground.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIfd\fR\fR
.ad
.RS 9n
.rt  
Use \fIfd\fR for service xprt.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 9n
.rt  
Verbose. Send output to the syslog daemon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 9n
.rt  
Verbose. Send output to stdout.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIxx\fR\fR
.ad
.RS 9n
.rt  
Use transport \fIxx\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIyy\fR\fR
.ad
.RS 9n
.rt  
Use transient program# \fIyy\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/nis
.TE

.SH SEE ALSO
.sp
.LP
\fBdig\fR(1M), \fBresolv.conf\fR(4), \fBattributes\fR(5)
