Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/ypset.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH ypset 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypset \- point ypbind at a particular server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ypset\fR [\fB-d\fR \fIypdomain\fR] [\fB-h\fR \fIhost\fR] \fIserver\fR
.fi

.SH DESCRIPTION
.sp
.LP
In order to run \fBypset\fR, \fBypbind\fR must be initiated with the \fB\(miypset\fR or \fB\(miypsetme\fR options. See \fBypbind\fR(1M). \fBypset\fR tells \fBypbind\fR to get NIS services for the specified \fIypdomain\fR from the \fBypserv\fR process running on \fIserver\fR. If \fIserver\fR is down, or is not running \fBypserv\fR, this might not be discovered until an NIS client process tries to obtain a binding for the domain. At this point, the binding set by \fBypset\fR is tested by \fBypbind\fR. If the binding is invalid, \fBypbind\fR attempts to rebind for the same domain.
.sp
.LP
\fBypset\fR is useful for binding a client node that is not on a broadcast net, or is on a broadcast net that is not running an NIS server host. It is also useful for debugging NIS client applications, for instance, where an NIS map exists only at a single NIS server host.
.sp
.LP
Where several hosts on the local net are supplying NIS services, \fBypbind\fR can rebind to another host, even while you attempt to find out if the \fBypset\fR operation succeeded.  For example, if you enter the \fBypset\fR command below, you might get the subsequent response from \fBypwhich\fR:
.sp
.in +2
.nf
example% ypset host1
example% ypwhich
host2
.fi
.in -2
.sp

.sp
.LP
The sequence shown above is a function of the NIS subsystem's attempt to load-balance among the available NIS servers, and occurs when \fBhost1\fR does not respond to \fBypbind\fR because it is not running \fBypserv\fR (or is overloaded), and \fBhost2\fR, running \fBypserv\fR, obtains the binding.
.sp
.LP
\fIserver\fR indicates which NIS server to bind to, and must be specified as a name or an IP address. This works only if the node has a current valid binding for the domain in question and \fBypbind\fR has been set to allow use of \fBypset\fR. In most cases, \fIserver\fR should be specified as an IP address.
.sp
.LP
\fBypset\fR tries to bind over a connectionless transport. The NIS library call, \fByp_all()\fR, uses connection-oriented transport and derives the NIS server's address  based on the connectionless address supplied by \fBypset\fR.
.sp
.LP
Refer to \fBypfiles\fR(4) for an overview of the NIS name service.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fI ypdomain\fR\fR
.ad
.RS 15n
.rt  
Use \fIypdomain\fR, instead of the default domain.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fI host\fR\fR
.ad
.RS 15n
.rt  
Set \fBypbind\fR's binding on \fIhost\fR, instead of locally. Specify \fIhost\fR as a name.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/nis
.TE

.SH SEE ALSO
.sp
.LP
\fBypwhich\fR(1), \fBypfiles\fR(4), \fBattributes\fR(5)
