Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/zonestatd.1m
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved
.TH zonestatd 1M "13 Aug 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
zonestatd \- zones monitoring daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/zones/zonestatd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBzonestatd\fR is a system daemon that is started during system boot. It monitors the utilization of system resources by zones, as well as zone and system configuration information such as \fBpsrset\fR \fBpsets\fR, pool \fBpsets\fR, and resource control settings.
.sp
.LP
This daemon is started automatically by the zone management software and should not be invoked directly. It does not constitute a programming interface; it is classified as a private interface.
.SH SECURITY
.sp
.LP
The \fBzonestat\fR service in the global zone must be online for the \fBzonestat\fR service in each non-global zone (NGZ) to function properly. The \fBzonestat\fR service in each NGZ does not directly read system configuration and utilization data, but rather reads from the \fBzonestat\fR service on the global zone.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/zones
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBprctl\fR(1), \fBsvcs\fR(1), \fBzonestat\fR(1), \fBacctadm\fR(1M), \fBpooladm\fR(1M), \fBpoolcfg\fR(1M), \fBrcapadm\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5), \fBzones\fR(5)
.SH NOTES
.sp
.LP
The \fBzonestat\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/zones-monitoring:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
The \fBzonestat\fR service has the following SMF configuration property:
.sp
.in +2
.nf
config/sample_interval
.fi
.in -2
.sp

.sp
.LP
This property sets the \fBzonestatd\fR sample interval. This is the interval used by the zones monitoring daemon, \fBzonestatd\fR to sample resource utilization. This is also the interval used to determine configuration changes such as processor set changes, resource control changes, and zone state changes.
.sp
.LP
The default interval is 5 seconds.
.sp
.LP
The \fBzonestat\fR service makes use of extended accounting facility. If not already enabled, it enables the tracking of process accounting resources, and configures a process accounting file. The \fBzonestat\fR service will roll the process accounting log at its configured interval (see \fBzonestat\fR(1)).
.sp
.LP
If extended process accounting is enabled externally, the \fBzonestat\fR service will use the process accounting log as configured. It will not roll the accounting log, but will operate correctly if the accounting log is rolled externally.
