Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/zonep2vchk.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved
.TH zonep2vchk 1M "1 Jul 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
zonep2vchk \- check a global zone's configuration for physical to virtual migration into non-global zone
.SH SYNOPSIS
.LP
.nf
\fBzonep2vchk\fR \fB-V\fR
.fi

.LP
.nf
\fBzonep2vchk\fR [\fB-T\fR \fIrelease\fR] \fB-c\fR
.fi

.LP
.nf
\fBzonep2vchk\fR [\fB-T\fR \fIrelease\fR] [\fB-P\fR] [\fB-b\fR] [ \fB-s\fR path[,path...] ] [\fB-S\fR \fIfile\fR]
     [ \fB-r\fR {\fItime\fR}(h|m|s} ] [\fB-x\fR] [\fB-e\fR \fIexecname\fR[,\fIexecname\fR...] ]
     [\fB-E\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBzonep2vchk\fR utility is used to evaluate a global zone's configuration before the process of physical-to-virtual (\fBp2v\fR) migration into a non-global zone.
.sp
.LP
The p2v process involves archiving a global zone (source), and then installing a non-global zone (target) using that archive. See the \fBinstall\fR \fB-a\fR documentation in the \fBsolaris\fR(5) and \fBsolaris10\fR(5) man pages.
.sp
.LP
\fBzonep2vchk\fR serves two functions. First, it can be used to report issues on the source which might prevent a successful \fBp2v\fR migration. Second, it can output a template \fBzonecfg\fR, which can be used to assist in configuring the non-global zone target.
.sp
.LP
\fBzonep2vchk\fR can be executed on a Solaris 10 or later global zone. To execute on Solaris 10, copy the \fBzonep2vchk\fR utility to the Solaris 10 source global zone.
.SH SECURITY
.sp
.LP
The \fBzonep2vchk\fR utility must be run with an effective user id of zero. It interrogates the configuration state of a variety of Solaris subsystems.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
Display the command version and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fIrelease\fR\fR
.ad
.sp .6
.RS 4n
Specify the target release. The defaults are:
.sp
.in +2
.nf
Global Zone         Default Target
Solaris 10          S10
Solaris 11          S11
.fi
.in -2
.sp

Any configuration files generated by \fBzonep2chk\fR will be applicable to the target release. See \fB-c\fR below.
.sp
When run on Solaris 10, a target release of \fBS11\fR can be specified, which will check for \fBp2v\fR into a Solaris 10 Branded zone.
.sp
When the target is S10, it is assumed that a shared stack will be used. Any issues that will require an exclusive IP stack will be reported.
.sp
When the target is S11, it is assumed that an exclusive IP stack will be used.
.sp
If a particular feature in use by the global zone requires a particular patch/update level of the target to function, this information will be printed in the \fBzonep2vchk\fR output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
Generate machine-parseable output. See the section "Parseable Output Format" below.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Display a template zone configuration on stdout in the form of \fBzonecfg\fR(1M) \fBexport\fR output. This configuration will contain resource limits and network configuration based on the source host's physical resources and networking configuration.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
Perform basic checks. This will check the global zone for issues that could prevent a successful \fBp2v\fR. This is the default behavior if none of \fB-b\fR, \fB-c\fR, \fB-s\fR, \fB-S\fR, \fB-r\fR, \fB-x\fR are specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR{\fItime\fR} (h|m|s)\fR
.ad
.sp .6
.RS 4n
Perform runtime checks for the specified duration. This will analyze the currently executing processes in the global zone, and report issues that could prevent successful execution inside a non-global zone. Issues reported reflect actions made by the processes during the time in which \fBzonep2vchk\fR was executing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
Perform runtime checks (as with \fB-r\fR) until \fBSIGINT\fR is received, such as is delivered by \fBCtrl-c\fR from most shells.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIexecname\fR[,\fIexecname\fR...]\fR
.ad
.sp .6
.RS 4n
When performing runtime analysis (\fB-r\fR, \fB-x\fR), limit inspected programs to those matching the specified list of \fIexecname\fRs. The \fIexecname\fR is the name of process, as returned by \fBps\fR \fB-o\fR \fBcomm\fR. It is not necessary for named processes to exist when \fBzonep2vchk\fR is invoked. Any matching processes created while \fBzonep2vchk\fR is running will be inspected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
Similar to \fB-e\fR, but reads the list of \fIexecname\fRs from \fIfile\fR, one per line.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIpath\fR[,\fIpath\fR...]\fR
.ad
.sp .6
.RS 4n
Perform static binary analysis on the files or directories specified. This will inspect ELF binaries for system and library calls that might affect function inside a zone. Directories will be recursed, and non-ELF files will be ignored.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
Similar to \fB-s\fR, but reads the path list from \fIfile\fR, one per line.
.RE

.SH PARSEABLE OUTPUT FORMAT
.sp
.LP
\fBzonep2vchk\fR will ouput a single line of parseable output for each issue detected. The line format is:
.sp
.in +2
.nf
\fIcategory\fR:\fIissue\fR:\fIfield1\fR:[\fIfield2\fR:...]
.fi
.in -2
.sp

.sp
.LP
Each field is delimited by a colon (\fB:\fR).  Colon characters escaped with a backslash (\fB\:\fR) should not be treated as field delimiters.
.sp
.LP
Multiple instances of the same issue can be reported, each with fields describing the particular instance of the issue.
.sp
.LP
Below the existing categories and issues are defined. Future versions of \fBzonep2vchk\fR might include additional categories and issues. Existing issues might have new fields added after the existing fields for existing issues.
.SS "\fBheader\fR Category"
.sp
.LP
The \fBheader\fR category lists information about the source, target, and \fBzonep2vchk\fR version. The issues in this category are:
.sp
.ne 2
.mk
.na
\fB\fBversion\fR\fR
.ad
.sp .6
.RS 4n
The version of the \fBzonep2vchk\fR command.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The version of the \fBzonep2vchk\fR command.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsource\fR\fR
.ad
.sp .6
.RS 4n
Information about the source system.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The nodename of the source system.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
The /etc/release version of the source system.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField3\fR:\fR
.ad
.RS 11n
.rt  
The kernel version of the source system.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField4\fR:\fR
.ad
.RS 11n
.rt  
The platform of the source system.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR\fR
.ad
.sp .6
.RS 4n
Information about the specified target of the \fBp2v\fR check.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The Solaris version of the target.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
The brand type that would be used on the target.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField3\fR:\fR
.ad
.RS 11n
.rt  
The ip-type of the expected zone on the target.
.RE

.RE

.SS "\fBfooter\fR Category"
.sp
.LP
The \fBfooter\fR category lists final summary information. The issues in this category are:
.sp
.ne 2
.mk
.na
\fB\fBissues\fR\fR
.ad
.sp .6
.RS 4n
A summary of the number of issues found.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The number of issues detected.
.RE

.RE

.SS "\fBincompatible\fR Category"
.sp
.LP
The \fBincompatible\fR category represents issues that will not function in a non-global zone. The issues in this category are:
.sp
.ne 2
.mk
.na
\fB\fBetcsystem\fR\fR
.ad
.sp .6
.RS 4n
An \fB/etc/system\fR tunable exists. These tunables do not function inside a zone. The \fB/etc/system\fR tunable can be transferred to the target global zone, but it will affect the entire system, including all zones and the global zone. If there is an alternate tunable that can be configured from within the zone, this tunable is described.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.sp .6
.RS 4n
The \fB/etc/system\fR tunable setting.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.sp .6
.RS 4n
One of:
.sp
.ne 2
.mk
.na
\fB\fBnoalternate\fR\fR
.ad
.RS 15n
.rt  
There is no alternate tunable from within a non-global zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fBobsolete\fR\fR
.ad
.RS 15n
.rt  
The tunable is obsolete on the target. It no longer serves any function.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreplaced\fR\fR
.ad
.RS 15n
.rt  
The tunable has been replaced on the target. The replacement is configured in the global zone, and described by fields 3 and 4.
.RE

.sp
.ne 2
.mk
.na
\fB\fBalternate\fR\fR
.ad
.RS 15n
.rt  
An alternate tunable exists. This tunable can be configured from within a non-global zone. The tunable is described by fields 3 and 4.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoinfo\fR\fR
.ad
.RS 15n
.rt  
\fBzonep2vchk\fR is not knowledgeable of the tunable. Tunable likely has no alternate inside a zone.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIField3\fR:\fR
.ad
.sp .6
.RS 4n
Type of alternate/replacement tunable.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField4\fR:\fR
.ad
.sp .6
.RS 4n
Description of alternate/replacement tunable.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBbe\fR\fR
.ad
.sp .6
.RS 4n
More than one boot environment exists. Only the active boot environment will be transferable to the non-global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The name of the non-active boot environment.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBunsupported\fR\fR
.ad
.sp .6
.RS 4n
A feature is enabled that will not function in a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR: \fBmobileip\fR\fR
.ad
.RS 20n
.rt  
The mobile IP agent, which does not function in a zone, is configured. See \fBmipagent\fR(1M) for details.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBnfs\fR (S10 sources only)\fR
.ad
.sp .6
.RS 4n
The system is sharing a filesystem by means of NFS. Native zones on Solaris 10 and Solaris 10 zones on Solaris 11 cannot share by means of NFS.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of file system being shared.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsmb\fR\fR
.ad
.sp .6
.RS 4n
The system is sharing a filesystem by means of in-kernel \fBsmb/cifs\fR. Zones cannot share filesystems by means of SMB.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of file system being shared.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBpkg\fR\fR
.ad
.sp .6
.RS 4n
A package delivering software known not to work in a zone is installed.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the package.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBiscsi-target\fR\fR
.ad
.sp .6
.RS 4n
The system is exporting an ISCSI target. Zones cannot export iSCSI targets.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the iSCSI target.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBfcoe-target\fR\fR
.ad
.sp .6
.RS 4n
The system has configured an FCOE target. Zones cannot configure FCOE targets.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Ethernet device used.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
WWN of the FCOE target.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBfc-target\fR\fR
.ad
.sp .6
.RS 4n
The system has configured an Fiberchannel target. Zones cannot configure Fiberchannel targets.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
WWN of the Fiberchannel target.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBnpiv\fR\fR
.ad
.sp .6
.RS 4n
The system has configured a virtual NPIV HBA. Zones cannot configure virtual HBAs.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Physical WWN hosting the virtual HBA.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Virtual WWN.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBscsi\fR\fR
.ad
.sp .6
.RS 4n
The system has configured an SCSI block device. Zones cannot configure scsi block devices.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Object configured as a SCSI device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsvcnotallowed\fR\fR
.ad
.sp .6
.RS 4n
A service is enabled that will not function in a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the service.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBresourcepool\fR\fR
.ad
.sp .6
.RS 4n
A Solaris resource pool is configured. Zones cannot configure resource pools.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the pool.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBpset\fR\fR
.ad
.sp .6
.RS 4n
A processor set is configured. Zones cannot configure processor sets.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Processor set ID.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
List of CPU IDs in the processor set.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzones\fR\fR
.ad
.sp .6
.RS 4n
Zones are configured. A zone cannot host zones. Any zones will not exist in the target non-global zone after \fBp2v\fR. Zones can be migrated separately using the \fBdetach\fR/\fBattach\fR features in \fBzoneadm\fR(1M).
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
State of the zone.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBlofi\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A lofi device is configured. A zone cannot configure lofi devices.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the lofi device.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Path of the file backing the device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsyscall\fR (generated by \fB-s\fR and \fB-f\fR)\fR
.ad
.sp .6
.RS 4n
A binary makes a system or library call that cannot be made from a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the the binary file.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the system or library call.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsyscallargs\fR (generated by \fB-s\fR and \fB-f\fR)\fR
.ad
.sp .6
.RS 4n
A binary makes a system or library call that cannot be made from a zone if called with certain arguments.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the system or library call.
.RE

See regular output (no \fB-P\fR) for details on disallowed arguments.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlib\fR (generated by \fB-s\fR and \fB-f\fR)\fR
.ad
.sp .6
.RS 4n
A binary links with a library that cannot be used inside a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the binary file.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the disallowed library.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBprivnotallowed\fR (generated by \fB-r\fR and \fB-x\fR)\fR
.ad
.sp .6
.RS 4n
A privilege is used by a process that cannot be added to a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the privilege.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdevnotallowed\fR (generated by \fB-r\fR and \fB-x\fR)\fR
.ad
.sp .6
.RS 4n
A device is opened by a process that cannot be added to a zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the device.
.RE

.RE

.SS "\fBconfiguration\fR Category"
.sp
.LP
The \fBconfiguration\fR category represents issues that will require a configuration setting to allow the issue to function inside the non-global zone. This could be a \fBzonecfg\fR(1M) configuration setting, a configuration change in the global zone, or both.
.sp
.LP
The issues in this category are:
.sp
.ne 2
.mk
.na
\fB\fBdatalink\fR\fR
.ad
.sp .6
.RS 4n
A datalink feature is configured that cannot be configured from within a zone. The datalink feature must be configured in the global zone, and if necessary, delegated to the zone using \fBzonecfg add anet\fR (Solaris 11 only) or \fBzonecfg add net\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the datalink feature. One of:
.sp
.ne 2
.mk
.na
\fB\fBaggr\fR\fR
.ad
.RS 13n
.rt  
Aggregation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBibiface\fR\fR
.ad
.RS 13n
.rt  
Infiniband interface.
.RE

.sp
.ne 2
.mk
.na
\fB\fBibpart\fR\fR
.ad
.RS 13n
.rt  
Infiniband partition.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic\fR\fR
.ad
.RS 13n
.rt  
Virtual NIC.
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.RS 13n
.rt  
Ethernet stub.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.RS 13n
.rt  
A bridge instance.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecobj\fR\fR
.ad
.RS 13n
.rt  
A wireless WPA or WEB security object.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Datalink object name.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdhcp-server\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
The host is a DHCP server. To provide DHCP service, a zone must have \fBip-type=exclusive\fR, or have the the privilege \fBnet_rawaccess\fR and the device \fB/dev/ip\fR. Note that this will allow a shared stack zone to read and write raw IP packets on the network, similar to an exclusive stack zone or global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
FMRI of the DHCP server service.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBntp-client\fR\fR
.ad
.sp .6
.RS 4n
An NTP client service is enabled. This service updates the system clock. Since all zones share the same system clock, this service is disabled automatically during \fBp2v\fR. If it is desired that the zone update the system clock on the target host, the zone will need the privilege \fBsys_time\fR, and the service will need to be enabled inside the zone after \fBp2v\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
FMRI of the client service.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdriverconf\fR\fR
.ad
.sp .6
.RS 4n
A networking device contains configuration settings in its \fB\&.conf\fR file. Zones cannot configure drivers. The driver must be configured in the global zone. Some network driver settings might be configurable using \fBdladm\fR(1M) instead of editing a driver configuration file.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of the configuration file.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBifname\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
An existing configuration file will be impacted by the change of a network device name. For example, an \fB/etc/hostname.bge0\fR file will be impacted if the network device given to the target non-global zone is not \fBbge0\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of the impacted file.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBiscsi-initiator\fR\fR
.ad
.sp .6
.RS 4n
The system is accessing an iSCSI target as a client. Zones cannot access iSCSI targets. The global zone must be the iSCSI initiator.  The device can then be added to the zone using \fBzonecfg add device\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
iSCSI target being accessed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBfcoe-initiator\fR\fR
.ad
.sp .6
.RS 4n
The system has an FCOE initiator configured. A zone cannot configure an FCOE initiator. The global zone must configure the  FCOE initiator, and make the SCSI target devices available to the zone using \fBzonecfg add fs\fR or \fBzonecfg add device\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Ethernet network device.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
WWN of the initiator.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBfc-initiator\fR\fR
.ad
.sp .6
.RS 4n
The system has an HBA Fiberchannel port online. A zone cannot access a Fiberchannel target. The target must be accessed from the global zone and made available to the zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Fiberchannel HBA port WWN.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBlinkprop\fR\fR
.ad
.sp .6
.RS 4n
Datalink properties are configured. A zone cannot configure datalink properties. They must be configured from the global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the datalink.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Property name
.RE

.sp
.ne 2
.mk
.na
\fB\fIField3\fR:\fR
.ad
.RS 11n
.rt  
Property value.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBndd\fR\fR
.ad
.sp .6
.RS 4n
Tunables that cannot be configured by a zone have been configured using \fBndd\fR. These tunables must be configured from the global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
File or script setting the tunable.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Driver being tuned.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField3\fR:\fR
.ad
.RS 11n
.rt  
Tunable parameter.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdynaddr\fR\fR
.ad
.sp .6
.RS 4n
One or more dynamically assigned IP addresses are configured on a network interface. These addresses are not supported with shared-IP zones. These IP addresses could change as a result of MAC address changes. You may need to modify this system's address information on the DHCP server and on the DNS, LDAP, or NIS name servers.
.sp
\fIField1\fR can be one of:
.sp
.ne 2
.mk
.na
\fB\fBdhcp\fR\fR
.ad
.sp .6
.RS 4n
Configured DHCP address. In this case, \fIField2\fR is the name of the interface configured for DHCP.
.RE

.sp
.ne 2
.mk
.na
\fB\fBv6autoconf\fR\fR
.ad
.sp .6
.RS 4n
IPv6 stateless address configuration is enabled. In this case, \fIField2\fR is the name of the interface with IPv6 auto configuration.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrarp\fR (Solaris 10 source only)\fR
.ad
.sp .6
.RS 4n
Reverse ARP assigned address is enabled. In this case, \fIField2\fR is the name of the interface with reverse ARP enabled.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBpatch\fR (Solaris 10 source with Solaris 11+ target only)\fR
.ad
.sp .6
.RS 4n
A patch is required before \fBp2v\fR into a non-global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The patch required.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBphysif\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A physical interface exists on the source system that will have to be replaced with a dedicated physical or VLAN interface on the destination system if migrating to an exclusive-IP zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the interface on the source system.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsched\fR\fR
.ad
.sp .6
.RS 4n
The system is configured with a default scheduling class. The default scheduling class of a non-global zone can be configured using the \fBzonecfg set scheduler\fR property. This will be provided in the \fB-c\fR output.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
The configured default scheduling class.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsharedip\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
If migrating to a shared-IP zone, the following networking features will need to be configured from the global zone on behalf of the zone.
.sp
\fIField1\fR can be one of:
.sp
.ne 2
.mk
.na
\fB\fBipmpgroup\fR\fR
.ad
.RS 16n
.rt  
An IPMP group is configured. If IPMP is required, it must be configured from the global zone. In this case, \fIField2\fR is the IPMP group name.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvni\fR\fR
.ad
.RS 16n
.rt  
A virtual network interface is configured. These must be configured from the global zone. In this case, \fIField2\fR is the VNI interface name.
.RE

.sp
.ne 2
.mk
.na
\fB\fBv4forwarding\fR\fR
.ad
.br
.na
\fB\fBv6forwarding\fR\fR
.ad
.RS 16n
.rt  
IP forwarding (v4 or v6) is configured on an interface. In this case, \fIField2\fR is the interface with IP forwarding configured.
.RE

.sp
.ne 2
.mk
.na
\fB\fBstaticroute\fR\fR
.ad
.RS 16n
.rt  
Static routes are configured. Static routes must be configured from the global zone.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBexclusiveonly\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A networking feature is configured that is not supported for use with shared-IP zones. The feature will work without modification in exclusive-IP zones.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
.sp
.ne 2
.mk
.na
\fB\fBiptun\fR\fR
.ad
.RS 9n
.rt  
A IPv4, IPv6, or 6to4 tunnel interface has been plumbed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the tunnel interface.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsharedonly\fR\fR
.ad
.sp .6
.RS 4n
A networking feature is configured that is not supported in an exclusive-IP zone. When migrating to a shared-IP zone, the feature must be configured in the global zone to support communication.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
.sp
.ne 2
.mk
.na
\fB\fBcgtp\fR\fR
.ad
.RS 8n
.rt  
A Carrier Grade Transport Protocol interface has been plumbed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the CGTP interface.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBnetdevalloc\fR\fR
.ad
.sp .6
.RS 4n
A networking feature requires its underlying device be allocated to the zone with the zonecfg(1M) add device command. This feature is not supported with shared-IP zones.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Can be :
.sp
.ne 2
.mk
.na
\fB\fBppp\fR\fR
.ad
.RS 7n
.rt  
Point-to-Point Protocol (PPP). PPP configuration files exist under \fB/etc/ppp\fR. The underlying device that needs to be allocated to the zone is either a serial port or, in the case of \fBpppoe\fR, an Ethernet physical or VNIC interface.
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsvcexlip\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A service is enabled that will require an exclusive-IP zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the service FMRI.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsvcpriv\fR\fR
.ad
.sp .6
.RS 4n
A service is enabled that will require additional privileges be added to the zone using the \fBzonecfg\fR(1M) \fBlimitpriv\fR property.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
FMRI of the service.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
List of the privileges required by the service.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsvm\fR\fR
.ad
.sp .6
.RS 4n
A Solaris Volume Manager metadevice is configured. Metadevices must be configured in the global zone, and made available to the non-global zone using \fBzonecfg\fR(1M) \fBadd device\fR, \fBadd fs\fR, or \fBadd dataset\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the metadevice.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBramdisk\fR\fR
.ad
.sp .6
.RS 4n
A ramdisk device is configured. A zone cannot configure ramdisk devices.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Ramdisk device path.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBvfstab\fR\fR
.ad
.sp .6
.RS 4n
A filesystem mount is configured by means of \fB/etc/vfstab\fR. The filesystem must be migrated to the target global zone and made available to the non-global zone.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Device being mounted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Mountpoint.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool\fR\fR
.ad
.sp .6
.RS 4n
The system has additional zpools configured. These zpools must be migrated to the target global zone, and made available to the zone using \fBzonecfg add dataset\fR or \fBzonecfg add fs\fR.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the pool.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBprivexclip\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A process used a privilege that requires and exclusive-IP stack. See \fBzonecfg\fR(1M) for a description of the \fBip-type\fR property.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Privilege used.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdevexclip\fR (Solaris 10 targets only)\fR
.ad
.sp .6
.RS 4n
A process opened a device that requires an exclusive IP stack. See \fBzonecfg\fR(1M) for a description of the \fBip-type\fR property.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBprivoptional\fR\fR
.ad
.sp .6
.RS 4n
A process used a privilege that requires additional privilege be added to the target non-global zone.  See \fBzonecfg\fR(1M) for a description of the \fBlimitpriv\fR property.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Privilege used.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdevoptional\fR\fR
.ad
.sp .6
.RS 4n
A process opened a device that is not available in a zone by default. See \fBzonecfg\fR(1M) for a description of the \fBadd device\fR resource.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Name of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Path of the device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsyscallpriv\fR (generated by \fB-s\fR and \fB-f\fR)\fR
.ad
.sp .6
.RS 4n
A binary makes a system or library call that might require additional privilege be added to the target non-global zone. See \fBzonecfg\fR(1M) for a description of the \fBlimitpriv\fR property. See the non-parseable output for details concerning the system or library call.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of the binary
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the system call.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsyscallexclip\fR (generated by \fB-s\fR and \fB-f\fR)\fR
.ad
.sp .6
.RS 4n
A binary makes a system or library call that might require an exclusive-ip stack. See \fBzonecfg\fR(1M) for a description of the \fBip-type\fR property. See the non-parseable output for details concerning the system or library call.
.sp
.ne 2
.mk
.na
\fB\fIField1\fR:\fR
.ad
.RS 11n
.rt  
Path of the binary
.RE

.sp
.ne 2
.mk
.na
\fB\fIField2\fR:\fR
.ad
.RS 11n
.rt  
Name of the system call.
.RE

.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRPerforming Static Binary Analysis
.sp
.LP
The following command performs static analysis on all ELF binaries in two application directory trees:

.sp
.in +2
.nf
# \fBzonep2vchk -s /opt/myapplication,/usr/local\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRGenerating a Template for the Target Zone
.sp
.LP
The following command will generate a template zone configuration for Solaris 11 when run on a Solaris 10 global zone.

.sp
.in +2
.nf
# \fBzonep2vchk T S11 -c\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRAnalyzing Running Applications for a Period
.sp
.LP
The following command will analyze the process named \fBmyapplication\fR for one hour and report any activity that might not function in a zone.

.sp
.in +2
.nf
# \fBzonep2vchk -s 1h -e myapplication\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRPerforming Basic Checks
.sp
.LP
The following command will analyze the global zone for configuration and Solaris features in use that might not function in a zone. Each discovered issue will be reported as a single line of parseable output.

.sp
.in +2
.nf
# \fBzonep2vchk  -bP\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion, no issues detected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
An internal error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Invalid usage.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.sp .6
.RS 4n
One or more issues were detected.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/zones
_
Interface StabilitySee below
.TE

.sp
.LP
Command invocation and parseable output is Committed.  Human readable output (default output) is Uncommitted.
.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBmipagent\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBsolaris\fR(5), \fBsolaris10\fR(5), \fBzones\fR(5)
.SH NOTES
.sp
.LP
The static (\fB-s\fR and \fB-f\fR) checks make use of the \fBelfdump\fR(1) utility, which is delivered by the following package:
.sp
.ne 2
.mk
.na
\fBSolaris 11\fR
.ad
.RS 14n
.rt  
\fBdeveloper/base-developer-utilities\fR
.RE

.sp
.ne 2
.mk
.na
\fBSolaris 10\fR
.ad
.RS 14n
.rt  
\fBSUNWbtool\fR
.RE

.sp
.LP
The runtime (\fB-r\fR) checks make use of the \fBdtrace\fR(1M) utility, which is delivered by the following package:
.sp
.ne 2
.mk
.na
\fBSolaris 11\fR
.ad
.RS 14n
.rt  
\fBsystem/dtrace\fR
.RE

.sp
.ne 2
.mk
.na
\fBSolaris 10\fR
.ad
.RS 14n
.rt  
\fBSUNWdtrc\fR
.RE

