Arquivotheca/solaris11/usr/man/man/usr/share/man/man1m/zoneadmd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH zoneadmd 1M "1 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
zoneadmd \- zone administration daemon 
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/zones/zoneadmd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBzoneadmd\fR is a system daemon that is started when the system needs to manage a particular zone. Because each instance of the \fBzoneadmd\fR daemon manages a particular zone, it is not unexpected to see multiple \fBzoneadmd\fR daemons running.
.sp
.LP
This daemon is started automatically by the zone management software and should not be invoked directly. The daemon shuts down automatically when no longer in use. It does not constitute a programming interface, but is classified as a private interface.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/zones
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBzlogin\fR(1), \fBsvcadm\fR(1M), \fBzoneadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5), \fBzones\fR(5)
.SH NOTES
.sp
.LP
The \fBzones\fR(5) service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/zones:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
