Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/acpihpd.1m
'\" te
.\" Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
.TH acpihpd 1M "2010 年 3 月 29 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
acpihpd \- ACPI ホットプラグデーモン
.SH 形式
.LP
.nf
\fB/usr/platform/i86pc/lib/acpihpd\fR
.fi

.SH 機能説明
.sp
.LP
ACPI ホットプラグデーモン \fBacpihpd\fR は、 x86 プラットフォームで実行されるデーモンプロセスです。デーモンは、サービス管理機能によって開始されます。\fBsyseventd\fR(1M) および \fBcfgadm\fR(1M) サブシステムと通信して、ホットプラグ対応のデバイスから ACPI イベントを処理します。
.sp
.LP
\fBacpihpd\fR 用のサービス FMRI は次のとおりです。
.sp
.in +2
.nf
svc:/platform/i86pc/acpihpd:default
.fi
.in -2
.sp

.sp
.LP
\fBacpihpd\fR は非公開インタフェースであることに注意してください。
.SH オプション
.sp
.LP
\fBacpihpd\fR デーモンでは、どのオプションもサポートされていません。
.SH エラー
.sp
.LP
\fBacpihpd\fR は \fBsyslog\fR(3C) を使用して、ステータスおよびエラーメッセージを報告します。すべてのメッセージは、\fBLOG_DAEMON\fR 機能を使用して記録されます。
.sp
.LP
エラーメッセージは \fBLOG_ERR\fR および \fBLOG_NOTICE\fR 優先順位を使用して記録され、情報メッセージは \fBLOG_DEBUG\fR 優先順位を使用して記録されます。\fB/etc/syslog.conf\fR ファイルのデフォルトエントリでは、すべてのエラーメッセージが \fB/var/adm/messages\fR ログに記録されます。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件T{
system/kernel/dynamic-reconfiguration/i86pc
T}
_
インタフェースの安定性非公開
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBcfgadm\fR(1M), \fBinetadm\fR(1M), \fBsvcadm\fR(1M), \fBsyseventd\fR(1M), \fBsyslog\fR(3C), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBacpihpd\fR サービスは、サービス管理機能 \fBsmf\fR(5) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/platform/i86pc/acpihpd:default
.fi
.in -2
.sp

