Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/lms.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.TH lms 1M "2009 年 3 月 3 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
lms \- アプリケーションに Intel AMT (Active Management Technology) へのアクセスを許可する
.SH 形式
.LP
.nf
\fBlms\fR
.fi

.SH 機能説明
.sp
.LP
\fBlms\fR (Local Manageability Service、LMS) を使用すると、アプリケーションがローカル HECI インタフェースを使用して Intel AMT (Intel Active Management Technology) ME (Management Engine) にアクセス可能になります。LMS は HECI ドライバに依存しています。
.sp
.LP
\fBlms\fR を使用するには、Intel AMT Manageability Interface ドライバがインストール済みであり、かつ ME に接続済みであることを確認してください。
.sp
.LP
\fBlms\fR は、デーモンとして実行するように設計されています。このサービスからのメッセージは、\fBsyslog\fR に送信されます。LMS メッセージには、「\fBLMS\fR」がソースであることを示すマークが付けられます。 
.sp
.LP
SMF を使用して LMS サービスを有効にする方法については、「使用例」を参照してください。\fB\fR
.SH 使用例
.LP
\fB例 1 \fRSMF を使用して LMS サービスを有効にする
.sp
.LP
次の例では、SMF を使用して LMS サービスを有効にします。

.sp
.in +2
.nf
svcadm enable network/lms
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
アーキテクチャx86
_
使用条件system/management/intel-amt
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBattributes\fR(5), \fBsmf\fR(5)
