Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfscmp.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscmp 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfscmp \- 2 つの NTFS ファイルシステムの比較と相違点の報告
.SH 形式
.LP
.nf
\fBntfscmp\fR [\fIoptions\fR] \fIdevice1\fR \fIdevice2\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfscmp\fR ユーティリティーは、2 つの NTFS ファイルシステムのあらゆる側面を比較して、見つかったすべての相違点を報告します。ファイルシステムは、ブロックデバイスまたはイメージファイル上のものにできます。\fBntfscmp\fR はボリューム検証に使用できます。ただし、その主な目的は、効率的な開発ツールとして、NTFS に行われたメタデータ変更を迅速に検出し、特定して、その妥当性を調べることです。
.sp
.LP
NTFS メタデータの変更にのみ関心がある場合は、\fBntfsclone\fR(1M) の \fB--metadata\fR オプションを使用して作成したメタデータイメージを比較すると便利です。このようにすると、通常は確認する必要がないタイムスタンプの変更を除外できます。
.sp
.LP
\fBntfscmp\fR の出力は簡潔ですが、相違点を正確に判断するための情報としては十分です。\fBdiff\fR(1) を使用して、報告された i ノードごとに \fBntfsinfo\fR(1M) の詳細な出力を比較すれば、より豊富な出力が得られます。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。オプションには、単一文字と完全名の両方の形式があります。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
ヘルプを表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--no-progress-bar\fR\fR
.ad
.sp .6
.RS 4n
進捗状況を表示しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.SH 終了ステータス
.sp
.LP
終了コードは成功した場合は \fB0\fR に、失敗した場合には 0 以外になります。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBdiff\fR(1), \fBntfscat\fR(1M), \fBntfsclone\fR(1M), \fBntfsinfo\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfscmp\fR は、Szabolcs Szakacsits が作成しました。
