Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfsprogs.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsprogs 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfsprogs \- NTFS ツールのリスト
.SH 形式
.LP
.nf
\fBntfsprogs\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfsprogs\fR とは、共有ライブラリに基づいた NTFS ユーティリティースイートの名前です。これらのツールは無料で利用でき、完全なソースコードが付属しています。次にこれらのツールを示します。
.sp
.ne 2
.mk
.na
\fB\fBmkntfs\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS ファイルシステムを作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscat\fR(1M)\fR
.ad
.sp .6
.RS 4n
ファイルの内容を標準出力にダンプします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsclone\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS のクローン作成、バックアップ作成、復元、またはレスキューを効率的に行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscluster\fR(1M)\fR
.ad
.sp .6
.RS 4n
指定したセクターまたはクラスタを使用するファイルを見つけます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscmp\fR(1M)\fR
.ad
.sp .6
.RS 4n
2 つの NTFS ファイルシステムを比較して、相違点を報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfscp\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS ボリュームにファイルをコピーします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsfix\fR(1M)\fR
.ad
.sp .6
.RS 4n
一般的なエラーのいくつかを調べて修復し、ログファイルをクリアし、オペレーティングシステムが次回起動したときに徹底的に検査します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsinfo\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS に関する情報や、その中にあるいずれかのファイルまたはディレクトリに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfslabel\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS ファイルシステムのボリュームラベルを表示または設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsls\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS に存在するディレクトリ内のファイルに関する情報を一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsmount(1M)\fR (SunOS のマニュアルページではありません)\fR
.ad
.sp .6
.RS 4n
NTFS ユーザー空間ドライバを読み書きします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsresize\fR(1M)\fR
.ad
.sp .6
.RS 4n
データを失うことなく NTFS のサイズを変更します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntfsundelete\fR(1M)\fR
.ad
.sp .6
.RS 4n
NTFS から削除したファイルを回復します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
これらのツールは、Anton Altaparmakov、Carmelo Kintana、Cristian Klein、Erik Sornes、Giang Nguyen、Holger Ohmacht、Lode Leroy、Matthew J. Fanto、Per Olofsson、Richard Russon、Szabolcs Szakacsits、Yura Pakhuchiy、および Yuval Fledel が作成しました。
