Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfscp.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscp 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfscp \- NTFS ボリュームへのファイルのコピー
.SH 形式
.LP
.nf
\fBntfscp\fR  [\fIoptions\fR] \fIdevice\fR \fIsource_file\fR \fIdestination\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfscp\fR ユーティリティーは、ファイルを NTFS ボリュームにコピーします。\fIdestination\fR (「形式」を参照) は、ファイルにすることもディレクトリにすることもできます。\fIdestination\fR は名前で指定されたディレクトリであり、\fIsource_file\fR はこのディレクトリにコピーされます。\fIdestination\fR が i ノード番号で指定されたディレクトリである場合は、この i ノードに対して名前のないデータ属性が作成され、そこに \fIsource_file\fR がコピーされます。i ノード番号でディレクトリを指定する前に、マイナスの結果になる可能性も考慮してください。通常、名前のないデータストリームはディレクトリに存在しません。
.SS "データストリーム"
.sp
.LP
NTFS のすべてのデータはストリームに保存され、ストリームには名前を付けられます。1 つのファイルに複数のデータストリームを格納できますが、名前のないストリームが正確に 1 つ必要になります。ファイルのサイズは、その名前のないデータストリームのサイズになります。通常、ストリーム名を指定しない場合、名前のないデータストリームにアクセスすることになります。名前のあるデータストリームにアクセスする場合は、\fB:\fR\fIstream_name\fR をファイル名に追加する必要があります。たとえば、\fBsome.mp3:artist\fR を開くと、\fBsome.mp3\fR 内の \fBartist\fR ストリームが開かれます。名前が付けられているデータストリームへのアクセスを禁止しているオペレーティングシステム (Windows など) でこれらのストリームにアクセスするには、\fBFAR\fR などのプログラムや、\fBcygwin\fR のユーティリティーを使用する必要があります。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。ほとんどのオプションには、単一文字と完全名の両方の形式があります。引数を取らない単一文字オプションは複数を組み合わせることができます。たとえば、\fB-fv\fR は \fB-f\fR \fB-v\fR と同等です。完全名のオプションは、その名前の一意の接頭辞に短縮できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR、\fB--attribute\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
\fInum\fR で指定された属性に書き込みます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
マウントされたボリュームを扱わないなど、一部の妥当なデフォルト値を無効にします。このオプションは慎重に使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
それぞれの簡単な説明が付いたオプションのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--inode\fR\fR
.ad
.sp .6
.RS 4n
\fIdestination\fR (「形式」を参照) を i ノード番号として扱います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR、\fB--attr-name\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
この名前を持つ属性に書き込みます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR、\fB--no-action\fR\fR
.ad
.sp .6
.RS 4n
実際のコピー操作を行う前にテストを実行する場合に、このオプションを使用します。ボリュームは読み取り専用で開かれ、書き込みは行われません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
一部のデバッグ、警告、およびエラーメッセージを抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号、著作権、およびライセンス情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.SH 使用例
.LP
\fB例 1 \fRホームからルートディレクトリにコピーする
.sp
.LP
次のコマンドは、\fBnew_boot.ini\fR を \fBboot.ini\fR として、\fB/home/user\fR から \fB/dev/dsk/c0d0p1\fR の NTFS ボリュームのルートにコピーします。

.sp
.in +2
.nf
# \fBntfscp /dev/dsk/c0d0p1 /home/user/new_boot.ini boot.ini\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRストリームをコピーする
.sp
.LP
次のコマンドは、\fBmyfile\fR を \fBC:\some\path\myfile:stream\fR (指定された \fB/dev/dsk/c0d0p1\fR ドライブ指示子は \fBC\fR と想定) にコピーします。

.sp
.in +2
.nf
# \fBntfscp -N stream /dev/dsk/c0d0p1 myfile /some/path\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBntfsresize\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfscp\fR は、Anton Altaparmakov と Hil Liao の協力の下、Yura Pakhuchiy が作成しました。
