Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfsfix.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsfix 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfsfix \- 一般的なエラーの修復と、オペレーティングシステムでの NTFS の検査の強制
.SH 形式
.LP
.nf
\fBntfsfix\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfsfix\fR ユーティリティーは、一般的な NTFS 問題のいくつかを修復します。\fBchkdsk\fR の一バージョンではありません。根本的な NTFS の不一致のいくつかを修復し、NTFS ジャーナルファイルをリセットし、オペレーティングシステムが次回リブートしたときに NTFS の整合性検査を行うようにスケジュールを設定します。
.sp
.LP
NTFS ボリュームがオペレーティングシステムまたは何らかのほかの原因によって損傷を受けた可能性があり、マウントできない場合は、そのボリュームで \fBntfsfix\fR を実行します。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
それぞれの簡単な説明が付いたオプションのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号、著作権、およびライセンス情報を表示します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBmkntfs\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfsfix\fR は、Szabolcs Szakacsits の協力の下、Anton Altaparmakov が作成しました。
