Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfsinfo.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsinfo 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfsinfo \- ファイルの属性のダンプ
.SH 形式
.LP
.nf
\fBntfsinfo\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfsinfo\fR ユーティリティーは、i ノード \fIinode-number\fR またはファイル \fIpath-filename\fR の属性や、MFT に関する情報 (\fB-m\fR オプション) をダンプします。オプションの全リストを表示するには、引数を付けずに、\fBntfsinfo\fR を実行します。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。ほとんどのオプションには、単一文字と完全名の両方の形式があります。引数を取らない単一文字オプションは複数を組み合わせることができます。たとえば、\fB-fv\fR は \fB-f\fR \fB-v\fR と同等です。完全名のオプションは、その名前の一意の接頭辞に短縮できます。
.sp
.ne 2
.mk
.na
\fB\fB-F\fR、\fB--file\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
\fIfile\fR に関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
既存のファイルを上書きしないなど、一部の妥当なデフォルト値をオーバーライドします。このオプションは慎重に使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
それぞれの簡単な説明が付いたオプションのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--inode\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
\fInum\fR で識別された i ノードに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR、\fB--mft\fR\fR
.ad
.sp .6
.RS 4n
ボリュームに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
一部のデバッグ、警告、およびエラーメッセージを抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--notime\fR\fR
.ad
.sp .6
.RS 4n
出力にタイムスタンプを表示しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号、著作権、およびライセンス情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBntfsprogs\fR(1M), \fBntfsundelete\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfsinfo\fR は、Matthew J. Fanto、Anton Altaparmakov、Richard Russon、Szabolcs Szakacsits、Yuval Fledel、Yura Pakhuchiy、および Cristian Klein が作成しました。
