Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfscat.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscat 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfscat \- NTFS ファイルとストリームの標準出力への表示
.SH 形式
.LP
.nf
\fBntfscat\fR [\fIoptions\fR] \fIdevice\fR [\fIfile\fR]
.fi

.SH 機能説明
.sp
.LP
\fBntfscat\fR コマンドは、ファイルまたはストリームを NTFS ボリュームから読み取り、その内容を標準出力に表示します。
.sp
.LP
\fBntfscat\fR に渡されるファイル名では、大文字と小文字は区別されません。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。ほとんどのオプションには、単一文字と完全名の両方の形式があります。引数を取らない単一文字オプションは複数を組み合わせることができます。たとえば、\fB-fv\fR は \fB-f\fR \fB-v\fR と同等です。完全名のオプションは、その名前の一意の接頭辞に短縮できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR、\fB--attribute\fR \fItype\fR\fR
.ad
.sp .6
.RS 4n
特定の属性タイプの内容を表示します。デフォルトでは、名前のない \fB$DATA\fR 属性が表示されます。この属性は、10 進数、16 進数、または名前で指定できます。
.sp
.in +2
.nf
Hex     Decimal Name
0x10    16      "$STANDARD_INFORMATION"
0x20    32      "$ATTRIBUTE_LIST"
0x30    48      "$FILE_NAME"
0x40    64      "$OBJECT_ID"
0x50    80      "$SECURITY_DESCRIPTOR"
0x60    96      "$VOLUME_NAME"
0x70    112     "$VOLUME_INFORMATION"
0x80    128     "$DATA"
0x90    144     "$INDEX_ROOT"
0xA0    160     "$INDEX_ALLOCATION"
0xB0    176     "$BITMAP"
0xC0    192     "$REPARSE_POINT"
0xD0    208     "$EA_INFORMATION"
0xE0    224     "$EA"
0xF0    240     "$PROPERTY_SET"
0x100   256     "$LOGGED_UTILITY_STREAM"
.fi
.in -2
.sp

属性名は、先頭のドル記号 (\fB$\fR) なしで指定できます。\fB$\fR 記号を使用する場合は、シェルにより名前が解釈されないように、名前を引用符で囲む必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
マウントされたボリュームを使用しないなど、一部の妥当なデフォルト値を無効にします。このオプションは慎重に使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
それぞれの簡単な説明が付いたオプションのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--inode\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
名前の代わりに i ノード番号を使ってファイルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR、\fB--attribute-name\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
\fIname\fR で識別される属性を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
一部のデバッグ、警告、およびエラーメッセージを抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号、著作権、およびライセンス情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.SH 使用例
.LP
\fB例 1 \fRルートにあるファイルの内容を表示する
.sp
.LP
次のコマンドは、NTFS ボリュームのルートにあるファイルの内容を表示します。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 boot.ini\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRサブディレクトリにあるファイルの内容を表示する
.sp
.LP
次のコマンドは、NTFS ボリュームのサブディレクトリ内にあるファイルの内容を表示します。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 /winnt/system32/drivers/etc/hosts\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR属性の内容を表示する
.sp
.LP
次のコマンドは、ルートディレクトリ (i ノード 5) の \fB$INDEX_ROOT\fR 属性の内容を表示します。

.sp
.in +2
.nf
# \fBntfscat /dev/dsk/c0d0p1 -a INDEX_ROOT -i 5\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBntfsls\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfscat\fR は、Richard Russon、Anton Altaparmakov、および Szabolcs Szakacsits が作成しました。
