Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfscluster.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfscluster 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfscluster \- NTFS ボリュームの指定領域におけるファイルの識別
.SH 形式
.LP
.nf
\fBntfscluster\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfscluster\fR ユーティリティーには、次に説明する \fBinfo\fR、\fBsector\fR、および \fBcluster\fR の 3 つのモードがあります。
.sp
.ne 2
.mk
.na
\fB\fBinfo\fR\fR
.ad
.sp .6
.RS 4n
デフォルトモードである \fBinfo\fR は、現在実装されていません。このモードが有効になっている場合、NTFS ボリュームに関する一般情報が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsector\fR\fR
.ad
.sp .6
.RS 4n
\fBsector\fR モードでは、指定した範囲のセクターにデータが存在するファイルのリストが表示されます。このモードは、\fB--sector\fR オプションで有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcluster\fR\fR
.ad
.sp .6
.RS 4n
\fBcluster\fR モードでは、指定した範囲のクラスタにデータが存在するファイルのリストが表示されます。クラスタサイズが 1 セクターである場合は、\fBsector\fR 操作モードと同等です。このモードは、\fB--cluster\fR オプションで有効になります。
.RE

.SH オプション
.sp
.LP
サポートされているオプションを次に示します。ほとんどのオプションには、単一文字と完全名の両方の形式があります。引数を取らない単一文字オプションは複数を組み合わせることができます。たとえば、\fB-fv\fR は \fB-f\fR \fB-v\fR と同等です。完全名のオプションは、その名前の一意の接頭辞に短縮できます。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR、\fB--cluster\fR \fIrange\fR\fR
.ad
.sp .6
.RS 4n
この範囲のクラスタにデータが存在するすべてのファイルが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR、\fB--filename\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
\fIfilename\fR に関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
マウントされたボリュームを扱わないなど、一部の妥当なデフォルト値をオーバーライドします。このオプションは慎重に使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
それぞれの簡単な説明が付いたオプションのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR、\fB--inode\fR \fInum\fR\fR
.ad
.sp .6
.RS 4n
この i ノードに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--info\fR\fR
.ad
.sp .6
.RS 4n
このオプションはまだ実装されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
一部のデバッグ、警告、およびエラーメッセージを抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR、\fB--sector\fR \fIrange\fR\fR
.ad
.sp .6
.RS 4n
この範囲のセクターにデータが存在するすべてのファイルが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号、著作権、およびライセンス情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.SH 使用例
.LP
\fB例 1 \fRボリュームに関する情報を表示する
.sp
.LP
次のコマンドは、ボリューム \fB/dev/dsk/c0d0p1\fR に関する情報を表示します。

.sp
.in +2
.nf
# \fBntfscluster /dev/dsk/c0d0p1\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRクラスタ範囲に存在するファイルのリストを表示する
.sp
.LP
次のコマンドは、\fB/dev/dsk/c0d0p1\fR の最初の 500 のクラスタに存在するファイルを検索します。

.sp
.in +2
.nf
# \fBntfscluster -c 0-500 /dev/dsk/c0d0p1\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBntfsinfo\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
\fBntfscluster\fR は、Anton Altaparmakov の協力の下、Richard Russon が作成しました。
