Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/ntfsls.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program (in the main directory of the Linux-NTFS distribution in the file COPYING); if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsls 1M "2009 年 5 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ntfsls \- NTFS ファイルシステムのディレクトリ内容の一覧表示
.SH 形式
.LP
.nf
\fBntfsls\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBntfsls\fR ユーティリティーは、\fBPATH\fR オプション (デフォルトはルートディレクトリ) で指定したファイルに関する情報を一覧表示します。\fIdevice\fR (「形式」を参照) は、デバイスに対応する特殊ファイル (\fB/dev/dsk/c0d0p0\fR\fI num\fR など)、または NTFS イメージファイルです。
.SH オプション
.sp
.LP
サポートされているオプションを次に示します。ほとんどのオプションには、単一文字と完全名の両方の形式があります。引数を取らない単一文字オプションは複数を組み合わせることができます。たとえば、\fB-fv\fR は \fB-f\fR \fB-v\fR と同等です。完全名のオプションは、その名前の一意の接頭辞に短縮できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR、\fB--all\fR\fR
.ad
.sp .6
.RS 4n
すべてのファイルを表示します。このオプションを指定しない場合、POSIX 名前空間のファイル名は表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR、\fB--classify\fR\fR
.ad
.sp .6
.RS 4n
次に示すインジケータのいずれかをエントリに付加します。
.sp
.in +2
.nf
* / = @ |
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
実行を強制します。たとえば、このオプションは、通常のファイルに格納された NTFS パーティションで実行する場合に必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
使用法の情報を表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--inode\fR\fR
.ad
.sp .6
.RS 4n
各ファイルの i ノード番号を表示します。これは、NTFS 用語での MFT 参照番号です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR、\fB--long\fR\fR
.ad
.sp .6
.RS 4n
長い出力形式を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR、\fB--path\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
内容を一覧表示するディレクトリ、または情報を表示するファイル (パスを含む)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR、\fB--quiet\fR\fR
.ad
.sp .6
.RS 4n
一部のデバッグ、警告、およびエラーメッセージを抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR、\fB--recursive\fR\fR
.ad
.sp .6
.RS 4n
指定したディレクトリの下位にあるすべてのディレクトリの内容を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR、\fB--system\fR\fR
.ad
.sp .6
.RS 4n
ドル記号文字で始まるすべてのファイルは通常システムファイルであるため、このオプションを指定しないかぎり、これらのファイルは一覧表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
追加のデバッグ、警告、およびエラーメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
\fBntfsls\fR のバージョン番号を表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR、\fB--dos\fR\fR
.ad
.sp .6
.RS 4n
長いファイル名 (つまり、WIN32 名前空間のファイル) ではなく、短いファイル名 (つまり、DOS 名前空間でのファイル) で表示します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/ntfsprogs
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH 著者
.sp
.LP
このバージョンの \fBntfsls\fR は、Lode Leroy、Anton Altaparmakov、Richard Russon、Carmelo Kintana、および Giang Nguyen が作成しました。
