Arquivotheca/solaris11/usr/man/man_i386/usr/share/man/ja_JP.UTF-8/man1m/parted.1m
'\" te
.\" Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
.\" Copyright (C) 1999, 2000, 2007 Free Software Foundation, Inc.
.\" This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see: http://www.gnu.org/copyleft/gpl.html
.TH parted 1M "2010 年 11 月 29 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
parted \- パーティション操作プログラム
.SH 形式
.LP
.nf
\fBparted\fR [\fIoptions\fR] [\fIdevice\fR [\fIcommand\fR [\fIoptions\fR...]...]]
.fi

.SH 機能説明
.sp
.LP
\fBparted\fR は、ディスクパーティション分割およびパーティションサイズ変更プログラムです。\fBext2\fR、\fBlinux-swap\fR、\fBFAT\fR、\fBFAT32\fR、および \fBreiserfs\fR パーティションの作成、破棄、サイズ変更、移動、およびコピーを行えます。Macintosh HFS パーティションの作成、サイズ変更、および移動のほか、\fBjfs\fR、\fBntfs\fR、\fBufs\fR、および \fBxfs\fR パーティションの検出も行えます。新しいオペレーティングシステム用の領域の作成、ディスク使用法の再編成、および新しいハードディスクへのデータのコピーに役立ちます。
.sp
.LP
このマニュアルページでは \fBparted\fR について簡単に説明します。\fBparted\fR に関する完全なドキュメントは、「GNU Info」形式のパッケージで配布されています。
.sp
.LP
\fBparted\fR には、一連の最上位オプションとサブコマンドが実装され、それらのほとんどは独自のオプションとオペランドを備えています。次に、これらのサブコマンドについて説明します。\fBparted\fR にはオプションのオペランドがあります。
.sp
.ne 2
.mk
.na
\fB\fIdevice\fR\fR
.ad
.RS 10n
.rt  
使用されるブロックデバイス。指定されない場合、\fBparted\fR は、最初に見つかったブロックデバイスを使用します。
.RE

.sp
.LP
引数を付けずに \fBparted\fR を呼び出した場合、プログラムはコマンドプロンプトを表示します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIalignment-type\fR、\fB--align\fR \fIalignment-type\fR\fR
.ad
.sp .6
.RS 4n
新しく作成したパーティションのアラインメントを設定します。有効なアラインメントタイプは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBnone\fR\fR
.ad
.sp .6
.RS 4n
ディスクタイプで使用できる最小のアラインメントを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcylinder\fR\fR
.ad
.sp .6
.RS 4n
パーティションをシリンダに合わせて調整します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBminimal\fR\fR
.ad
.sp .6
.RS 4n
ディスクトポロジ情報から得られる最小のアラインメントを使用します。この値と \fIoptimal\fR 値は、ディスクから得られたレイアウト情報を使用して、論理的なパーティションテーブルアドレスを、ディスク上の実際の物理的なブロックに合わせて調整します。\fIminimal\fR 値は、パーティションを物理的ブロックに合わせて適切に調整するために必要な最小のアラインメントであり、パフォーマンスの低下を回避します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptimal\fR\fR
.ad
.sp .6
.RS 4n
ディスクトポロジ情報から得られる最適なアラインメントを使用します。これは、最適なパフォーマンスが確保されるように、物理的なブロックサイズの倍数に合わせて調整します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
ヘルプメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR、\fB--list\fR\fR
.ad
.sp .6
.RS 4n
すべてのブロックデバイスのパーティションレイアウトを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR、\fB--machine\fR\fR
.ad
.sp .6
.RS 4n
マシン解析可能な出力を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR、\fB--script\fR\fR
.ad
.sp .6
.RS 4n
ユーザーの操作を要求しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号を表示します。
.RE

.SH サブコマンド
.sp
.LP
\fBparted\fR コマンド行でサブコマンドを省略した場合、ユーティリティーはコマンドプロンプトを発行します。
.sp
.ne 2
.mk
.na
\fB\fBcheck\fR \fIpartition\fR\fR
.ad
.sp .6
.RS 4n
\fIpartition\fR を簡単にチェックします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcp\fR [\fIsource-device\fR] \fIsource\fR \fIdest\fR\fR
.ad
.sp .6
.RS 4n
\fIsource-device\fR (または、ほかのデバイスが指定されていない場合は現在のデバイス) 上のソースパーティションのファイルシステムを、現在のデバイス上の \fIdest\fR パーティションにコピーします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhelp\fR \fIcommand\fR\fR
.ad
.sp .6
.RS 4n
一般ヘルプまたは指定された場合はコマンドに関するヘルプを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmkfs\fR \fIpartition\fR \fIfs-type\fR\fR
.ad
.sp .6
.RS 4n
パーティションにファイルシステム \fIfs-type\fR を作成します。\fIfs-type\fR には、\fBfat16\fR、\fBfat32\fR、\fBext2\fR、\fBlinux-wap\fR、\fBreiserfs\fR のいずれかを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmklabel\fR \fIlabel-type\fR\fR
.ad
.sp .6
.RS 4n
\fIlabel-type\fR の新しいディスクラベル (パーティションテーブル) を作成します。\fIlabel-type\fR には、\fBbsd\fR、\fBdvh\fR、\fBgpt\fR、\fBloop\fR、\fBmac\fR、\fBmsdos\fR、\fBpc98\fR、\fBsun\fR のいずれかを指定するようにしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmkpart\fR \fIpart-type\fR [\fIfs-type\fR] \fIstart\fR \fIend\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステム \fIfs-type\fR (指定した場合) の、\fIstart\fR から始まり、\fIend\fR で終わる (デフォルトで M バイト単位) \fIpart-type\fR パーティションを作成します。\fIfs-type\fR には、\fBfat16\fR、\fBfat32\fR、\fBext2\fR、\fBHFS\fR、\fBlinux-swap\fR、\fBNTFS\fR、\fBreiserfs\fR、\fBufs\fR のいずれかを指定できます。\fIpart-type\fR には、\fBprimary\fR、\fBlogical\fR、\fBextended\fR のいずれかを指定するようにしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmkpartfs\fR \fIpart-type\fR \fIfs-type\fR \fIstart\fR \fIend\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステム \fIfs-type\fR の、\fIstart\fR から始まり、\fIend\fR で終わる (デフォルトで M バイト単位) \fIpart-type\fR パーティションを作成します。
.sp
このサブコマンドの使用は推奨されません。\fBmkpart\fR を使用して空のパーティションを作成する代わりに、\fBmke2fs(8)\fR (Linux の一部) などの外部ツールを使用してファイルシステムを作成してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmove\fR \fIpartition\fR \fIstart\fR \fIend\fR\fR
.ad
.sp .6
.RS 4n
\fIstart\fR から始まり \fIend\fR で終わるように、パーティションを移動します。\fBmove\fR ではマイナー番号が決して変更されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBname\fR \fIpartition\fR \fIname\fR\fR
.ad
.sp .6
.RS 4n
パーティションの名前を \fIname\fR に設定します。このオプションは、Mac、PC98、および GPT のディスクラベルでのみ機能します。名前は必要に応じて引用符で囲むことができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprint\fR\fR
.ad
.sp .6
.RS 4n
パーティションテーブルを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBquit\fR\fR
.ad
.sp .6
.RS 4n
\fBparted\fR を終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrescue\fR \fIstart\fR \fIend\fR\fR
.ad
.sp .6
.RS 4n
\fIstart\fR と \fIend\fR の間のどこかの地点に存在したが失われたパーティションをレスキューします。パーティションが見つかった場合、\fBparted\fR は、パーティションテーブル内にそのパーティション用のエントリを作成するかどうかを尋ねます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBresize\fR \fIpartition\fR \fIstart\fR \fIend\fR\fR
.ad
.sp .6
.RS 4n
\fIstart\fR から始まり \fIend\fR で終わるように、\fIpartition\fR 上のファイルシステムのサイズを変更します (デフォルトで M バイト単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrm\fR \fIpartition\fR\fR
.ad
.sp .6
.RS 4n
\fIpartition\fR を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBselect\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
編集対象の現在のデバイスとして \fIdevice\fR を選択します。\fIdevice\fR は、通常、Solaris または Linux ハードディスクデバイスであるべきですが、必要に応じて、パーティション、ソフトウェア RAID デバイス、SVM または LVM 論理ボリュームにすることができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR \fIpartition\fR \fIflag\fR \fIstate\fR\fR
.ad
.sp .6
.RS 4n
\fIpartition\fR 上の \fIflag\fR の状態を \fIstate\fR に変更します。サポートされているフラグは、\fBboot\fR、\fBroot\fR、\fBswap\fR、\fBhidden\fR、\fBraid\fR、\fBlvm\fR、\fBlba\fR、および \fBpalo\fR です。\fIstate\fR は、\fBon\fR または \fBoff\fR のどちらかにするようにしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunit\fR \fIunit\fR\fR
.ad
.sp .6
.RS 4n
場所およびサイズを表示するときに使用する単位として、およびユーザーが指定した値に明示的に単位が接尾辞として付加されていないときにその値を解釈する単位として \fIunit\fR を設定します。\fIunit\fR は、\fBs\fR (セクター)、\fBB\fR (バイト)、\fBkB\fR、\fBMB\fR、\fBGB\fR、\fBTB\fR、\fB%\fR (デバイスサイズのパーセント)、\fBcyl\fR (シリンダ)、\fBchs\fR (シリンダ、ヘッド、セクター)、\fBcompact\fR (入力には M バイト、出力には人間に読みやすい形式) のいずれかにすることができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBversion\fR\fR
.ad
.sp .6
.RS 4n
バージョン情報と著作権メッセージを表示します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/storage/parted
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBfdisk\fR(1M), \fBmkfs\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fBparted\fR プログラムについては、\fBinfo(1)\fR 形式の GNU パーティション分割ソフトウェアマニュアルで詳しく説明しています。
.SH 注意事項
.sp
.LP
\fBext3\fR ファイルシステム機能は現在動作しません。\fBext3\fR タイプのファイルシステムを管理するには、\fBresize2fs(8)\fR や \fBmke2fs(8)\fR (どちらも Linux の一部) などのツールを使用します。現在サポートされている \fBext2\fR ファイルシステムは、\fBext3\fR サポートの完成後、非推奨になります。\fBext3\fR サポートには、まだ定義されていない制限付き機能が含まれています。これらのタイプのファイルシステムを管理するには、\fBresize2fs(8)\fR や \fBmke2fs(8)\fR などのツールを使用します。
.sp
.LP
\fBext3\fR ファイルシステムまたはパーティションのサイズを手動で変更するには、\fBresize2fs(8)\fR、\fBfdisk(8)\fR、または同様のツールを使用します。LVM の場合は、LVM コマンドを使用して LVM 要素のサイズを変更する必要があります。
.SH 著者
.sp
.LP
このマニュアルページは、Timshel Knoll が Debian GNU/Linux システム用に記述しました。ここでは、Solaris オペレーティングシステムに合わせて書き換えられています。
