Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/ar.1
'\" te
.\" Copyright 1989 AT&T 
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH ar 1 "2011 年 6 月 8 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
ar \- 移植可能なアーカイブまたはライブラリの保守
.SH 形式
.LP
.nf
\fB/usr/bin/ar\fR \fB-d\fR [\fB-SVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-m\fR [\fB-abiSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-p\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-q\fR [\fB-cSVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-r\fR [\fB-abciuSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-t\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-x\fR [\fB-CSsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-d\fR [\fB-SVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-m\fR [\fB-abiSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-p\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-q\fR [\fB-cSVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-r\fR [\fB-abciuSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-t\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-x\fR [\fB-CSsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBar\fR ユーティリティーは、1 つのアーカイブファイルとして結合されたファイル群の保守を実行します。このコマンドは、おもにライブラリファイルの 作成および更新のために使用されますが、他の似たような目的で使うこともできます。\fBar\fR が使用するマジック文字列とファイルヘッダーは、印刷可能な \fBASCII\fR 文字で構成されます。アーカイブが印刷可能なファイルの集まりであれば、アーカイブ全体も印刷可能です。
.sp
.LP
\fBar\fR はアーカイブを作成する際に、すべてのマシン間で移植できるような形式でヘッダーを生成します。移植可能なアーカイブの形式や構造については、\fBar.h\fR(3HEAD) で詳しく説明されています。アーカイブシンボルテーブル (ar.h(3HEAD) で説明) は、リンクエディタ \fBld\fR(1) がオブジェクトファイルのライブラリ群にまたがった複数の受け渡しを効率よく有効にするために使用します。アーカイブシンボルテーブルは、アーカイブ中にオブジェクトファイルが 1 つでも 存在している場合にだけ、\fBar\fR により作成または保守されます。アーカイブシンボルテーブルは、特殊な名前が付けられたファイル内にあり、そのファイルは常にアーカイブの先頭にあります。このファイルに関してはユーザーに対しては表示されず、ユーザーがアクセスすることはできません。\fBar\fR を使ってアーカイブを生成または更新するたびに、シンボルテーブルは再構築されます。また後述する \fB-s\fR オプションを使えば、シンボルテーブルを強制的に再構築することができます。
.SH オプション
.sp
.LP
次のオプションを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示す新たなファイルを、\fIarchive\fR が示すアーカイブ中の \fIposname\fR が示すファイルの後に配置します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示す新たなファイルを、\fIarchive\fR が示すアーカイブ中の \fIposname\fR が示すファイルの前に配置します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
デフォルトでは、\fIarchive\fR で示すアーカイブが生成されるときに標準エラー出力に診断メッセージが書き込まれますが、このオプションはそのメッセージ出力を抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 6n
.rt  
抽出されたファイルが、ファイルシステム中の同一名のファイルを 置き換えないようにします。特に \fB-T\fR オプションも指定した場合にはファイル名の後半が切り捨てられてしまうので、この C オプションにより前半部分が一致するファイルを置き換えてしまうことを防げます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示すファイルを \fIarchive\fR が示すアーカイブから削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示す新たなファイルを、\fIarchive\fR が示すアーカイブ中の \fIposname\fR が示すファイルの前に配置します。このオプションは、\fB-b\fR と同じ意味を持ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示すファイルを移動します。\fB-a\fR、\fB-b\fR、または \fB-i\fR オプションが \fIposname\fR とともに指定されていればそれに従い、\fB-\fR\fI\fRそうでない場合は、\fIarchive\fR が示すアーカイブの末尾に移動します。\fB-\fR\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
\fIarchive\fR が示すアーカイブ中の、\fIfile\fR が示すファイルの内容を標準出力に印刷します。\fIfile\fR が 1 つも指定されていなければ、そのアーカイブ中のすべてのファイルの内容が、アーカイブ内でのファイルの順序に従って出力されます。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR が示すファイルを、\fIarchive\fR が示すアーカイブの最後尾に追加します。位置を指定するオプション \fB-a\fR、\fB-b\fR、および \fB-i\fR はいずれも無効です。指定されたファイルと同じ名前のファイルがすでにそのアーカイブ中に存在しているかどうかは、チェックされません。\fI\fR\fI\fRこのオプションを使えば二次的な動作を抑止できるので、大きなアーカイブを少しずつ作成していく場合に便利です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
\fIarchive\fR が示すアーカイブ中で、\fIfile\fR が示すファイルの置換または追加を行います。指定したアーカイブが存在していなければ、新たにアーカイブを作成し (\fB-c\fR オプション指定時を除く) 診断メッセージを標準エラー出力に書き出します。\fI\fRアーカイブは存在していて、ファイル名が 1 つも指定されなかった場合の実行結果は定義されていません。\fI\fR\fI\fRファイルの置換が発生しても、アーカイブ中でのファイルの順序は変わりません。この \fB-r\fR オプションとともに \fB-u\fR オプションも指定されていると、最終更新日時がアーカイブ中の対応するファイルより新しいファイルだけが置き換えられます。\fB-a\fR、\fB-b\fR、または \fB-i\fR オプションが指定された場合、\fIposname\fR 引数の指定も必須となります。このとき、新規ファイルは \fB-posname\fR で示すファイルの後 (\fB-a\fR) または前 (\fB-b\fR または \fIi\fR ) に置かれます。それ以外の場合、新規ファイルはアーカイブの最後尾に置かれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
\fBar\fR を呼び出したコマンドに、アーカイブの内容を更新するようなオプションが指定されていない場合でも、アーカイブのシンボルテーブルを強制的に再構築します。このオプションは、アーカイブ上で \fBstrip\fR(1) コマンドを実行した後でアーカイブシンボルテーブルの内容を復元するのに便利です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.RS 6n
.rt  
アーカイブシンボルテーブルの作成時に、64 ビット対応のシンボルテーブル形式の使用を強制します。デフォルトでは、4G バイト未満のすべてのアーカイブに 32 ビット形式が使用されます。32 ビットの制限を超える、より大きなアーカイブには 64 ビット形式が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 6n
.rt  
アーカイブの内容を示す目次を生成します。\fI\fR\fIfile\fR で指定したファイルが目次に含まれます。\fIfile\fR を 1 つも指定しないと、アーカイブ中の全ファイル名が、アーカイブ中での順番に含まれます。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.RS 6n
.rt  
抽出されたファイルのアーカイブ名の長さが、ファイルシステムでサポートする最大長を超えている場合、超過した部分を切り捨てます。デフォルトでは、最大長を超える長さの名前を持つファイルを抽出しようとするとエラーとなり、ファイルの抽出は行われず診断メッセージが出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
古いファイルを更新します。\fB-r\fR オプションと一緒に指定すると、最終更新日時が \fIarchive\fR 中の対応するファイルよりも新しいファイルについてだけ、置換が行われます。\fI\fR\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
詳細な情報を出力します。他のオプション \fB-d\fR、\fB-r\fR、または \fB-x\fR も一緒に指定すると、アーカイブやファイルの生成と保守作業についてファイルごとの詳細な情報を出力します。\fB-\fR\fI\fR\fB-p\fR オプションも一緒に指定すると、ファイルの内容の前にファイルの名前を標準出力に書き出します。\fB-\fR\fB-t\fR オプションも一緒に指定すると、アーカイブ中のファイルに関する大量の情報が出力されます。\fB-\fR\fB-x\fR オプションも一緒に指定すると、抽出作業の前にファイル名が出力されます。\fB-\fRアーカイブに書き込むと、メッセージを標準エラーに書き出します。\fB-\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 6n
.rt  
自身のバージョン番号を標準エラー出力に印刷します。
.RE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp
.LP
次のオプションは、\fB/usr/xpg4/bin/ar\fR でサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
アーカイブに書き込んだ場合 (メッセージを標準エラーに書き出しません) を除いて、\fB/usr/bin/ar\fR 版と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
\fIfile\fR で指定したファイル群を \fIarchive\fR が示すアーカイブから抽出します。アーカイブの内容は変わりません。\fI\fR\fIfile\fR を 1 つも指定しないと、アーカイブ中の全ファイルが抽出されます。\fI\fR抽出されたファイルの名前が、出力先のディレクトリが サポートしている最大長を超えている場合、結果は定義されていません。\fI\fR抽出されたファイルの最終更新時刻は、アーカイブから抽出された時刻に設定されます。\fI\fR\fI\fR\fI\fR
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIarchive\fR\fR
.ad
.RS 11n
.rt  
アーカイブのパス名。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 11n
.rt  
パス名。アーカイブ中のファイル名と比較する際には、ファイル名の最終コンポーネントだけが使用されます。最終パス名コンポーネント (\fBbasename\fR(1) を参照) に同一の名前が複数指定された場合、その結果は不確定です。\fI\fRアーカイブに追加または置換されたファイルの名前は、それが正当なものであれば、実装先システムのアーカイブの形式により切り捨てられることはありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fIposname\fR\fR
.ad
.RS 11n
.rt  
アーカイブ中での配置位置を相対的に表すためのファイルの名前。詳しくは \fB-m\fR と \fB-r\fR オプションの説明を参照してください。
.RE

.SH 環境
.sp
.LP
\fBar\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR、および \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBTMPDIR\fR\fR
.ad
.RS 10n
.rt  
一時ファイルが存在する場合にデフォルトのディレクトリにオーバーライドするパス名を調べます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTZ\fR\fR
.ad
.RS 10n
.rt  
\fBar\fR \fB-tv\fR により書き込まれる日時文字列の計算に使用されるタイムゾーンを調べます。\fBTZ\fR が指定されていない、または NULL の場合は、デフォルトのタイムゾーンが使用されます。
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "\fB/usr/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/linker
_
インタフェースの安定性確実
.TE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBbasename\fR(1), \fBcpio\fR(1), \fBelffile\fR(1), \fBfile\fR(1), \fBld\fR(1), \fBlorder\fR(1), \fBstrip\fR(1), \fBtar\fR(1), \fBar.h\fR(3HEAD), \fBa.out\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
引数リスト中に同じファイル名を 2 度記述すると、アーカイブ中にそのファイルが 2 個置かれます。
.sp
.LP
慣習として、アーカイブのファイル名には \fB\&.a\fR という接尾辞を付けるのが一般的です。
.sp
.LP
アーカイブファイルに \fBELF\fR オブジェクトを挿入する場合、\fBar\fR では、これらのオブジェクトを 8 バイト境界にパディングするために「\fB\n\fR」文字が追加されることがあります。このようなパディングによって、\fBld\fR(1) がこのアーカイブにより効率的にアクセスできるようになります。この方法でパディングが行われるのは、\fBELF\fR オブジェクトファイルだけです。その他のアーカイブメンバーは変更されません。この種のパディングが行われたオブジェクトをアーカイブから抽出するとき、生成される出力にパディングは含まれません。
.sp
.LP
\fBar\fR を個別に呼び出して個々のファイルを既存のアーカイブに挿入するよりも、新しいアーカイブを最初から作成する方が時間を短縮できます。可能であれば、既存のアーカイブを削除し、\fBar\fR を 1 回呼び出してアーカイブを再作成することをお勧めします。
.sp
.LP
1 つのアーカイブ全体のサイズは、4G バイトを超えてもかまいません。ただし、アーカイブ内の個々のファイルのサイズはすべて、アーカイブファイル形式によって 4G バイトに制限されています。\fBar.h\fR(3HEAD) を参照してください。
.sp
.LP
アーカイブ内の個々のファイルの最大のユーザー ID とグループ ID は、アーカイブファイル形式によって 6 桁の 10 進数に制限されています。999999 より大きいユーザーまたはグループ ID を持つファイルはすべて、暗黙のうちにユーザー ID「nobody」(60001) またはグループ ID「nobody」(6001) に設定されます。\fBar.h\fR(3HEAD) を参照してください。
