Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/auths.1
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH auths 1 "2011 年 3 月 10 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
auths \- ユーザーに付与された承認の出力
.SH 形式
.LP
.nf
\fBauths\fR [ \fIuser\fR ]...
.fi

.SH 機能説明
.sp
.LP
\fBauths\fR コマンドは、自分や任意指定のユーザーまたは役割に付与された承認を標準出力に書き込みます。承認は、制限付き機能をユーザーが実行できるかどうかを決定するために、特定の特権付きプログラムによって検査される特権です。
.sp
.LP
各ユーザーはゼロまたはそれ以上の承認を持つことができます。承認は、承認を作成した組織と制御対象の機能とを識別する完全指定名で表現されます。Java の規約に準じて、承認の階層コンポーネントはドット (\fB\&.\fR) で区切られ、作成元組織のインターネットドメイン名を逆順にした形式で始まり、承認クラス内の特定の機能で終わります。
.sp
.LP
アスタリスク (\fB*\fR) はクラス内のすべての承認を示します。
.sp
.LP
ユーザーの承認は \fBuser_attr\fR(4) および \fB/etc/security/policy.conf\fR ファイル (\fBpolicy.conf\fR(4) を参照) 内で検索されます。承認は、\fBuser_attr\fR(4) 内に直接、または \fBprof_attr\fR(4) を通して間接的に指定できます。また、\fB/etc/security/policy.conf\fR ファイル内で、承認をデフォルトの承認として直接、またはデフォルトプロファイルとして間接的に、システムの各ユーザーに割り当てることもできます。
.SH 使用例
.LP
\fB例 1 \fR出力例
.sp
.LP
\fBauths\fR 出力の形式は次のとおりです。

.sp
.in +2
.nf
example% \fBauths tester01 tester02\fR
tester01 : solaris.system.date,solaris.jobs.admin
tester02 : solaris.system.*
example%
.fi
.in -2
.sp

.sp
.LP
\fBtester01\fR 内の承認名を区切るコンマの後ろには、スペースはありません。

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBprofiles\fR(1), \fBroles\fR(1), \fBgetauthattr\fR(3C), \fBauth_attr\fR(4), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
