Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/basename.1
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH basename 1 "1997 年 3 月 18 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
basename, dirname \- パス名の部分的な抽出
.SH 形式
.LP
.nf
\fB/usr/bin/basename\fR \fIstring\fR [\fIsuffix\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/basename\fR \fIstring\fR [\fIsuffix\fR]
.fi

.LP
.nf
\fBdirname\fR \fIstring\fR
.fi

.SH 機能説明
.sp
.LP
\fBbasename\fR ユーティリティは、\fB/\fR で終わるすべてのプレフィックスと \fIsuffix\fR (\fIstring\fR 中にある場合) を \fIstring\fR から削除して、その結果を標準出力に出力します。このユーティリティは通常、シェルプロシージャ内の置換マーク (\fB`\|`\fR) の中で使用されます。
.SS "/usr/bin"
.sp
.LP
\fIsuffix\fR は、\fBexpr\fR(1) のマニュアルページに定義されているパターンです。
.SS "/usr/xpg4/bin"
.sp
.LP
\fIsuffix\fR は、含まれるどの文字にも特殊な意味が付加されていない文字列です。
.sp
.LP
\fBdirname\fR ユーティリティは、\fIstring\fR 内のパス名の最後のレベルを除く、すべてのレベルを出力します。
.SH 使用例
.LP
\fB例 1 \fR環境変数を設定する
.sp
.LP
次の例は、引数 \fB/home/sms/personal/mail\fR を指定して呼び出しを行なった場合で、環境変数 \fBNAME\fR に \fBmail\fR というファイルを設定し、環境変数 \fBMYMAILPATH\fR に文字列 \fB/home/sms/personal\fR を設定します。

.sp
.in +2
.nf
example% \fBNAME=`basename \|$HOME/personal/mail`\fR
example% \fBMYMAILPATH=`dirname \|$HOME/personal/mail`\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRファイルをコンパイルして出力を移動する
.sp
.LP
次のシェルプロシージャは、引数 \fB/usr/src/bin/cat.c\fR を指定して呼び出しを行なった場合で、指定したファイルをコンパイルし、出力を現在のディレクトリ内の \fBcat\fR というファイルに移動します。

.sp
.in +2
.nf
example% \fBcc $1\fR
example% \fBmv a.out `basename $1 .c`\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBbasename\fR と \fBdirname\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。 
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SS "/usr/xpg4/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBexpr\fR(1), \fBbasename\fR(3C), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
