Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/chgrp.1
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1983 Regents of the University of California. All rights reserved.The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH chgrp 1 "2008 年 7 月 11 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
chgrp \- ファイルのグループ所有権の変更
.SH 形式
.LP
.nf
\fBchgrp\fR [\fB-fhR\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR [\fB-fhR\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.SH 機能説明
.sp
.LP
\fBchgrp\fR ユーティリティは、\fIfile\fR で指定された各ファイルのグループ ID を、\fIgroup\fR で示す値に設定します。
.sp
.LP
\fIfile\fR の個々のファイルに対し、chgrp は、\fBchown\fR(2) 関数を以下の引数とともに呼び出した場合と同等の動作を行います。
.RS +4
.TP
.ie t \(bu
.el o
\fIfile\fR の値を \fIpath\fR 引数に指定
.RE
.RS +4
.TP
.ie t \(bu
.el o
そのファイルのユーザー ID を \fIowner\fR 引数に指定
.RE
.RS +4
.TP
.ie t \(bu
.el o
指定されたグループ ID を \fIgroup\fR 引数に指定
.RE
.sp
.LP
適切な特権を持ったプロセスが \fBchgrp\fR を呼び出さない限り、正常終了時に通常ファイルのセットユーザー ID ビットとセットグループ ID はクリアされます。他の種類のファイルのセットユーザー ID ビットとセットグループ ID もクリアされることがあります。
.sp
.LP
オペレーティングシステムは、所有者変更を制限する構成オプション \fB{_POSIX_CHOWN_RESTRICTED}\fR を持っています。このオプションが有効になっていると、ファイルの所有者は自分自身が属するグループへしかファイルのグループを変更できません。このオプションが有効かどうかに関わらず、スーパーユーザーだけが所有者 ID を変更できます。構成オプションを設定する場合は、\fB/etc/system\fR ファイルに次の行を挿入してください。
.sp
.in +2
.nf
set rstchown = 1
.fi
.in -2

.sp
.LP
このオプションを無効にする場合は、\fB/etc/system\fR ファイルに次の行を挿入してください。
.sp
.in +2
.nf
set rstchown = 0
.fi
.in -2

.sp
.LP
デフォルトでは \fB{_POSIX_CHOWN_RESTRICTED}\fR は有効です。\fBsystem\fR(4) と \fBfpathconf\fR(2) を参照してください。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.SS "/usr/bin/chgrp および /usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
強制。エラーは報告しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
ファイルがシンボリックリンクであるとき、そのシンボリックリンクのグループを変更します。このオプションが指定されていない場合は、そのシンボリックリンクによって参照されるファイルのグループが変更されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
コマンド行に指定したファイルがディレクトリタイプのファイルを参照するシンボリックリンクである場合、グループの変更の対象となるのは、そのシンボリックリンクが参照するディレクトリ、および、そのディレクトリより下にあるファイル階層内のすべてのファイルです。ファイル階層の検索中にシンボリックリンクに出会った場合、対象となるファイルは変更されますが、再帰は発生しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
ファイルがシンボリックリンクである場合、グループの変更の対象となるのは、そのシンボリックリンクが参照するファイルです。コマンド行に指定したファイル、あるいは、ファイル階層の検索中に出会ったファイルがディレクトリタイプのファイルを参照するシンボリックリンクである場合、グループの変更の対象となるのは、そのシンボリックリンクが参照するディレクトリ、および、そのディレクトリより下にあるファイル階層内のすべてのファイルです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
コマンド行に指定したファイル、あるいは、ファイル階層の検索中に出会ったファイルがシンボリックリンクである場合、グループの変更の対象となるのは、そのシンボリックリンク自身です。このオプションは、シンボリックリンクが参照するファイル階層は検索しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
指定されたグループは Windows SID です。このオプションでは、SID を格納可能なファイルシステム (ZFS など) が必要になります。
.RE

.sp
.LP
\fB-H\fR、\fB-L\fR、または \fB-P\fR は相互排他的なオプションですが、これらを複数指定しても、エラーであるとは判断されません。最後に指定したオプションが \fBchgrp\fR の動作を決定します。
.SS "/usr/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
再帰。\fBchgrp\fR はディレクトリおよびすべてのサブディレクトリを検索し、指定されたグループ \fBID\fR を設定していきます。シンボリックリンクに出合うと、(\fB-h\fR または \fB-P\fR オプションが指定されていなければ) 対象となるファイルのグループが変更されます。しかし、\fB-H\fR または \fB-L\fR オプションを指定しない限り、再帰は発生しません。
.RE

.SS "/usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
再帰。\fBchgrp\fR はディレクトリおよびすべてのサブディレクトリを検索し、指定されたグループ \fBID\fR を設定していきます。シンボリックリンクに出合うと、(\fB-h\fR または \fB-P\fR オプションが指定されていなければ) 対象となるファイルのグループが変更されます。\fB-H\fR、\fB-L\fR、または \fB-P\fR のいずれのオプションも指定しない限り、\fB-L\fR オプションがデフォルトのモードとして使用されます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIgroup\fR\fR
.ad
.RS 9n
.rt  
グループデータベースから得られるグループ名、または数値のグループ ID。どちらの場合でも、\fIfile\fR で指定した各ファイルに与えるグループ ID を表します。\fIgroup\fR が数値で、それがグループ名としてグループデータベースに存在していると、そのグループ名に対応したグループ ID 番号がグループ ID として用いられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 9n
.rt  
グループ ID を変更するファイルのパス名
.RE

.SH 使用法
.sp
.LP
ファイルが 2 ギガバイト (2^31 バイト) 以上ある場合の \fBchgrp\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 環境
.sp
.LP
\fBchgrp\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
ユーティリティの実行が正常終了し、要求されたすべての変更が行われた。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 14n
.rt  
グループファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSIT{
有効。「注意事項」を参照してください。
T}
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SS "/usr/xpg4/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSIT{
有効。「注意事項」を参照してください。
T}
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBchmod\fR(1), \fBchown\fR(1), \fBid\fR(1M), \fBchown\fR(2), \fBfpathconf\fR(2), \fBgroup\fR(4), \fBpasswd\fR(4), \fBsystem\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fBchgrp\fR は \fIgroup\fR 名を除いて CSI に対応しています。
