Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/chown.1
'\" te
.\" Copyright 1989 AT&T 
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH chown 1 "2011 年 7 月 25 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
chown \- ファイルの所有者の変更
.SH 形式
.SS "/usr/bin/chown"
.LP
.nf
\fB/usr/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.SS "/usr/xpg4/bin/chown"
.LP
.nf
\fB/usr/xpg4/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.SH 機能説明
.SS "/usr/bin/chown および /usr/xpg4/bin/chown"
.sp
.LP
\fBchown\fR ユーティリティは、\fBfile\fR オペランドが示す各ファイルのユーザー \fBID\fR を、\fIowner\fR オペランドが示す値に変更し、さらに \fIgroup\fR が指定されていれば、グループ \fBID\fR もその値に変更します。\fB\fR
.sp
.LP
\fBchown\fR がスーパーユーザー以外のユーザーによって起動された 場合、セットユーザー \fBID\fR ビットはクリアされます。
.sp
.LP
ファイルの所有者 (またはスーパーユーザー) だけが、ファイルの所有者を変更できます。
.sp
.LP
ファイルシステムでは、マウントポイントオプション \fBrstchown\fR を使用して所有者変更を制限します。このオプションが有効なときは、ファイルの所有者はそのファイルの所有者 \fBID\fR を変更することができません。このオプションが有効かどうかにかかわらず、スーパーユーザーだけが所有者 \fBID\fR を変更できます。
.sp
.LP
\fBchown\fR は、各ファイルの所有者を owner に変更します。owner は、ユーザー名または数値のユーザー ID で指定できます。各ファイルのグループ所有権も、ユーザー名に続けて \fB :group\fR を指定することで group に変更できます。
.SH オプション
.SS "/usr/bin/chown および /usr/xpg4/bin/chown"
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
強制。エラーは報告しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
ファイルがシンボリックリンクであるとき、そのシンボリックリンクの所有者を変更します。このオプションが指定されていない場合は、そのシンボリックリンクによって参照されるファイルの所有者が変更されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
コマンド行に指定したファイルがディレクトリタイプのファイルを参照するシンボリックリンクである場合、所有者の変更の対象となるのは、そのシンボリックリンクが参照するディレクトリと、その下にあるファイル階層内のすべてのファイルです。ファイル階層の検索中にシンボリックリンクに出会った場合、対象となるファイルの所有者は変更されますが、再帰は発生しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
ファイルがシンボリックリンクである場合、所有者の変更の対象となるのは、そのシンボリックリンクが参照するファイルです。コマンド行に指定したファイル、あるいは、ファイル階層の検索中に出会ったファイルがディレクトリタイプのファイルを参照するシンボリックリンクである場合、所有者の変更の対象となるのは、そのシンボリックリンクが参照するディレクトリ、および、そのディレクトリより下にあるファイル階層内のすべてのファイルです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
コマンド行に指定したファイル、あるいは、ファイル階層の検索中に出会ったファイルがシンボリックリンクである場合、所有者の変更の対象となるのは、そのシンボリックリンク自身です。このオプションは、シンボリックリンクが参照するファイル階層は検索しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
所有者やグループの引数は、Windows SID 文字列です。このオプションでは、SID を格納可能なファイルシステム (ZFS など) が必要になります。
.RE

.sp
.LP
\fB-H\fR、\fB-L\fR、または \fB-P\fR は相互排他的なオプションですが、これらを複数指定しても、エラーであるとは判断されません。最後に指定したオプションが \fBchown\fR の動作を決定します。
.SS "/usr/bin/chown"
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
再帰。\fBchown\fR はディレクトリおよびすべてのサブディレクトリを検索し、指定された所有者 \fBID\fR を設定していきます。シンボリックリンクに出合うと、(\fB-h\fR または \fB-P\fR オプションが指定されていなければ) 対象となるファイルの所有者が変更されます。しかし、\fB-H\fR または \fB-L\fR オプションを指定しない限り、再帰は発生しません。
.RE

.SS "/usr/xpg4/bin/chown"
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
再帰。\fBchown\fR はディレクトリおよびすべてのサブディレクトリを検索し、指定された所有者 \fBID\fR を設定していきます。シンボリックリンクに出合うと、(\fB-h\fR または \fB-P\fR オプションが指定されていなければ) 対象となるファイルの所有者が変更されます。\fB-H\fR、\fB-L\fR、または \fB-P\fR のいずれのオプションも指定しない限り、\fB-L\fR オプションがデフォルトのモードとして使用されます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIowner\fR[\fB:\fR\fIgroup\fR]\fR
.ad
.RS 17n
.rt  
\fBfile\fR に割り当てるユーザー \fBID\fR とグループ \fBID\fR (グループ ID は省略可能) を指定します。\fIowner\fR 部分は、ユーザーデータベースから得られるユーザー名、または数値のユーザー \fBID\fR のどちらかでなければなりません。どちらの場合でも、\fIfile\fR で指定した各ファイルに与えるユーザー \fBID\fR を表します。\fIowner\fR が数値で、それがユーザー名としてユーザーデータベースに存在していると、そのユーザー名に対応したユーザー \fBID\fR 番号がユーザー \fBID\fR として用いられます。同様に、\fIgroup\fR 部分を指定する場合は、グループデータベースから得られるグループ名、または数値のグループ \fBID\fR のどちらかでなければなりません。どちらの場合でも、各ファイルに与えるグループ \fBID\fR を表します。group が数値で、それがグループ名としてグループデータベースに存在していると、そのグループ名に対応したグループ \fBID\fR 番号がグループ \fBID\fR として用いられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 17n
.rt  
\fBユーザー ID を変更するファイルのパス名\fR
.RE

.SH 使用法
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBchown\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 使用例
.LP
\fB例 1 \fR階層内のすべてのファイルの所有者を変更
.sp
.LP
次のコマンドを実行すると、階層に含まれるすべてのファイルの所有者が変更されます。このとき、シンボリックリンクも変更されますが、リンクの参照先の所有者は変更されません。

.sp
.in +2
.nf
example% \fBchown \(miR \(mih \fIowner\fR[:group] \fIfile\fR...\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBchown\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
ユーティリティの実行が正常終了し、要求されたすべての変更が行われた。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
システムパスワードファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSIT{
有効。「注意事項」を参照してください。
T}
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SS "/usr/xpg4/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSIT{
有効。「\fB注意事項\fR」 を参照してください。
T}
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBchgrp\fR(1), \fBchmod\fR(1), \fBchown\fR(2), \fBfpathconf\fR(2), \fBpasswd\fR(4), \fBsystem\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fBchown\fR は \fIowner\fR 名および \fIgroup\fR 名を除いて \fBCSI\fR に対応しています。
