Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/egrep.1
'\" te
.\" Copyright 1989 AT&T 
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved 
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH egrep 1 "2006 年 3 月 24 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
egrep \- 完全な正規表現を使用したファイル内のパターン検索
.SH 形式
.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fB-e\fR \fIpattern_list\fR [\fIfile...\fR]
.fi

.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fB-f\fR \fIfile\fR [\fIfile...\fR]
.fi

.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fIpattern\fR [\fIfile...\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] \fB-e\fR \fIpattern_list\fR [\fB-f\fR \fIfile\fR] 
     [\fIfile...\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] [\fB-e\fR \fIpattern_list\fR] \fB-f\fR \fIfile\fR 
     [\fIfile...\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] \fIpattern\fR [\fIfile...\fR]
.fi

.SH 機能説明
.sp
.LP
\fBegrep\fR ( \fIexpression grep\fR) ユーティリティは、ファイルの中の 文字パターンを検索し、 そのパターンを含む行をすべて出力します。\fBegrep\fR は、 パターンマッチング用に完全な正規表現 ( 英数字および特殊文字のフルセットを使用する文字列値による表現 ) を使用します。また、 高速決定性アルゴリズムを使用しており、 これは指数的に増加する領域を必要とすることもあります。
.sp
.LP
ファイルが指定されない場合は、 \fBegrep\fR は、標準入力を入力とみなします。 検索された各行は、 通常、標準出力に出力されます。複数の入力ファイルがある場合は、 検索された各行の前にファイル名が出力されます。
.SS "/usr/bin/egrep"
.sp
.LP
\fB/usr/bin/egrep\fR ユーティリティは \fBregexp\fR(5)  のマニュアルページに記述されているように、完全な正規表現を受け入れますが、\fB\e(\fR、 \fB\e)\fR、\fB\e(\fR 、 \fB\e)\fR、\fB\e{\fR 、 \fB\e}\fR、\fB\e<\fR 、 \fB\e>\fR  と \fB\en\fR を除きます。 また次の各項目が追加されます。
.RS +4
.TP
1.
後ろに \fB+\fR が付いている完全な正規表現。 これは、 その完全な正規表現が 1 回以上現れるものに一致します。
.RE
.RS +4
.TP
2.
後ろに \fB?\fR が付いている完全な正規表現。 これは、 その完全な正規表現が 0 回 または 1 回現れるものに一致します。
.RE
.RS +4
.TP
3.
| または復帰改行 (\fBNEWLINE\fR) で区切られた複数の完全な正規表現。これは、どちらかの完全な正規表現と一致する文字列に一致します。
.RE
.RS +4
.TP
4.
グループ化のために、 丸かっこ \fB()\fR で囲まれた完全な正規表現。
.RE
.sp
.LP
完全な正規表現の中で \fB$\fR、\fB*\fR、\fB[\fR、\fB^\fR、|、\fB(\fR、\fB)\fR、\fB\e\fR の各文字を使用する際には注意が必要です。これらの文字は、シェルにとっても特別な意味があるからです。\fI\fR完全な正規表現全体を単一引用符で囲む (\fBa\'\fR\fBa\'\fR) のがもっとも安全です。\fI\fR
.sp
.LP
演算子の優先順位は、\fB[\|]\fR、\fB*\|?\|+\fR、連結、|、復帰改行の順です。
.SS "/usr/xpg4/bin/egrep"
.sp
.LP
\fB/usr/xpg4/bin/egrep\fR ユーティリティは、\fBregex\fR(5) のマニュアルページの「\fBEXTENDED REGULAR EXPRESSIONS\fR」の項で述べる 正規表現を使用します。
.SH オプション
.sp
.LP
\fB/usr/bin/egrep\fR と \fB/usr/xpg4/bin/egrep\fR では次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 19n
.rt  
検索された各行の先頭にその行のブロック番号を付けます。文脈によりブロック番号を見つけ出す場合に便利です (最初のブロックは 0 です)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 19n
.rt  
一致したパターンを含む行の行数だけを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIpattern_list\fR\fR
.ad
.RS 19n
.rt  
\fIpattern_list\fR (\fB\(mi\fR で始まる完全な正規表現 ) を検索します。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.RS 19n
.rt  
\fIfile\fR から完全な正規表現のリストを取り込みます。\fI\fR\fI\fR\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 19n
.rt  
複数ファイルの検索時にファイル名の出力を抑制します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 19n
.rt  
比較時に大文字と小文字を区別しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 19n
.rt  
一致した行が 1 行でもあるファイルのファイル名だけを、 1 ファイルずつ復帰改行で区切って出力します。パターンが 2 度以上見つかるときは、ファイルの名前を繰り返しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 19n
.rt  
各行の先頭にファイル内の行番号を付けます (最初の行は 1 です)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 19n
.rt  
エラーメッセージだけを表示します。 エラーステータスをチェックするのに有用です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 19n
.rt  
一致するパターンを含む行以外のすべての行を出力します。
.RE

.SS "/usr/xpg4/bin/egrep"
.sp
.LP
次のオプションは、 \fB/usr/xpg4/bin/egrep\fR でのみサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
非出力。行が一致したかどうかに関わらず、 標準出力には何も書き出しません。入力行に一致した行があった場合、 0 の終了ステータスで処理を終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
固定文字列全体または正規表現と完全に一致する 入力行だけを、一致する行とみなします。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
パターンを検索するファイルのパス名。\fIfile\fR オペランドを指定しないと、標準入力が使用されます。
.RE

.SS "/usr/bin/egrep"
.sp
.ne 2
.mk
.na
\fB\fIpattern\fR\fR
.ad
.RS 11n
.rt  
入力の検索時に用いるパターンを指定します。
.RE

.SS "/usr/xpg4/bin/egrep"
.sp
.ne 2
.mk
.na
\fB\fIpattern\fR\fR
.ad
.RS 11n
.rt  
入力の検索時に用いる 1 つまたは複数のパターンを指定します。このオペランドは、 \fB-e\fR\fIpattern_list\fR と指定されたものとして扱われます。
.RE

.SH 使用法
.sp
.LP
ファイルが 2 ギガバイト ( 2^31 バイト) 以上ある場合の \fBegrep\fR の動作については、 \fBlargefile\fR(5) を参照してください。
.SH 環境
.sp
.LP
\fBegrep\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
一致するものが 1 つ以上見つかりました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
一致するものが 1 つも見つかりませんでした。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
( 一致するものが見つかった場合でも ) 構文エラーが検出された、 またはアクセスできないファイルがあった。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/egrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI未対応
.TE

.SS "/usr/xpg4/bin/egrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
.TE

.SH 関連項目
.sp
.LP
\fBfgrep\fR(1), \fBgrep\fR(1), \fBsed\fR(1), \fBsh\fR(1), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBregex\fR(5), \fBregexp\fR(5), \fBXPG4\fR(5)
.SH 注意事項
.sp
.LP
理想的には、 \fBgrep\fR コマンドは 1 つだけにすべきですが、広い範囲における消費領域と時間のかねあいに対応できるような 1 つのアルゴリズムはありません。
.sp
.LP
1 行は仮想記憶に使用できるサイズに 制限されています。
.SS "/usr/xpg4/bin/egrep"
.sp
.LP
\fB/usr/xpg4/bin/egrep\fR ユーティリティーは \fB/usr/xpg4/bin/grep\fR \fB-E\fR と同一です。\fBgrep\fR(1) を参照してください。移植性の必要なアプリケーションは、\fB/usr/xpg4/bin/grep \fR\fB-E\fR の方を使用してください。
