Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/env.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH env 1 "2011 年 7 月 12 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
env \- コマンド実行のための環境の設定
.SH 形式
.LP
.nf
\fB/usr/bin/env\fR [\fB-i\fR | \fB-\fR] [\fIname=value\fR]... [\fIutility\fR [\fIarg\fR... ]]
.fi

.LP
.nf
\fB/usr/xpg4/bin/env\fR [\fB-i\fR | \fB-\fR] [\fIname=value\fR]... 
     [\fIutility\fR [\fIarg\fR... ]]
.fi

.SH 機能説明
.sp
.LP
\fBenv\fR ユーティリティは現在の環境を読み込み、 引数の指定に従ってその値を変更し、 \fIutility\fR 引数で指定されたユーティリティを変更された状態の環境で実行します。
.sp
.LP
任意指定の引数も、 \fIutility\fR に渡されます。\fIutility\fR が省略された場合、 変更後の環境の内容が標準出力に書き込まれます。 この出力には、名前と値が \fIname\fR\fB=\fR\fIvalue\fR の形式で 1 行に 1 組ずつ書かれます
.SS "\fB/usr/bin\fR"
.sp
.LP
\fBenv\fR が引数のあるコマンドを実行する場合、 デフォルトのシェル \fB/usr/bin/sh\fR が使われます (\fBsh\fR(1) 参照)。
.SS "\fB/usr/xpg4/bin\fR"
.sp
.LP
\fBenv\fR が引数のあるコマンドを実行する場合、\fB/usr/xpg4/bin/sh\fR が使われます (\fBksh88\fR(1) を参照)。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR | \fB\(mi\fR \fR
.ad
.RS 14n
.rt  
現在のシェルから引き継がれるはずの環境はすべて無視します。引数で指定された環境だけを用いて \fIutility\fR を実行します。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fB=\fR\fIvalue\fR \fR
.ad
.RS 15n
.rt  
この形式でオペランドを指定すると、 \fIname\fR\fB が示す環境変数に \fR\fIvalue\fR が示す値を設定して実行環境を変更し、さらに \fIutility\fR を実行する前に、受け継いだ環境にその指定を割り当てます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIutility\fR \fR
.ad
.RS 15n
.rt  
実行するユーティリティの名前。シェルの特殊な組み込みユーティリティを指定した場合の結果は定義されていません。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fIarg\fR \fR
.ad
.RS 15n
.rt  
実行するユーティリティに引数として渡す文字列。
.RE

.SH 使用例
.LP
\fB例 1 \fR新しい PATH の値でユーティリティを呼び出す
.sp
.LP
以下にユーティリティを示します。

.sp
.in +2
.nf
example% \fBenv -i PATH=/mybin mygrep xyz myfile \fR
.fi
.in -2
.sp

.sp
.LP
ここでは環境変数 \fBPATH\fR を設定し、これを唯一の環境設定として \fBmygrep\fR という ユーティリティを実行しています。つまり \fBmygrep\fR は、\fBPATH\fR が示す \fB/mybin\fR 中に存在していなければなりません。

.SH 環境
.sp
.LP
\fBenv\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBPATH\fR\fR
.ad
.RS 8n
.rt  
 \fIutility\fR で指定したユーティリティの位置を決定します。\fBPATH\fR が \fBenv\fR への \fIname\fR=\fIvalue\fR オペランドとして指定された場合は、指定された値が \fIutility\fR で指定したユーティリティの検索に使用されます。
.RE

.SH 終了ステータス
.sp
.LP
\fIutility\fR で指定したユーティリティが実行された場合、 そのユーティリティの終了ステータスが \fBenv\fR の終了ステータスとなります。\fI\fRそうでない場合は、 \fBenv\fR は次の終了値を返します。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 10n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1-125\fR \fR
.ad
.RS 10n
.rt  
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB126\fR \fR
.ad
.RS 10n
.rt  
\fIutility\fR は見つかったが呼び出すことができませんでした。
.RE

.sp
.ne 2
.mk
.na
\fB\fB127\fR \fR
.ad
.RS 10n
.rt  
\fIutility\fR は見つかりませんでした。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
.TE

.SS "/usr/xpg4/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBksh88\fR(1), \fBsh\fR(1), \fBexec\fR(2), \fBprofile\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
