Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/file.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved 
.\" Copyright (c) 2006, 2010, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH file 1 "2010 年 12 月 8 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
file \- ファイルタイプの判別
.SH 形式
.LP
.nf
\fB/usr/bin/file\fR  [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR]
 \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR  [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR  \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR  \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR  \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR  [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR]
 \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR  [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR  \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR  \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR  \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.SH 機能説明
.sp
.LP
\fBfile\fR ユーティリティーは、\fIfile\fR で指定した各ファイル、およびオプションとして指定した \fIffile\fR 中に記述された個々のファイルを分類します。指定したファイルが通常ファイル以外である場合、そのタイプを判別します。判別されるタイプには、ディレクトリ、\fBFIFO\fR、ブロック特殊ファイル、文字特殊ファイルなどがあります。ファイル長がゼロの通常ファイルは、空ファイルと判別します。
.sp
.LP
\fIfile\fR がテキストファイルである場合、\fBfile\fR は最初の 512 バイトを検査し、そのプログラミング言語を判定します。\fIfile\fR がシンボリックリンクである場合、デフォルトでは、\fBfile\fR はそのリンクをたどって参照先のファイルをテストします。
.sp
.LP
\fIfile\fR 引数が再配置可能オブジェクト、実行可能ファイル、または共有オブジェクトである場合、\fBfile\fR コマンドはそのファイルの実行要件に関する情報を出力します。この情報には、マシンのクラス、バイト順、静的リンクまたは動的リンク、およびソフトウェア能力またはハードウェア能力に関する要件が入っています。\fIfile\fR が実行時のリンク先の構成ファイルである場合、\fBfile\fR は、マシンクラスやバイト順序などの、ターゲットのプラットフォームに関する情報を出力します。
.sp
.LP
\fB/usr/lib/locale/\fIlocale\fR/LC_MESSAGES/magic\fR ファイルが存在する場合、\fBfile\fR はデフォルトで、このマジックファイルを使用してマジック番号を持つファイルを識別します。たとえば、日本語ロケールの場合は \fB/usr/lib/locale/ja/LC_MESSAGES/magic\fR を使用します。\fB\fR/usr/lib/locale/locale/LC_MESSAGES/magic が存在しない場合、\fBfile\fR は \fB/etc/magic\fR ファイルを使用します。マジック番号は、ファイルタイプを表す数値定数または文字列定数です。\fB/etc/magic\fR の形式については \fBmagic\fR(4) を参照してください。
.sp
.LP
\fIfile\fR が存在しない、読み取りできない、またはステータスが判別できない場合でも、終了ステータスに影響を与えるようなエラーとは見なされません。この場合、ファイルの処理は行われたがタイプは判断できなかったということが示されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 12n
.rt  
マジックファイルにフォーマットエラーがないかどうかをチェックします。効率上の問題から、この妥当性検査は通常実行しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 12n
.rt  
システムのデフォルトの位置依存および文脈依存テストをファイルに適用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIffile\fR\fR
.ad
.RS 12n
.rt  
\fIffile\fR は、検査すべきファイルの一覧が記述されているファイルの名前を表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 12n
.rt  
シンボリックリンクに遭遇したとき、ファイルをシンボリックリンクとして識別します。\fB-h\fR を指定しない場合でも、\fIfile\fR がシンボリックリンクであり、存在しないファイルを参照する場合、\fBfile\fR ユーティリティは、\fB-h\fR が指定されたように、file をシンボリックリンクとして識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 12n
.rt  
ファイルが通常ファイルである場合、それ以上ファイルのタイプを分類せず、そのファイルを「通常ファイル」として識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImfile\fR\fR
.ad
.RS 12n
.rt  
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/file\fR\fR
.ad
.RS 22n
.rt  
\fImfile\fR を \fB/etc/magic\fR に代わる代替マジックファイルとして使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/xpg4/bin/file\fR\fR
.ad
.RS 22n
.rt  
位置依存テストを含むファイルの名前を指定します。このテストは、ファイルを分類するときに適用されます (\fBmagic\fR(4) を参照)。\fB-d\fR オプションまたは \fB-M\fR オプションを指定せず、\fB-m\fR オプションだけを指定した場合、\fB-m\fR オプションで指定した位置依存テストの後に、システムのデフォルトの位置依存テストが適用されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fIMfile\fR\fR
.ad
.RS 12n
.rt  
位置依存テストを含むファイルの名前を指定します。このテストは、ファイルを分類するときに適用されます (\fBmagic\fR(4) を参照)。\fB-d\fR オプションを一緒に指定しない限り、システムのデフォルトの位置依存テストまたは文脈依存テストは適用されません。
.RE

.sp
.LP
\fB-d\fR オプション、\fB-m\fR オプション、あるいは、その両方と一緒に、-\fB-M\fR オプションを指定した場合、あるいは、\fB-d\fR オプションと一緒に、\fB-m\fR オプションを指定した場合、これらのオプションで指定した位置依存テストはすべて、これらのオプションに指定した順番どおりに適用されます。
.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
テストするファイルのパス名。
.RE

.SH 使用法
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBfile\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 使用例
.LP
\fB例 1 \fR引数として指定したファイルがバイナリの実行可能ファイルであるかどうかを検査する
.sp
.LP
次の例は、引数として指定したファイルがバイナリの実行可能ファイルであるかどうかを検査します。

.sp
.in +2
.nf
file "$1" | grep \(miFq executable &&
          printf "%s is executable.\n" "$1"
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBfile\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/magic\fR\fR
.ad
.RS 14n
.rt  
\fBfile\fR のマジック番号ファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBcrle\fR(1), \fBelfdump\fR(1), \fBelffile\fR(1), \fBls\fR(1), \fBmagic\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fBfile\fR ユーティリティーでは、最初にアーカイブメンバーがアーカイブから別個のファイルに抽出されていないかぎり、アーカイブメンバーを検査することはできません。\fBelffile\fR ユーティリティーでは、所定の場所にあるアーカイブメンバーを検査できるため、\fBELF\fR オブジェクトおよびアーカイブでは、このユーティリティーを使用することをお勧めします。
