Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/isainfo.1
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH isainfo 1 "2007 年 2 月 8 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
isainfo \- 命令セットアーキテクチャーの記述
.SH 形式
.LP
.nf
\fBisainfo\fR [ [\fB-v\fR] [\fB-b\fR | \fB-n\fR | \fB-k\fR] | [\fB-x\fR]]
.fi

.SH 機能説明
.sp
.LP
\fBisainfo\fR ユーティリティーは、現在実行中のシステムでサポートされる命令セットアーキテクチャーのさまざまな属性を識別するために使用されます。このコマンドが回答可能な質問には、64 ビットアプリケーションがサポートされているかどうか、実行中のカーネルで使用するデバイスドライバが 32 ビットか 64 ビットか、などが含まれます。
.sp
.LP
オプションを設定せずに \fBisainfo\fR を呼び出した場合、現バージョンのオペレーティングシステムでサポートされているアプリケーションのネイティブ命令セットの名前が表示されます。それらは、\fBisalist\fR(1) によって返されるリストのサブセットです。サブセットは、現在実行中のシステムでサポートされている基本アプリケーション環境に対応しています。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 6n
.rt  
ネイティブ命令セットのアドレス空間のビット数を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 6n
.rt  
オペレーティングシステムのカーネルコンポーネント (デバイスドライバや \fBSTREAMS\fR モジュールなど) で使用される命令セットの名前を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
オペレーティングシステムの現在のバージョンでサポートされる、移植性のあるアプリケーションで使用されるネイティブ命令セットの名前を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
\fB-b\fR、\fB-k\fR、または \fB-n\fR オプションともに使用した場合、より詳細な情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
プラットフォームでサポートされている、ネイティブ ABI に対する命令拡張を表示します。
.RE

.SH 使用例
.LP
\fB例 1 \fR32 ビット x86 プラットフォーム上での \fBisainfo\fR の呼び出し
.sp
.LP
次の例では、32 ビット x86 プラットフォーム上で \fBisainfo\fR を呼び出します。

.sp
.in +2
.nf
example% isainfo -v
32-bit i386 applications

example% isainfo -k
i386
.fi
.in -2
.sp

.LP
\fB例 2 \fR64 ビット SPARC プロセッサ上で 64 ビットオペレーティングシステムを実行しているシステムでの \fBisainfo\fR の呼び出し
.sp
.LP
次の例では、64 ビット SPARC プロセッサ上で 64 ビットオペレーティングシステムを実行しているシステムで \fBisainfo\fR を呼び出します。

.sp
.in +2
.nf
example% isainfo
sparcv9 sparc
example% isainfo -n
sparcv9
example% isainfo -v
64-bit sparcv9 applications
32-bit sparc applications
example% isainfo -vk
64-bit sparcv9 kernel modules
.fi
.in -2
.sp

.LP
\fB例 3 \fRAMD Opteron CPU 上での \fBisainfo\fR \fB-x\fR の呼び出し
.sp
.LP
次の例では、AMD Opteron CPU 上で \fB-x\fR オプションを指定して \fBisainfo\fR を呼び出します。 

.sp
.in +2
.nf
example% isainfo -x
i386: fpu tsc cx8 sep cmov mmx ammx a3dnow a3dnowx fxsr sse sse2 pause
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB0 以外\fR
.ad
.RS 12n
.rt  
オプションが正しく指定されていないか、実行中のシステムの属性をコマンドが認識できません。エラーメッセージが\fB標準エラー出力\fRに出力されます。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBisalist\fR(1), \fBuname\fR(1), \fBpsrinfo\fR(1M), \fBgetisax\fR(2), \fBsysinfo\fR(2), \fBattributes\fR(5), \fBisalist\fR(5)
