Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/locale.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 1995, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH locale 1 "2011 年 5 月 8 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
locale \- ロケール固有の情報の取得
.SH 形式
.LP
.nf
\fBlocale\fR [\fB-a\fR | \fB-m\fR]
.fi

.LP
.nf
\fBlocale\fR [\fB-ck\fR] \fIname\fR...
.fi

.SH 機能説明
.sp
.LP
\fBlocale\fR ユーティリティーは現在のロケール環境、または、すべての公開ロケールに関する情報を標準出力に書き込みます。こにおいて、「\fI公開ロケール\fR」とは、アプリケーションからアクセスできる、該当する実装上で利用可能なロケールのことです。
.sp
.LP
引数を指定しないで \fBlocale\fR を呼び出すと、環境変数の設定値によって決定されたロケールカテゴリごとに、現在のロケール環境が表示されます。
.sp
.LP
オペランドを指定して locale を呼び出すと、次のように、ロケールカテゴリでキーワードに割り当てられている値を標準出力に書き込みます。
.RS +4
.TP
.ie t \(bu
.el o
キーワード名を指定すると、指定したキーワードとそのキーワードが含まれているカテゴリが選択される。
.RE
.RS +4
.TP
.ie t \(bu
.el o
カテゴリ名を指定すると、指定したカテゴリとそのカテゴリ内のすべてのキーワードが選択される。
.RE
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
利用可能なすべての公開ロケールに関する情報を標準出力に書き込みます。利用可能なロケールには、POSIX ロケールを表す \fBPOSIX\fR も含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
選択したロケールカテゴリの名前を標準出力に書き込みます。\fB-c\fR オプションは、複数のカテゴリを選択したときに (たとえば、複数のキーワード名やカテゴリ名を使用したとき)、表示を読みやすくするために使用します。このオプションは、\fB-k\fR オプションの指定に関係なく有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 6n
.rt  
選択したキーワードの名前と値を標準出力に書き込みます。実装によっては、一部のキーワードで値が省略されることがあります。「オペランド」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
利用できる文字マッピング (charmap) の名前を標準出力に書き込みます。\fBlocaledef\fR(1) を参照してください。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 8n
.rt  
ロケールカテゴリの名前、ロケールカテゴリ内のキーワードの名前、または予約名 \fBcharmap\fR。指定したカテゴリまたはキーワードが選択され、出力されます。1 つの \fIname\fR が現在のロケールでロケールカテゴリ名とキーワード名の両方を表す場合、指定しないのと同じ結果になります。それ以外の場合、カテゴリ名とキーワード名は、どちらも \fIname\fR オペランドとして任意の順序で指定できます。
.RE

.SH 使用例
.LP
\fB例 1 \fRlocale ユーティリティーの例
.sp
.LP
次の例では、ロケール環境変数は次のように設定されているものとします。

.sp
.in +2
.nf
LANG=locale_x LC_COLLATE=locale_y
.fi
.in -2
.sp

.sp
.LP
\fBlocale\fR は次の出力を生成します。

.sp
.in +2
.nf
LANG=locale_x
LC_CTYPE="locale_x"
LC_NUMERIC="locale_x"
LC_TIME="locale_x"
LC_COLLATE=locale_y
LC_MONETARY="locale_x"
LC_MESSAGES="locale_x"
LC_ALL=
.fi
.in -2
.sp

.sp
.LP
次のコマンドを見てください。

.sp
.in +2
.nf
\fBLC_ALL=POSIX locale -ck decimal_point\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドは、次の出力を生成します。

.sp
.in +2
.nf
LC_NUMERIC
decimal_point="."
.fi
.in -2
.sp

.sp
.LP
次の例は、\fBlocale\fR を使用して、ユーザーの応答が肯定応答であるかどうかを調べるアプリケーションの一部を示します。

.sp
.in +2
.nf
\fBif printf "%s\en" "$response" | /usr/xpg4/bin/grep -Eq\e
        "$(locale yesexpr)"
then
    affirmative processing goes here
else
    non-affirmative processing goes here
fi\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR については、\fBenviron\fR(5) を参照してください。
.sp
.LP
\fBLANG\fR、\fBLC_*\fR、および \fBNLSPATH\fR 環境変数には、出力する現在のロケール環境が指定されていなければなりません。これらの環境変数は、\fB-a\fR オプションが指定されていない場合に使用されます。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
要求したすべての情報が見つかり、正常に出力されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件text/locale
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBlocaledef\fR(1), \fBattributes\fR(5), \fBcharmap\fR(5), \fBenviron\fR(5), \fBlocale\fR(5), \fBlocale_alias\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fBLC_CTYPE\fR または \fBLC_CTYPE\fR カテゴリのキーワードを指定すると、\fB0x00\fR-\fB0x7f\fR の範囲内の値だけが書き込まれます。
.sp
.LP
\fBLC_COLLATE\fR または \fBLC_COLLATE\fR カテゴリのキーワードを指定すると、実際の値は書き込まれません。
.sp
.LP
\fBlocale -a\fR の出力で示されるロケール名は正規ロケール名に限定されます。使用できる、またサポートされているロケール名の別名については、\fBlocale_alias\fR(5) を参照してください。
