Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/ls.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH ls 1 "2011 年 6 月 9 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
ls \- ディレクトリの内容を一覧表示
.SH 形式
.LP
.nf
\fB/usr/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg6/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.SH 機能説明
.sp
.LP
\fIfile\fR オペランドがディレクトリの場合、\fBls\fR は、そのディレクトリの内容を出力します。\fIfile\fR が通常ファイルの場合、\fBls\fR は、そのファイル名と要求されたほかの情報を出力します。デフォルトでは、アルファベット順にソートして出力します。引数をまったく指定しないと、現在のディレクトリ (\fB\&.\fR) の内容を出力します。引数を複数指定すると、引数は最初に適切にソートされますが、ファイル引数がディレクトリとその内容より先に処理されます。
.sp
.LP
出力形式には、主に 3 種類あります。端末に対するデフォルトの出力形式は、複数カラムで、ソートしたエントリを縦方向に並べて表示します。\fB-1\fR オプションを指定すると、単一のカラムで出力します。\fB-m\fR オプションを指定すると、ストリーム出力形式で表示します。\fB-C\fR、\fB-x\fR、\fB-m\fR オプションの出力形式を決定するために、\fBls\fR は環境変数 \fBCOLUMNS\fR を使用して、1 行に出力できる文字数を調べます。この環境変数が設定されていない場合は、環境変数 \fBTERM\fR に基づいて、\fBterminfo\fR(4) データベースが使用され、カラム数が決定されます。この情報が得られない場合は、カラム数は 80 カラムと見なされます。\fB-w\fR オプションを使用する場合、引数はその他のカラム幅よりも優先されます。
.sp
.LP
\fB-e\fR、\fB-E\fR、\fB-g\fR、\fB-l\fR、\fB-n\fR、\fB-o\fR、\fB-v\fR、\fB-V\fR、\fB-@\fR のいずれかのオプションが有効になっている場合、出力されるモードは 11 文字から成ります。最初の文字は次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.sp .6
.RS 4n
エントリがディレクトリの場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.sp .6
.RS 4n
エントリが door の場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.sp .6
.RS 4n
エントリがシンボリックリンクの場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.sp .6
.RS 4n
エントリがブロック型特殊ファイルの場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.sp .6
.RS 4n
エントリが文字型特殊ファイルの場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.sp .6
.RS 4n
エントリが \fBFIFO\fR (または「名前付きパイプ」) 特殊ファイルの場合。
.RE

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.sp .6
.RS 4n
エントリがイベントポートの場合
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
エントリが \fBAF_UNIX\fR アドレスファミリのソケットの場合。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\(mi\fR\fR
.ad
.sp .6
.RS 4n
エントリが通常ファイルの場合
.RE

.sp
.LP
残りの 9 文字は、3 文字ずつの 3 組に分けられます。最初の組は、所有者へのアクセス権を示します。次の組は、同一のグループに属するほかのユーザーへのアクセス権を示します。最後の組は、その他のユーザーへのアクセス権を示します。各組においては、3文字がそれぞれ、ファイルの読み取り、書き込み、実行権を示します。ディレクトリの場合は、\fB実行\fR権は、指定したファイルの有無についてディレクトリを検索するアクセス権を意味します。アクセス権に続く文字は、ACL、拡張属性のいずれかを示します。ファイルに拡張属性が関連付けられており、かつ \fB-@\fR オプションが有効になっている場合、この文字は \fB@\fR になります。それ以外の場合、意味のある ACL がファイルに関連付けられている場合にはこの文字はプラス記号 (\fB+\fR) 文字になり、それ以外の場合はスペース文字になります。
.sp
.LP
\fB-/\fR または \fB-%\fR (あるいはその両方) が有効になっている場合、ファイルシステムで拡張システム属性がサポートされていれば、拡張システム属性が出力されます。次のように表示されます。 
.sp
.in +2
.nf
$ls -/ c  file   
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {AHRSadim-u}

$ls -/ v file
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {archive,hidden,readonly,system,appendonly\e
                 nodump,immutable, av_modified,\e
                 noav_quarantined,nounlink}

$ls -l -% all file
-rw-r--r--   1 root     root           0 May 10 14:17 file
                timestamp: atime    Jun 25 12:56:44 2007
                timestamp: ctime    May 10 14:20:23 2007
                timestamp: mtime    May 10 14:17:56 2007
                timestamp: crtime   May 10 14:17:56 2007
.fi
.in -2
.sp

.sp
.LP
詳細は、\fB-/\fR および \fB-%\fR オプションの説明を参照してください。 
.sp
.LP
\fBls\fR \fB-l\fR (ロング形式出力) は、POSIX ロケールで次のように出力します。
.sp
.in +2
.nf
-rwxrwxrwx+ 1 smith dev   10876  May 16 9:42 part2
.fi
.in -2
.sp

.sp
.LP
右から左へ見ていくと、現在のディレクトリには \fBpart2\fR というファイルが 1 つあるのがわかります。次に、ファイルの内容を最後に修正したのは \fB5 月 16 日\fR\fB午前 9 時 42 分\fRです。ファイルには、10,876 文字 (バイト) が含まれています。ファイルの所有者またはユーザーは、グループ \fBdev\fR (おそらく \fBdevelopment\fR を示す) に属しており、ログイン名は \fBsmith\fR です。この例で \fB1\fR と示されている数字は、\fBpart2\fR というファイルへのリンクの数を示します (\fBcp\fR(1) を参照)。プラス記号は、ファイルに関連する \fBACL\fR があることを示します。\fB-@\fR オプションが指定されている場合、拡張属性が存在していると \fBACL\fR は無効になり、プラス記号はアット記号 (\fB@\fR) に置き換えられます。さらにダッシュと文字によって、ユーザー、グループ、その他のユーザーが \fBpart2\fR に対する読み取り、書き込み、実行権を持っていることが示されています。
.sp
.LP
実行権を表す \fBx\fR は、各組の 3 番目の位置に置かれます。3 番目の位置に \fB\(mi\fR がある場合は、実行権を与えられていないことを示します。
.sp
.LP
各アクセス権の意味は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.sp .6
.RS 4n
ファイルが読み取り可能
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.sp .6
.RS 4n
ファイルが書き込み可能
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.sp .6
.RS 4n
ファイルが実行可能
.RE

.sp
.ne 2
.mk
.na
\fB\fB\(mi\fR\fR
.ad
.sp .6
.RS 4n
指定されたアクセス権は与えられていない\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
セットユーザー ID ビットまたはセットグループ ID ビットがオンで、対応するユーザーまたはグループ実行権ビットもオン\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.sp .6
.RS 4n
不定ビット状態 (セットユーザーID ビットまたはセットグループ ID ビットがオンで、ユーザーまたはグループの実行権ビットがオフ)。グループのアクセス権の場合、通常ファイル以外のファイルだけに適用される 
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.sp .6
.RS 4n
1000 (8 進数) ビット、つまり、スティッキービットがオン (\fBchmod\fR(1) を参照) で、実行権ビットがオン
.RE

.sp
.ne 2
.mk
.na
\fB\fBT\fR\fR
.ad
.sp .6
.RS 4n
1000 ビットがオンで、実行権ビットがオフ (不定ビット状態)
.RE

.SS "/usr/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.sp .6
.RS 4n
アクセス中に強制ロックが発生する (通常ファイルについて、セットグループ IDビットがオンで、グループ実行権ビットがオフ) 
.RE

.SS "/usr/xpg4/bin/ls および /usr/xpg6/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.sp .6
.RS 4n
アクセス中に強制ロックが発生する (通常ファイルについて、セットグループ IDビットがオンで、グループ実行権ビットがオフ) 
.RE

.sp
.LP
ユーザーやグループへのアクセス権では、3 番目の位置に \fBx\fR や \fB\(mi\fR ではなく、セットユーザー ID ビットあるいはセットグループ ID ビットの状態に応じて \fBs\fR または \fBS\fR が置かれることがあります。実行中に、ユーザーのユーザー ID をファイルのユーザー ID と同じと見なすこの機能は、たとえば、ルートとして起動したユーザーが、ログイン中に普通にログインした場合のユーザー ID を必要とするときなどに使用されます。
.sp
.LP
グループへのアクセス権においては、3 番目の位置に \fBl\fR が置かれることがあります。\fBl\fR は、強制的なファイルおよびレコードのロックを示しています。これはアクセス中にその他のファイルに対する読み取りまたは書き込み権をロックするファイルの機能があることを示しています。
.sp
.LP
その他のユーザーへのアクセス権においては、3 番目の位置に \fBt\fR または \fBT\fR が置かれることがあります。これらは、スティッキービットと実行権の状態を示しています。
.SS "色出力"
.sp
.LP
色出力が有効になっている場合、環境変数 LS_COLORS がチェックされます。これが存在する場合、ファイル名の表示に使用される色が、その内容を使用して制御されます。設定されていない場合、デフォルトの色一覧が使用されます。LS_COLORS の形式は、属性仕様をコロンで区切ったリストです。各属性仕様の形式は、次のとおりです。
.sp
.in +2
.nf
\fIfilespec\fR=\fIattr\fR[;\fIattr\fR..]
.fi
.in -2
.sp

.sp
.LP
\fIfilespec\fR は、\fI*.SUFFIX \fR (\fB*.jar\fR や \fB*.Z\fR など) の形式、または次のファイルタイプのいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.sp .6
.RS 4n
通常ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fBfi\fR\fR
.ad
.sp .6
.RS 4n
標準ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fBdi\fR\fR
.ad
.sp .6
.RS 4n
ディレクトリ
.RE

.sp
.ne 2
.mk
.na
\fB\fBln\fR\fR
.ad
.sp .6
.RS 4n
シンボリックリンク
.RE

.sp
.ne 2
.mk
.na
\fB\fBpi\fR\fR
.ad
.sp .6
.RS 4n
FIFO (名前付きパイプ)
.RE

.sp
.ne 2
.mk
.na
\fB\fBso\fR\fR
.ad
.sp .6
.RS 4n
ソケット
.RE

.sp
.ne 2
.mk
.na
\fB\fBdo\fR\fR
.ad
.sp .6
.RS 4n
Door ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fBbd\fR\fR
.ad
.sp .6
.RS 4n
ブロック型デバイス
.RE

.sp
.ne 2
.mk
.na
\fB\fBcd\fR\fR
.ad
.sp .6
.RS 4n
文字デバイス
.RE

.sp
.ne 2
.mk
.na
\fB\fBex\fR\fR
.ad
.sp .6
.RS 4n
実行ビット (\fBuser\fR、\fBgroup\fR、または \fBother\fR) セット
.RE

.sp
.ne 2
.mk
.na
\fB\fBpo\fR\fR
.ad
.sp .6
.RS 4n
イベントポート
.RE

.sp
.ne 2
.mk
.na
\fB\fBst\fR\fR
.ad
.sp .6
.RS 4n
スティキービットセット
.RE

.sp
.ne 2
.mk
.na
\fB\fBor\fR\fR
.ad
.sp .6
.RS 4n
孤立したシンボリックリンク
.RE

.sp
.ne 2
.mk
.na
\fB\fBsg\fR\fR
.ad
.sp .6
.RS 4n
\fBsetgid\fR バイナリ
.RE

.sp
.ne 2
.mk
.na
\fB\fBsu\fR\fR
.ad
.sp .6
.RS 4n
\fBsetuid\fR バイナリ
.RE

.sp
.ne 2
.mk
.na
\fB\fBow\fR\fR
.ad
.sp .6
.RS 4n
\fBその他のユーザ書き込み可能\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBtw\fR\fR
.ad
.sp .6
.RS 4n
スティキービットと\fBその他のユーザー\fR書き込み可能
.RE

.sp
.LP
\fIattr\fR は色をセミコロンで区切ったリストであり、最終出力の色を決定する際に組み合わせる属性を表示します。\fIattr\fR 値は、任意に組み合わせて指定できます。指定可能な \fIattr\fR 値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB00\fR\fR
.ad
.sp .6
.RS 4n
すべての属性をオフにします (デフォルト端末の色)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB01\fR\fR
.ad
.sp .6
.RS 4n
テキストを太字で表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB04\fR\fR
.ad
.sp .6
.RS 4n
テキストに下線を付けて表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB05\fR\fR
.ad
.sp .6
.RS 4n
テキストを太字で表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB07\fR\fR
.ad
.sp .6
.RS 4n
前景および背景の色を反転させてテキストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB08\fR\fR
.ad
.sp .6
.RS 4n
隠しテキストを使用して表示します。
.RE

.sp
.LP
次の値のいずれかを選択できます。複数の値が指定されている場合は、最後に指定された値が使用されます。
.sp
.ne 2
.mk
.na
\fB\fB30\fR\fR
.ad
.sp .6
.RS 4n
前景を「黒」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB31\fR\fR
.ad
.sp .6
.RS 4n
前景を「赤」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB32\fR\fR
.ad
.sp .6
.RS 4n
前景を「緑」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB33\fR\fR
.ad
.sp .6
.RS 4n
前景を「黄」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB34\fR\fR
.ad
.sp .6
.RS 4n
前景を「青」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB35\fR\fR
.ad
.sp .6
.RS 4n
前景を「マゼンタ」(紫色) に設定します。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB36\fR\fR
.ad
.sp .6
.RS 4n
前景を「シアン」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB37\fR\fR
.ad
.sp .6
.RS 4n
前景を「白」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB39\fR\fR
.ad
.sp .6
.RS 4n
前景をデフォルト端末の色に設定します。
.RE

.sp
.LP
次の値のいずれかを指定できます。複数の値が指定されている場合は、最後に指定された値が使用されます。
.sp
.ne 2
.mk
.na
\fB\fB40\fR\fR
.ad
.sp .6
.RS 4n
前景を「黒」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB41\fR\fR
.ad
.sp .6
.RS 4n
前景を「赤」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB42\fR\fR
.ad
.sp .6
.RS 4n
前景を「緑」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB43\fR\fR
.ad
.sp .6
.RS 4n
前景を「黄」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB44\fR\fR
.ad
.sp .6
.RS 4n
前景を「青」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB45\fR\fR
.ad
.sp .6
.RS 4n
前景を「マゼンタ」(紫色) に設定します。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB46\fR\fR
.ad
.sp .6
.RS 4n
前景を「シアン」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB47\fR\fR
.ad
.sp .6
.RS 4n
前景を「白」に設定します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB49\fR\fR
.ad
.sp .6
.RS 4n
前景をデフォルト端末の色に設定します。
.RE

.sp
.LP
一部の端末では、太字属性を設定すると、前景色の濃度が高く (つまり、明るく) なります。この場合、濃度が低い黄色が茶色やオレンジ色に表示されることが頻繁にあります。
.sp
.LP
ファイル仕様には、1 つ以上の属性を指定する必要があります。
.sp
.LP
もっとも限定された一致を選択し、ファイル接尾辞から開始して、ファイルタイプの一致が見つかるまで継続すると、適切な色コードが選択されます。\fBno\fR (通常ファイル) タイプは任意のファイルに一致します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.SS "/usr/bin/ls、/usr/xpg4/bin/ls、および /usr/xpg6/bin/ls"
.sp
.LP
次のオプションは、ls の 3 つのすべてのバージョンで指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.br
.na
\fB\fB--all\fR\fR
.ad
.sp .6
.RS 4n
すべてのエントリを出力します。つまり、ドット (\fB\&.\fR) で始まるエントリも出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.br
.na
\fB\fB--almost-all \fR\fR
.ad
.sp .6
.RS 4n
すべてのエントリを出力します。つまり、ドット (\fB\&.\fR) で始まるエントリも出力します。ただし、作業用ディレクトリ (\fB\&.\fR) や親ディレクトリ (..) は出力しません。\fB\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.br
.na
\fB\fB--escape \fR\fR
.ad
.sp .6
.RS 4n
出力できない文字を 8進 \fB\e\fR\fIddd\fR の出力形式で強制的に出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.br
.na
\fB\fB--ignore-backups \fR\fR
.ad
.sp .6
.RS 4n
チルド (\fB~\fR) で終わるファイルを表示しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
(\fB-t\fRオプションによる) ソート や (\fB-l\fR または \fB-n\fR オプションによる) 出力において、i ノードを最後に修正した時刻 (ファイル作成、モード変更など) を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
複数カラム形式の出力で、エントリを縦方向にソートします。これは、デフォルトの出力形式です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
引数がディレクトリの場合、(内容ではなく) その名前だけを出力します。\fB-l\fR とともに使用すれば、ディレクトリのステータスを知ることができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
\fB-l\fR と似ていますが、時刻を秒まで表示します。また、時刻の形式は、年数にかかわらず、すべてのファイルに対して 1 つだけで、その形式は POSIX ロケールの場合、\fImmm dd hh:mm:ss yyyy\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.sp .6
.RS 4n
\fB-l\fR と似ていますが、時刻をナノ秒まで表示します。また、時刻の形式は、年数にかかわらず、すべてのファイルに対して、\fIyyyy-mm-ddhh:mm:ss.nnnnnnnnn\fR (ISO 8601 形式) の 1 つだけです。 
.sp
また、このオプションを指定すると、UTC からのオフセットを ISO 8601 標準形式 (+\fIhhmm\fR または -\fIhhmm\fR) で表示します。オフセットが確認できない場合は何も表示しません。オフセットは、現在のタイムゾーンにおけるファイルの表示日時の時点で有効な標準オフセットまたは代替オフセットを反映しています。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
強制的に、各引数をディレクトリと解釈し、各引数のディレクトリで見つかる名前を出力します。このオプションは、\fB-l\fR、\fB- t\fR、\fB-s\fR、\fB-S\fR、および \fB-r\fR を無視し、\fB-a\fR が指定されたものと見なします。エントリは、ディレクトリ内での順序で出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.br
.na
\fB\fB--classify \fR\fR
.ad
.sp .6
.RS 4n
特定のファイルタイプの後ろに、ファイルタイプを示すシンボルを追加します。次のシンボルが使用されます。
.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.sp .6
.RS 4n
ディレクトリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB>\fR\fR
.ad
.sp .6
.RS 4n
Door ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB|\fR\fR
.ad
.sp .6
.RS 4n
名前付きパイプ (\fBFIFO\fR)
.RE

.sp
.ne 2
.mk
.na
\fB\fB@\fR\fR
.ad
.sp .6
.RS 4n
シンボリックリンク
.RE

.sp
.ne 2
.mk
.na
\fB\fB=\fR\fR
.ad
.sp .6
.RS 4n
ソケット
.RE

.sp
.ne 2
.mk
.na
\fB\fB*\fR\fR
.ad
.sp .6
.RS 4n
実行可能ファイル
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
所有者名が出力されない点を除いて、\fB-l\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.br
.na
\fB\fB--human-readable \fR\fR
.ad
.sp .6
.RS 4n
すべてのサイズは縮小され、読みやすい形式で表示されます。たとえば、\fB14K\fR、\fB234M\fR、\fB2.7G\fR、\fB3.0T\fR などのようになります。縮尺は、\fB1024\fR を除数として行われます。末尾の --si または -h オプションは、使用される除数を決定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.br
.na
\fB\fB--dereference-command-line \fR\fR
.ad
.sp .6
.RS 4n
引数がディレクトリを参照するシンボリックリンクの場合、リンク自身ではなく、そのリンクが参照するディレクトリのファイル情報およびファイルタイプを評価します。ただし、表示される名前はリンクの名前であり、参照されるディレクトリの名前ではありません。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.br
.na
\fB\fB--inode \fR\fR
.ad
.sp .6
.RS 4n
各ファイルについて、i ノード番号を第 1 カラムに出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.sp .6
.RS 4n
すべてのサイズがキロバイト単位で出力されます。--block-size=1024 と同等です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
各ファイルについて、モード、\fBACL\fR 表示、リンクの数、所有者名、グループ名、サイズ (バイト単位)、最終修正時刻をロング形式で出力します。ファイルが特殊ファイルの場合、サイズフィールドにはメジャーデバイス番号とマイナーデバイス番号が入ります。最終修正時刻が 6 か月よりも前である場合には、POSIX ロケールでは「月・日・年」の形式で表示されます。\fBLC_TIME\fR ロケールカテゴリが POSIX ロケールに設定されていない場合には、異なった形式で時間フィールドが表示されます。最終修正時刻が 6 か月以内である場合には、「月・日・時」の形式で表示されます。ファイルがシンボリックリンクの場合は、ファイル名を出力したあとに、\fB\(->\fR に続いて参照されるファイルのパス名が出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.br
.na
\fB\fB--dereference \fR\fR
.ad
.sp .6
.RS 4n
引数がシンボリックリンクの場合、リンク自身ではなく、そのリンクが参照するファイルまたはディレクトリのファイル情報およびファイルタイプを評価します。しかし、表示される名前はリンクの名前であり、参照されるファイルまたはディレクトリの名前ではありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
ストリーム形式出力を指定します。ファイルはコンマで区切られ横方向に出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.br
.na
\fB\fB--numeric-uid-gid \fR\fR
.ad
.sp .6
.RS 4n
所有者名とグループ名の代わりに、所有者の\fBユーザーID\fR とグループの\fBグループ ID\fR が出力されることを除き、\fB-l\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.br
.na
\fB\fB--no-group \fR\fR
.ad
.sp .6
.RS 4n
グループ名が出力されない点を除き、\fB-l\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
ファイルがディレクトリの場合、各ファイル名のあとにスラッシュ (\fB/\fR) を付けます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.br
.na
\fB\fB--hide-control-chars \fR\fR
.ad
.sp .6
.RS 4n
ファイル名中の出力できない文字を疑問符記号 (\fB?\fR) として出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.br
.na
\fB\fB--reverse \fR\fR
.ad
.sp .6
.RS 4n
必要に応じて、アルファベットの逆順、古い順、またはファイルサイズの小さい順で取得するために、ソート順序を逆にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.br
.na
\fB\fB--recursive \fR\fR
.ad
.sp .6
.RS 4n
サブディレクトリの内容を再帰的に出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--size \fR\fR
.ad
.sp .6
.RS 4n
各エントリについて、間接ブロックを含むブロック数を出力します
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
ファイルサイズ (逆順) でソートします。ファイルサイズが同じ場合は、単に名前だけではなくファイル名 (アルファベット順) でソートします。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
ファイル名ではなく、タイムスタンプ (新しい順) でソートします。デフォルトは最終修正時刻です \fB-c\fR、\fB-u\fR、および \fB-%\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
(\fB-t\fR オプションによる) ソートまたは (\fB-l\fR オプションによる) 出力において、最終修正時刻の代わりに、最終アクセス時刻を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.sp .6
.RS 4n
出力はソートされません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
\fB-l\fR とほぼ同じですが、\fB-l\fR 出力のほかに冗長な ACL 情報が表示される点が異なります。ACL を持たないファイルやディレクトリの場合でも、ACL 情報が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
\fB-l\fR とほぼ同じですが、\fB-l\fR 出力のあとにコンパクトな ACL 情報が表示される点が異なります。 
.sp
\fB-V\fR オプションを適用できるのは、Solaris の ZFS ファイルシステムなど、NFSv4 ACL をサポートするファイルシステムに対してだけです。
.sp
ACL の表示形式は次のとおりです。
.sp
.in +2
.nf
\fIentry_type\fR : \fIpermissions\fR : \fIinheritance_flags\fR : \fIaccess_type\fR
.fi
.in -2
.sp

\fIentry_type\fR に表示されるのは、次のいずれかです。
.sp
.ne 2
.mk
.na
\fBuser:\fIusername\fR\fR
.ad
.sp .6
.RS 4n
\fIusername\fR に対する追加のユーザーアクセス。
.RE

.sp
.ne 2
.mk
.na
\fBgroup:\fIgroupname\fR\fR
.ad
.sp .6
.RS 4n
グループ \fIgroupname\fR に対する追加のグループアクセス。
.RE

.sp
.ne 2
.mk
.na
\fBowner@\fR
.ad
.sp .6
.RS 4n
ファイルの所有者。
.RE

.sp
.ne 2
.mk
.na
\fBgroup@\fR
.ad
.sp .6
.RS 4n
ファイルのグループ所有者。
.RE

.sp
.ne 2
.mk
.na
\fBeveryone@\fR
.ad
.sp .6
.RS 4n
すべてのユーザーのアクセス。ファイルの所有者とグループ所有者も含みます。これは、POSIX の「other」クラスと等価ではありません。
.RE

\fB-v\fR、\fB-V\fR のいずれかのオプションを使用した場合、NFSv4 ACL モデルでサポートされている次のアクセス権が表示されます。
.sp
.ne 2
.mk
.na
\fBread_data (\fBr\fR)\fR
.ad
.sp .6
.RS 4n
ファイルのデータを読み取る権限。
.RE

.sp
.ne 2
.mk
.na
\fBlist_directory (\fBr\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリの内容を表示するためのアクセス権。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_data (\fBw\fR)\fR
.ad
.sp .6
.RS 4n
ファイルのデータを変更する権限。ファイルのオフセット範囲内の任意の場所。
.RE

.sp
.ne 2
.mk
.na
\fBadd_file (\fBw\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリに新しいファイルを追加するためのアクセス権。
.RE

.sp
.ne 2
.mk
.na
\fBappend_data (\fBp\fR)\fR
.ad
.sp .6
.RS 4n
ファイルのデータを変更する機能。ただし、変更できるのは EOF 以降のみです。
.RE

.sp
.ne 2
.mk
.na
\fBadd_subdirectory (\fBp\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリにサブディレクトリを作成する権限。
.RE

.sp
.ne 2
.mk
.na
\fBread_xattr (\fBR\fR)\fR
.ad
.sp .6
.RS 4n
ファイルの拡張属性を読み取る機能。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_xattr (\fBW\fR)\fR
.ad
.sp .6
.RS 4n
拡張属性を作成したり拡張属性ディレクトリに書き込んだりする機能。
.RE

.sp
.ne 2
.mk
.na
\fBexecute (\fBx\fR)\fR
.ad
.sp .6
.RS 4n
ファイルを実行する権限。
.RE

.sp
.ne 2
.mk
.na
\fBread_attributes (\fBa\fR)\fR
.ad
.sp .6
.RS 4n
ファイルの基本属性 (ACL 以外) を読み取る機能。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_attributes (\fBA\fR)\fR
.ad
.sp .6
.RS 4n
ファイルまたはディレクトリに関連付けられた時刻を任意の値に変更するためのアクセス権。
.RE

.sp
.ne 2
.mk
.na
\fBdelete (\fBd\fR)\fR
.ad
.sp .6
.RS 4n
ファイルを削除するためのアクセス権。
.RE

.sp
.ne 2
.mk
.na
\fBdelete_child (\fBD\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリ内のファイルを削除する権限。
.RE

.sp
.ne 2
.mk
.na
\fBread_acl (\fBc\fR)\fR
.ad
.sp .6
.RS 4n
ファイルの ACL を読み取る権限。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_acl (\fBC\fR)\fR
.ad
.sp .6
.RS 4n
ファイルの ACL を書き込む権限。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_owner (\fBo\fR)\fR
.ad
.sp .6
.RS 4n
ファイルの所有者を変更する権限。
.RE

.sp
.ne 2
.mk
.na
\fBsynchronize (\fBs\fR)\fR
.ad
.sp .6
.RS 4n
同期付きの読み取り権と書き込み権を使ってサーバー上のファイルにローカルアクセスする権限。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.sp .6
.RS 4n
アクセス権が許可されていない。
.RE

\fB-v\fR、\fB-V\fR のいずれかのオプションを使用した場合、NFSv4 ACL モデルでサポートされている次の継承フラグが表示されます。
.sp
.ne 2
.mk
.na
\fBfile_inherit (\fBf\fR)\fR
.ad
.sp .6
.RS 4n
新たに作成されたすべてのファイルに継承します。
.RE

.sp
.ne 2
.mk
.na
\fBdir_inherit (\fBd\fR)\fR
.ad
.sp .6
.RS 4n
新たに作成されたすべてのディレクトリに継承します。
.RE

.sp
.ne 2
.mk
.na
\fBinherit_only (\fBi\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリに対して指定された場合、そのディレクトリには適用せず、新たに作成されたファイルやディレクトリだけに適用します。このフラグを使用する際には、\fBfile_inherit\fR または \fBdir_inherit\fR、あるいはその両方も指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fBno_propagate (\fBn\fR)\fR
.ad
.sp .6
.RS 4n
ディレクトリ内のオブジェクトには ACL エントリを継承しますが、レベルが 1 つ下がった時点でその継承を停止すべきであることを示します。このフラグを使用する際には、\fBfile_inherit\fR または \fBdir_inherit\fR、あるいはその両方も指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fBsuccessful_access (\fBS\fR)\fR
.ad
.sp .6
.RS 4n
正常にアクセスしたときに、アラームまたは監査記録を開始するかどうかを指定します。監査/アラーム ACE タイプと同時に使用されます。
.RE

.sp
.ne 2
.mk
.na
\fBfailed_access (\fBF\fR)\fR
.ad
.sp .6
.RS 4n
アクセスに失敗したときに、アラームまたは監査記録を開始するかどうかを指定します。監査/アラーム ACE タイプと同時に使用されます。
.RE

.sp
.ne 2
.mk
.na
\fBinherited (\fBI\fR)\fR
.ad
.sp .6
.RS 4n
ACE が継承されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.sp .6
.RS 4n
アクセス権は付与されていません。
.RE

\fIaccess_type\fR に表示されるのは、次のいずれかのタイプです。
.sp
.ne 2
.mk
.na
\fBalarm\fR
.ad
.RS 9n
.rt  
アラームをトリガーするアクセス権を指定するアクセス権フィールド。
.RE

.sp
.ne 2
.mk
.na
\fBallow\fR
.ad
.RS 9n
.rt  
許可されたアクセス権を表すアクセス権フィールド。
.RE

.sp
.ne 2
.mk
.na
\fBaudit\fR
.ad
.RS 9n
.rt  
監査するアクセス権を指定するアクセス権フィールド。 
.RE

.sp
.ne 2
.mk
.na
\fBdeny\fR
.ad
.RS 9n
.rt  
拒否されたアクセス権を表すアクセス権フィールド。
.RE

例: 
.sp
.in +2
.nf
$ ls -dV /sandbox/dir.1
  drwxr-xr-x+  2 root     root           2 Jan 17 15:09 dir.1
                  user:marks:r-------------:fd-----:allow
                      owner@:--------------:-------:deny
                      owner@:rwxp---A-W-Co-:-------:allow
                      group@:-w-p----------:-------:deny
                      group@:r-x-----------:-------:allow
                   everyone@:-w-p---A-W-Co-:-------:deny
                   everyone@:r-x---a-R-c--s:-------:allow
$ 
                           ||||||||||||||||:||||||+ inherited access
                             ||||||||||||||:||||||+ failed access
                             ||||||||||||||:|||||+--success access
                             ||||||||||||||:||||+-- no propagate
                             ||||||||||||||:|||+--- inherit only
                             ||||||||||||||:||+---- directory inherit
                             ||||||||||||||:|+----- file inherit
                             ||||||||||||||
                             ||||||||||||||+ sync
                             |||||||||||||+- change owner
                             ||||||||||||+-- write ACL
                             |||||||||||+--- read ACL
                             ||||||||||+---- write extended attributes
                             |||||||||+----- read extended attributes
                             ||||||||+------ write attributes
                             |||||||+------- read attributes
                             ||||||+-------- delete child
                             |||||+--------- delete
                             ||||+---------- append
                             |||+----------- execute
                             ||+------------ write data
                             |+------------- read data
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIcols\fR\fR
.ad
.br
.na
\fB\fB--width\fR \fIcols\fR\fR
.ad
.sp .6
.RS 4n
カラム幅を強制的に \fIcols\fR にする複数カラム形式出力。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
複数カラム形式出力で、エントリを縦方向ではなく横方向にソートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.sp .6
.RS 4n
1 行の出力につき 1 つのエントリを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-@\fR\fR
.ad
.sp .6
.RS 4n
\fB-l\fR と似ていますが、拡張属性が存在していると \fBACL\fR は無効になります。拡張属性を持つファイルのアクセス権ビットの後ろにはアット記号 (\fB@\fR) が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-/\fR\fR
.ad
.sp .6
.RS 4n
\fB-/\fR オプションでは、\fBc\fR (コンパクトモード) と \fBv\fR (詳細モード) の 2 つのオプション引数がサポートされています。\fB-l\fR と同様に、長い形式のリストを表示します。さらに、基盤となるファイルシステムで拡張システム属性が完全にサポートされている場合は、ファイルに関連付けられた拡張システム属性も表示されます。
.sp
.ne 2
.mk
.na
\fB\fBappendonly\fR\fR
.ad
.sp .6
.RS 4n
オフセット \fBEOF\fR でのみファイルを変更できます。\fBEOF\fR 以外の場所でファイルを変更しようとすると、\fBEPERM\fR エラーが発生します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBarchive\fR\fR
.ad
.sp .6
.RS 4n
最後にバックアップが作成されたときから、ファイルが変更されたかどうかを指定します。ファイルの変更時刻 (\fBmtime\fR) が変更されるたびに、\fBarchive\fR 属性が設定されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBav_modified\fR\fR
.ad
.sp .6
.RS 4n
ファイルの内容やサイズが変更されたりファイルの名前が変更されたりするたびに、ZFS はウイルス対策属性を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBav_quarantined\fR\fR
.ad
.sp .6
.RS 4n
ウイルス対策ソフトウェアがファイルに検疫済みのマークを付けます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtime\fR\fR
.ad
.sp .6
.RS 4n
ファイル作成時のタイムスタンプ。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBhidden\fR\fR
.ad
.sp .6
.RS 4n
ファイルを非表示とマークを付けます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBimmutable\fR\fR
.ad
.sp .6
.RS 4n
ファイルの内容が変更されないようにします。アクセス時刻の更新を除く、すべてのメタデータの変更も防ぎます。ディレクトリにある場合は、ディレクトリ内のファイルの削除および作成もできません。\fBimmutable\fR とマークが付けられたファイルやディレクトリの内容を変更しようとすると、\fBEPERM\fR エラーが発生します。\fBimmutable\fR とマークが付けられたファイルの属性 (アクセス時刻、および適切な特権がある場合 \fBimmutable\fR を除く) を変更しようとすると、\fBEPERM\fR エラーが発生します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBnodump\fR\fR
.ad
.sp .6
.RS 4n
Solaris システムには、この属性専用のセマンティクスはありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnounlink\fR\fR
.ad
.sp .6
.RS 4n
ファイルが削除されないようにします。ディレクトリでは、この属性はディレクトリの内容への変更も防ぎます。つまり、ディレクトリ内のファイルの削除または名前の変更はできません。\fBnounlink\fR とマークが付けられたファイルおよびディレクトリのリンクを解除したり、名前を変更したりしようとすると、\fBerrno\fR \fB EPERM\fR が返されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR\fR
.ad
.sp .6
.RS 4n
ファイルに \fBreadonly\fR とマークを付けます。ファイルが \fBreadonly\fR とマークが付けられると、ファイルの内容データを変更できなくなります。ファイルのその他のメタデータは変更できます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBsparse\fR\fR
.ad
.sp .6
.RS 4n
この属性はユーザーおよびアプリケーションで使用可能であり、ファイルが疎であるものとして解釈できることを示します。ファイルが実際に疎であるかどうかは示さず、Solaris オペレーティングシステムに特別なセマンティクスはありません。ファイルの長さがゼロに切り詰められると、sparse 属性はクリアされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsystem\fR\fR
.ad
.sp .6
.RS 4n
Solaris システムには、この属性専用のセマンティクスはありません。 
.RE

.RE

.sp
.LP
コンパクトモード (\fB-/ c\fR) で使用される表示文字は、次のとおりです。 
.sp
.in +2
.nf
Attribute Name     Display
archive            A
hidden             H
readonly           R
system             S
appendonly         a
nodump             d
immutable          i
av_modified        m
av_quarantined     q
sparse             s
nounlink           u
.fi
.in -2
.sp

.sp
.LP
詳細モード (/ v) の表示では、属性の完全名が設定されていれば使用され、設定されていなければ接頭辞として 'no' が付いた名前が使用されます。
.sp
.LP
属性名 \fBcrtime\fR およびその他のすべてのタイムスタンプは、オプション \fB-%\fR に各タイムスタンプオプション引数および \fBall\fR オプション引数を付けて処理されます。表示位置は次のとおりです: 詳細モード (\fB-/ v\fR) の表示では、属性の完全名が設定されていれば使用され、設定されていなければ接頭辞として \fBno\fR が付いた名前が使用されます。属性名 \fBcrtime\fR およびその他のすべてのタイムスタンプは、オプション \fB-%\fR に各タイムスタンプオプション引数および \fBall\fR オプション引数を付けて処理されます。
.sp
.LP
表示位置は次のとおりです。
.sp
.in +2
.nf
{||||||||||}
 |||||||||||+- s (sparse)
 ||||||||||+-- O (offline)
 |||||||||+--- u (nounlink)
 ||||||||+---- q (av_quarantined)
 |||||||+----- m (av_modified)
 ||||||+------ i (immutable)
 |||||+------- d (nodump)
 ||||+-------- a (appendonly)
 |||+--------- S (system)
 ||+---------- R (readonly)
 |+----------- H (hidden)
 +------------ A (archive)
.fi
.in -2
.sp

.sp
.in +2
.nf
-% atime | crtime | ctime | mtime | all 
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fB\fBatime\fR\fR
.ad
.sp .6
.RS 4n
\fB-u\fR と同等です。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtime\fR\fR
.ad
.sp .6
.RS 4n
ソートまたは出力にファイルの作成時刻を使用します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBctime\fR\fR
.ad
.sp .6
.RS 4n
\fB-c\fR と同等です。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtime\fR\fR
.ad
.sp .6
.RS 4n
ソートまたは出力にファイル内容の最終変更時刻を使用します。 
.RE

.sp
.LP
拡張システム属性がサポートされていない場合、ユーザーがファイルに対する \fBread\fR 特権を持っていない場合、または \fBcrtime \fR 拡張属性が設定されていない場合、\fBcrtime\fR は \fBmtime\fR の同義語と見なされます。
.sp
.LP
オプション引数 \fB-all\fR が指定されている場合、\fB-atime\fR、\fB-ctime\fR、\fB-mtime\fR、および拡張システム属性をサポートするファイルシステムでは \fB- crtime\fR (作成時刻) を含むすべての使用可能なタイムスタンプが出力されます。オプション \fB-% all\fR を指定しても、タイムスタンプが長形式で表示されることには変わりなく、ソートも影響を受けません。
.sp
.ne 2
.mk
.na
\fB\fB--block-size\fR \fIsize \fR\fR
.ad
.sp .6
.RS 4n
サイズの倍数でサイズを表示します。サイズは接尾辞 \fBYyZzEePpTtGgMmKk\fR のいずれかを付けて指定できます。さらに、\fBB\fR を末尾に配置すると、2 乗ではなく 10 乗を指定できます。たとえば、次のように指定します。\fB10mB\fR は \fB10000000\fR バイトのブロックを意味し、\fB10m\fR は \fB10*2^20 -- 10485760 --\fR バイトのブロックを意味します。これは、\fB-h\fR オプションと同時には指定できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--color\fR \fB[=\fR\fI when\fR\fB]\fR\fR
.ad
.br
.na
\fB\fB--colour \fR\fB[=\fR\fIwhen\fR\fB]\fR\fR
.ad
.sp .6
.RS 4n
色対応の端末で色を使用してファイル名を表示します。\fIwhen\fR は、色出力を表示するタイミングを決定するオプション引数です。 
.sp
\fIwhen\fR に指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBalways\fR\fR
.ad
.br
.na
\fB\fByes\fR\fR
.ad
.br
.na
\fB\fBforce\fR\fR
.ad
.sp .6
.RS 4n
常に、色を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.br
.na
\fB\fBtty\fR\fR
.ad
.br
.na
\fB\fBif-tty\fR\fR
.ad
.sp .6
.RS 4n
端末が存在する場合に、色を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.br
.na
\fB\fBnever\fR\fR
.ad
.br
.na
\fB\fBnone\fR\fR
.ad
.sp .6
.RS 4n
色を使用しません。これはデフォルトです。
.RE

出力色を制御する方法については、色出力を参照してください。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
\fB-F\fR オプションと同様に、タイプに従ってファイルの後ろに接尾辞を表示しますが、実行可能ファイルに \fB*\fR が付加される点が異なります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-si\fR\fR
.ad
.br
.na
\fB\fB--\fR\fR
.ad
.sp .6
.RS 4n
\fB-h\fR オプションと同様に、人間が読みやすい形式でサイズを表示しますが、値が 1024 ではなく 1000 で繰り返し除算される点が異なります。末尾の \fB--si\fR または \fB-h\fR オプションは、使用される除数を決定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--time-style\fR style\fR
.ad
.sp .6
.RS 4n
指定された形式を使用して時刻を表示します。拡張属性 (\fB-%\fR) で表示される時刻は、この影響を受けません。 
.sp
\fIstyle\fR に指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBfull-iso\fR\fR
.ad
.sp .6
.RS 4n
\fB-E\fR と同等です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlong-iso\fR\fR
.ad
.sp .6
.RS 4n
すべてのファイルを \fIYYYY-MM-DD HH:MM\fR 形式で表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiso\fR\fR
.ad
.sp .6
.RS 4n
古いファイルを \fIYYYY-MM-DD\fR 形式、新しいファイルを \fIMM-DD HH:MM\fR 形式で表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlocale\fR\fR
.ad
.sp .6
.RS 4n
古いファイルと新しいファイルでデフォルトのロケール形式を使用します。これはデフォルトです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+FORMAT\fR\fR
.ad
.sp .6
.RS 4n
カスタム形式を使用します。値は、\fBstrftime\fR(3C) で説明したものと同じです。文字列に NEWLINE が表示される場合、1 番目の行が古いファイルに使用され、2 番目の行が新しいファイルに使用されます。それ以外の場合は、指定された形式がすべてのファイルで使用されます。
.RE

.RE

.SS "/usr/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
ディレクトリの末尾にスラッシュ (\fB/\fR) を、door の末尾に大記号 (\fB>\fR) を、実行可能ファイルの末尾にアスタリスク (\fB*\fR) を、\fBFIFO\fR の末尾に縦線 (\fB|\fR) を、シンボリックリンクの末尾に「at」記号 (\fB@\fR) を、\fBAF_UNIX\fR アドレスファミリソケットの末尾に等号 (\fB=\fR) を、それぞれ付加します。これらは、オペランドとして指定したシンボリックリンクのあとに表示されます。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
実行可能ファイルを除いて、\fB-F\fR と同様にエントリにマークします。実行可能ファイルはマークされません。これらは、オペランドとして指定したシンボリックリンクのあとに表示されます。
.RE

.sp
.LP
次のオプションは、同時に指定できません。このような矛盾する組み合わせでオプションを指定してもエラーにはなりません。 \fB-C\fR と \fB-l\fR (小文字のエル)、\fB-m\fR と \fB-l\fR (小文字のエル)、\fB-x\fR と \fB-l\fR (小文字のエル)、\fB-@\fR と \fB-l\fR (小文字のエル)。\fB-l\fR オプションは、各ペアに指定されたその他のオプションよりも優先されます。
.sp
.LP
次のオプションは、同時に指定できません。このような矛盾するグループでオプションを指定してもエラーにはなりません。\fB-C\fR と \fB-l\fR (数字の 1)、\fB-H\fR と \fB-L\fR、\fB-c\fR と \fB-u\fR、\fB-e\fR と \fB-E\fR、\fB-t\fR と \fB- S\fR。特定のタイムスタンプを指定する最後のオプション (\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR、および \fB-% mtime\fR) は、ソートまたは長形式リストで使用されるタイムスタンプを決定します。最後のオプション (\fB-t\fR、\fB-S\fR、または \fB-U\fR) は、ソート動作を決定します。
.SS "/usr/xpg4/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
ディレクトリの末尾にスラッシュ (\fB/\fR) を、door の末尾に大記号 (\fB>\fR) を、実行可能ファイルの末尾にアスタリスク (\fB*\fR) を、\fBFIFO\fR の末尾に縦線 (\fB|\fR) を、シンボリックリンクの末尾に「at」記号 (\fB@\fR) を、\fBAF_UNIX\fR アドレスファミリソケットの末尾に等号 (\fB=\fR) を、それぞれ付加します。これらは、オペランドとして指定したシンボリックリンクのあとに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
実行可能ファイルを除いて、\fB-F\fR と同様にエントリにマークします。実行可能ファイルはマークされません。これらは、オペランドとして指定したシンボリックリンクのあとに表示されます。
.RE

.sp
.LP
次のオプションは、同時に指定できません。このような矛盾するグループでオプションを指定してもエラーにはなりません。\fB-C\fR と \fB-l\fR (小文字のエル)、\fB-m\fR と \fB-l\fR (小文字のエル)、\fB-x\fR と \fB-l\fR (小文字のエル)、\fB-@\fR と \fB-l\fR (小文字のエル)、\fB-C\fR と \fB-1\fR (数字の 1)、\fB-H\fR と \fB-L\fR、\fB-c\fR と \fB-u\fR、\fB-e\fR と \fB-E\fR、\fB-t\fR と \fB-S\fR と \fB- U\fR。特定のタイムスタンプを指定する最後のオプション (\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR、および \fB-% mtime\fR) は、ソートまたは長形式リストで使用されるタイムスタンプを決定します。最後のオプション (\fB-t\fR、\fB-S\fR、または \fB-U\fR) は、ソート動作を決定します。
.SS "/usr/xpg6/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
ディレクトリの末尾にスラッシュ (\fB/\fR) を、door の末尾に大記号 (\fB>\fR) を、実行可能ファイルの末尾にアスタリスク (\fB*\fR) を、\fBFIFO\fR の末尾に縦線 (\fB|\fR) を、シンボリックリンクの末尾に「at」記号 (\fB@\fR) を、\fBAF_UNIX\fR アドレスファミリソケットの末尾に等号 (\fB=\fR) を、それぞれ付加します。これらは、\fB-H\fR オプションまたは \fB-L\fR オプションを指定しないかぎり、オペランドとして指定したシンボリックリンクの後に表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
実行可能ファイルを除いて、\fB-F\fR と同様にエントリにマークします。実行可能ファイルはマークされません。これらは、\fB-H\fR オプションまたは \fB-L\fR オプションを指定しないかぎり、オペランドとして指定したシンボリックリンクの後に表示されません。
.RE

.sp
.LP
次のオプションは、同時に指定できません。このような矛盾する組み合わせでオプションを指定してもエラーにはなりません。\fB-C\fR と \fB-l\fR (小文字のエル)、m と \fB-l\fR (小文字のエル)、\fB-x\fR と \fB-l\fR (小文字のエル)、\fB-@\fR と \fB-l\fR (小文字のエル)、\fB-C\fR と \fB-1\fR (数字の 1)、\fB-H\fR と \fB-L\fR、\fB-c\fR と \fB-u\fR、および \fB-e\fR と \fB-E\fR、\fB-t\fR と \fB-S\fR と \fB- U\fR。特定のタイムスタンプを指定する最後のオプション (\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR、および \fB-% mtime\fR) は、ソートまたは長形式リストで使用されるタイムスタンプを決定します。最後のオプション (\fB-t\fR、\fB-S\fR、または \fB-U\fR) は、ソート動作を決定します。
.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.sp .6
.RS 4n
内容を印刷するファイルのパス名。ここで指定したファイルが見つからない場合、標準エラー出力に診断メッセージが書き出されます。
.RE

.SH 使用法
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBls\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 使用例
.LP
\fB例 1 \fRファイルのアクセス権の表示
.sp
.LP
次の例は、特定のファイルに関する詳細情報を表示する方法を示したものです。

.sp
.in +2
.nf
% ls -l file.1
-rw-r--r--   1 gozer    staff     206663 Mar 14 10:15 file.1 
.fi
.in -2
.sp

.sp
.LP
上記のアクセス権文字列 (\fB-rw-r--r--\fR) から、ファイルの所有者が読み取り権と書き込み権を、所有者のグループが読み取り権を、その他のユーザーが読み取り権を、それぞれ持っていることがわかります。 

.sp
.LP
次の例は、特定のディレクトリに関する詳細情報を表示する方法を示したものです。 

.sp
.in +2
.nf
% ls -ld test.dir
drwxr-xr-x   2 gozer    staff          2 Mar 14 10:17 test.dir    
.fi
.in -2
.sp

.sp
.LP
前述のアクセス権文字列 (\fBdrwxr-xr-x\fR) から、ディレクトリの所有者が読み取り権、書き込み権、および検索権を、所有者のグループが読み取り権と検索権を、その他のユーザーが読み取り権と検索権を、それぞれ持っていることがわかります。

.sp
.LP
ファイルのアクセス権を表示する別の例を、次に示します。 

.sp
.in +2
.nf
% ls -l file.2
-rw-rwl---   1 gozer    staff     206663 Mar 14 10:47 file.2
.fi
.in -2
.sp

.sp
.LP
前述のアクセス権文字列 (\fB-rw-rwl---\fR) から、ファイルの所有者が読み取り権と書き込み権を、所有者のグループが読み取り権と書き込み権を、それぞれ持っていることがわかります。また、アクセス中にファイルがロックされる可能性のあることもわかります。

.LP
\fB例 2 \fRファイルやディレクトリの ACL 情報を表示する
.sp
.LP
次の例は、特定の ZFS ファイルの冗長な ACL 情報を表示する方法を示したものです。

.sp
.in +2
.nf
% ls -v file.1
-rw-r--r--   1 marks    staff     206663 Mar 14 10:15 file.1
     0:owner@:execute:deny
     1:owner@:read_data/write_data/append_data/write_xattr/write_attributes
          /write_acl/write_owner:allow
     2:group@:write_data/append_data/execute:deny
     3:group@:read_data:allow
     4:everyone@:write_data/append_data/write_xattr/execute/write_attributes
          /write_acl/write_owner:deny
     5:everyone@:read_data/read_xattr/read_attributes/read_acl/synchronize
          :allow
.fi
.in -2
.sp

.sp
.LP
次の例は、特定の ZFS ディレクトリのコンパクトな ACL 情報を表示する方法を示したものです。

.sp
.in +2
.nf
% ls -dV test.dir
drwxr-xr-x   2 marks    staff          2 Mar 14 10:17 test.dir
            owner@:--------------:------:deny
            owner@:rwxp---A-W-Co-:------:allow
            group@:-w-p----------:------:deny
            group@:r-x-----------:------:allow
            everyone@:-w-p---A-W-Co-:------:deny
            everyone@:r-x---a-R-c--s:------:allow
.fi
.in -2
.sp

.sp
.LP
次の例は、UFS ファイルの ACL 情報を一覧表示する際の \fBls\fR \fB-v\fR の動作を示したものです。

.sp
.in +2
.nf
$ ls -v file.3
-rw-r--r--   1 root     root        2703 Mar 14 10:59 file.3
     0:user::rw-
     1:group::r--               #effective:r--
     2:mask:r--
     3:other:r--
.fi
.in -2
.sp

.LP
\fB例 3 \fR全ファイルの名前を出力
.sp
.LP
次の例は、現在のディレクトリ中にあるすべてのファイルの名前を出力します。通常は名前が出力されない、先頭にドット \fB\&.\fR が付いているファイルの名前も出力します。

.sp
.in +2
.nf
example% \fBls -a\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRファイルの情報を出力する
.sp
.LP
次の例では、ファイルの情報を提供します。

.sp
.in +2
.nf
example% ls -aisn
.fi
.in -2
.sp

.sp
.LP
このコマンドは、ドットで始まるものを含む、すべてのファイルについて (\fBa\fR)、\fBi\fR 番号 \(em ファイルに対応する i ノードのメモリーアドレス \(em をカラムの左側に (\fBi\fR)、ファイルのサイズ (ブロック単位) を i 番号の右のカラムに (\fBs\fR) 出力します。さらに、コマンドによる出力形式は、ファイルに関連する \fBUID\fR 番号 (ユーザー名の代わり) と \fBGID\fR 番号 (グループ名の代わり) が出力されるロング出力形式の数値バージョン (\fBn\fR) になります。\fB\fR\fB\fR

.sp
.LP
ディレクトリ内のファイルのサイズを出力する際、間接ブロックを含むブロックの総数を出力します。

.LP
\fB例 5 \fR拡張システム属性の情報の提供
.sp
.in +2
.nf
example% ls -/ c file    (extended system attribute in compact mode)
-rw-r--r--   1 root     root           0 May 10 14:17 file    
                         {AHRSadim-u}
.fi
.in -2
.sp

.sp
.LP
この例では、\fBav_quarantined\fR は設定されません。 
.sp
.in +2
.nf
example% ls -/ v file (extended system attribute in verbose mode)
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {archive,hidden,readonly,system,appendonly\e
                 nodump,immutable,av_modified,\e
                 noav_quarantined,nounlink}

example% ls -/ v file     (no extended system attribute)
-rw-r--r--  1 root    staff        0 May 16 14:48 file
               {}

example% ls -/ c file        (extended system attribute 
                              supported file system)

-rw-r--r--  1 root staff        3 Jun  4 22:04 file
               {A------m--}
.fi
.in -2
.sp

.sp
.LP
拡張システム属性がサポートされるファイルでは、\fBarchive\fR および \fBav_modified\fR 属性はデフォルトで設定されます。
.sp
.in +2
.nf
example% ls -/ c  -%crtime file

-rw-r--r--    root     root          0 May 10 14:17 file
               {AHRSadim-u}
.fi
.in -2
.sp

.sp
.LP
この例では、作成時刻としてタイムスタンプが表示されます。
.sp
.in +2
.nf
example% ls -l -%all file
-rw-r--r--   1 root     root           0 May 10 14:17    file
                timestamp: atime    Jun 14 08:47:37 2007
                timestamp: ctime    May 10 14:20:23 2007
                timestamp: mtime    May 10 14:17:56 2007
                timestamp: crtime   May 10 14:17:56 2007

example% ls -%crtime -tl file*

-rw-r--r--   1 foo      staff          3 Jun  4 22:04 file1
-rw-r--r--   1 root     root           0 May 10 14:17 file
-rw-r--r--   1 foo      staff          0 May  9 13:49 file.1
.fi
.in -2
.sp

.sp
.LP
この例では、ファイルは作成時刻でソートされます。 
.SH 環境
.sp
.LP
\fBls\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_TIME\fR、\fBLC_MESSAGES\fR、\fBNLSPATH\fR、および \fBTZ\fR。
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR\fR
.ad
.sp .6
.RS 4n
複数のテキストカラムからなる出力を生成する場合に、ユーザーが希望するカラム幅の値を指定します。この変数の値が10 進整数を示す文字列の場合、\fBls\fR は書き出すパス名テキストカラムの数を、その幅の値を元に計算します (\fB-C\fR の説明を参照)。\fBCOLUMNS\fR が設定されていない、または値が不適当な場合には、カラム幅として 80 が用いられます。どのディレクトリのファイル名を出力する場合でも、選択されたカラム幅は一定です。複数テキストカラムを出力する際、ファイル名は長すぎても切り捨てられません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLS_COLORS\fR\fR
.ad
.sp .6
.RS 4n
色出力の出力時に使用される色スキーマを決定します。これを設定せずに色出力が指定されている場合は、デフォルトのスキーマが使用されます。TERM が設定されていない場合、色出力は使用されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTERM\fR\fR
.ad
.sp .6
.RS 4n
端末のタイプを決定します。この変数が未設定または NULL の場合は、--color オプションの値に関係なく、色出力が生成されません。
.RE

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
情報はすべて正常に書き込まれました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.sp .6
.RS 4n
\fBls\fR \fB-l\fR および \fBls\fR \fB-g\fR 用のグループ ID
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
\fBls\fR \fB-l\fR および \fBls\fR \fB-o\fR 用のユーザー ID
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/terminfo/?/*\fR\fR
.ad
.sp .6
.RS 4n
端末情報データベース
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
_
インタフェースの安定性確実
_
標準下記を参照。
.TE

.sp
.LP
\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E\fR、\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR、および \fB--time-style\fR を除くすべてのオプションについては、\fBstandards\fR(5) を参照してください。
.SS "/usr/xpg4/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準下記を参照。
.TE

.sp
.LP
\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E\fR、\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR、および \fB--time-style\fR を除くすべてのオプションについては、\fBstandards\fR(5) を参照してください。
.SS "/usr/xpg6/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu6
_
CSI有効
_
インタフェースの安定性確実
_
標準下記を参照。
.TE

.sp
.LP
\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E\fR、\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR、および \fB--time-style\fR を除くすべてのオプションについては、\fBstandards\fR(5) を参照してください。
.SH 関連項目
.sp
.LP
\fBchmod\fR(1), \fBcp\fR(1), \fBsetfacl\fR(1), \fBfgetattr\fR(3C), \fBstrftime\fR(3C), \fBterminfo\fR(4), \fBacl\fR(5), \fBattributes\fR(5), \fBenviron\fR(5), \fBfsattr\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
ファイル名に出力できない文字があると、カラムの出力オプションが正しく処理されないことがあります。
.sp
.LP
ハードリンクされたファイルがある場合、総ブロック数は正しく表示されません。
.sp
.LP
\fBls\fR の出力のソート順序はロケールの影響を受け、\fBLC_COLLATE\fR 環境変数で変更できます。たとえば、\fBLC_COLLATE\fR が \fBC\fR の場合、ファイルを表示する順序は、ファイル名がドット (.) で始まるファイル、次にファイル名が大文字で始まるファイル、その後にファイル名が小文字で始まるファイルという順番になります。一方、\fBLC_COLLATE\fR が \fBen_US.ISO8859-1\fR の場合には、ソート順序を決定する際に、先行するドットや大文字と小文字の区別は無視されます。
