Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/man.1
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright (c) 1980 Regents of the University of California. The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.TH man 1 "2011 年 8 月 16 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
man \- マニュアルページの表示
.SH 形式
.LP
.nf
\fBman\fR [\fB-\fR] [\fB-adFlrt\fR] [\fB-M\fR \fIpath\fR] [\fB-T\fR \fImacro-package\fR] [\fB-s\fR \fIsection\fR] \fIname\fR...
.fi

.LP
.nf
\fBman\fR [\fB-M\fR \fIpath\fR] [\fB-s\fR \fIsection\fR] \fB-k\fR \fIkeyword\fR...
.fi

.LP
.nf
\fBman\fR [\fB-M\fR \fIpath\fR] \fB-f\fR \fIfile\fR...
.fi

.LP
.nf
\fBman\fR [\fB-M\fR \fIpath\fR]  [\fB-s\fR \fIsection\fR] \fB-K\fR \fIstring\fR...
.fi

.SH 機能説明
.sp
.LP
\fBman\fR コマンドは、リファレンスマニュアルから得た情報を表示します。\fIname\fR で選択された完全なマニュアルページか、\fIkeyword\fR または \fIstring\fR (\fB-k\fR または \fB-K\fR) と関連するファイルの名前 (\fB-f\fR) のどちらかで選択された 1 行から成る要約情報を出力します。マニュアルページが見つからない場合、\fBman\fR はエラーメッセージを出力します。
.SS "ソース形式"
.sp
.LP
リファレンスマニュアルのページは、\fBnroff\fR (\fBnroff\fR(1) を参照) または \fBSGML\fR (Standard Generalized Markup Language) タグ (\fBsgml\fR(5) を参照) のどちらかのタグがマークアップされています。\fBman\fR コマンドはそのマークアップの種類を認識して、適宜にファイルを処理します。マークアップの種類によって分けられたディレクトリに、個々のソースファイルが置かれています。
.SS "マニュアルページの位置"
.sp
.LP
オンラインのリファレンスマニュアルのページのディレクトリは、通常 \fB/usr/share/man\fR ディレクトリにあります。\fBnroff\fR のソースは、\fB/usr/share/man/man\fR* ディレクトリにあります。\fBSGML\fR のソースは、\fB/usr/share/man/sman\fR* ディレクトリにあります。各ディレクトリは、マニュアルのセクションごとに対応しています。これらのディレクトリは必須ではないため、ホスト上にインストールされているとは限りません。存在していなければ、ほかのホストから \fB/usr/share/man\fR をマウントしてください。
.sp
.LP
事前整形された最新バージョンが \fBcat\fR* または \fBfmt\fR* ディレクトリ中にあれば、\fBman\fR は単にそれを表示または印刷します。バージョンが古かったり存在しない場合には、\fBman\fR は再フォーマット処理を行なってから出力し、\fBcat\fR* または \fBfmt\fR* が書き込み可の場合に事前整形されたバージョンを格納します。インデックスファイルは更新されません。\fBcatman\fR(1M) を参照してください。事前整形されたバージョン用のディレクトリが提供されていない場合、\fBman\fR は要求に応じてページを再フォーマットし、表示処理中、フォーマットされたテキストを一時ファイルに収納します。\fB\fR
.sp
.LP
標準出力が端末ではない場合、または `\fB-\fR'フラグが指定された場合には、\fBman\fR は \fBcat\fR(1) を通じてテキストを出力します。それ以外の場合、\fBman\fR はページごとの出力や下線付けを画面上で行うために \fBmore\fR(1) を通じて出力します。
.SS "クエリー文字列"
.sp
.LP
\fB-k\fR または \fB-K\fR オプションを使用して、キーワードまたはクエリー文字列でマニュアルページを検索できます。 インデックスファイルベースの全文テキスト検索、ステミング、および選択マッチングがサポートされています。インデックスファイルの生成方法については、\fBcatman\fR(1M) および \fBman\fR(5) を参照してください。
.sp
.LP
英語の場合、たとえば \fBcat\fR という語幹でステミングを実行すると、\fBcats\fR、\fBcatlike\fR、\fBcatty\fR などの文字列が検索されます。\fBstem\fR でステミングを実行すると、\fBstemmer\fR、\fBstemming\fR、および \fBstemmed\fR が検索されます。ステミングのアルゴリズムによって、\fBfishing\fR、\fBfished\fR、\fBfish\fR、および \fBfisher\fR という単語が \fBfish\fR という語幹に変換されます。
.sp
.LP
マッチングでは、大文字と小文字が区別されます。ステミングは、英語のマニュアルページでのみ使用できます。
.sp
.LP
一致したマニュアルページは保存され、クエリー文字列の一致した頻度が多い順か、または複数の一致がある場合は一致レベルが高い順に表示されます。
.sp
.LP
Oracle Solaris のマニュアルページは、\fB名前\fR、\fB形式\fR、\fB機能説明\fR などのセクションに分かれています。ユーザーは、\fB-K\fR オプションで詳しく説明しているように、検索範囲を 1 つのセクションに限定できます。
.SH オプション
.sp
.LP
次のオプションを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 20n
.rt  
\fBMANPATH\fR 検索パス中で \fIname\fR に一致したすべてのマニュアルページを出力します。複数個あるときは、見つかった順序で出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 20n
.rt  
デバッグモード。セクションを示す引数に対応する値、検索に用いた方法、および \fBman\fR が検索を行なったパスを表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile ...\fR\fR
.ad
.RS 20n
.rt  
\fB\fR指定された \fIfile\fR のいずれかに関連するマニュアルページを探しだします。各 \fIfile\fR から先頭のパス名部分を取り除き、そのベース名または名前を含む 1 行の要約情報を出力します。  
.sp
このオプションは、インデックスファイルを使用します。 インデックスファイルの生成方法については、\fBcatman\fR(1M) および \fBman\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fR
.ad
.RS 20n
.rt  
インデックス照合ファイルを使う代わりに、\fBMANPATH\fR で指定した全ディレクトリまたは \fBman.cf\fR ファイルを使って検索を行うよう \fBman\fR に指示します。 このオプションは、インデックスファイルの内容が最新状態にない場合に便利な指定で、\fBman\fR コマンドのデフォルトの動作です。そのため、通常はこのオプションを起動する必要はありません。参考のためにここに記述しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkeyword ...\fR\fR
.ad
.RS 20n
.rt  
インデックスファイルから 1 行のサマリーを出力します。 
.sp
インデックスファイルの生成方法については、\fB-K\fR オプションを参照してください。インデックスファイルがない場合、マニュアルページファイルが直接照合されるため、インデックスファイルが存在する場合に比べて応答時間が遅くなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR \fIstring ...\fR\fR
.ad
.RS 20n
.rt  
指定した文字列をインデックスファイルから検索します。インデックスファイルがない場合、マニュアルページファイルに対して直接検索が実行されるため、検索速度が非常に遅くなります。
.sp
検索オプション引数で左から 1 番目のテキストとしてセクション名を追加し、その最後にコロン (\fB:\fR) を付けて \fI"セクション名: クエリー文字列"\fR のようにすると、そのクエリー文字列の検索は指定したセクションに対してのみ実行されます。指定したセクション名が存在しない場合、この指定は無視され、マニュアルページ全体に対して検索が実行されます。
.sp
\fB-f\fR、\fB-k\fR、または \fB-K\fR によって使用されるインデックスファイルは、\fBman\fR(5) で指定されている \fBrestart_fmli\fR アクチュエータで指定されたマニュアルページパッケージのインストール中に SMF サービスによって自動的に生成されるか、または \fBcatman\fR(1M) で \fB-w\fR オプションを指定して手動で生成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 20n
.rt  
検索パス内にある、\fIname\fR に一致するマニュアルページをすべて一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fIpath\fR\fR
.ad
.RS 20n
.rt  
マニュアルページ用に別の検索パスを指定します。\fIpath\fR には、マニュアルページのディレクトリサブツリーを含んだディレクトリの名前をコロンで区切って記述します。たとえば \fIpath\fR の値として \fB/usr/share/man:/usr/local/man\fR と指定すると、\fBman\fR は最初に標準のディレクトリを検索し、次に \fB/usr/local/man\fR を検索して \fIname\fR を探します。\fB-f\fR、\fB-k\fR または \fB-K\fR オプションとともに使用する場合は、\fB-M\fR オプションを最初に記述する必要があります。\fIpath\fR 中の各ディレクトリ中には、各セクションにつき 1 つの \fBman\fR* または \fBsman\fR* という名のサブディレクトリが存在していると見なされます。このオプションは、\fBMANPATH\fR 環境変数より優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 20n
.rt  
マニュアルページを再フォーマットするだけで、結果の表示は行いません。この指定は、\fBman\fR \fB-\fR \fB-t\fR \fIname\fR と同等です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsection ...\fR\fR
.ad
.RS 20n
.rt  
\fBman\fR で検索するマニュアルのセクションを指定します。\fIsection\fR 引数に対応するディレクトリだけを検索して \fIname\fR を探します。\fIsection\fR の値は 1 桁の数字で、検索対象のセクション名を伴う場合もあります (たとえば、"\fB3lib\fR")。または、\fIsection\fR を 1 つの単語 (たとえば、\fBlocal\fR、\fBnew\fR、\fBold\fR、\fBpublic\fR) にすることもできます。また、\fIsection\fR は 1 文字の場合もあります。複数のセクションを指定するには、各セクションをコンマで区切ります。このオプションは、\fBMANPATH\fR 環境変数や \fBman.cf\fR ファイルより優先されます。\fBman\fR で検索を実行する方法の説明については、後続の「検索パス」を参照してください。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 20n
.rt  
\fBman\fR は、指定されたマニュアルページが、適切なラスター出力デバイス用に \fBtroff\fR されるようにします (\fBtroff\fR(1) を参照)。\fB-\fR と \fB-t\fR の両オプションがともに指定された場合、\fBman\fR は指定された各 \fIname\fR の \fBtroff\fR バージョンを (必要であれば) 更新しますが、結果の出力は行いません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fImacro-package\fR\fR
.ad
.RS 20n
.rt  
マニュアルページをフォーマットする際、\fB/usr/share/lib/tmac/an\fR に定義されている標準の \fB-man\fR マクロの代わりに、\fImacro-package\fR が示すパッケージを使用します。デフォルトの検索パスの順序に関する詳しい説明については、後述の「使用法」の「検索パス」を参照してください。\fB\fR
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 8n
.rt  
標準ユーティリティーまたはキーワードの名前。
.RE

.SH 使用法
.sp
.LP
\fBman\fR の使用方法は次のとおりです。
.SS "マニュアルページのセクション"
.sp
.LP
マニュアルページはセクションという単位に分類されています。各セクションの名前は、主セクション名 (通常は 1 桁の数字) と、サブセクション名 (通常は 1 つ以上の文字) からなります (サブセクション名の指定は任意)。\fI\fR主セクション名 (例: "\fB9\fR") を、そのセクションのサブセクション名 (例: "\fB9e\fR"、"\fB9f\fR"、"\fB9s\fR" など) の省略名として使用することはできません。サブセクションを検索する場合は、\fBman\fR \fB-s\fR で個別に指定する必要があります。各セクションに属するマニュアルページ群は、共通のカテゴリに属しており、その中でさらに細かく分類するためにサブセクションがあります。このリリースで使用されている分類の説明については、\fBintro\fR のマニュアルページを参照してください。
.sp
.LP
次に、マニュアルページの各セクションと、そこに含まれている情報について簡単について説明します。 
.RS +4
.TP
.ie t \(bu
.el o
セクション 1 では、このオペレーティングシステムで使用できるコマンドをアルファベット順に説明しています。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 1M では、主にシステムの保守や管理に使用するコマンドを、アルファベット順に説明しています。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 2 では、すべてのシステムコールについて説明しています。これらのコールのほとんどに、1 つ以上のエラーの戻り値があります。エラー状態は、ほかの場合には返されない戻り値によって示されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 3 では、さまざまなライブラリにある関数のうち、セクション 2 で説明されている、UNIX システムのプリミティブを直接呼び出す関数以外について説明しています。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 4 では、さまざまなファイルの形式の概要について説明しています。C 言語の構造体によるファイル形式の宣言も適宜示します。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 5 には、文字セット表などのその他のドキュメントが含まれています。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 7 では、特定のハードウェア周辺装置やデバイスドライバを参照する、さまざまな特殊ファイルについて説明しています。また、STREAMS ソフトウェアのドライバやモジュール、STREAMS で一般的な一連のシステムコールについても説明しています。
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 9E では、開発者がデバイスドライバに含めることのできる DDI (デバイスドライバインタフェース)/DKI (ドライバ/カーネルインタフェース)、DDI のみ、および DKI のみのエントリポイントルーチンについて説明しています。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
このセクションでは、デバイスドライバで使用可能なカーネル関数について説明します。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
セクション 9S では、ドライバとカーネルの間で情報を共有するためにドライバによって使用されるデータ構造について説明しています。 
.RE
.SS "検索パス"
.sp
.LP
指定されたある \fIname\fR を検索する前に、\fBman\fR はまず候補となりうるディレクトリとセクションのリストを構築します。\fBman\fR は環境変数 \fBMANPATH\fR が示すディレクトリ群の中で \fIname\fR を探します。
.sp
.LP
\fBMANPATH\fR が存在しない場合、\fBman\fR は最初に \fBPATH\fR 要素の最後のコンポーネントに \fBman\fR を代入することによって、\fBPATH\fR 環境変数に基づいた検索パスを作成します。\fB/sbin\fR、\fB/usr/ucb\fR、\fB/usr/xpg4/bin\fR などのディレクトリの独自の特性に対応するために、特別なプロビジョニングが追加されています。ファイル引数に \fB/\fR 文字が含まれる場合は、検索パスを作成するために \fBPATH\fR 要素の代わりに引数の \fIdirname\fR 部分が使用されます。
.sp
.LP
マニュアルページのディレクトリ内において、\fBman\fR は次に示すセクションだけを次の順序で検索します。
.RS +4
.TP
.ie t \(bu
.el o
\fI\fRコマンド行上で \fB-s\fR オプションにより指定されたセクション群
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fI\fR\fBMANPATH\fR 環境変数に埋め込まれているセクション群
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fI\fR\fBMANPATH\fR 環境変数が示す各ディレクトリの \fBman.cf\fR ファイル中に指定されているセクション群
.RE
.sp
.LP
前述の指定がいずれも存在しない場合には、\fBman\fR はマニュアルページパス中の各ディレクトリを検索し、最初に見つかったマニュアルページだけを表示します。
.sp
.LP
\fBman.cf\fR ファイルの形式は次のとおりです。
.sp
.in +2
.nf
MANSECTS=\fIsection\fR[,\fIsection\fR]... 
.fi
.in -2
.sp

.sp
.LP
文字 `\fB#\fR' で始まる行および空行は注釈と見なされ、無視されます。\fBMANPATH\fR が示す各ディレクトリには、そのディレクトリのデフォルトの検索順序を指定するマニュアルページ設定ファイルを含めることができます。
.SH マニュアルページのフォーマット
.sp
.LP
マニュアルページは \fBnroff\fR(1) または \fBsgml\fR(5) でマークアップされています。\fBnroff\fR のマニュアルページは、\fB-man\fR マクロパッケージにより用意されている \fBnroff\fR(1) または \fBtroff\fR(1) によって処理されます。マクロの使用法については、\fBman\fR(5) を参照してください。\fBSGML\fR タグがついたマニュアルページは、\fBSGML\fR パーサーによって処理され、フォーマッタに引き渡されます。
.SS "\fBnroff\fR マニュアルページの前処理"
.sp
.LP
\fBnroff\fR マニュアルページをフォーマットする際、\fBman\fR は、先頭行を検査して特殊な処理が必要かどうかを判断します。先頭行が
.sp
.in +2
.nf
\&'\e" \fIX\fR
.fi
.in -2
.sp

.sp
.LP
という形式の文字列 (\fIX\fR と `\fB"\fR' の間は 1 つのスペース文字) であり、次に示す文字の任意の組み合わせで構成されている場合、\fBman\fR は入力テキストを対応するプリプロセッサを介して \fBtroff\fR(1) または \fBnroff\fR(1) に送ります。
.sp
.ne 2
.mk
.na
\fB\fBe\fR\fR
.ad
.RS 5n
.rt  
\fBeqn\fR(1)、または \fBnroff\fR の場合は \fBneqn\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 5n
.rt  
\fBrefer\fR(1)
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
\fBtbl\fR(1) 
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.RS 5n
.rt  
\fBvgrind\fR(1)
.RE

.sp
.LP
\fBeqn\fR または \fBneqn\fR は、呼び出されると自動的にファイル \fB/usr/pub/eqnchar\fR を読み取ります (\fBeqnchar\fR(5) を参照)。\fBnroff\fR(1) が呼び出されると、\fBcol\fR(1) が自動的に使用されます。
.SS "ほかの \fBnroff\fR マニュアルページへの参照"
.sp
.LP
\fBnroff\fR のマニュアルページの先頭行が、次のパターンで別のマニュアルページを参照している場合、
.sp
.in +2
.nf
\&.so man*/\fIsourcefile\fR
.fi
.in -2
.sp

.sp
.LP
\fBman\fR は、現在のファイルの代わりにその参照されているファイルを処理します。この参照は、マニュアルページのディレクトリサブツリーのルートに対して相対的なパス名として表現されている必要があります。
.sp
.LP
2 行目以降の行が \fB\&.so\fR で開始されている場合、\fBman\fR はそれを無視し、\fBtroff\fR(1) または \fBnroff\fR(1) は通常の方法で要求を処理します。
.SS "SGML マニュアルページの処理"
.sp
.LP
マニュアルページは、ファイル中に \fB<!DOCTYPE\fR という文字列が存在することによって、SGML でマークアップされていると特定されます。ファイルに \fBSHADOW_PAGE\fR という文字列も含まれている場合、そのファイルは別のマニュアルページの内容を参照します。この参照は、テキストが含まれているマニュアルページへのファイル実体の参照によって行われます。これは、\fBnroff\fR フォーマットのマニュアルページで使用される \fB\&.so\fR のメカニズムに類似しています。
.SH 環境
.sp
.LP
\fBman\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。 
.sp
.ne 2
.mk
.na
\fB\fBMANPATH\fR\fR
.ad
.RS 11n
.rt  
コロンで区切られたディレクトリのリスト。各ディレクトリは、コンマで区切られたセクションのリストのあとに続いて指定できます。この環境変数に値を設定すると、デフォルトのディレクトリ検索パスである \fB/usr/share/man\fR と、デフォルトのセクション検索パスである \fBman.cf\fR を無効にします。また、\fB-M\fR フラグはデフォルトのディレクトリ検索パスを、\fB-s\fR フラグはデフォルトのセクション検索パスを、それぞれ無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAGER\fR\fR
.ad
.RS 11n
.rt  
\fBman\fR の出力を対話モードで画面に送るために使用するプログラム。この環境変数が設定されていない場合は、`\fBmore\fR \fB-s\fR' が使用されます。\fBmore\fR(1) を参照してください。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCAT\fR\fR
.ad
.RS 11n
.rt  
\fBtroff\fR で処理されたマニュアルページを表示するために使用するプログラムの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTROFF\fR\fR
.ad
.RS 11n
.rt  
\fB-t\fR オプションが指定された場合に用いるフォーマッタの名前。この環境変数が設定されていない場合は、\fBtroff\fR(1) が使用されます。
.RE

.SH 使用例
.LP
\fB例 1 \fRテキストバージョンのマニュアルページの作成
.sp
.LP
次の例では、\fBpipe\fR(2) のマニュアルページを ASCII テキストで作成します。

.sp
.in +2
.nf
man pipe.2 | col -x -b > pipe.text
.fi
.in -2
.sp

.sp
.LP
これは、\fBman\fR \fB-t\fR を使用してマニュアルページをデフォルトのプリンタに送信する代わりに、テキストファイルバージョンのマニュアルページを作成します。

.LP
\fB例 2 \fR\fI文字列\fRに一致するマニュアルページのリストの作成
.sp
.LP
次の例では、\fBzfs create\fR 文字列に一致するマニュアルページのリストを取得します。

.sp
.in +2
.nf
man -K 'zfs create' 
.fi
.in -2
.sp

.LP
\fB例 3 \fR\fIセクション\fR内の\fI文字列\fRに一致するマニュアルページの取得
.sp
.LP
次の例では、\fB関連項目\fRセクションで \fBzfs\fR について記述しているマニュアルページのリストを取得します。 

.sp
.in +2
.nf
man -K "SEE ALSO: zfs"
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man\fR\fR
.ad
.sp .6
.RS 4n
標準マニュアルページのディレクトリサブツリーのルート
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man/man?/*\fR\fR
.ad
.sp .6
.RS 4n
書式なし \fBnroff\fR のマニュアルのエントリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man/man_index/*\fR\fR
.ad
.sp .6
.RS 4n
目次とキーワードのデータべース。
.sp
次のファイルが生成されます。 
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/share/man/man_index/man.idx\fR 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/share/man/man_index/man.dic\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/share/man/man_index/man.frq\fR 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/share/man/man_index/man.pos\fR
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man/sman?/*\fR\fR
.ad
.sp .6
.RS 4n
書式なし \fBSGML\fR のマニュアルのエントリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man/cat?/*\fR\fR
.ad
.sp .6
.RS 4n
\fBnroff\fR 処理後のマニュアルのエントリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/man/fmt?/*\fR\fR
.ad
.sp .6
.RS 4n
\fBtroff\fR 処理後のマニュアルのエントリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/tmac/an\fR\fR
.ad
.sp .6
.RS 4n
標準 \fB-man\fR マクロパッケージ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/sgml/locale/C/dtd/*\fR\fR
.ad
.sp .6
.RS 4n
\fBSGML\fR ドキュメント型定義ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/sgml/locale/C/solbook/*\fR\fR
.ad
.sp .6
.RS 4n
\fBSGML\fR のスタイルシートと実体ファイルの定義ディレクトリ
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/pub/eqnchar\fR\fR
.ad
.sp .6
.RS 4n
\fBeqn\fR と \fBneqn\fR の標準定義 
.RE

.sp
.ne 2
.mk
.na
\fB\fBman.cf\fR \fR
.ad
.sp .6
.RS 4n
セクションごとのデフォルトの検索順序
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件text/doctools
_
CSI有効。「注意事項」を参照。\fB\fR
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。 
T}
.TE

.SH 関連項目
.sp
.LP
\fBapropos\fR(1), \fBcat\fR(1), \fBcol\fR(1), \fBeqn\fR(1), \fBmore\fR(1), \fBnroff\fR(1), \fBrefer\fR(1), \fBtbl\fR(1), \fBtroff\fR(1), \fBvgrind\fR(1), \fBwhatis\fR(1), \fBcatman\fR(1M), \fBattributes\fR(5), \fBenviron\fR(5), \fBeqnchar\fR(5), \fBman\fR(5), \fBsgml\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fB-f\fR、\fB-k\fR、および \fB-K\fR オプションは、\fBman\fR(5) で指定される SMF サービスによって自動的に生成されるか、または \fBcatman\fR(1M)で \fB-w\fR オプションを指定して手動で生成するインデックスファイルを使用します。 
.sp
.LP
\fBwindex\fR データベースファイルは使用されなくなりました。\fBwindex\fR データベースファイルは新しいインデックスファイルに置き換えられました。 
.sp
.LP
\fBman\fR コマンドは CSI に対応しています。ただし、\fBman\fR コマンドによって呼び出される一部のユーティリティー (\fBtroff\fR、\fBeqn\fR、\fBneqn\fR、\fBrefer\fR、\fBtbl\fR、および \fBvgrind\fR) は、CSI 対応が検証されていません。このため、\fB-t\fR オプションを指定した \fBman\fR コマンドは、EUC 以外のデータを処理できません。また、\fBeqn\fR、\fBneqn\fR、\fBrefer\fR、\fBtbl\fR、または \fBvgrind\fR を通した特殊な処理が必要なマニュアルページを表示するための \fBman\fR コマンドの使用を CSI 対応にすることもできません。 
.SH 使用上の留意点
.sp
.LP
マニュアルは、写真植字機または \fBASCII\fR 端末のどちらかで再現可能であると想定されています。ただし、端末上では (たとえば、フォントの変更で示される) 一部の情報が失われます。
.sp
.LP
一部のダム端末は、\fBe\fR (\fBeqn\fR(1) を参照) 前処理フラグによって生成される縦方向の動きを処理できません。これらの端末での歪んだ出力を防ぐために、\fBe\fR フラグを使用するときには \fBt\fR フラグも使用して、暗黙的に \fBcol\fR(1) を呼び出してください。この回避方法には、上付きおよび下付きの添字が、それらを表示できる端末でも削除されるという欠点があります。\fBeqn\fR(1) の出力によって正しく動作しなくなった端末は、Control-q でクリアーしてください。
