Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/more.1
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH more 1 "2005 年 11 月 4 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
more, page \- テキストファイルの表示またはページング
.SH 形式
.LP
.nf
\fB/usr/bin/more\fR  [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR]
 [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/page\fR  [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR]
 [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR  [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [\fB-p\fR \fIcommand\fR]
 [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR  [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [+ \fIcommand\fR]
 [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBmore\fR ユーティリティーは、端末の画面上にテキストファイルの内容を 1 画面ずつ表示するフィルタです。通常、画面がいっぱいになると休止します。そのとき \fB/usr/bin/more\fR は \fB--More--\fR を、 \fB/usr/xpg4/bin/more\fR は \fIfile\fR を、いずれも画面の最下段に表示します。\fBmore\fR がパイプではなくファイルから読み取る場合、それまでに表示された文字のパーセンテージもあわせて表示します。
.sp
.LP
\fBmore\fR ユーティリティーは、\fBRETURN\fR 文字が入力されると、もう 1 行スクロールアップします。\fB\fR\fBSPACE\fR 文字が入力されると、次の画面を表示します。その他のコマンドは、次で説明します。
.sp
.LP
\fBpage\fR ユーティリティーは、テキストの次の画面を表示する前に画面をクリアします。\fBpage\fR は、more とは異なり、前画面の最後の行を現画面の最初に重複して表示することはしません。
.sp
.LP
\fBmore\fR ユーティリティーは、端末を \fBNOECHO\fR モードに設定し、連続して出力できるようにします。通常、入力するコマンドは端末上に表示されません。ただし、 \fB/\fR コマンドと \fB!\fR コマンドの場合を除きます。
.sp
.LP
\fB/usr/bin/more\fR ユーティリティーは、指定された最後のファイルを表示して終了します。\fB/usr/xpg4/bin/more\fR は、指定された最後のファイルの最終行で、コマンド入力を要求するプロンプトを発行します。
.sp
.LP
標準出力が端末の場合、\fBmore\fR は \fBcat\fR(1) とまったく同じように動作しますが、複数のファイルが指定された場合、ファイルの前にヘッダーが表示されます。
.SH オプション
.sp
.LP
\fB/usr/bin/more\fR と \fB/usr/xpg4/bin/more\fR の両方で次のオプションが使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fR
.ad
.RS 7n
.rt  
表示前に画面をクリアします。より高速に表示するため、画面をスクロールせずに描画し直します。端末が行の終端までクリアする機能を持たない場合、このオプションは無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fR
.ad
.RS 7n
.rt  
認識できないコマンドが使用された場合、端末ベルを鳴らさずにエラーメッセージを表示します。これは経験の少ないユーザーに役立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fR
.ad
.RS 7n
.rt  
圧縮。複数の空行を単一の空行と置換します。これは、\fBnroff\fR(1) を画面表示させる場合に役立ちます。
.RE

.SS "/usr/bin/more"
.sp
.LP
次のオプションは \fB/usr/bin/more\fR でのみ指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fR
.ad
.RS 15n
.rt  
長い行を折り返しません。\fBnroff\fR(1) 出力を \fBul\fR(1) によりパイプ連結したとき生成されるような非表示文字、またはエスケープシーケンスが行にあるときに役立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fR
.ad
.RS 15n
.rt  
\fBFORMFEED\fR 文字 (Control-l) を改ページと見なしません。\fB-l\fR を使用しない場合、\fBmore\fR は休止して、\fB^L\fR 文字 (Control-l) の入った行のあとのコマンドを受け入れます。また、ファイルが \fBFORMFEED\fR で始まっている場合、ファイルを表示する前に画面をクリアーします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fR
.ad
.RS 15n
.rt  
通常、 \fBmore\fR は解釈できない制御文字を無視します。\fB-r\fR オプションにより、これらの文字は \fB^\fR\fIC\fR として表示されます。ここで、\fIC\fR はこのような任意の制御文字を表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fR
.ad
.RS 15n
.rt  
下線引きエスケープシーケンスを生成しません。通常、\fBmore\fR は、 \fBnroff\fR(1) が生成するような下線引きを、端末に適切な方法で処理します。端末が下線引きを実行できるか、あるいは強調モードを備えている場合、\fBmore\fR はテキストファイルで呼び出されたものに対応するエスケープシーケンスを提供します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fR
.ad
.RS 15n
.rt  
通常、\fBmore\fR はその出力の終端まで来ると終了します。しかし、\fB-w\fR を用いると、\fBmore\fR は終了する前にプロンプトを出し、キーが押されるのを待ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIlines\fR\fR
.ad
.RS 15n
.rt  
デフォルト (端末画面内の行の数から 2 を引いた数) の代わりに、指定された数の \fIlines\fR を行数分画面に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+\fR\fIlinenumber\fR\fR
.ad
.RS 15n
.rt  
\fIlinenumber\fR から表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+/\fR\fIpattern\fR\fR
.ad
.RS 15n
.rt  
\fIpattern\fR という正規表現の入った行より上の 2 行から表示します。注: エディタとは異なり、この形式は `\fB/\fR' で終了してはいけません。\fB\fR\fI\fRスラッシュで終了すると、その後のスラッシュは検索パターンの文字と見なされます。
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
次のオプションは \fB/usr/xpg4/bin/more\fR でのみ指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fR
.ad
.RS 17n
.rt  
引数リストの最後のファイルの最終行を出力すると、ただちに終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fR
.ad
.RS 17n
.rt  
検索時に、大文字と小文字を区別せずにパターンマッチングを行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInumber\fR \fR
.ad
.RS 17n
.rt  
1 画面当たりの行数を指定します。\fInumber\fR 引数の値は正の整数です。\fB-n\fR オプションの値は、環境から得られる値に優先して用いられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIcommand\fR \fR
.ad
.br
.na
\fB\fB+\fR\fIcommand\fR \fR
.ad
.RS 17n
.rt  
検査対象の各ファイルに対し、最初に \fIcommand\fR 引数中の \fBmore\fR コマンドを実行します。それが行番号や正規表現検索など位置決め用のコマンドであれば、コマンドの最終結果を表すように現在の位置を設定します。ファイルの中間行は書き出しません。例として次の 2 つのコマンドを見てください。
.sp
.in +2
.nf
\fBmore -p 1000j file  
more -p 1000G file\fR
.fi
.in -2
.sp

これらは、現在の位置を行番号 1000 として表示を開始する、という同じ動作をします。しかも、\fBj\fR がファイルの検査中に呼び出されていれば書き出して画面から消したであろうと思われる行は飛ばします。位置決めコマンドが正常終了でなければ、ファイルの先頭行が現在の位置となります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItagstring\fR \fR
.ad
.RS 17n
.rt  
\fItagstring\fR 引数で指定したタグを持つファイルの内容を 1 画面分表示します。詳細については \fBctags\fR(1) ユーティリティーの説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 17n
.rt  
バックスペース文字を印刷可能文字として扱い、^H (Control-h) と表示します。このとき、ある種の端末では下線付きまたは強調モードテキストで出力するような特殊な処理や、下線を付ける処理は行いません。さらにこのオプションが指定されると、行の終わりのキャリッジリターンを無視しません。
.RE

.sp
.LP
\fB-t\fR\fI tagstring\fR と \fB-p\fR\fI command\fR (または旧式の \fI+command\fR) オプションの両方が指定された場合、\fB-t\fR\fI tagstring\fR が先に処理されます。
.SH 使用法
.SS "環境"
.sp
.LP
\fBmore\fR は、端末の \fBterminfo\fR(4) エントリを使用して、そのディスプレイ特性を判別します。
.sp
.LP
\fBmore\fR は、\fBMORE\fR という環境変数に設定済みオプションがないか調べます。たとえば、デフォルトで \fB-c\fR モードを使用してファイルをページングするときは、この環境変数の値を \fB-c\fR に設定します(通常、この環境変数を設定するコマンドシーケンスは \fB\&.login\fR または \fB\&.profile\fR ファイルに格納されます)。
.SS "コマンド (Commands)"
.sp
.LP
コマンドはただちに有効になります。コマンドが \fIfile\fR 、\fIcommand\fR、\fItagstring\fR、\fIpattern\fR のいずれかを必要としないかぎり、キャリッジリターンを入力する必要はありません。コマンド文字自体を指定しないかぎり、行抹消文字を入力すれば、入力中の数値引数を取り消すことができます。さらに、消去文字を入力すれば、`\fB--More--(\fR\fIxx\fR%)' または \fIfile\fR メッセージを再表示できます。
.sp
.LP
次のコマンドにおいて、\fIi\fR は数値引数です (デフォルトでは \fB1\fR)。
.sp
.ne 2
.mk
.na
\fB\fIi\fRSPACE \fR
.ad
.RS 13n
.rt  
次の画面を表示します。\fIi\fR を指定すると、\fIi\fR 行追加表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fRRETURN \fR
.ad
.RS 13n
.rt  
次の行を表示します。\fIi\fR が指定されていればその行数分を表示します 
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBb\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^B\fR\fR
.ad
.RS 13n
.rt  
(Control-b) 画面を \fIi\fR 個、逆にスキップして次の画面を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBd\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^D\fR\fR
.ad
.RS 13n
.rt  
(Control-d) 画面を半画面分または \fIi\fR 行分、順方向にスクロールします。\fIi\fR が指定されていれば、その値が以降の \fBd\fR および \fBu\fR コマンド用のデフォルトとなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBf\fR\fR
.ad
.RS 13n
.rt  
画面を \fIi\fR 個スキップして次の画面を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBh\fR\fR
.ad
.RS 13n
.rt  
ヘルプ。\fBmore\fR のすべてのコマンドの説明を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB^L\fR \fR
.ad
.RS 13n
.rt  
(Control-l) 画面の再表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBn\fR\fR
.ad
.RS 13n
.rt  
直前に入力した \fIpattern\fR の \fIi\|\fR 番目の一致を検索します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBq\fR \fR
.ad
.br
.na
\fB\fBQ\fR \fR
.ad
.RS 13n
.rt  
\fBmore\fR を終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBs\fR\fR
.ad
.RS 13n
.rt  
\fIi\fR 行スキップしてから 1 画面分を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.RS 13n
.rt  
現在のファイルの現在行で、\fBvi\fR エディタに入ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBz\fR\fR
.ad
.RS 13n
.rt  
SPACE と同じ。ただし \fIi\fR を指定した場合、その値が画面当たりの行数の新しいデフォルト値になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB=\fR \fR
.ad
.RS 13n
.rt  
現在の行番号を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB/\fR\fIpattern\fR\fR
.ad
.RS 13n
.rt  
\fIpattern\fR という正規表現の \fIi\|\fR 番目の一致を順方向に検索します。\fIpattern\fR という正規表現の \fIi\|\fR 番目の一致またはパイプの終端、どちらか先に見つかった方を含む行の前 2 行から画面を表示します。\fBmore\fR がファイルを表示中であり、一致がない場合、そのファイルにおける位置は変更されません。正規表現は、消去文字と抹消文字を使用して編集できます。第 1 カラムを越えて消去すると、検索コマンドが取り消されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB!\fR\fIcommand\fR\fR
.ad
.RS 13n
.rt  
シェルを起動し、\fIcommand\|\fR を実行します。\fB%\fR および \fB!\fR という文字を \fIcommand\fR 内で使用すると、それぞれ、現在のファイル名および直前のシェルコマンドに置換されます。現在のファイル名がない場合、\fB%\fR は展開されません。これらの文字の前にバックスラッシュを追加して、展開をエスケープしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:f\fR\fR
.ad
.RS 13n
.rt  
現在のファイル名と行番号を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB:n\fR\fR
.ad
.RS 13n
.rt  
コマンド行に指定された \fIi\|\fR 番目後のファイル名、または \fIi\fR が範囲外の場合はリスト内の最後のファイル名までスキップします。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB:p\fR\fR
.ad
.RS 13n
.rt  
コマンド行に指定された \fIi\|\fR 番目前のファイル名、または \fIi\fR が範囲外の場合はリスト内の最初のファイル名までスキップします。ファイル内に \fBmore\fR を位置決めしている間に指定すると、ファイルの最初に移動します。\fBmore\fR がパイプから読み取り中の場合、\fBmore\fR は単に端末ベルを鳴らすだけです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:q\fR\fR
.ad
.br
.na
\fB\fB:Q\fR\fR
.ad
.RS 13n
.rt  
\fBmore\fR を終了します (\fBq\fR または \fBQ\fR と同じ)。
.RE

.SS "/usr/bin/more"
.sp
.LP
次のコマンドは \fB/usr/bin/more\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fB\&'\fR\fR
.ad
.RS 9n
.rt  
単一引用符。直前の検索が開始された点に移動します。現在のファイルで検索を実行していない場合、ファイルの最初に移動します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&.\fR\fR
.ad
.RS 9n
.rt  
ドット。直前のコマンドを繰り返します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB^\|\e\fR\fR
.ad
.RS 9n
.rt  
テキストの一部表示を停止します。\fBmore\fR は出力の送信を停止し、通常の \fB--More--\fR プロンプトを表示します。一部の出力は結果的に失われることがあります。
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
次のコマンドは \fB/usr/xpg4/bin/more\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB^F\fR\fR
.ad
.RS 17n
.rt  
(Control-f) 画面を \fIi\fR 個スキップして次の 1 画面分を表示します (\fIi\fR\fBf\fR と同じ)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB^G\fR\fR
.ad
.RS 17n
.rt  
(Control-g) 現在の行番号を表示します (\fB=\fR と同じ)。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBg\fR\fR
.ad
.RS 17n
.rt  
ファイル中の行番号 \fIi\fR に進みます。デフォルトは先頭行です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBG\fR\fR
.ad
.RS 17n
.rt  
ファイル中の行番号 \fIi\fR に進みます。デフォルトは最終行です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBj\fR\fR
.ad
.RS 17n
.rt  
次の行を表示します。\fIi\fR が指定されていればその行数分を表示します (\fIi\fRRETURN と同じ)。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBk\fR\fR
.ad
.RS 17n
.rt  
画面を逆方向にスクロールします。\fIi\fR 指定時はその行数、省略時は 1 行です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fIletter\fR \fR
.ad
.RS 17n
.rt  
\fIletter\fR で示す名前で現在の位置をマークします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBN\fR \fR
.ad
.RS 17n
.rt  
逆方向に検索します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr\fR \fR
.ad
.RS 17n
.rt  
画面を再表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR \fR
.ad
.RS 17n
.rt  
画面を再表示し、バッファー内に入力があればそれを破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBu\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^U\fR\fR
.ad
.RS 17n
.rt  
(Control-u) 画面を逆方向にスクロールします。\fIi\fR 指定時はその行数、省略時は半画面分です。\fIi\fR が指定されていれば、その値が以降の \fBd\fR および \fBu\fR コマンド用のデフォルトとなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZZ\fR \fR
.ad
.RS 17n
.rt  
\fBmore\fR を終了します (\fBq\fR と同じ)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:e\fR \fIfile\fR \fR
.ad
.RS 17n
.rt  
新たなファイルを検査 (表示) します。\fIfile\fR を省略すると、現在のファイルが再表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:t\fR \fItagstring\fR \fR
.ad
.RS 17n
.rt  
\fItagstring\fR 引数が示すタグの位置へ進み、タグを含む行が現在の位置となるように画面をスクロールします。詳しくは \fBctags\fR ユーティリティーの説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&'\fR\fIletter\fR \fR
.ad
.RS 17n
.rt  
以前に \fIletter\fR という名を付けてマークした位置に戻ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&''\fR \fR
.ad
.RS 17n
.rt  
最新の 1 画面分を超える移動を行なったときの元の位置に戻ります。デフォルトはファイルの先頭です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB?\fR[\fI!\fR]\fIpattern\fR\fR
.ad
.RS 17n
.rt  
ファイルを逆方向に検索し、\fIpattern\fR を含んでいる \fIi\fR 番目の行を見つけます。\fI!\fR は、\fIpattern\fR を含んでいない \fIi\fR 番目の行の検索です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB/\fR\fB!\fR\fIpattern\fR\fR
.ad
.RS 17n
.rt  
ファイルを順方向に検索し、pattern を含んでいない \fIi\fR 番目の行を見つけます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB!\fR[\fIcommand\fR]\fR
.ad
.RS 17n
.rt  
シェルまたは指定したコマンドを呼び出します。
.RE

.SS "大規模ファイルの動作"
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBmore\fR と \fBpage\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 環境
.sp
.LP
\fBmore\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR (\fB/usr/xpg4/bin/more\fR のみ)、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBNLSPATH\fR、および \fBTERM\fR。
.SS "/usr/xpg4/bin/more"
.sp
.LP
次の環境変数も \fB/usr/xpg4/bin/more\fR の実行に影響を与えます。
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR \fR
.ad
.RS 12n
.rt  
画面の水平方向のサイズとして、システムが選択した値の代わりに用いる値を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEDITOR\fR \fR
.ad
.RS 12n
.rt  
エディタを選択する際に \fBv\fR コマンドを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINES\fR \fR
.ad
.RS 12n
.rt  
画面の垂直方向のサイズとして、システムが選択した値の代わりに用いる値を指定します。画面当たりの行数を決める際、\fB-n\fR オプションの値が \fBLINES\fR の値に優先します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMORE\fR \fR
.ad
.RS 12n
.rt  
前述の「オプション」節で説明した、オプションを指定する文字列です。コマンド行に記述する場合と同様に、オプションとオプションの間は空白文字で区切り、個々のオプションは - で始まらなければなりません。\fBMORE\fR で指定したオプションのあとで、コマンド行のオプションが処理されます。つまり、コマンド行が次に示すように記述されていると見なされます。\fBmore $MORE\fR \fIoptions operands\fR
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 7n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR \fR
.ad
.RS 7n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/more.help\fR\fR
.ad
.RS 22n
.rt  
\fB/usr/bin/more\fR と \fB/usr/bin/page\fR のためだけのヘルプファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/more /usr/bin/page"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI未対応
.TE

.SS "/usr/xpg4/bin/more"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBcat\fR(1), \fBcsh\fR(1), \fBctags\fR(1), \fBman\fR(1), \fBnroff\fR(1), \fBscript\fR(1), \fBsh\fR(1), \fBul\fR(1), \fBterminfo\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SS "/usr/bin/more /usr/bin/page"
.sp
.LP
\fBregcomp\fR(3C)
.SS "/usr/xpg4/bin/more"
.sp
.LP
\fBregex\fR(5)
.SH 注意事項
.SS "/usr/bin/more"
.sp
.LP
逆方向のスキップを大規模なファイルに対して行うと遅くなります。
.SS "/usr/xpg4/bin/more"
.sp
.LP
端末が正しく設定されていないと、このユーティリティーも正しく動作しません。
