Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/nice.1
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material. 
.TH nice 1 "2011 年 7 月 12 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
nice \- コマンドを変更されたスケジューリング優先順位で実行
.SH 形式
.LP
.nf
\fB/usr/bin/nice\fR [\fB-\fIincrement\fR\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR 
     [\fIargument\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/nice\fR [\fB-\fIincrement\fR\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR 
     [\fIargument\fR]...
.fi

.SS "csh 組み込みコマンド"
.LP
.nf
\fBnice\fR [\fB-\fIincrement\fR\fR | +\fIincrement\fR] [\fIcommand\fR]
.fi

.SH 機能説明
.sp
.LP
\fBnice\fR ユーティリティーは、異なるシステムのスケジューリング優先順位で動作するように \fBcommand\fR を実行します。\fBpriocntl\fR(1) コマンドは、スケジューラ機能とのより汎用的なインタフェースです。
.sp
.LP
起動するプロセス (通常は、ユーザーのシェル) は、\fBnice\fR コマンドをサポートする スケジューリングクラスで実行されていなければなりません。
.sp
.LP
C シェル (\fBcsh\fR(1) 参照) を使用している場合、コマンドのフルパス名を指定する必要があります。指定しないと、\fBcsh\fR 組み込みコマンドの \fBnice\fR が実行されます。後述の「csh 組み込みコマンド」を参照してください。\fB\fR
.SS "/usr/bin/nice"
.sp
.LP
\fBnice\fR が引数のあるコマンドを実行する場合、デフォルトのシェル \fB/usr/bin/sh\fR が使われます (\fBsh\fR(1) 参照) 。
.SS "/usr/xpg4/bin/nice"
.sp
.LP
\fBnice\fR が引数のあるコマンドを実行する場合は、\fB/usr/xpg4/bin/sh\fR が使用されます (\fBksh88\fR(1) を参照)。
.SS "csh 組み込みコマンド"
.sp
.LP
\fBnice\fR という \fBcsh\fR の組み込みコマンドもあります。こちらの動作は、ここで説明した nice とは異なります。詳しくは \fBcsh\fR(1) を参照してください。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIincrement\fR | \fB-n\fR \fIincrement\fR\fR
.ad
.RS 29n
.rt  
\fIincrement\fR は正または負の 10 進整数です。このオプションは、ユーティリティーバージョンの実行時に、\fBnice()\fR 関数に \fIincrement\fR オプション引数 (数値) を指定して呼び出した場合と同じ効果を発揮します。\fBnice\fR(2) を参照してください。\fBnice()\fR のエラー (\fBEINVAL\fR 以外) は無視されます。このオプションを指定しない場合、増分は \fB10\fR であると想定されます。
.sp
スーパーユーザーは、たとえば \fB-\|-10\fR のように、負数の increment を使用することにより、通常よりも高い優先順位でコマンドを実行できます。\fI\fR特権を持たないユーザーが負数の増分値を指定した場合は無視されます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIcommand\fR\fR
.ad
.RS 12n
.rt  
呼び出すコマンドの名前。\fIcommand\fR に組み込みコマンド (\fBshell_builtins\fR(1) を参照) を指定した場合、処理の結果は保証されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fIargument\fR\fR
.ad
.RS 12n
.rt  
\fIcommand\fR を呼び出す際に引数として与える文字列。
.RE

.SH 環境
.sp
.LP
\fBnice\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBPATH\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
\fIcommand\fR で指定したコマンドが呼び出された場合、そのコマンドの終了ステータスが \fBnice\fR の終了ステータスとなります。\fI\fR呼び出されなかった場合には、\fBnice\fR は次の終了ステータスを返します。
.sp
.ne 2
.mk
.na
\fB\fB1-125\fR\fR
.ad
.RS 9n
.rt  
エラーが発生しました。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB126\fR\fR
.ad
.RS 9n
.rt  
\fIcommand\fR で示すコマンドユーティリティーは見つかったが呼び出すことができなかった。
.RE

.sp
.ne 2
.mk
.na
\fB\fB127\fR\fR
.ad
.RS 9n
.rt  
\fIコマンドが見つからなかった。\fR
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
.TE

.SS "/usr/xpg4/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBcsh\fR(1), \fBksh88\fR(1), \fBnohup\fR(1), \fBpriocntl\fR(1), \fBsh\fR(1), \fBshell_builtins\fR(1), \fBnice\fR(2), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
