Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/pfexec.1
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pfexec 1 "2011 年 7 月 12 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
pfexec, pfbash, pfcsh, pfksh, pfsh, pftcsh, pfzsh \- プロファイル内のコマンドの実行
.SH 形式
.LP
.nf
\fB/usr/bin/pfexec\fR \fIcommand\fR
.fi

.LP
.nf
\fB/usr/bin/pfexec\fR \fB-P\fR \fIprivspec\fR \fIcommand\fR [ \fIarg\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfsh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfcsh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfksh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.SH 機能説明
.sp
.LP
\fBpfexec\fR プログラムは、\fBexec_attr\fR(4) データベース内の当該ユーザーのプロファイルによって指定された属性でコマンドを実行するために使用します。このプログラムは、プロファイルシェル \fBpfsh\fR、\fBpfcsh\fR、および \fBpfksh\fR によって呼び出されます。これらのプロファイルシェルは、それぞれ Bourne シェル、C シェル、および Korn シェルにリンクされています。
.sp
.LP
プロファイルは、\fBuser_attr\fR(4) データベース内の当該ユーザーのエントリで指定された順序で検索されます。同じコマンドが複数のプロファイルに存在する場合、プロファイルシェルは最初に一致したエントリを使用します。
.sp
.LP
2 番目の形式 \fBpfexec\fR \fB-P\fR \fIprivspec\fR を使用すると、ユーザーは \fBprof_attr\fR(4) 内の当該ユーザーのプロファイルに与えられた追加の特権を取得できます。コマンド行での特権の指定は、\fBpriv_str_to_set\fR(3C) を使用して解析されます。その結果得られた特権と、当該ユーザーのすべてのプロファイルについて \fBprof_attr\fR(4) 内の \fBprivs\fR キーワードで指定されている特権の和集合との間で、積集合をとった上で、その結果がコマンドの実行前に継承可能セットに追加されます。
.SH 使用法
.sp
.LP
\fBpfexec\fR は、特定のユーザーまたはグループ \fBID\fR など、定義済みのプロセス属性でコマンドを実行するために使用します。
.sp
.LP
プロファイルシェルの使用法についての詳細は、\fBsh\fR(1)、\fBcsh\fR(1)、および \fBksh\fR(1) のマニュアルページを参照してください。
.SH 使用例
.LP
\fB例 1 \fR追加ユーザー特権の取得
.sp
.in +2
.nf
example% \fBpfexec -P all chown user file\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドは、現在のユーザーに割り当てられているすべての特権 (必ずしもすべての特権であるとは限らない) で \fBchown user file\fR を実行します。

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR \fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBbash\fR(1), \fBcsh\fR(1), \fBksh\fR(1), \fBksh88\fR(1), \fBprofiles\fR(1), \fBsh\fR(1), \fBtcsh\fR(1), \fBzsh\fR(1), \fBexec_attr\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
