Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/pkginfo.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH pkginfo 1 "2011 年 7 月 7 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
pkginfo \- ソフトウェアパッケージ情報の表示
.SH 形式
.LP
.nf
\fBpkginfo\fR [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-p\fR | \fB-i\fR] [\fB-r\fR] [\fB-a\fR \fIarch\fR] 
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.LP
.nf
\fBpkginfo\fR [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-a\fR \fIarch\fR] 
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBpkginfo\fR は、システムにインストールされているソフトウェアパッケージの情報を表示します (最初の形式)。あるいは、特定のデバイスまたはディレクトリ上にあるソフトウェアパッケージの情報を表示します (2 番目の形式)。
.sp
.LP
オプションを指定しないと、\fBpkginfo\fR は、一次カテゴリ、パッケージのインスタンス、および完全または部分的にインストールされているすべてのパッケージの名前を一覧表示します。これらの情報はパッケージごとに 1 行に表示されます。
.SH オプション
.sp
.LP
\fB-d\fR オプションと組み合わせて使用すると、\fB-p\fR オプションと \fB-i\fR オプションは無効になります。
.sp
.LP
\fB-q\fR オプション、\fB-x\fR オプション、および \fB-l\fR オプションを同時に指定することはできません。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarch\fR\fR
.ad
.sp .6
.RS 4n
パッケージのアーキテクチャを \fBarch\fR として指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcategory\fR\fR
.ad
.sp .6
.RS 4n
\fIcategory\fR に一致するパッケージを表示します。カテゴリは \fBpkginfo\fR(4) ファイルの \fBCATEGORY\fR パラメータで定義されます。複数のカテゴリが設定されている場合、リスト内の 1 つのカテゴリとだけ一致する必要があります。照合に大文字と小文字の区別はありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
ソフトウェアが存在するデバイス \fIdevice\fR を定義します。\fIdevice\fR はディレクトリの絶対パス名、または、テープ、着脱式ディスクなどの識別子のどちらでもかまいません。\fBspool\fR という特殊なトークンを使用すると、デフォルトのインストールスプールディレクトリ (\fB/var/spool/pkg\fR) を指定することができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
完全にインストールされているパッケージの情報だけを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
詳細な出力形式を指定します。つまり、指定されたパッケージについて利用できる情報をすべて表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
部分的にインストールされているパッケージの情報だけを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
情報を表示しません。このオプションは、パッケージがインストールされているかどうかをプログラム内で検査するときに使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
再配置可能なパッケージのインストールのベースディレクトリを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.sp .6
.RS 4n
\fIroot_path\fR として使用するディレクトリのフルパス名を定義します。すべてのファイル (パッケージシステム情報ファイルを含む) は \fIroot_path\fR から始まるディレクトリツリーに再配置されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
パッケージのバージョンを \fIversion\fR として指定します。バージョンは \fBpkginfo\fR(4) ファイルの \fBVERSION\fR パラメータで定義されます。互換性があるすべてのバージョンを要求するには、バージョン名の前にチルド (～) を付けます。\fB\fRバージョンの比較では、複数のスペースは 1 つのスペースに置き換えられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
抽出されたパッケージ情報の一覧を示します。一覧には、パッケージの省略名、名前、アーキテクチャ (もしあれば)、およびバージョン (もしあれば) が含まれます。
.RE

.SH オペランド
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.sp .6
.RS 4n
インスタンスによるパッケージの指定。インスタンスはパッケージの省略形または特定のインスタンス (たとえば、\fBinst.1\fR や \fBinst.2\fR) のどちらでもかまいません。パッケージのすべてのインスタンスを要求するには、\fBinst.*\fR を使用します。シェルによっては、アスタリスク文字 (\fB*\fR) が特殊な意味を持つことがあり、 * をエスケープしなければならない場合があります。C シェルでは、「\fB*\fR」は単一引用符 (\fB\&'\fR) で囲むか、またはバックスラッシュ (\e) を前に付ける必要があります。
.RE

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/var/spool/pkg\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのインストールスプールディレクトリ
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBpkgtrans\fR(1), \fBpkgadd\fR(1M), \fBpkgask\fR(1M), \fBpkgchk\fR(1M), \fBpkgrm\fR(1M), \fBpkginfo\fR(4), \fBattributes\fR(5), \fBlargefile\fR(5)
.sp
.LP
\fI『Application Packaging Developer\&'s Guide』\fR
.SH 注意事項
.sp
.LP
パッケージコマンドは、\fBlargefile\fR(5) を認識します。これらのコマンドは、2G バイトより大きなファイルを、より小さなファイルと同様に処理します。現在の実装では、\fBpkgadd\fR(1M)、\fBpkgtrans\fR(1)、およびその他のパッケージコマンドは最大 4G バイトのデータストリームを処理できます。
