Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/pkgparam.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH pkgparam 1 "2011 年 7 月 7 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
pkgparam \- パッケージパラメータ値の表示
.SH 形式
.LP
.nf
\fBpkgparam\fR [\fB-v\fR] [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] \fIpkginst\fR [\fIparam\fR]...
.fi

.LP
.nf
\fBpkgparam\fR \fB-f\fR \fIfilename\fR [\fB-v\fR] [\fIparam\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBpkgparam\fR は、コマンド行で要求された 1 つ以上のパラメータに関連付けられた値を表示します。この値は、\fIpkginst\fR の \fBpkginfo\fR(4) ファイルまたは \fB-f\fR オプションで指定された特定のファイルから検索されます。
.sp
.LP
1 行に 1 つのパラメータ値が表示されます。\fB-v\fR オプションを使用しない場合は、パラメータの値だけが表示されます。このオプションを使用すると、コマンドの出力は次の形式になります。
.sp
.in +2
.nf
\fIparameter1\fR\fB='\fR\fIvalue1\fR\fB\&'\fR
\fIparameter2\fR\fB='\fR\fIvalue2\fR\fB\&'\fR
\fIparameter3\fR\fB='\fR\fIvalue3\fR\fB\&'\fR
.fi
.in -2
.sp

.sp
.LP
コマンド行にパラメータを指定しなかった場合は、パッケージに関連付けられたすべてのパラメータの値が表示されます。
.SH オプション
.sp
.LP
このコマンドのオプションと引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.RS 16n
.rt  
\fIpkginst\fR を保存するデバイスを指定します。\fI\fRディレクトリパス名、または、テープかリムーバブルディスクの識別子 (\fB/var/tmp\fR、\fB/、/dev/dsk/c1d0s0\fR など) を指定できます。\fBspool\fR という特殊なトークンを使用すると、デフォルトのインストールスプールディレクトリ (\fB/var/spool/pkg\fR) を指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 16n
.rt  
\fIfilename\fR からパラメータ値を読み取ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.RS 16n
.rt  
\fIroot_path\fR として使用するサブディレクトリのフルパス名を定義します。すべてのファイル (パッケージシステム情報ファイルを含む) は \fIroot_path\fR から始まるディレクトリツリーに再配置されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 16n
.rt  
冗長モード。パラメータの名前とその値を表示します。
.RE

.SH オペランド
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
パラメータ値を表示する特定のパッケージインスタンスを定義します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIparam\fR\fR
.ad
.RS 11n
.rt  
値を表示する特定のパラメータを定義します。
.RE

.SH エラー
.sp
.LP
指定されたパッケージからパラメータ情報を取得できない場合、コマンドは 0 以外のステータスで終了します。
.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBpkgmk\fR(1), \fBpkgproto\fR(1), \fBpkgtrans\fR(1), \fBpkgadd\fR(1M), \fBpkginfo\fR(4), \fBattributes\fR(5), \fBlargefile\fR(5)
.sp
.LP
\fI『Application Packaging Developer\&'s Guide』\fR
.SH 注意事項
.sp
.LP
\fB-f\fR オプションを使用すると、パラメータ値の抽出元ファイルを指定できます。このファイルは、\fBpkginfo\fR(4) ファイルと同じ形式でなければなりません。たとえば、このようなファイルをパッケージの開発中に作成しておき、この段階でソフトウェアをテストするときに使用できます。
.sp
.LP
パッケージコマンドは、\fBlargefile\fR(5) を認識します。これらのコマンドは、2G バイトより大きなファイルを、より小さなファイルと同様に処理します。現在の実装では、\fBpkgadd\fR(1M)、\fBpkgtrans\fR(1)、およびその他のパッケージコマンドは最大 4G バイトのデータストリームを処理できます。
