Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/pkgtrans.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH pkgtrans 1 "2011 年 7 月 7 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
pkgtrans \- パッケージ形式の変換
.SH 形式
.LP
.nf
\fBpkgtrans\fR [\fB-inosg\fR] [\fB-k\fR \fIkeystore\fR] [\fB-a\fR \fIalias\fR] [\fB-P\fR \fIpasswd\fR] \fIdevice1\fR \fIdevice2\fR 
     [\fIpkginst\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBpkgtrans\fR ユーティリティーは、インストール可能なパッケージをある形式から別の形式に変換します。次のような変換が行われます。
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステム形式からデータストリームへ
.RE
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステム形式から署名付きのデータストリームへ
.RE
.RS +4
.TP
.ie t \(bu
.el o
データストリームからファイルシステム形式へ
.RE
.RS +4
.TP
.ie t \(bu
.el o
あるファイルシステム形式から別のファイルシステム形式へ
.RE
.SH オプション
.sp
.LP
このコマンドのオプションと引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIalias\fR\fR
.ad
.RS 15n
.rt  
friendlyName が示す別名に関連付けられた公開鍵証明書と対応する秘密鍵を使用します。詳細は、\fBKEYSTORE LOCATIONS\fR and \fBKEYSTORE AND CERTIFICATE FORMATS\fR in \fBpkgadd\fR(1M)を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 15n
.rt  
結果として得られたデータストリームに署名します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 15n
.rt  
\fBpkginfo\fR(4) ファイルと \fBpkgmap\fR(4) ファイルのみをコピーします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkeystore\fR\fR
.ad
.RS 15n
.rt  
キーストアを使用して、署名の生成に使用する秘密鍵を取得します。指定しなかった場合は、\fB-a\fR で指定した秘密鍵を見つけるためにデフォルトの場所が検索されます。別名を指定せず、キーストアに複数の鍵が存在する場合は、\fBpkgtrans\fR が異常終了します。検索の場所と形式の詳細については、\fBKEYSTORE LOCATIONS\fR and \fBKEYSTORE AND CERTIFICATE FORMATS\fR in \fBpkgadd\fR(1M)を参照してください。
.sp
root 以外のユーザーが実行した場合、証明書検索のデフォルトベースディレクトリは \fB\&.\|.\|./.pkg/security\fR になります。ここで、\fB\&.\|.\|.\fR は \fBpkgtrans\fR を起動したユーザーのホームディレクトリです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
このパッケージのインスタンスがすでに存在する場合は、宛先デバイス上にパッケージの新しいインスタンスを作成します。作成するインスタンスの最大数は、\fBpkginfo\fR(4) ファイルの \fBMAXINST\fR 変数で指定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 15n
.rt  
宛先デバイス上の同じインスタンスを上書きします。パッケージインスタンスがすでに存在する場合、そのインスタンスは上書きされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpasswd\fR\fR
.ad
.RS 15n
.rt  
キーストアの復号化に使用するパスワードを指定します。このオプションの引数の構文の詳細については、\fBPASS PHRASE ARGUMENTS\fR in \fBpkgadd\fR(1M)を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 15n
.rt  
パッケージをファイルシステムではなくデータストリームとして \fIdevice2\fR に書き込むよう指定します。デフォルトの動作では、両方の形式をサポートするデバイスにはファイルシステム形式で書き込みます。
.RE

.SH オペランド
.sp
.ne 2
.mk
.na
\fB\fIdevice1\fR\fR
.ad
.RS 11n
.rt  
ソースデバイスを指定します。このデバイス上の 1 つ以上のパッケージを変換して、\fIdevice2\fR に格納します。下記の「デバイス識別子」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdevice2\fR\fR
.ad
.RS 11n
.rt  
宛先デバイスを指定します。変換されたパッケージはこのデバイスに格納されます。下記の「デバイス識別子」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
\fIdevice1\fR 上の変換対象となるパッケージインスタンスを 1 つ以上指定します。トークン \fBall\fR を使用すると、すべてのパッケージを指定できます。\fBpkginst.*\fR を使用すると、1 つのパッケージのすべてのインスタンスを指定できます。パッケージを定義しなかった場合は、デバイス上のすべてのパッケージがプロンプトに表示され、変換対象を選択するよう求められます。
.sp
シェルによっては、アスタリスク文字 (\fB*\fR) が特殊な意味を持つことがあり、 * をエスケープしなければならない場合があります。C シェルの場合、\fB*\fR は単一引用符 (\fB\&'\fR) で囲むか、またはバックスラッシュ (\fB\e\fR) を前に付ける必要があります。
.RE

.SH デバイス識別子
.sp
.LP
\fBpkgtrans\fR、\fBpkgadd\fR(1M)、\fBpkgchk\fR(1M) などのパッケージツールでは、パッケージが格納されているデバイスを指定することによってパッケージの場所を指定できます。次の一覧は、パッケージを格納して取り出すことができるデバイスのタイプです。ただし、ソースデバイスと宛先デバイスを同じデバイスにすることはできません。
.sp
.ne 2
.mk
.na
\fBデバイス\fR
.ad
.RS 22n
.rt  
デバイス識別子をデバイスとして指定することで、パッケージを文字デバイスまたはブロック型デバイスに格納できます。このデバイスタイプのよくある例は、取り外し可能磁気テープの \fB/dev/rmt/0\fR です。\fBpkgtrans\fR では、通常のファイルシステムのファイルをストリーム形式で生成することもできます。これは、文字デバイスや Web サーバーへの格納、または \fBpkgadd\fR(1M) への入力に適しています。
.RE

.sp
.ne 2
.mk
.na
\fBディレクトリ\fR
.ad
.RS 22n
.rt  
ファイルシステムのディレクトリへの絶対パスを指定することにより、パッケージをディレクトリに格納できます。パッケージの内容は、指定したディレクトリ内のディレクトリに格納されます。パッケージのディレクトリ名は、\fBpkginfo\fR(4) ファイルでの \fBPKG\fR の指定と同じにする必要があります。このタイプのデバイス指定の例は、\fB/export/packages\fR です。
.RE

.SH 使用例
.LP
\fB例 1 \fR\fB/tmp\fR 上のパッケージを変換する
.sp
.LP
次の例では、\fB/tmp\fR 上のパッケージ \fBpkg1\fR および \fBpkg2\fR をデータストリーム形式に変換しています。

.sp
.in +2
.nf
example% \fBpkgtrans -s /tmp /tmp/datastream.pkg pkg1 pkg2\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR署名付きパッケージを作成する
.sp
.LP
次の例では、\fBpkg1\fR および \fBpkg2\fR から署名付きパッケージを作成し、\fB$PASS\fR 環境変数からパスワードを読み取っています。

.sp
.in +2
.nf
example% \fBpkgtrans -sg -k /tmp/keystore.p12 -a foo \e\fR
    \fB-p env:PASS /tmp /tmp/signedpkg pkg1 pkg2\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRパッケージデータストリームを変換する
.sp
.LP
次の例では、パッケージのデータストリームをファイルシステム形式のパッケージに変換しています。

.sp
.in +2
.nf
example% \fBpkgtrans /tmp/pkg1.pkg ~/tmp pkg1\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBpkginfo\fR(4) ファイルに \fBMAXINST\fR 変数が設定され、パッケージインスタンスの最大数が宣言されています。
.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件package/svr4
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBpkginfo\fR(1), \fBpkgmk\fR(1), \fBpkgparam\fR(1), \fBpkgproto\fR(1), \fBinstallf\fR(1M), \fBpkgadd\fR(1M), \fBpkgask\fR(1M), \fBpkgrm\fR(1M), \fBremovef\fR(1M), \fBpkginfo\fR(4), \fBpkgmap\fR(4), \fBattributes\fR(5), \fBlargefile\fR(5)
.sp
.LP
\fI『Application Packaging Developer\&'s Guide』\fR
.SH 注意事項
.sp
.LP
デフォルトでは、パッケージのインスタンスが宛先デバイスにすでに存在する場合、\fBpkgtrans\fR はそのパッケージのどのインスタンスも変換しません。\fB-n\fR オプションを使用すると、このパッケージのインスタンスがすでに存在する場合に新しいインスタンスが作成されます。\fB-o\fR オプションを使用すると、このパッケージのインスタンスがすでに存在する場合にそのインスタンスが上書きされます。宛先デバイスがデータストリームである場合は、どちらのオプションも使用できません。
.sp
.LP
パッケージコマンドは、\fBlargefile\fR(5) を認識します。これらのコマンドは、2G バイトより大きなファイルを、より小さなファイルと同様に処理します。現在の実装では、\fBpkgadd\fR(1M)、\fBpkgtrans\fR1、およびそのほかのパッケージコマンドは最大 4G バイトのデータストリームを処理できます。
