Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/ppriv.1
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ppriv 1 "2011 年 3 月 25 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
ppriv \- プロセス特権セットおよび属性の検査または変更
.SH 形式
.LP
.nf
\fB/usr/bin/ppriv\fR \fB-e\fR [\fB-D\fR | \fB-N\fR] [\fB-M\fR] [\fB-s\fR \fIspec\fR] \fIcommand\fR [\fIarg\fR]...
.fi

.LP
.nf
\fB/usr/bin/ppriv\fR [\fB-v\fR] [\fB-S\fR] [\fB-D\fR | \fB-N\fR] [\fB-s\fR \fIspec\fR] 
     [\fIpid\fR | \fIcore\fR]...
.fi

.LP
.nf
\fB/usr/bin/ppriv\fR \fB-l\fR [\fB-v\fR] [\fIprivilege-specification\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBppriv\fR コマンドの最初の呼び出しでは、コマンド行の引数に従って変更された特権セットとフラグが指定された \fIcommand\fR が実行されます。
.sp
.LP
2 番目の呼び出しでは、実行中のプロセスとコアファイルの特権の状態を検査または変更します。
.sp
.LP
3 番目の呼び出しでは、定義されている特権および指定された特権または特権セットの指定に関する情報を一覧表示します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 11n
.rt  
指定されたプロセスまたはコマンドの特権のデバッグを有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 11n
.rt  
残りの引数をコマンド行として解釈し、指定された特権の属性およびセットでコマンド行を実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 11n
.rt  
現在定義されている特権をすべて標準出力に書き込みます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.RS 11n
.rt  
システムが Trusted Extensions で構成されている場合、このオプションを使用すると、\fBNET_MAC_AWARE\fR および \fBNET_MAC_AWARE_INHERIT\fR プロセス属性が有効になります。
.sp
これらの属性と \fBnet_mac_aware\fR 特権を持つプロセスは、より低いレベルのリモートピアと通信できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR \fR
.ad
.RS 11n
.rt  
指定されたプロセスまたはコマンドの特権のデバッグを無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIspec\fR\fR
.ad
.RS 11n
.rt  
スペース文字を含まない \fB[AEILP][+-=]\fR\fIprivsetspec\fR という形式の指定である \fIspec\fR に従ってプロセスの特権セットを変更します。
.sp
.ne 2
.mk
.na
\fB\fBAEILP\fR\fR
.ad
.RS 15n
.rt  
変更する特権セットを示す 1 文字以上の文字を示します。これらは大文字と小文字の区別がなく、たとえば、\fBa\fR または \fBA\fR のいずれもすべての特権セットを示します。
.sp
特権セットの単一文字省略名の定義については、\fBprivileges\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+-=\fR\fR
.ad
.RS 15n
.rt  
リストされた特権を \fIprivsetspec\fR で指定されたセットに、それぞれ追加 (\fB+\fR)、削除 (\fB-\fR)、または割り当て (\fB=\fR) する修飾子を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIprivsetspec\fR\fR
.ad
.RS 15n
.rt  
\fBpriv_str_to_set\fR(3C) で説明されている、コンマで区切られた特権セットの指定 (\fBpriv1\fR,\fBpriv2\fR など) を示します。
.RE

個々のセットにそれぞれ 1 つの割り当てを行うか、任意の数の追加および削除を行うかのいずれかであれば、同じセットを複数の \fB-s\fR オプションで変更することは可能です。つまり、単一のセットに対する割り当てと、追加または削除は相互に排他的です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.RS 11n
.rt  
短い。可能なかぎり短い出力文字列でセットを報告します。デフォルトは移植性のある出力形式です。\fBpriv_str_to_set\fR(3C) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 11n
.rt  
冗長。特権名を使用して特権セットを報告します。
.RE

.SH 使用法
.sp
.LP
\fBppriv\fR ユーティリティーは、プロセスとコアファイルを検査し、それらの特権セットを出力または変更します。
.sp
.LP
\fBppriv\fR は、特権のデバッグを有効または無効にして、あるいは呼び出すプロセスよりも少ない特権でコマンドを実行できます。
.sp
.LP
サブプロセスを実行する場合、変更できるセットは \fBL\fR と \fBI\fR のみです。\fBppriv\fR が \fBP=E=I\fR で起動された場合、特権を削除できるのは \fBL\fR と \fBI\fR からのみです。
.sp
.LP
\fBppriv\fR は、プロセスから特権を削除する場合、または別のプロセスに特権を委譲する場合にも使用できます。プロセスを制御するには、\fBppriv\fR ユーティリティーの実効セットは、制御されるプロセスの \fBE\fR、\fBI\fR、および \fBP\fR の上位集合である必要があります。ユーティリティーの制限セットは、ターゲットの制限セットの上位集合である必要があります。ターゲットプロセスのユーザー ID が一致しない場合は、ユーティリティーの実効セットで \fB{PRIV_PROC_OWNER}\fR 特権を表明する必要があります。制御されるプロセスが値 \fB0\fR のユーザー ID を持つ場合、さらに制限が存在する可能性があります。\fBprivileges\fR(5) を参照してください。
.SH 使用例
.LP
\fB例 1 \fR現在のシェルに対するプロセスの特権の取得
.sp
.LP
次の例では、現在のシェルに対するプロセスの特権を取得します。

.sp
.in +2
.nf
example$ \fBppriv $$\fR
387:   -sh
flags = <none>
         E: basic
         I: basic
         P: basic
         L: all
.fi
.in -2
.sp

.LP
\fB例 2 \fRシェルの継承可能な実効セットからの特権の削除
.sp
.LP
次の例では、シェルの継承可能な実効セットから特権を削除します。

.sp
.in +2
.nf
example$ \fBppriv -s EI-proc_session $$\fR 
.fi
.in -2
.sp

.sp
.LP
サブプロセスはまだ親シェルを検査できますが、親に影響を及ぼすことはできません。親は \fBppriv\fR の子プロセスよりも多い特権を Permitted セットに持っているためです。

.sp
.in +2
.nf
example$ \fBtruss -p $$\fR
truss: permission denied: 387

example$ \fBppriv $$\fR
387:   -sh
flags = <none>
         E: basic,!proc_session
         I: basic,!proc_session
         P: basic
         L: all
.fi
.in -2
.sp

.LP
\fB例 3 \fR特権のデバッグを使用したプロセスの実行
.sp
.LP
次の例では、特権のデバッグを有効にしてプロセスを実行します。

.sp
.in +2
.nf
example$ \fBppriv -e -D cat /etc/shadow\fR
cat[418]: missing privilege "file_dac_read" (euid = 21782),
                    needed at ufs_access+0x3c
cat: cannot open /etc/shadow
.fi
.in -2
.sp

.sp
.LP
特権のデバッグのエラーメッセージは、現在のプロセスの制御端末に送信されます。\fBneeded at\fR アドレス指定は、カーネル実装のアーティファクトであり、ソフトウェアの更新後にいつでも変更できます。

.sp
.LP
システムコール番号は、\fB/etc/name_to_sysnum\fR を使用するとシステムコールにマップできます。

.LP
\fB例 4 \fR現在のゾーンで使用可能な特権の一覧表示
.sp
.LP
次の例では、現在のゾーンで使用可能な特権を一覧表示します (\fBzones\fR(5) を参照)。大域ゾーンで実行すると、定義されているすべての特権が一覧表示されます。

.sp
.in +2
.nf
example$ \fBppriv -l zone\fR
 ... listing of all privileges elided ...
.fi
.in -2
.sp

.LP
\fB例 5 \fR特権に対応したプロセスの検査
.sp
.LP
次の例では、特権に対応したプロセスを検査します。

.sp
.in +2
.nf
example$ \fBppriv -S `pgrep rpcbind`\fR


928:    /usr/sbin/rpcbind
flags = PRIV_AWARE
        E: net_privaddr,proc_fork,sys_nfs
        I: none
        P: net_privaddr,proc_fork,sys_nfs
        L: none
.fi
.in -2
.sp

.sp
.LP
フラグの説明については、\fBsetpflags\fR(2) を参照してください。

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB0 以外\fR
.ad
.RS 12n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.RS 23n
.rt  
プロセスファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/name_to_sysnum\fR\fR
.ad
.RS 23n
.rt  
システムコール名と番号のマッピング
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
呼び出しは「確実」です。出力は「不確実」です。
.SH 関連項目
.sp
.LP
\fBgcore\fR(1), \fBtruss\fR(1), \fBsetpflags\fR(2), \fBpriv_str_to_set\fR(3C), \fBproc\fR(4), \fBattributes\fR(5), \fBprivileges\fR(5), \fBzones\fR(5)
