Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/rm.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T 
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH rm 1 "2011 年 7 月 27 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
rm, rmdir \- ディレクトリのエントリの削除
.SH 形式
.LP
.nf
\fB/usr/bin/rm\fR [\fB-f\fR] [\fB-i\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/rm\fR \fB-rR\fR [\fB-f\fR] [\fB-i\fR] \fIdirname\fR... [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/rm\fR [\fB-fiRr\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/rmdir\fR [\fB-ps\fR] \fIdirname\fR...
.fi

.SH 機能説明
.SS "/usr/bin/rm /usr/xpg4/bin/rm"
.sp
.LP
\fBrm\fR ユーティリティは、\fIfile\fR オペランドで示された各ディレクトリエントリを削除します。file に書き込み権がなく、標準入力が端末の場合、そのファイルに対するすべてのアクセス権 (8 進数) が出力され、後ろに疑問符がつけられます。これは、確認を求めるプロンプトです。回答が肯定の場合、ファイルが削除されます。それ以外の場合、ファイルはそのままです。
.sp
.LP
\fIfile\fR がシンボリックリンクの場合、リンクは削除されますが、参照するファイルまたはディレクトリは削除されません。ユーザーがシンボリックリンクを削除する際、そのディレクトリに書き込み権があれば、シンボリックリンクに書き込み権は必要ありません。
.sp
.LP
複数のファイルが指定され、何らかの理由でそのうちの 1 つが削除できなかった場合、\fBrm\fR は診断メッセージを標準エラー出力に書き出し、そのファイルにはそれ以上の処理は行わず、残りの \fIfile\fR を処理します。\fI\fR\fI\fR\fI\fR
.sp
.LP
標準入力が端末でない場合、rm は \fB-f\fR オプションが指定されている場合と同様に動作します。
.SS "/usr/bin/rmdir"
.sp
.LP
\fBrmdir\fR ユーティリティーは、\fIdirname\fR オペランドで示されたディレクトリのエントリを削除します。dirname は空のディレクトリを指している必要があります。
.sp
.LP
ディレクトリは指定された順序で処理されます。したがって、あるディレクトリとそのディレクトリのサブディレクトリを 1 度の \fBrmdir\fR 呼び出しで削除したい場合、サブディレクトリを親ディレクトリよりも前に指定して先に削除し、親ディレクトリの削除のときにディレクトリが空になるようにしてください。\fB\fR
.SH オプション
.sp
.LP
次のオプションは、\fB/usr/bin/rm\fR と \fB/usr/xpg4/bin/rm\fR で使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
引数リストにあるディレクトリおよび サブディレクトリを再帰的に削除します。ディレクトリ内は空にされ、削除されます。通常、ディレクトリにある書き込み保護された任意のファイルの削除には、ユーザーに確認を求めるプロンプトが出されます。ただし、\fB-f\fR オプションが使用されている場合、または 標準入力が端末ではなく、しかも \fB-i\fR オプションが使用されていない場合、書き込み保護されたファイルはプロンプトなしで削除されます。
.sp
このオプションが使用されたシンボリックリンクは、シンボリックリンク先には及びません。
.sp
書き込み保護された空でないディレクトリを削除しようとすると、このコマンドは常に (\fB-f\fR オプションが使用されている場合でも) 失敗に終わり、エラーメッセージが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
\fB-r\fRオプションと同じです。
.RE

.SS "/usr/bin/rm"
.sp
.LP
次のオプションは、\fB/usr/bin/rm\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
ユーザーへの指示なしにディレクトリ内のファイル (書き込み保護されているファイルも含む) を削除します。しかし、書き込み保護されたディレクトリでは、(たとえどんなアクセス権があっても) ファイルは決して削除されず、それについてのメッセージは表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
対話型。このオプションを使用すると、\fBrm\fR はファイルを削除する前に、確認を求めるプロンプトを出します。これは \fB-f\fR オプションより優先され、標準入力が端末でない場合でもその効力を持続します。
.RE

.SS "/usr/xpg4/bin/rm"
.sp
.LP
次のオプションは、\fB/usr/xpg4/bin/rm\fR のみでサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
確認を求めるプロンプトメッセージを出力しません。存在しないものがオペランドで指定されても、診断メッセージを出力したり終了ステータスを変更したりしません。前に \fB-i\fR オプションが指定されていれば、それを無視します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
確認を求めるプロンプトを出力します。\fB-f\fR オプションが指定されていれば、それを無視します。
.RE

.SS "/usr/bin/rmdir"
.sp
.LP
次のオプションは、\fB/usr/bin/rmdir\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
ユーザーはディレクトリ \fIdirname\fR および空になる親ディレクトリを削除できます。パスの全体、または一部が削除されていなければ、メッセージが標準出力に出されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
\fB-p\fR が有効なときに標準エラーに出力されるメッセージを表示しません。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 11n
.rt  
削除されるディレクトリエントリのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdirname\fR\fR
.ad
.RS 11n
.rt  
削除される空ディレクトリのパス名を指定します。
.RE

.SH 使用法
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBrm\fR と \fBrmdir\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 使用例
.sp
.LP
以下の例に、有効なコマンドの使用法を示します。
.SS "/usr/bin/rm、/usr/xpg4/bin/rm"
.LP
\fB例 1 \fRディレクトリの削除
.sp
.LP
次のコマンドは、ディレクトリエントリ \fBa.out\fR および \fBcore\fR を削除します。

.sp
.in +2
.nf
example% \fBrm a.out core\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR確認を求めない、ディレクトリの削除
.sp
.LP
次のコマンドは、確認を求めずにディレクトリ \fBjunk\fR とそのすべての内容を削除します。

.sp
.in +2
.nf
example% \fBrm -rf junk\fR
.fi
.in -2
.sp

.SS "/usr/bin/rmdir"
.LP
\fB例 3 \fR空のディレクトリの削除
.sp
.LP
現在のディレクトリに \fBa\fR というディレクトリがあり、そのディレクトリには \fBb\fR というディレクトリだけがあるとします。また \fBb\fR には、\fBc\fR というディレクトリだけがあるものとします。次のコマンドは、3 つのディレクトリすべてを削除します。

.sp
.in +2
.nf
example% \fBrmdir -p a/b/c\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBrm\fR と \fBrmdir\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.sp
.LP
肯定応答は、ユーザーのロケールの \fBLC_MESSAGES\fR カテゴリの \fByesexpr\fR キーワードで定義されている拡張正規表現を使用して処理されます。\fBLC_COLLATE\fR カテゴリに指定されているロケールは、\fByesexpr\fR に定義されている式に使用される範囲、同等クラス、および複数文字照合要素の動作を定義します。\fBLC_CTYPE\fR に指定されているロケールは、テキストデータのバイト列を文字として解釈するロケールや、\fByesexpr\fR に定義されている式に使用される文字クラスの動作を定義します。\fBlocale\fR(5) を参照してください。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 7n
.rt  
\fB-f\fR オプション省略時は、指定されたすべてのディレクトリエントリが削除されたことを示す。f オプション指定時は、指定されたすべての既存のディレクトリエントリが 削除されたことを示す。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR \fR
.ad
.RS 7n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/rm、/usr/bin/rmdir"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
.TE

.SS "/usr/xpg4/bin/rm"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBrmdir\fR(2), \fBunlink\fR(2), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.SH 診断
.sp
.LP
うっかりして次のようなことを行わないために、ファイル "\fB\&.\fR" および "\fB\&..\fR" を削除することは禁じられています。
.sp
.in +2
.nf
example% \fBrm -r .*\fR
.fi
.in -2
.sp

.sp
.LP
ファイル「\fB/\fR」を削除することは禁止されています。これは、間違って以下のような状況になってしまったときに、惨劇を起こさないようにするためです。
.sp
.in +2
.nf
example% \fBrm -rf $x/$y\fR
.fi
.in -2
.sp

.sp
.LP
または
.sp
.in +2
.nf
example% \fBrm -rf /$y\fR
.fi
.in -2
.sp

.sp
.LP
そして、\fB$x\fRと \fB$y\fR が空の文字列に展開される場合です。
.SH 注意事項
.sp
.LP
\fB\(mi\fR を使用することにより、ユーザーは任意のコマンド行オプションの最後を明白に記すことができ、\fBrm\fR は \fB\(mi\fR で始まるファイル名の引数を認識できます。BSD 移行の補助として、\fBrm\fR は \fB\(mi\|\(mi\fR を \fB\(mi\fR の同義語として受け入れます。この導入補助は、将来のリリースでは提供されない可能性があります。\fB\(mi\|\(mi\fR と \fB\(mi\fR の両方が同一コマンド行にある場合は、2 つめがファイルとして解釈されます。
