Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/rmformat.1
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rmformat 1 "2011 年 8 月 15 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
rmformat \- 再書き込み可能な取り外し可能メディアのフォーマット
.SH 形式
.LP
.nf
\fBrmformat\fR  [\fB-DeHUv\fR] [\fB-b\fR \fIlabel\fR] [\fB-c\fR \fIblockno\fR] [\fB-F\fRquick | long | force ]
 [\fB-s\fR \fIfilename\fR] [\fIdevname\fR]
.fi

.LP
.nf
\fBrmformat\fR  \fB-V\fR read | write \fIdevname\fR
.fi

.LP
.nf
\fBrmformat\fR  \fB-l\fR [\fIdevname\fR]
.fi

.SH 機能説明
.sp
.LP
\fBrmformat\fR ユーティリティーは、再書き込み可能な取り外し可能媒体の、フォーマット、ラベル付け、パーティション分割、およびその他のさまざまな処理を行います。この再書き込み可能な取り外し可能媒体には、\fBPCMCIA\fR メモリーカードと \fBata\fR カードがあります。\fBrmformat\fR ユーティリティーは、USB ハードドライブなど、あらゆる USB 大容量ストレージデバイスでも使用することをお勧めします。rmformat ユーティリティーは、検証、表面解析、不良セクターの修復 (ドライブまたはドライバが不良ブロック管理をサポートしている場合) を行うためにも使用できます。
.sp
.LP
フォーマット後、\fBrmformat\fR はラベルを書き込みます。これにより、メディアの全容量が \fBPCMCIA\fR メモリーカード上で 1 つのスライスとして扱われます。パーティション情報は、\fBrmformat\fR のオプションを使用して変更することができます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIlabel\fR\fR
.ad
.sp .6
.RS 4n
メディアに SUNOS ラベルを作成します。SUNOS ボリュームラベル名は 8 文字以内にする必要があります。メディアのサイズが 1T バイトを超える場合は、EFI ラベルが作成されます。媒体のサイズが 1 TB を超える場合は、EFI ラベルが作成されます。\fBDOS\fR ボリュームラベルを書き込むには、\fBmkfs_pcfs\fR(1M) を使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIblockno\fR\fR
.ad
.sp .6
.RS 4n
指定されたブロックを修正して修復します。このオプションは、\fBrmformat\fR がサポートするすべてのデバイスに適用できるわけではありません。不良ブロック管理機能を持つドライブが装備されているデバイスと、このオプションがドライバによって実装されているデバイスとがあるためです。不良ブロック管理がサポートされているのがドライブまたはドライバのどちらであっても、不良ブロックは可能なかぎり修正されるように機能します。不良ブロックを修正できなかった場合は、修復に失敗したことを示すメッセージが表示されます。メッセージには、該当するブロック番号が 10 進数、8 進数、16 進数で示されます。
.sp
通常の \fBPCMCIA\fR メモリーおよび \fBata\fR カードは、不良ブロック管理をサポートしていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
処理が終了した時にメディアを取り出します。ドライブが自動で取り出しを行う機能をサポートしていない場合、このオプションは利用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR quick | long | force\fR
.ad
.sp .6
.RS 4n
メディアをフォーマットします。
.sp
\fBquick\fR オプションは、検証をしないでフォーマットを開始するか、またはメディアの特定のトラックだけを検証してフォーマットを開始します。
.sp
\fBlong\fR オプションは、完全フォーマットを開始します。ドライブ自体によってメディア全体の検証を行うデバイスもあります。
.sp
\fBforce\fR オプションは、フォーマットを開始する前にユーザーによる確認を行わずに long オプションによるフォーマットを行います。
.sp
\fBPCMCIA\fR メモリーカードでは、前述のどのオプションを指定しても long オプションによるフォーマットを行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
すべてのリムーバブルデバイスのリストを表示します。デフォルト (オプションを指定しない場合) でも、\fBrmformat\fR はすべてのリムーバブルデバイスのリストを表示します。\fBdev_name\fR を指定した場合、\fBrmformat\fR は \fBdev_name\fR に関連するデバイスのリストを表示します。リストには、デバイスのパス名、ベンダー情報、およびデバイスタイプが含まれます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
ユーザーが、SUNOS ラベル中のパーティション情報を配置することができるようにします。
.sp
ユーザーは、各スライスの情報 (バイトオフセット、必要なサイズ、タグ、フラグ) を記述したファイルを入力として指定する必要があります。各スライスの情報を記述する書式は次のとおりです。
.sp
.in +2
.nf
slices: \fIn\fR = \fIoffset\fR, \fIsize\fR [, \fIflags\fR, \fItags\fR] 
.fi
.in -2
.sp

\fIn\fR はスライス番号です。\fIoffset\fR はスライス \fIn\fR の開始位置で、バイトオフセットです。\fIsize\fR はスライス \fIn\fR のサイズです。\fIoffset\fR および \fIsize\fR に指定する値は、512 バイトの倍数にする必要があります。これらの数値は、10進数、16 進数、または 8 進数で指定することができます。浮動小数点数は使用できません。スライスの最大数についての詳細は、\fI『Oracle Solaris Administration: Common Tasks』\fRを参照してください。
.sp
\fIsize\fR または \fIoffset\fR を K バイト、M バイト、G バイト単位で指定するには、それぞれ数値のあとに \fBKB\fR、\fBMB\fR、\fBGB\fR を付けてください。これらの単位を表す接尾辞なしの数値は、バイトオフセットとみなされます。指定できるフラグは、次のとおりです。
.sp
.in +2
.nf
\fBwm\fR = read-write, mountable
\fBwu\fR = read-write, unmountable
\fBru\fR = read-only, unmountable
.fi
.in -2
.sp

指定できるタグは、次のとおりです。 \fBunassigned\fR、\fBboot\fR、\fBroot\fR、\fBswap\fR、\fBusr\fR、\fBbackup\fR、\fBstand\fR、\fBvar\fR、\fBhome\fR、および \fBalternates\fR。
.sp
値を特定する必要がない場合は、タグとフラグの指定を省略することができます。ただし、省略する場合はタグとフラグの両方を省略し、指定する場合はタグとフラグの両方を指定する必要があります。特定のスライスに対するタグとフラグの値が指定されない場合、それぞれのデフォルト値が使用されます。フラグのデフォルト値は \fBwm\fR、タグのデフォルト値は \fBunassigned\fR です。
.sp
また、タグの名前は完全名または短縮名で指定できます。短縮名は完全名から最初の 2 文字以上を引用したものです。\fBrmformat\fR は、タグおよびフラグの短縮名を扱う時には大文字・小文字を区別しません。
.sp
スライスの指定は、次のように区切って記述します。 
.sp
例: 
.sp
.in +2
.nf
slices: 0 = 0, 30MB, "wm", "home" : 
        1 = 30MB, 51MB : 
        2 = 0, 100MB, "wm", "backup" :
        6 = 81MB, 19MB
.fi
.in -2
.sp

\fBrmformat\fR は、重複パーティションまたはメディアの容量を超える不正な要求を検出するために、必要性検査を行います。1つのスライス \fIn\fR について提供するスライス情報は 1 項目だけにする必要があります。同じスライス \fIn\fR について複数のスライス情報がある場合は、エラーメッセージが表示されます。スライス \fB2\fR は、ディスク全体を含むバックアップです。\fB#\fR は、入力ファイル中にコメント行を記述するために使用します。\fBrmformat\fR は、行頭にハッシュ記号 (\fB#\fR) がある行は、その行の末尾までのすべての文字を無視します。\fB\fR
.sp
容量がごく小さいメディアにいくつかのパーティションを作成することはできますが、そのようなデバイスに対してこのオプションを使用する場合には注意が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.sp .6
.RS 4n
すべてのファイルシステム上で \fBumount\fR を実行し、そのあとでフォーマットします。\fBmount\fR(1M) を参照してください。つまり、マウントされていたスライスをすべてマウント解除し、指定したデバイスに対して long オプションによるフォーマットを実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR read | write\fR
.ad
.sp .6
.RS 4n
フォーマット後にメディアの各ブロックを検証します。書き込みの検証は、破壊的なメカニズム (書き込んだら消去するというメカニズム) で行われます。検証を開始する前に、ユーザーは検証を始めることを確定するように求められます。このオプションを使用すると、不良ブロックとして検出されたブロックの番号のリストが出力されます。
.sp
読み取りの検証は、ブロックを検証して、エラーが発生する傾向にあるブロックのリストが出力されます。
.sp
出力されるブロック番号のリストは、修復を行う時に \fB-c\fR オプションを使って利用することができます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIdevname\fR\fR
.ad
.sp .6
.RS 4n
\fIdevname\fR には、絶対パス名または現在のディレクトリからの相対パス名でデバイスのパス名を指定するか、\fBcdrom\fR や \fBrmdisk\fR などのニックネームを指定します。 
.sp
ボリューム管理が動作していないシステムでは、\fB/dev/rdsk/c\fI?\fRt\fI?\fRd\fI?\fRs\fI?\fR\fR のような絶対パス名で、または現在のディレクトリからの相対パス名で、デバイスを指定することができます。
.RE

.SH 使用例
.LP
\fB例 1 \fRPCFS ファイルシステム用にリムーバブルメディアをフォーマットする
.sp
.LP
以下は、代替の \fBfdisk\fR パーティションを作成する例です。

.sp
.in +2
.nf
example$ \fBrmformat -F quick /dev/rdsk/c0t4d0s2:c\fR
Formatting will erase all the data on disk.
Do you want to continue? (y/n)\fBy\fR
example$ \fBsu\fR
# \fBfdisk /dev/rdsk/c0t4d0s2:c\fR
# \fBmkfs -F pcfs /dev/rdsk/c0t4d0s2:c\fR
Construct a new FAT file system on /dev/rdsk/c0t4d0s2:c: (y/n)? \fBy\fR
#
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/dev/aliases\fR\fR
.ad
.sp .6
.RS 4n
別名を使用するボリューム管理によって制御されている異なるメディアに対して、文字型デバイスへのシンボリックリンクを提供するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk\fR\fR
.ad
.sp .6
.RS 4n
\fBPCMCIA\fR メモリーおよび ata カードやリムーバブルメディアのデバイスに対するブロック型デバイスアクセスを提供するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk\fR\fR
.ad
.sp .6
.RS 4n
\fBPCMCIA\fR メモリーおよび ata カードやリムーバブルメディアのデバイスに対する文字型デバイスアクセスを提供するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/aliases/pcmemS\fR\fR
.ad
.sp .6
.RS 4n
ソケット \fBS\fR 中の \fBPCMCIA\fR メモリーカードに対する文字型デバイスへのシンボリックリンク。S は、PCMCIA ソケット番号を表しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/aliases/rmdisk0\fR\fR
.ad
.sp .6
.RS 4n
\fBCD-ROM\fR、\fBDVD-ROM\fR、\fBPCMCIA\fR メモリーカード以外の一般的なリムーバブルメディアのデバイスへのシンボリックリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk\fR\fR
.ad
.sp .6
.RS 4n
\fBPCMCIA\fR メモリーおよび \fBata\fR カードやその他のリムーバブルデバイスに対する文字型デバイスアクセスを提供するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk\fR\fR
.ad
.sp .6
.RS 4n
\fBPCMCIA\fR メモリーおよび \fBata\fR カードやその他のリムーバブルメディアのデバイスに対するブロック型デバイスアクセスを提供するディレクトリ。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/storage/media-volume-manageR
.TE

.SH 関連項目
.sp
.LP
\fBcpio\fR(1), \fBeject\fR(1), \fBtar\fR(1), \fBvolcheck\fR(1), \fBvolrmmount\fR(1), \fBformat\fR(1M), \fBmkfs_pcfs\fR(1M), \fBmount\fR(1M), \fBnewfs\fR(1M), \fBprtvtoc\fR(1M), \fBrmmount\fR(1M), \fBrpc.smserverd\fR(1M), \fBattributes\fR(5), \fBscsa2usb\fR(7D), \fBsd\fR(7D), \fBpcfs\fR(7FS), \fBudfs\fR(7FS)
.sp
.LP
\fI『Oracle Solaris Administration: Common Tasks』\fR
.SH 注意事項
.sp
.LP
SPARC ベースのシステム上で (\fBnewfs\fR(1M) を使用して) 作成された \fBufs\fR ファイルシステムが含まれている、再書き込み可能なメディア、\fBPCMCIA\fR メモリーカード、または \fBPCMCIA\fR ata カードと、x86 ベースのシステム上で作成された \fBufs\fR ファイルシステムが含まれている再書き込み可能なメディアまたは \fBPCMCIA\fR メモリーカードとは、同じではありません。SPARC ベースのシステムと x86 ベースのシステムとの間で、\fBufs\fR ファイルシステムを含む再書き込み可能な媒体を交換しないでください。SPARC ベースのシステムと x86 ベースのシステムとの間で、メモリーカード中のファイルを転送するには、\fBcpio\fR(1) または \fBtar\fR(1) を使用してください。相互に交換することが可能なファイルシステムについては、\fBpcfs\fR(7FS) および \fBudfs\fR(7FS) を参照してください。 
.sp
.LP
仮想化環境では、\fBrmformat\fR がリムーバブルデバイスの一部を表示しないことがあります。
.SH 使用上の留意点
.sp
.LP
現在のところ、\fBPCMCIA\fR メモリーカード上の不良セクターの場所を検出する機能は、サポートされていません。このため、\fBrmformat\fR を実行してエラー (\fBbad sector\fR) が発生した場合、メモリーカードを使用できません。
