Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/roles.1
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH roles 1 "2011 年 7 月 5 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
roles \- ユーザーに許可された役割を表示する
.SH 形式
.LP
.nf
\fBroles\fR [ \fIuser\fR ]...
.fi

.SH 機能説明
.sp
.LP
\fBroles\fR コマンドは、自分または任意指定のユーザーに許可されている役割を標準出力に書き込みます。役割は、実際のユーザー (通常ユーザーと呼ばれる) ではなく、機能的な責任に対応する特殊なアカウントです。
.sp
.LP
各ユーザーはゼロ以上の役割を持つことができます。役割には通常ユーザーのほとんどの属性が含まれ、\fBpasswd\fR(4) および \fBshadow\fR(4) では通常のユーザーと同様に識別されます。各役割には、\fBuser_attr\fR(4) ファイルのエントリが必要です。このエントリによって役割として識別されます。役割には、独自の承認とプロファイルを指定できます。\fBauths\fR(1) および \fBprofiles\fR(1) を参照してください。
.sp
.LP
役割には、一次的なユーザーとしてシステムにログインすることが許可されません。ユーザーが自分自身としてログインしてから、役割を引き受ける必要があります。役割のアクションは通常ユーザーに起因します。監査が有効の場合、監査される役割のイベントには、役割を引き受けた元のユーザーの監査 \fBID\fR が含まれます。
.sp
.LP
役割が役割自身またはほかの役割を引き受けることはできません。役割は階層型ではありません。ただし、権利プロファイル (\fBprof_attr\fR(4) を参照) は階層型で、階層型の役割と同じ効果を得るために使用できます。
.sp
.LP
役割の引き受けは、\fBsu\fR(1M)、\fBssh\fR(1)、または \fBPAM_AUSER\fR 変数をサポートするその他のサービスを使用して実行できます。引き受けが成功するには、役割の認証とメンバーシップの両方が必要です。役割の認証では、その役割の \fBuser_attr\fR(4) エントリにおける \fBroleauth\fR プロパティーの設定に応じて、ユーザーのパスワードと役割のパスワードのどちらかを要求できます。デフォルトでは、役割のパスワードが要求されます。通常、役割にはプロファイルシェルが割り当てられます。 慣例により、プロファイルシェルは、たとえば \fBpfbash\fR のように、標準のシェルの名前の前に \fBpf\fR を付けて指定されます。役割の割り当ては、\fBuser_attr\fR(4) で指定されます。
.SH 使用例
.LP
\fB例 1 \fR出力例
.sp
.LP
\fBroles\fR コマンドの出力の形式は次のとおりです。

.sp
.in +2
.nf
example% \fBroles tester01 tester02\fRtester01 : admin
tester02 : secadmin, root
example%
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBauths\fR(1), \fBpfexec\fR(1), \fBprofiles\fR(1), \fBrlogin\fR(1), \fBssh\fR(1), \fBsu\fR(1M), \fBauth_attr\fR(4), \fBpasswd\fR(4), \fBprof_attr\fR(4), \fBshadow\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
