Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1/svcs.1
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH svcs 1 "2011 年 6 月 15 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
svcs \- サービスのステータスを報告 
.SH 形式
.LP
.nf
\fBsvcs\fR [\fB-aHpv?\fR] [\fB-o\fR \fIcol\fR[,\fIcol\fR]]... [\fB-R\fR \fIFMRI-instance\fR]... 
     [\fB-sS\fR \fIcol\fR]... [\fIFMRI\fR | \fIpattern\fR]...
.fi

.LP
.nf
\fBsvcs\fR {\fB-d\fR | \fB-D\fR} [\fB-Hpv?\fR] [\fB-o\fR \fIcol\fR[,\fIcol\fR]]... [\fB-sS\fR \fIcol\fR]... 
     [\fIFMRI\fR | \fIpattern\fR] ...
.fi

.LP
.nf
\fBsvcs\fR \fB-n\fR [\fIFMRI\fR] ...
.fi

.LP
.nf
\fBsvcs\fR \fB-l\fR [\fB-v\fR] [\fIFMRI\fR | \fIpattern\fR]...
.fi

.LP
.nf
\fBsvcs\fR \fB-x\fR [\fB-v\fR] [\fIFMRI\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBsvcs\fR コマンドは、サービス設定リポジトリに記録されているサービスインスタンスに関する情報を表示します。
.sp
.LP
このコマンドの 1 番目の形式では、引数に指定したサービスインスタンスのステータスが、1 行のリストとして出力されます。各インスタンスは 1 回だけ出力されます。引数を指定しない場合は、有効になっているすべてのサービスインスタンス (一時的に無効になっているものも含む) が、あとに示すように列のリストとして出力されます。
.sp
.LP
2 番目の形式では、引数に指定したサービスインスタンスの依存関係 (依存しているサービス) のステータスが、1 行のリストとして出力されます。
.sp
.LP
3 番目の形式では、特定のサービスおよびインスタンスに関する詳細情報が出力されます。
.sp
.LP
4 番目の形式では、サービスインスタンスの状態の説明が出力されます。指定した引数ごとに、サービスの状態およびその状態になった理由の説明が、人間が読み取れる形式のテキストで表示されます。引数を指定しない場合は、問題の発生したサービスの説明が表示されます。
.sp
.LP
エラーメッセージが標準エラーストリームに出力されます。
.sp
.LP
このコマンドの出力は、\fBsvcadm\fR(1M) コマンドへの適切な入力として使用できます。
.SH オプション
.sp
.LP
次のオプションを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.RS 20n
.rt  
列指定子を含めて、使用状況のメッセージを詳細に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 20n
.rt  
無効なサービスや不完全なサービスを含め、すべてのサービスを表示します。不完全なサービスについては、\fBsvcs \(emx\fR\fI<service>\fR を使用してさらに詳細を表示できます。 
.sp
サービスが選択されている場合は、このオプションの効果はありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 20n
.rt  
指定されたサービスインスタンスが依存するサービスまたはサービスインスタンスの一覧を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 20n
.rt  
指定されたサービスまたはサービスインスタンスに依存するサービスインスタンスの一覧を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 20n
.rt  
列ヘッダーを省略します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 20n
.rt  
(小文字のエル)選択されたサービスおよびサービスインスタンスについて、表示可能な情報をすべて表示します。各行に 1 つのサービス属性が表示されます。異なるインスタンスの情報は、空白行で区切られます。
.sp
次の属性について個別に説明します。
.sp
.ne 2
.mk
.na
\fB\fBdependency\fR\fR
.ad
.RS 14n
.rt  
依存関係に関する情報。グループ化および \fBrestart_on\fR プロパティーが最初に表示されます。プロパティーの間はスラッシュ (\fB/\fR) で区切られます。次に、各エンティティーとその状態が表示されます。状態の詳細については、\fBsmf\fR(5) を参照してください。標準の状態のほかに、各サービスの依存関係に次の状態説明が表示される場合があります。
.sp
.ne 2
.mk
.na
\fB\fBabsent\fR\fR
.ad
.RS 12n
.rt  
このサービスはシステムに定義されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinvalid\fR\fR
.ad
.RS 12n
.rt  
障害管理リソース識別子 (FMRI) は無効です (\fBsmf\fR(5) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmultiple\fR\fR
.ad
.RS 12n
.rt  
このエンティティーは、複数のインスタンスを持つサービスです。
.RE

ファイルの依存関係には、次のいずれかの状態説明のみ表示されます。
.sp
.ne 2
.mk
.na
\fB\fBabsent\fR\fR
.ad
.RS 11n
.rt  
このファイルはシステムに存在しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonline\fR\fR
.ad
.RS 11n
.rt  
このファイルは存在します。
.sp
最後に \fBsvc.startd\fR がサービスの依存関係を評価したときにファイルが存在しなかった場合には、依存関係が満たされていないものとみなされることがあります。\fBsvcadm refresh\fR は、強制的に依存関係を再評価します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.RS 11n
.rt  
\fBENOENT\fR 以外の理由で、\fBstat\fR(2) が失敗しました。
.RE

依存関係、グループ化、および \fBrestart_on\fR の値の詳細については、\fBsmf\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBenabled\fR\fR
.ad
.RS 14n
.rt  
このサービスが有効であるかどうか、および一時的に (次回のシステムリブートまで) 有効であるか無効であるかの情報。サービスが有効かどうかは、\fBtrue\fR または \fBfalse\fR によって示されます。一時的に有効かどうかは、\fB(temporary)\fR が存在するかどうかで示されます。
.sp
管理者が \fBsvcadm disable -t\fR を実行した場合、\fBsvcadm milestone\fR を使用した場合、または特定のタイミングにシステムをブートした場合に、サービスが一時的に無効になることがあります。詳細については、\fBsvcadm\fR(1M) を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 20n
.rt  
通知パラメータを出力します。\fBsmf\fR(5) を参照してください。これは、選択された FMRI またはパターンに関係なく、FMA イベント通知パラメータとシステム全体の SMF 状態遷移通知パラメータを常に出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIcol\fR[,\fIcol\fR]...\fR
.ad
.RS 20n
.rt  
指定された列を出力します。各 \fIcol\fR は列名でなければなりません。指定できる列については、後述の「\fB列\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 20n
.rt  
各サービスインスタンスに関連付けられているプロセスの一覧を表示します。サービスインスタンスによっては、プロセスが関連付けられていないことがあります。プロセス ID、開始時刻、およびコマンド名 (\fBps\fR(1) の \fBPID\fR、\fBSTIME\fR、および \fBCMD\fR フィールド) がプロセスごとに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIFMRI-instance\fR\fR
.ad
.RS 20n
.rt  
指定されたサービスインスタンスをリスタータとして使用するサービスインスタンスを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIcol\fR\fR
.ad
.RS 20n
.rt  
出力を列でソートします。\fIcol\fR は列名でなければなりません。指定できる列については、後述の「\fB列\fR」を参照してください。複数の \fB-s\fR オプションが指定された場合は、指定された順番にソートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIcol\fR\fR
.ad
.RS 20n
.rt  
オプション \fB-s\fR と反対の順序に、 \fIcol\fR でソートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 20n
.rt  
\fB-x\fR または \fB-l\fR が指定されていない場合は、次の冗長列を表示します: \fBSTATE\fR、\fBNSTATE\fR、\fBSTIME\fR、\fBCTID\fR、および \fBFMRI\fR。
.sp
\fB-x\fR が指定されている場合は、各説明に関する追加情報を表示します。
.sp
\fB-l\fR が指定されている場合は、タイプ \fBapplication\fR のプロパティーグループのユーザーが表示可能なプロパティーとその説明を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 20n
.rt  
サービスの状態の説明を表示します。 
.sp
引数が指定されていない場合の \fB-x\fR オプションは、次のようなサービスの状態説明を表示します。 
.RS +4
.TP
.ie t \(bu
.el o
有効になっているが、実行されていない。
.RE
.RS +4
.TP
.ie t \(bu
.el o
別の有効なサービスが動作しているので、実行できない。
.RE
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIFMRI\fR\fR
.ad
.RS 17n
.rt  
1 つまたは複数のインスタンスを指定する障害管理リソース識別子 (FMRI) (\fBsmf\fR(5) を参照)。FMRI は、インスタンス名、またはサービス名の最後の部分を指定する方法で、省略して入力することができます。たとえば、次の FMRI があるとします。
.sp
.in +2
.nf
svc:/network/smtp:sendmail
.fi
.in -2
.sp

次のような省略が有効です。
.sp
.in +2
.nf
sendmail
:sendmail
smtp
smtp:sendmail
network/smtp
.fi
.in -2
.sp

次のような省略は無効です。
.sp
.in +2
.nf
mail
network
network/smt
.fi
.in -2
.sp

FMRI にサービスを指定した場合は、\fB-D\fR オプションを一緒に使用している場合を除いて、そのサービスのすべてのインスタンスにコマンドが適用されます。
.sp
FMRI の省略形は不安定なので、スクリプトやその他の長期に渡って使用するツールには使用しないでください。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpattern\fR\fR
.ad
.RS 17n
.rt  
\fBfnmatch\fR(5) で説明されている展開規則に従ってサービスインスタンスの \fIFMRI\fR と照合されるパターン。このパターンが「\fBsvc:\fR」で始まっていない場合は、「\fBsvc:/\fR」が前に付加されます。glob パターンの一般的な例を次に示します。
.sp
.in +2
.nf
qexample% svcs \e*keyserv\e*
STATE          STIME     FMRI
disabled       Aug_02    svc:/network/rpc/keyserv:default
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fIFMRI-instance\fR\fR
.ad
.RS 17n
.rt  
あるインスタンスを指定する FMRI。
.RE

.SH 列
.sp
.LP
列名の大文字と小文字は区別されません。デフォルトの出力形式は「\fB-o\fR \fBstate,stime,fmri\fR」です。デフォルトのソート列は \fBSTATE\fR、\fBSTIME\fR、\fBFMRI\fR です。
.sp
.ne 2
.mk
.na
\fB\fBCTID\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの主契約 ID。すべてのインスタンスに有効な主契約 ID が割り当てられているわけではありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESC\fR\fR
.ad
.RS 10n
.rt  
テンプレート要素から渡された、サービスの簡単な説明。説明が渡されていないサービスの場合は、値が空であることを示すために、ハイフン (\fB\(hy\fR) が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFMRI\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの \fIFMRI\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINST\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスのインスタンス名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNSTA\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの次の状態 (省略名)。\fBSTA\fR 列の説明を参照してください。ハイフンは、インスタンスが移行していないことを示します。それ以外は \fBSTA\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNSTATE\fR\fR
.ad
.RS 10n
.rt  
サービスの次の状態。ハイフンは、インスタンスが移行していないことを示します。それ以外は \fBSTATE\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSCOPE\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの有効範囲名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVC\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスのサービス名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTA\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの状態 (省略名) (\fBsmf\fR(5) を参照)。
.sp
.ne 2
.mk
.na
\fB\fBDGD\fR\fR
.ad
.RS 7n
.rt  
機能低下
.RE

.sp
.ne 2
.mk
.na
\fB\fBDIS\fR\fR
.ad
.RS 7n
.rt  
無効
.RE

.sp
.ne 2
.mk
.na
\fB\fBLRC\fR\fR
.ad
.RS 7n
.rt  
レガシー \fBrc*.d\fR スクリプト主導インスタンス
.RE

.sp
.ne 2
.mk
.na
\fB\fBMNT\fR\fR
.ad
.RS 7n
.rt  
保守
.RE

.sp
.ne 2
.mk
.na
\fB\fBOFF\fR\fR
.ad
.RS 7n
.rt  
オフライン
.RE

.sp
.ne 2
.mk
.na
\fB\fBON\fR\fR
.ad
.RS 7n
.rt  
online
.RE

.sp
.ne 2
.mk
.na
\fB\fBUN\fR\fR
.ad
.RS 7n
.rt  
未初期化
.RE

状態が存在しないか認識されない場合は、疑問符 (\fB?\fR) が表示されます。移行中のインスタンスにはアスタリスク (\fB*\fR) が付加されます。ただし、\fBNSTA\fR 列または \fBNSTATE\fR 列が一緒に表示されている場合には付加されません。
.sp
サービスの状態の説明については、\fBsmf\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.RS 10n
.rt  
サービスインスタンスの状態。移行中のインスタンスには、アスタリスクが付加されます。ただし、\fBNSTA\fR 列または \fBNSTATE\fR 列が一緒に表示されている場合には付加されません。
.sp
サービスの状態の説明については、\fBsmf\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTIME\fR\fR
.ad
.RS 10n
.rt  
直前の 24 時間の間にサービスインスタンスが現在の状態になった場合は、この列にその時刻が表示されます。それ以外の場合は、その日付が表示されます。空白の場所は下線 (\fB_\fR) に変換されます。
.RE

.SH 使用例
.LP
\fB例 1 \fRデフォルトの出力を表示する
.sp
.LP
この例では、デフォルトの出力が表示されます。

.sp
.in +2
.nf
example% svcs
STATE          STIME    FMRI
\&...
legacy_run     13:25:04 lrc:/etc/rc3_d/S42myscript
\&...
online         13:21:50 svc:/system/svc/restarter:default
\&...
online         13:25:03 svc:/milestone/multi-user:default
\&...
online         13:25:07 svc:/milestone/multi-user-server:default
\&...
.fi
.in -2
.sp

.LP
\fB例 2 \fRすべてのローカルインスタンスの一覧を表示する
.sp
.LP
この例では、\fBservice1\fR サービスのすべてのローカルインスタンスの一覧が表示されます。

.sp
.in +2
.nf
example% svcs -o state,nstate,fmri service1
STATE        NSTATE        FMRI
online       -             svc:/service1:instance1
disabled     -             svc:/service1:instance2
.fi
.in -2
.sp

.LP
\fB例 3 \fR冗長情報を表示する
.sp
.LP
この例では、冗長情報が表示されます。

.sp
.in +2
.nf
example% svcs -v network/rpc/rstat:udp
STATE          NSTATE        STIME    CTID   FMRI
online         -             Aug_09        - svc:/network/rpc/rstat:udp
.fi
.in -2
.sp

.LP
\fB例 4 \fR詳細情報を表示する
.sp
.LP
この例では、\fBsystem/service3\fR のすべてのインスタンスに関する詳細情報が表示されます。管理しているリスタータに応じて、追加フィールドが表示されます。 

.sp
.in +2
.nf
example% svcs -l network/rpc/rstat:udp

fmri         svc:/network/rpc/rstat:udp
enabled      true
state        online
next_state   none
restarter    svc:/network/inetd:default
contract_id
dependency   require_all/error svc:/network/rpc/bind (online)
.fi
.in -2
.sp

.LP
\fB例 5 \fRプロセスを表示する
.sp
.in +2
.nf
example% svcs -p sendmail
STATE          STIME    FMRI
online         13:25:13 svc:/network/smtp:sendmail
               13:25:15   100939 sendmail
13:25:15   100940 sendmail  
.fi
.in -2
.sp

.LP
\fB例 6 \fR\fBsvcs\fR \fB-x\fR を使用したサービス状態の説明
.sp
.LP
(a) この例では、\fBsvcs\fR \fB-x\fR を実行することで、無効になっている print/server サービスが、ある 2 つのサービスが有効なのにオンラインになっていない根本原因であることが明らかになりました。\fBsvcs\fR \fB-xv\fR を実行すると、それらのサービスが \fBprint/rfc1179\fR と \fBprint/ipp-listener\fR であることがわかります。この状況を解決するには、\fBprint/server\fR を有効にするか、あるいは \fBrfc1179\fR と \fBipp-listener\fR を無効にします。

.sp
.in +2
.nf
example% svcs -x
svc:/application/print/server:default (LP print server)
 State: disabled since Mon Feb 13 17:56:21 2006
Reason: Disabled by an administrator.
   See: http://sun.com/msg/SMF-8000-05
   See: lpsched(1M)
Impact: 2 dependent services are not running. (Use -v for list.)
.fi
.in -2
.sp

.sp
.LP
(b) この例では、NFS が動作していません。

.sp
.in +2
.nf
example$ svcs nfs/client
STATE          STIME    FMRI
offline        16:03:23 svc:/network/nfs/client:default
.fi
.in -2
.sp

.sp
.LP
(c) 次の例から、問題は \fBnfs/status\fR にあることがわかります。\fBnfs/client\fR が待機中になっている理由は、\fBnfs/status\fR に依存する \fBnfs/nlockmgr\fR に、自身が依存しているからです。

.sp
.in +2
.nf
example$ svcs -xv nfs/client
svc:/network/nfs/client:default (NFS client)
 State: offline since Mon Feb 27 16:03:23 2006
Reason: Service svc:/network/nfs/status:default
        is not running because a method failed repeatedly.
   See: http://sun.com/msg/SMF-8000-GE
  Path: svc:/network/nfs/client:default
          svc:/network/nfs/nlockmgr:default
            svc:/network/nfs/status:default
   See: man -M /usr/share/man -s 1M mount_nfs
   See: /var/svc/log/network-nfs-client:default.log
Impact: This service is not running.
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
コマンド呼び出しに成功しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
致命的エラーが発生したことを表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
無効なコマンド行オプションが指定された。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
画面出力は「不確実」です。呼び出しは「確実」です。
.SH 関連項目
.sp
.LP
\fBps\fR(1), \fBsvcprop\fR(1), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvc.startd\fR(1M), \fBstat\fR(2), \fBlibscf\fR(3LIB), \fBattributes\fR(5), \fBfnmatch\fR(5), \fBsmf\fR(5)
