Arquivotheca/solaris11/usr/man/man/usr/share/man/man7fs/dev.7fs
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH dev 7FS "7 May 2011" "SunOS 5.11" "File Systems"
.SH NAME
dev \- Device name file system
.SH DESCRIPTION
.sp
.LP
The \fBdev\fR filesystem manages the name spaces of devices under the Solaris operating environment. The global zone's instance of the \fBdev\fR filesystem is mounted during boot on \fB/dev\fR.
.sp
.LP
A subdirectory under \fB/dev\fR can have unique operational semantics. Most of the common device names under \fB/dev\fR are created automatically by \fBdevfsadm\fR(1M). Others, such as \fB/dev/pts\fR, are dynamic and reflect the operational state of the system. You can manually generate device names for newly attached hardware by invoking \fBdevfsadm\fR(1M) or implicitly, by indirectly causing a lookup or readdir operation in the filesystem to occur. For example, you can discover a disk that was attached when the system was powered down (and generate a name for that device) by invoking \fBformat\fR(1M)).
.sp
.LP
The \fB/dev/zvol/dsk\fR and \fB/dev/zvol/rdsk\fR directories are generated based on the ZFS dataset hierarchy. Each ZFS file system is represented in \fB/dev/zvol/dsk\fR and \fB/dev/zvol/rdsk\fR as a directory. Each ZFS volume and each snapshot of a ZFS volume is represented as a block device in \fB/dev/zvol/dsk\fR and as a character device in \fB/dev/zvol/rdsk\fR. Within the global zone, symbolic links to device nodes within \fB/devices\fR are used instead of device nodes. See \fBdevfs\fR(7FS) 
.sp
.LP
Within non-global zones, the names that appear under \fB/dev/zvol\fR represent the aliased dataset names. See \fBzonecfg\fR(1M).
.sp
.LP
Within non-global zones, devices that are added by way of device resources can have the same name as those that appear in the aliased dataset namespace. See \fBzonecfg\fR(1M). If such conflicts occur, the device file corresponding to the device resource is seen and any corresponding \fB/dev/zvol\fR entries for datasets that are delegated to the zone is not seen. For example, if the device \fB/dev/zvol/rdsk/rpool/vol1\fR is added as a device resource and the within the non-global zone the volume \fBrpool/vol1\fR is created, the file \fB/dev/zvol/rdsk/rpool/vol1\fR is the device allocated from the global zone, not the one that appears within the non-global zone's aliased dataset namespace.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev\fR\fR
.ad
.RS 8n
.rt  
Mount point for the \fB/dev\fR filesystem in the global zone.
.RE

.SH SEE ALSO
.sp
.LP
\fBdevfsadm\fR(1M), \fBformat\fR(1M), \fBzonecfg\fR(1M)
.SH NOTES
.sp
.LP
The global \fB/dev\fR instance cannot be unmounted.
