Arquivotheca/solaris11/usr/man/man/usr/share/man/man7fs/devfs.7fs
'\" te
.\"  Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.TH devfs 7FS "26 Oct 2004" "SunOS 5.11" "File Systems"
.SH NAME
devfs \- Devices file system
.SH DESCRIPTION
.sp
.LP
The \fBdevfs\fR filesystem manages a name space of all devices under the Solaris operating environment and is mounted during boot on the \fB/devices\fR name space.
.sp
.LP
The \fB/devices\fR name space is dynamic and reflects the current state of accessible devices under the Solaris operating environment. The names of all attached device instances are present under \fB/devices\fR.
.sp
.LP
The content under \fB/devices\fR is under the exclusive control of the \fBdevfs\fR filesystem and cannot be changed.
.sp
.LP
The system may be configured to include a device in one of two ways: 
.br
.in +2
By means of dynamic reconfiguration (DR), using, for example, \fBcfgadm\fR(1M).
.in -2
.br
.in +2
For devices driven by \fBdriver.conf\fR(4) enumeration, edit the \fBdriver.conf\fR file to add a new entry, then use \fBupdate_drv\fR(1M) to cause the system to re-read the \fBdriver.conf\fR file and thereby enumerate the instance.
.in -2
.sp
.LP
The device may be attached through a number of system calls and programs, including \fBopen\fR(2), \fBstat\fR(2) and \fBls\fR(1). During device attach, the device driver typically creates minor nodes corresponding to the device via \fBddi_create_minor_node\fR(9F). If the attach is successful, one or more minor nodes referring to the device are created under \fB/devices\fR. 
.sp
.LP
Operations like \fBmknod\fR(2), \fBmkdir\fR(2) and \fBcreat\fR(2) are not supported in \fB/devices\fR.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/devices\fR
.ad
.RS 12n
.rt  
Mount point for \fBdevfs\fR file system
.RE

.SH SEE ALSO
.sp
.LP
\fBdevfsadm\fR(1M), \fBvfstab\fR(4), \fBattach\fR(9E)
.SH NOTES
.sp
.LP
The \fB/devices\fR name space cannot be unmounted.
.sp
.LP
All content at or below the \fB/devices\fR name space is an implementation artifact and subject to incompatible change or removal without notification.
