Arquivotheca/solaris11/usr/man/man/usr/share/man/man7fs/hsfs.7fs
'\" te
.\" Copyright (c) 2006, 2010, Oracle and/or its affiliates. All rights reserved.
.TH hsfs 7FS "1 Nov 2006" "SunOS 5.11" "File Systems"
.SH NAME
hsfs \- High Sierra & ISO 9660 CD-ROM file system
.SH DESCRIPTION
.sp
.LP
\fBHSFS\fR is a file system type that allows users to access files on High Sierra or  \fBISO\fR 9660 format \fBCD-ROM\fR disks from within the SunOS operating system. Once mounted, a \fBHSFS\fR file system provides standard SunOS read-only file system operations and semantics, meaning that you can read and list files in a directory on a High Sierra or \fBISO\fR 9660 \fBCD-ROM\fR and applications can use standard UNIX system calls on these files and directories.
.sp
.LP
This file system contains support for Rock Ridge, ISO 9660 Version 2 and Joliet extensions. These extensions provide support for file names with a  length of at least 207 bytes, but only Rock Ridge extensions (with the exception of writability and hard links) can provide file system semantics and file types as they are found in UFS. The presence of Rock Ridge, ISO 9660 Version 2  and Joliet is autodetected and the best-suitable available extension is  used by the HSFS driver for file name and attribute lookup.
.sp
.LP
If  your \fB/etc/vfstab\fR file contains a line similar to the following:
.sp
.in +2
.nf
/dev/dsk/c0t6d0s0 \(mi/hsfs hsfs \fB-no\fR ro
.fi
.in -2

.sp
.LP
and \fB/hsfs\fR exists, you can mount an \fBHSFS\fR file system with either of the following commands: 
.sp
.in +2
.nf
mount \fB-F\fR hsfs \fB-o\fR ro \fIdevice-special\fR \fIdirectory-name\fR
.fi
.in -2

.sp
.LP
or 
.sp
.in +2
.nf
mount /hsfs
.fi
.in -2

.sp
.LP
By default, Rock Ridge extensions are used if available, otherwise  ISO 9660 Version 2, then Joliet are used. If neither extension is present HSFS defaults to the standard capabilities of ISO  9660. Since so-called hybrid CD-ROMs that contain multiple extensions are possible,  you can use the following mount options to deliberately disable the  search for a specific extension or to force the use of a specific extension even if a preferable type is present:
.sp
.in +2
.nf
mount \fB-F\fR hsfs \fB-o\fR ro,nrr \fIdevice-special\fR \fIdirectory-name\fR
.fi
.in -2

.sp
.LP
Mount options are:
.sp
.LP
rr\(emrequest HSFS to use Rock Ridge extensions, if present. This is the default  behavior and does not need to be explicitly specified.
.sp
.LP
nrr\(emdisable detection and use of Rock Ridge extensions, even if present.
.sp
.LP
vers2\(emrequest HSFS to use \fIISO 9660\fR Version 2 extensions, even if Rock Ridge is available.
.sp
.LP
novers2\(emdisable detection and use of \fIISO 9660\fR Version 2 extensions.
.sp
.LP
joliet\(emrequest HSFS to use Joliet extensions, even if Rock Ridge or \fIISO 9660\fR Version 2 extensions are available.
.sp
.LP
nojoliet\(emdisable detection and use of Joliet extensions.
.sp
.LP
Files on a High Sierra or \fBISO\fR 9660 \fBCD-ROM\fR disk have names of the form \fIfilename.ext;version\fR, where  \fIfilename\fR and the optional  \fIext\fR consist of a sequence of uppercase alphanumeric characters (including ``_''), while the \fIversion\fR consists of a sequence of digits, representing the version number of  the file. \fBHSFS\fR converts all the uppercase characters in a file name to lowercase, and truncates the ``;'' and version information. If more than one version of a file is present on the  \fBCD-ROM\fR, only the file with the highest version number is accessible.
.sp
.LP
Conversion of uppercase to lowercase characters may be disabled by using the \fB-o\fR \fBnomaplcase\fR option to \fBmount\fR(1M). (See \fBmount_hsfs\fR(1M)).
.sp
.LP
If the  \fBCD-ROM\fR contains Rock Ridge, ISO  9660 version 2 or Joliet extensions, the file names and directory names may contain any character supported under  \fBUFS.\fR The names may also be upper and/or lower case and are case sensitive. File name lengths can be as long as those of  \fBUFS\fR.
.sp
.LP
Files accessed through \fBHSFS\fR have mode 555 (owner, group and world readable and executable),  uid 0 and gid 3. If a directory on the \fBCD-ROM\fR has read permission, \fBHSFS\fR grants execute permission to the directory, allowing it to be searched.
.sp
.LP
With Rock Ridge extensions, files and directories can have any permissions that are supported on a  \fBUFS\fR file system. However, under all write permissions, the file system is read-only, with \fBEROFS\fR returned to any write operations.
.sp
.LP
Like High Sierra and \fBISO\fR 9660 \fBCD-ROMs\fR, HSFS supports only regular files and directories. A Rock Ridge \fBCD-ROM\fR can support regular files, directories, and symbolic links, as well as device nodes, such as block, character, and FIFO.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample Display of File System Files
.sp
.LP
If there is a file \fBBIG.BAR\fR on a High Sierra or \fBISO\fR 9660 format \fBCD-ROM\fR it will show up as \fBbig.bar\fR when listed on a \fBHSFS\fR file system.

.sp
.LP
If there are three files 

.sp
.in +2
.nf
\fBBAR.BAZ;1\fR
.fi
.in -2

.sp
.in +2
.nf
\fBBAR.BAZ;2\fR
.fi
.in -2

.sp
.LP
and 

.sp
.in +2
.nf
\fBBAR.BAZ;3\fR 
.fi
.in -2

.sp
.LP
on a High Sierra or \fBISO\fR 9660 format \fBCD-ROM,\fR only the file \fBBAR.BAZ;3\fR will be accessible. It will be listed as \fBbar.baz\fR.

.SH SEE ALSO
.sp
.LP
\fBmount\fR(1M), \fBmount_hsfs\fR(1M), \fBzonecfg\fR(1M), \fBvfstab\fR(4)
.sp
.LP
N. V. Phillips and Sony Corporation, \fISystem Description Compact Disc Digital Audio\fR, ("Red Book").
.sp
.LP
N. V. Phillips and Sony Corporation, \fISystem Description of Compact Disc Read Only Memory\fR, ("Yellow Book").
.sp
.LP
IR "Volume and File Structure of CD-ROM for Information Interchange", ISO 9660:1988(E).
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBhsfs: Warning: the file system...\fR
.ad
.br
.na
\fBdoes not conform to the ISO-9660 spec\fR
.ad
.sp .6
.RS 4n
The specific reason appears on the following line. You might be attempting to mount a \fBCD-ROM\fR containing a different file system, such as \fBUFS\fR.
.RE

.sp
.ne 2
.mk
.na
\fBhsfs: Warning: the file system...\fR
.ad
.br
.na
\fBcontains a file [with an] unsupported type\fR
.ad
.sp .6
.RS 4n
The \fBhsfs\fR file system does not support the format of some file or directory on the \fBCD-ROM,\fR for example a record structured file.
.RE

.sp
.ne 2
.mk
.na
\fBhsfs: hsnode table full, %d nodes allocated\fR
.ad
.sp .6
.RS 4n
There are not enough \fBHSFS\fR internal data structure elements to handle all the files currently open.  This problem may be overcome by adding a line of the form \fBset hsfs:nhsnode=\fR\fInumber\fR to the \fB/etc/system\fR system configuration file and rebooting.  See \fBsystem\fR(4).
.RE

.SH WARNINGS
.sp
.LP
Do not physically eject a \fBCD-ROM\fR while the device is still mounted as a \fBHSFS\fR file system.
.sp
.LP
Under \fBMS-DOS\fR (for which \fBCD-ROMs\fR are frequently targeted), files with no extension may be represented either as: 
.sp
.in +2
.nf
\fIfilename.\fR
.fi
.in -2

.sp
.LP
or 
.sp
.in +2
.nf
\fIfilename\fR
.fi
.in -2

.sp
.LP
that is, with or without a trailing period. These names are not equivalent under UNIX systems. For example, the names: 
.sp
.in +2
.nf
\fBBAR.\fR
.fi
.in -2

.sp
.LP
and 
.sp
.in +2
.nf
\fBBAR\fR
.fi
.in -2

.sp
.LP
are not names for the same file under the UNIX system. This may cause confusion if you are consulting documentation for \fBCD-ROMs\fR originally intended for \fBMS-DOS\fR systems.
.sp
.LP
Use of the \fB-o\fR \fBnotraildot\fR option to \fBmount\fR(1M) makes it optional to specify the trailing dot. (See \fBmount_hsfs\fR(1M)).
.SH NOTES
.sp
.LP
No translation of any sort is done on the contents of High Sierra or \fBISO\fR 9660 format \fBCD-ROMs\fR; only directory and file names are subject to interpretation by \fBHSFS.\fR
.sp
.LP
By default, zones can mount this file system.
