Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/man7d/dr.7d
'\" te
.\"  Copyright (c) 2001 Sun Microsystems, Inc.  All Rights Reserved
.TH dr 7d "29 Sep 2003" "SunOS 5.11" "Devices"
.SH NAME
dr, drmach, ngdr, ngdrmach \- Sun Enterprise 10000  dynamic reconfiguration driver
.SH SYNOPSIS
.LP
.nf
\fBdr\fR 
.fi

.LP
.nf
\fBdrmach\fR 
.fi

.LP
.nf
\fBngdr\fR 
.fi

.LP
.nf
\fBngdrmach\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The dynamic reconfiguration (DR) driver consists of a platform-independent driver and a platform-specific module. The DR driver uses standard features of the Solaris operating environment whenever possible to control DR operations and calls the platform specific module as needed. The DR driver creates minor nodes in the file system that serve as attachment points for DR operations.
.sp
.LP
The DR driver provides a pseudo-driver interface to sequence attach and detach operations on system boards using file system entry points referred to as "attachment points." The attachment point form depends on the platform.
.SS "Sun Enterprise 10000 Server"
.sp
.LP
On the Sun Enterprise 10000 server, the DR driver consists of a platform-independent driver (\fBngdr\fR) and a platform-specific module (\fBngdrmach\fR).
.sp
.LP
The domain configuration server (DCS) accepts DR requests from the system services processor (SSP) and uses the \fBlibcfgadm\fR(3LIB) interface to initiate the DR operation. After the operation is performed, the results are returned to the SSP. For more information about the DCS on the Sun Enterprise 10000, refer to the \fBdcs\fR(1M) man page and the \fISun Enterprise 10000 Dynamic Reconfiguration User Guide\fR.
.sp
.LP
The DR driver creates physical attachment points for system board slots that takes the following form:
.sp
.in +2
.nf
/devices/pseudo/ngdr@0:SB\fIx\fR
.fi
.in -2

.sp
.LP
Where \fIx\fR represents the slot number (0 to 15) for a particular board.
.sp
.LP
The \fBcfgadm_sbd\fR(1M) plugin creates dynamic attachment points that refer to components on system boards, including CPUs, memory, or I/O devices. Refer to the \fBcfgadm_sbd\fR(1M) man page for more details.
.SH SEE ALSO
.sp
.LP
\fBcfgadm_sbd\fR(1M), \fBioctl\fR(2), \fBlibcfgadm(3LIB)\fR
.sp
.LP
\fISun Enterprise 10000 Dynamic Reconfiguration User Guide\fR
