Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/man7d/ifp.7d
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.TH ifp 7D "22 Jul 1998" "SunOS 5.11" "Devices"
.SH NAME
ifp \- ISP2100 Family Fibre Channel Host Bus Adapter Driver
.SH SYNOPSIS
.LP
.nf
PCI   SUNW,ifp@pci-slot
.fi

.SH DESCRIPTION
.sp
.LP
The \fBifp\fR Host Bus Adapter is a \fBSCSA\fR compliant nexus driver for the Qlogic ISP2100/ISP2100A chips. These chips support Fibre Channel Protocol for \fBSCSI\fR on Private Fibre Channel Arbitrated loops.       
.sp
.LP
The \fBifp\fR driver interfaces with \fBSCSI\fR disk target driver, \fBssd\fR(7D), and the \fBSCSI\fR-3 Enclosure Services driver, \fBssd\fR(7D). Only \fBSCSI\fR devices of type \fBdisk\fR and \fBses\fR are supported at present time.       
.sp
.LP
The \fBifp\fR driver supports the standard functions provided by the \fBSCSA\fR interface. It supports auto request sense (cannot be turned off) and tagged queueing by default. The driver requires that all devices have unique hard addresses defined by switch settings in hardware. Devices with conflicting hard addresses will not be accessible. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ifp\fR\fR
.ad
.RS 27n
.rt  
ELF Kernel Module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ifp\fR\fR
.ad
.RS 27n
.rt  
ELF Kernel Module (64-bit version)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ifp.conf\fR\fR
.ad
.RS 27n
.rt  
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE  TYPEATTRIBUTE	VALUE
_
AvailabilitySPARC
.TE

.SH SEE ALSO
.sp
.LP
\fBluxadm\fR(1M),\fBprtconf\fR(1M),\fBdriver.conf\fR(4),\fBattributes\fR(5),\fBses\fR(7D),\fBssd\fR(7D) 
.sp
.LP
\fIWriting Device Drivers\fR,
.sp
.LP
\fIANSI X3.272-1996, Fibre Channel Arbitrated Loop (FC-AL)\fR,
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)\fR,
.sp
.LP
\fIANSI X3.270-1996, SCSI-3 Architecture Model (SAM)\fR,
.sp
.LP
\fIFibre Channel Private Loop SCSI Direct Attach (FC-PLDA)\fR,
.sp
.LP
\fIISP2100 Firmware Interface Specification, QLogic Corporation\fR
.SH DIAGNOSTICS
.sp
.LP
The messages described below are some that may appear on the system console, as well as being logged.      
.sp
.LP
 This first set of messages may be displayed while the ifp driver is initially trying to attach.  All of these messages mean that the ifp driver was unable to attach. These  messages are preceded by "\fBifp\fR\fI<number>\fR", where "\fI<number>\fR" is the instance number of the ISP2100 Host Bus Adapter.
.sp
.ne 2
.mk
.na
\fBDevice is using a hilevel intr, unused\fR
.ad
.sp .6
.RS 4n
The device was configured with an interrupt level that cannot be used with this ifp driver.  Check the device.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to alloc soft state\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the internal state structure. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBBad soft state\fR
.ad
.sp .6
.RS 4n
Driver requested an invalid internal state structure.           Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBUnable to map pci config registers\fR
.ad
.br
.na
\fBUnable to map biu registers\fR
.ad
.sp .6
.RS 4n
Driver was unable to map device registers; check for bad hardware. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot alloc tran\fR
.ad
.sp .6
.RS 4n
Driver was unable to obtain a transport handle to be able to communicate with \fBSCSA\fR framework. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.  
.RE

.sp
.ne 2
.mk
.na
\fBddi_create_minor_node failed\fR
.ad
.sp .6
.RS 4n
Driver was unable to create \fBdevctl\fR minor node that is used by \fBluxadm\fR(1M) for administering the loop. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible. 
.RE

.sp
.ne 2
.mk
.na
\fBCannot alloc dma handle\fR
.ad
.sp .6
.RS 4n
Driver was unable allocate a \fBdma\fR handle for communicating with the Host Bus Adapter. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot alloc cmd area\fR
.ad
.sp .6
.RS 4n
 Driver was unable allocate \fBdma\fR memory for request and response queues. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot bind cmd area\fR
.ad
.sp .6
.RS 4n
Driver was unable to bind \fBdma\fR handle to the \fBcmd\fR area. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.  
.RE

.sp
.ne 2
.mk
.na
\fBCannot alloc fcal handle\fR
.ad
.sp .6
.RS 4n
Driver was unable allocate a \fBdma\fR handle for retrieving loop map from the Host Bus Adapter. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot bind portdb\fR
.ad
.sp .6
.RS 4n
Driver was unable to bind \fBfcal\fR port handle to the memory used for obtaining port database. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBscsi_hba_attach failed\fR
.ad
.sp .6
.RS 4n
Driver was unable to attach to the \fBSCSA\fR framework. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible. 
.RE

.sp
.ne 2
.mk
.na
\fBUnable to create hotplug thread\fR
.ad
.sp .6
.RS 4n
Driver was not able to create the kernel thread used for hotplug support. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot add intr\fR
.ad
.sp .6
.RS 4n
Driver was not able to add the interrupt routine to the           kernel. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBUnable to attach\fR
.ad
.sp .6
.RS 4n
Driver was unable to attach to the  hardware for some           reason that may be printed. Driver did not attach to device; \fBSCSI\fR devices will be inaccessible.  
.RE

.sp
.LP
The following set of messages may be display at any time. They will be printed with the full device pathname followed by the shorter form described above. 
.sp
.ne 2
.mk
.na
\fBFirmware checksum incorrect\fR
.ad
.sp .6
.RS 4n
Firmware has an invalid checksum and will not be downloaded.
.RE

.sp
.ne 2
.mk
.na
\fBChip reset timeout\fR
.ad
.sp .6
.RS 4n
\fBISP\fR chip failed to reset in the time allocated; may  be bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fBStop firmware failed\fR
.ad
.sp .6
.RS 4n
Stopping the firmware failed; may be bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fBLoad ram failed\fR
.ad
.sp .6
.RS 4n
Unable to download new firmware into the \fBISP\fR chip.
.RE

.sp
.ne 2
.mk
.na
\fBDMA setup failed\fR
.ad
.sp .6
.RS 4n
The \fBDMA\fR setup failed in the host adapter driver on a \fBscsi_pkt\fR. This will return \fBTRAN_BADPKT\fR to a \fBSCSA\fR target driver.
.RE

.sp
.ne 2
.mk
.na
\fBBad request pkt type\fR
.ad
.br
.na
\fBBad request pkt\fR
.ad
.br
.na
\fBBad request pkt hdr\fR
.ad
.br
.na
\fBBad req pkt order\fR
.ad
.sp .6
.RS 4n
The \fBISP\fR Firmware rejected the packet as being set up incorrectly. This will cause the ifp driver to call the target completion routine with the reason of \fBCMD_TRAN_ERR\fR set in the \fBscsi_pkt\fR. Check the target driver for correctly setting up the packet.  
.RE

.sp
.ne 2
.mk
.na
\fBFirmware error\fR
.ad
.sp .6
.RS 4n
The \fBISP\fR chip encountered a firmware error of some kind. This error will cause the ifp driver to do error recovery by resetting the chip.  
.RE

.sp
.ne 2
.mk
.na
\fBDMA Failure (event)\fR
.ad
.sp .6
.RS 4n
The \fBISP\fR chip encountered a \fBDMA\fR error while reading from the request queue (event is 8003) or writing to the response queue (event is 8004). This error will cause the ifp driver to do error recovery by resetting the chip.
.RE

.sp
.ne 2
.mk
.na
\fBFatal error, resetting interface\fR
.ad
.sp .6
.RS 4n
This is an indication that the \fBifp\fR driver  is  doing error recovery. This will cause all outstanding commands that have been transported to the \fBifp\fR driver to be completed via the \fBscsi_pkt\fR completion routine in the target driver with reason of \fBCMD_RESET\fR and status of \fBSTAT_BUS_RESET\fR set in the \fBscsi_pkt\fR.
.RE

.sp
.ne 2
.mk
.na
\fBtarget t, duplicate port wwns\fR
.ad
.sp .6
.RS 4n
The driver detected target \fIt\fR to be having the same port \fBWWN\fR as a different target; this is not supposed to happen. Target \fIt\fR will become inaccessible. 
.RE

.sp
.ne 2
.mk
.na
\fBtarget t, duplicate switch settings\fR
.ad
.sp .6
.RS 4n
The driver detected devices with the same switch setting \fIt\fR. All such devices will become inaccessible.  
.RE

.sp
.ne 2
.mk
.na
\fBWWN changed on target t\fR
.ad
.sp .6
.RS 4n
The World Wide Name (\fBWWN\fR) has changed on the device with switch setting \fIt\fR.
.RE

.sp
.ne 2
.mk
.na
\fBtarget t, unknown device type dt\fR
.ad
.sp .6
.RS 4n
The driver does not know the device type \fIdt\fR reported by the device with switch setting \fIt\fR. 
.RE

