Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/ad.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH ad 5 "2008 年 10 月 22 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
ad \- ネーミングリポジトリとしての Active Directory
.SH 機能説明
.sp
.LP
Solaris クライアントは、Active Directory (AD) サーバーからネーミング情報を取得できます。 
.sp
.LP
最初に Solaris システムを AD ドメインに参加させ、次に \fBad\fR キーワードを \fBnsswitch.conf\fR(4) ファイルの適切なエントリに追加する必要があります。Solaris システムを AD ドメインに参加させるには、\fBkclient\fR(1M) ユーティリティーを使用します。AD ネームサービスは、\fBpasswd\fR および \fBgroup\fR に対するネーミングデータベースをサポートしています。
.sp
.LP
Windows ユーザーはログインできません。\fBuser_attr\fR(4) データベースには Windows ユーザーのエントリがなく、\fBpasswd\fR(1) コマンドは、AD とのユーザーパスワードの同期をサポートしていません。
.sp
.LP
Solaris AD クライアントは、自動検出テクノロジを使用して、ドメインコントローラやグローバルカタログサーバーなどの AD ディレクトリサーバーを見つけます。クライアントはまた、LDAP v3 プロトコルを使用して、AD サーバーのネーミング情報にアクセスします。AD サーバー方式は、AD クライアントがネイティブな AD 方式で動作しているので、変更を必要としません。Solaris AD クライアントは、\fBidmap\fR(1M) サービスを使用して、Windows セキュリティー識別子 (SID) と Solaris ユーザー識別子 (UID) およびグループ識別子 (GID) とを対応付けます。ユーザー名とグループ名は、AD ユーザーおよびグループオブジェクトの \fBsAMAccountName\fR 属性から取得され、オブジェクトが存在するドメインでタグ付けされます。ドメイン名は、\fB@\fR 文字でユーザー名またはグループ名から切り離されます。 
.sp
.LP
クライアントは SASL/GSSAPI/KRB5 セキュリティーモデルを使用します。クライアントを AD に参加させるには、\fBkclient\fR ユーティリティーが使用されます。参加操作中、\fBkclient\fR はクライアント上で Kerberos v5 を構成します。\fBkclient\fR(1M) を参照してください。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 24n
.rt  
ネームサービススイッチの構成ファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.ad\fR\fR
.ad
.RS 24n
.rt  
ad、dns、および files で構成されたネームサービススイッチのサンプル構成ファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/nss_ad.so.1\fR\fR
.ad
.RS 24n
.rt  
AD 用のネームサービススイッチモジュール。
.RE

.SH 関連項目
.sp
.LP
\fBpasswd\fR(1), \fBsvcs\fR(1), \fBidmap\fR(1M), \fBidmapd\fR(1M), \fBkclient\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvccfg\fR(1M), \fBnsswitch.conf\fR(4), \fBuser_attr\fR(4), \fBsmf\fR(5)
