Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/brands.5
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH brands 5 "2011 年 7 月 8 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
brands \- 非大域ゾーンのオペレーティング環境の切り替え
.SH 機能説明
.sp
.LP
ブランドゾーン (BrandZ) フレームワークは、\fBzones\fR(5) で説明されている Solaris ゾーンインフラストラクチャーを拡張して、ブランドの作成機能を追加します。ブランドは、ネイティブでないオペレーティング環境を含む非大域ゾーンを提供します。
.sp
.LP
「ブランド」という用語は、さまざまなオペレーティング環境を指す場合があります。すべてのブランド管理は、現在のゾーン構造の拡張を通して実行されます。
.sp
.LP
すべてのゾーンに、それぞれ関連するブランドが構成されます。ブランドタイプにより、ゾーンのインストール時および起動時に実行されるスクリプトが決定されます。また、ゾーンのブランドにより、アプリケーションの起動時に正しいアプリケーションタイプが適切に識別されます。デフォルトのブランドは、大域ゾーンにインストールされているディストリビューションによって決まります。
.sp
.LP
ブランドゾーンは、ネイティブでないバイナリのブランドを 1 つだけサポートします。つまり、1 つのブランドゾーンは 1 つのオペレーティング環境を提供します。ゾーンにブランドを割り当てたあとは、そのブランドの変更や削除を行うことはできません。
.sp
.LP
BrandZ はゾーンのツールを次のように拡張します。
.RS +4
.TP
.ie t \(bu
.el o
ブランドはゾーンの属性であり、ゾーンの作成時に設定されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
zonecfg ツール (\fBzonecfg\fR(1M) を参照) を使用して、ゾーンのブランドタイプの設定とゾーンの構成を行います。
.RE
.RS +4
.TP
.ie t \(bu
.el o
zoneadm ツール (\fBzoneadm\fR(1M) を参照) を使用して、ゾーンのブランドタイプの報告とゾーンの管理を行います。
.RE
.SS "デバイスのサポート"
.sp
.LP
各ゾーンでサポートされるデバイスについては、そのブランドに関するマニュアルページやほかのドキュメントに記載されています。サポートされていないデバイスを追加しようとすると、ゾーンインフラストラクチャーで検出され、管理者に警告が発行されます。管理者が警告にもかかわらず、サポートされていないデバイスを追加した場合、そのデバイスが期待どおりに機能するかどうかは不明です。その構成はテストもサポートもされません。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/zones
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBmdb\fR(1), \fBzlogin\fR(1), \fBzonename\fR(1), \fBdtrace\fR(1M), \fBin.rlogind\fR(1M), \fBsshd\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBkill\fR(2), \fBpriocntl\fR(2), \fBgetzoneid\fR(3C), \fBucred_get\fR(3C), \fBgetzoneid\fR(3C), \fBproc\fR(4), \fBattributes\fR(5), \fBsolaris\fR(5), \fBprivileges\fR(5), \fBsolaris10\fR(5), \fBzones\fR(5), \fBcrgetzoneid\fR(9F)
