Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/grub.5
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH grub 5 "2011 年 4 月 6 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
grub \- GRUB (GRand Unified Bootloader) ソフトウェア (Solaris 版)
.SH 機能説明
.sp
.LP
Solaris オペレーティングシステムの現行リリースには、GRUB (GRand Unified Bootloader) ソフトウェアが付属しています。GRUB は、Free Software Foundation によって開発およびサポートされています。
.sp
.LP
\fBwww.gnu.org\fR からアクセス可能な GRUB マニュアルの「Overview」では、GRUB を次のように説明しています。
.sp
.LP
Briefly, a boot loader is the first software program that runs when a computer starts. It is responsible for loading and transferring control to an operating system kernel software (such as Linux or GNU Mach). The kernel, in turn, initializes the rest of the operating system (for example, a GNU [Ed. note: or Solaris] system).
.sp
.LP
GNU GRUB is a very powerful boot loader that can load a wide variety of free, as well as proprietary, operating systems, by means of chain-loading. GRUB is designed to address the complexity of booting a personal computer; both the program and this manual are tightly bound to that computer platform, although porting to other platforms may be addressed in the future. [Ed. note: Sun has ported GRUB to the Solaris operating system.]
.sp
.LP
One of the important features in GRUB is flexibility; GRUB understands filesystems and kernel executable formats, so you can load an arbitrary operating system the way you like, without recording the physical position of your kernel on the disk. Thus you can load the kernel just by specifying its file name and the drive and partition where the kernel resides.
.sp
.LP
GRUB がサポートされるのは、Solaris マシンのうち、x86 プラットフォームのみです。Solaris に付属する GRUB ソフトウェアには、オープンソースディストリビューションには含まれていない、次の 2 つのユーティリティーが追加されています。
.sp
.ne 2
.mk
.na
\fB\fBbootadm\fR(1M)\fR
.ad
.RS 19n
.rt  
ブートアーカイブの管理と GRUB メニューの変更を可能にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstallgrub\fR(1M)\fR
.ad
.RS 19n
.rt  
ディスクからブートプログラムをロードします。
.RE

.sp
.LP
これらのユーティリティーはどちらも、Solaris のマニュアルページで説明されています。
.sp
.LP
これら 2 つの Solaris 固有ユーティリティー以外の GRUB ソフトウェアについては、GRUB マニュアル内で説明されています。その PDF 版は Sun の Web サイトから入手可能となっています。また、\fBgrub(8)\fR オープンソースマニュアルページも、同じ場所から入手可能となっています。このマニュアルページは GRUB シェルについて説明しています。
.SH 関連項目
.sp
.LP
\fBboot\fR(1M), \fBbootadm\fR(1M), \fBinstallgrub\fR(1M)
.sp
.LP
\fI『Installing Oracle Solaris 11 Systems』\fR
.sp
.LP
\fI『Oracle Solaris Administration: Common Tasks』\fR
.sp
.LP
http://www.gnu.org/software/grub
