Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/Intro.5
'\" te
.\" Copyright 1989 AT&T 
.\" Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
.TH Intro 5 "2008 年 11 月 17 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
Intro, intro \- その他の序章
.SH 機能説明
.sp
.LP
このセクションでは、次の項目について説明します。
.sp
.ne 2
.mk
.na
\fB標準\fR
.ad
.RS 13n
.rt  
POSIX (IEEE) 標準と X/Open 仕様について \fBstandards\fR で 記述します。 
.RE

.sp
.ne 2
.mk
.na
\fB環境\fR
.ad
.RS 13n
.rt  
ユーザー環境 (\fBenviron\fR)、言語や文化規約によるユーザー環境のサブセット (\fBlocale\fR)、大規模ファイルのコンパイル環境 (\fBlfcompile\fR)、変換のコンパイル環境 (\fBlfcompile64\fR) について記述します。
.RE

.sp
.ne 2
.mk
.na
\fBマクロ\fR
.ad
.RS 13n
.rt  
リファレンスマニュアルのページ (\fBman\fR と \fBmansun\fR) を書式化するマクロ、およびその他のテキストを書式化するマクロ (\fBme\fR、\fBmm\fR、\fBms\fR) について記述します。
.RE

.sp
.ne 2
.mk
.na
\fB文字\fR
.ad
.RS 13n
.rt  
文字セット (\fBascii\fR、\fBcharmap\fR、\fBeqnchar\fR、\fBiconv\fR) のテーブル、ファイルの書式化設定 (\fBformats\fR)、ファイル名のパターンマッチング (\fBfnmatch\fR)、正規表現 (\fBregex\fR と \fBregexp\fR) について記述します。
.RE

.SH 謝辞
.sp
.LP
Oracle America, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/\&.
.sp
.LP
The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.
.sp
.LP
In the following statement, the phrase ``this text'' refers to portions of the system documentation.
.sp
.LP
Portions of this text are reprinted and reproduced in electronic form in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html\&.
.sp
.LP
This notice shall appear on any product containing this material. 
