Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/isalist.5
'\" te
.\"  Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved.
.TH isalist 5 "2008 年 3 月 20 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
isalist \- Solaris ソフトウェアに認識されるネイティブな命令セット
.SH 機能説明
.sp
.LP
\fBisalist\fR(1) によって、および \fBsysinfo\fR(2) の \fBSI_ISALIST\fR コマンドによって返される可能性のある命令セットの名前を、ここに一覧表示します。
.sp
.LP
このリストでは、命令セットファミリ別に、おおむね後ろに行くほど高速になるように名前が並んでいます。\fBisalist\fR(1) および \fBsysinfo\fR(2) の表示とは逆の順序です。次の値リストでは、通し番号はおおむねパフォーマンスの向上を表し、アルファベットの付いた項目は、相互排他的関係にあるか順序付け不可能なものです。
.sp
.LP
この機能は廃止されており、Solaris の将来のバージョンでは削除されることがあります。次のリストは、最近のプロセッサに追加されているすべての拡張機能を反映しているわけではありません。命令セット拡張機能のより適切な処理方法については、\fBgetisax\fR(2) を参照してください。
.SS "SPARC プラットフォーム"
.sp
.LP
適切と思われる箇所では、Sun の C 4.0 コンパイラの \fB-xarch\fR オプションの指定した値と対応する値が示されます。ほかのコンパイラにも同様のオプションがあります。
.sp
.ne 2
.mk
.na
\fB1a. \fBsparc\fR\fR
.ad
.RS 27n
.rt  
『SPARC Architecture Manual, Version 8』(Prentice-Hall, Inc. 発行、1992 年) で定義された SPARC V8 命令セットを示します。\fI\fR特定のシステムでは、一部の命令 (整数の乗除、FSMULD および quad オペランドでのすべての浮動小数点演算) がカーネルによりエミュレートされます。
.RE

.sp
.ne 2
.mk
.na
\fB1b. \fBsparcv7\fR\fR
.ad
.RS 27n
.rt  
sparc の場合と同じです。これは、Sun の C 4.0 コンパイラの -xarch=v7 オプションで生成されるコードに対応します。
.RE

.sp
.ne 2
.mk
.na
\fB2. \fBsparcv8-fsmuld\fR\fR
.ad
.RS 27n
.rt  
sparc と同様ですが、整数の乗除がハードウェアで実行される必要がある点が異なります。これは、Sun の C 4.0 コンパイラの -xarch=v8a オプションで生成されるコードに対応します。
.RE

.sp
.ne 2
.mk
.na
\fB3. \fBsparcv8\fR\fR
.ad
.RS 27n
.rt  
sparcv8-fsmuld と同様ですが、FSMULD がハードウェアで実行される必要がある点が異なります。これは、Sun の C 4.0 コンパイラの -xarch=v8 オプションで生成されるコードに対応します。
.RE

.sp
.ne 2
.mk
.na
\fB4. \fBsparcv8plus\fR\fR
.ad
.RS 27n
.rt  
SPARC V8 命令セットに加え、『The SPARC Architecture Manual, Version 9』(Prentice-Hall, Inc. 発行、1994 年) で定義されている SPARC V9 命令セット内の命令 (『The V8+ Technical Specification』に従って使用可能) も示します。\fI\fR\fI\fRこれは、Sun の C 4.0 コンパイラの -xarch=v8plus オプションで生成されるコードに対応します。
.RE

.sp
.ne 2
.mk
.na
\fB5a. \fBsparcv8plus+vis\fR\fR
.ad
.RS 27n
.rt  
sparcv8plus と同様ですが、さらに『The V8+ Technical Specification』に従って使用可能な UltraSPARC I 視覚化命令 (VIS) が加わります。\fI\fRこれは、Sun の C 4.0 コンパイラの -xarch=v8plusa オプションで生成されるコードに対応します。
.RE

.sp
.ne 2
.mk
.na
\fB5b. \fBsparcv8plus+fmuladd\fR\fR
.ad
.RS 27n
.rt  
sparcv8plus と同様ですが、さらに富士通 SPARC64 の Floating Multiply-Add 命令および Multiply-Subtract 命令が加わります。
.RE

.sp
.ne 2
.mk
.na
\fB6. \fBsparcv9\fR\fR
.ad
.RS 27n
.rt  
『SPARC Architecture Manual, Version 9』(Prentice-Hall, Inc. 発行、1994 年) で定義された SPARC V9 命令セットを示します。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB7a. \fBsparcv9+vis\fR\fR
.ad
.RS 27n
.rt  
sparcv9 と同様ですが、さらに UltraSPARC I 視覚化命令 (VIS) が加わります。
.RE

.sp
.ne 2
.mk
.na
\fB7b. \fBsparcv9+vis2\fR\fR
.ad
.RS 27n
.rt  
sparcv9 と同様ですが、さらに UltraSPARC III 視覚化命令 (VIS) が加わります。
.RE

.sp
.ne 2
.mk
.na
\fB7c. \fBsparcv9+fmuladd\fR\fR
.ad
.RS 27n
.rt  
sparcv9 と同様ですが、さらに富士通 SPARC64 の Floating Multiply-Add 命令および Multiply-Subtract 命令が加わります。
.RE

.SS "x86 プラットフォーム"
.sp
.ne 2
.mk
.na
\fB1. \fBi386\fR\fR
.ad
.RS 22n
.rt  
『The i386 Microprocessor Programmer's Reference Manual』で説明されている Intel 80386 命令セット。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB2. \fBi486\fR\fR
.ad
.RS 22n
.rt  
『The i486 Microprocessor Programmer's Reference Manual』で説明されている Intel 80486 命令セット。\fI\fR(これは、事実上 i386 に加え、CMPXCHG、BSWAP、および XADD 命令。)
.RE

.sp
.ne 2
.mk
.na
\fB3. \fBpentium\fR\fR
.ad
.RS 22n
.rt  
『The Pentium Processor User's Manual』で説明されている Intel Pentium の命令セット。\fI\fR(これは、事実上 i486 に加え、CPU_ID 命令および CPU_ID 命令が提示する機能すべてが存在。)
.RE

.sp
.ne 2
.mk
.na
\fB4. \fBpentium+mmx\fR\fR
.ad
.RS 22n
.rt  
pentium と同様ですが、MMX 命令の存在が保証されています。
.RE

.sp
.ne 2
.mk
.na
\fB5. \fBpentium_pro\fR\fR
.ad
.RS 22n
.rt  
『The PentiumPro Family Developer's Manual』で説明されている Intel PentiumPro の命令セット。\fI\fR(これは、事実上 pentium に加え、CMOVcc、FCMOVcc、FCOMI、および RDPMC 命令の存在が保証されています。)
.RE

.sp
.ne 2
.mk
.na
\fB6. \fBpentium_pro+mmx\fR\fR
.ad
.RS 22n
.rt  
pentium_pro と同様ですが、MMX 命令の存在が保証されています。
.RE

.sp
.ne 2
.mk
.na
\fB7. \fBamd64\fR\fR
.ad
.RS 22n
.rt  
『\fIAMD64 Architecture Programmer's Manual\fR』で説明されている AMD Opteron 命令セット。
.RE

.SH 関連項目
.sp
.LP
\fBisalist\fR(1), \fBgetisax\fR(2), \fBsysinfo\fR(2) 
