Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/pam_tsol_account.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH pam_tsol_account 5 "2007 年 7 月 20 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
pam_tsol_account \- Trusted Extensions 用 PAM アカウント管理モジュール
.SH 形式
.LP
.nf
\fB/usr/lib/security/pam_tsol_account.so.1\fR
.fi

.SH 機能説明
.sp
.LP
\fBPAM\fR 用の Solaris Trusted Extensions サービスモジュール \fB/usr/lib/security/pam_tsol_account.so.1\fR は、ラベルに関連したアカウント制限を検査します。\fBpam_tsol_account.so.1\fR モジュールは、必要な機能をオンデマンドで提供する、動的にロード可能な共有オブジェクトです。パスは、\fBPAM\fR 構成ファイルで指定されます。
.sp
.LP
\fBpam_tsol_account.so.1\fR には、アカウント管理を実行するための関数 \fBpam_sm_acct_mgmt()\fR が含まれます。この関数は、ユーザーに許可されるラベル範囲を検査します。許可されるラベル範囲のデフォルトは、\fBlabel_encodings\fR(4) ファイル内に設定されています。これらのデフォルトは、\fBuser_attr\fR(4) データベース内のエントリで上書きできます。
.sp
.LP
デフォルトでは、このモジュールは、大域ゾーンに接続する遠隔ホストが CIPSO ホストタイプであることが必要です。このポリシーを無効にするには、次に示すように、\fBpam.conf\fR(4) のエントリのオプションとして \fBallow_unlabeled\fR キーワードを追加します。
.sp
.in +2
.nf
other  account required    pam_tsol_account allow_unlabeled
.fi
.in -2
.sp

.SH オプション
.sp
.LP
このモジュールに渡すことができるオプションを、次に示します。
.sp
.ne 2
.mk
.na
\fB\fBallow_unlabeled\fR\fR
.ad
.RS 19n
.rt  
ラベル付けされていないテンプレートタイプのホストからのリモート接続を許可します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 19n
.rt  
デバッグ情報を \fBLOG_DEBUG\fR レベルで提供します。\fBsyslog\fR(3C) を参照してください。
.RE

.SH 戻り値
.sp
.LP
次の値が返されます。
.sp
.ne 2
.mk
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 19n
.rt  
アカウントは、今回およびこのラベルでの使用で有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_PERM_DENIED\fR\fR
.ad
.RS 19n
.rt  
現在のプロセスラベルがユーザーのラベル範囲外にある、プロセスのラベル情報を使用できない、遠隔ホストタイプが無効である、のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fBOther values\fR
.ad
.RS 19n
.rt  
通常の PAM 操作と一致するエラーコードを返します。エラー関連の戻り値の詳細は、\fBpam\fR(3PAM) のマニュアルページを参照してください。
.RE

.SH 属性
.sp
.LP
次の属性については、 \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
インタフェースの安定性確実
_
MT レベル例外付きで MT-安全
.TE

.sp
.LP
\fBlibpam\fR(3LIB) のインタフェースは、マルチスレッドアプリケーション内部の各スレッドが独自の PAM ハンドルを使用する場合にのみ、「MT- 安全」です。
.SH 関連項目
.sp
.LP
\fBkeylogin\fR(1), \fBlibpam\fR(3LIB), \fBpam\fR(3PAM), \fBpam_sm_acct_mgmt\fR(3PAM), \fBpam_start\fR(3PAM), \fBsyslog\fR(3C), \fBlabel_encodings\fR(4), \fBpam.conf\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
.sp
.LP
Chapter 15, \fI「Using PAM,」\fR in \fI『Oracle Solaris Administration: Security Services』\fR
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
