Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/solaris10.5
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH solaris10 5 "2011 年 7 月 25 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
solaris10 \- Solaris 10 ブランドゾーン
.SH 機能説明
.sp
.LP
\fBsolaris10\fR ブランドは、\fBbrands\fR(5) で説明されているブランドゾーンフレームワークを使用して、Solaris 10 バイナリアプリケーションを変更することなく、最新の Solaris オペレーティングシステムカーネルを備えたマシンで実行できるようにします。
.sp
.LP
\fBsolaris10\fR ブランドでは、ゾーン内での Solaris 10 10/09 (Solaris 10 Update 8) リリース以降の実行のみをサポートしています。
.sp
.LP
\fBsolaris10\fR ブランドには、Solaris 10 システムイメージを非大域ゾーンにインストールするために必要なツールが含まれています。Solaris 10 ネイティブゾーンを \fBsolaris10\fR ブランドゾーンに移行するために必要なツールもサポートされています。このブランドでは、最新の Solaris オペレーティングシステムが稼働している SPARC または x86 マシンのいずれかでの、32 ビットおよび 64 ビットの Solaris 10 アプリケーションの実行をサポートしています。
.SS "構成と管理"
.sp
.LP
\fBsolaris10\fR ブランドは完全ルート非大域ゾーンモデルをサポートします。Solaris 10 ソフトウェアの必須パッケージおよび追加パッケージのすべてが、ゾーン固有のファイルシステムにインストールされます。 
.sp
.LP
ゾーンは固有の \fBzfs\fR(1M) データセット上に構築される必要があり、ZFS だけがサポートされています。ZFS データセットは、ゾーンのインストール時または接続時に自動的に作成されます。ZFS データセットを作成できない場合、ゾーンのインストールや接続は行われません。 
.sp
.LP
\fBzonecfg\fR(1M) ユーティリティーは、\fBsolaris10\fR ブランドゾーンを構成するために使用されます。ゾーンの作成時に \fBSUNWsolaris10 \fR テンプレートを使用することも、構成を手動で設定することもできます。ブランドゾーンのインストールが完了したあとは、そのゾーンのブランドの変更や削除を行うことはできません。\fBzoneadm\fR(1M) ユーティリティーは、ゾーンのブランドタイプの報告およびゾーンの管理に使用されます。\fBzlogin\fR(1) ユーティリティーは、ゾーンにログインするために使用されます。
.sp
.LP
現在、委任された ZFS データセット構成のサポートは実験的なもので、まだテストされていません。準仮想化された xVM ドメインでこれらのゾーンを実行するためのサポートは実験的なもので、ゾーン内の 64 ビット x86 アプリケーションで問題が見つかっています。\fB/dev/sound\fR デバイスをブランドゾーン内に構成することはできません。また、大域ゾーンで \fBmdb\fR(1) と \fBdtrace\fR(1M) を使用して \fBsolaris10\fR ブランドゾーン内で実行されているプロセスを検査する場合、これらは完全には機能しません。
.sp
.LP
\fBsolaris10\fR ブランドのインストーラでは、インストール済み Solaris 10 システムのイメージからのゾーンのインストールをサポートしています。これには、完全な \fBflash_archive\fR(4)、\fBcpio\fR(1)、または \fBpax\fR(1) \fBxustar\fR アーカイブを使用できます。\fBcpio\fR アーカイブは \fBgzip(1)\fR または \fBbzip2(1)\fR で圧縮することもできます。このイメージとしては、レベル 0 \fBufsdump\fR(1M)、または Solaris 10 システムのルートディレクトリツリーの最上位パスも使用できます。標準の Solaris 10 配布メディアからゾーンをインストールすることはできません。 
.sp
.LP
ネイティブゾーンを Solaris 10 システムから最新の Solaris オペレーティングシステムカーネルに移行するするために、attach サブコマンドでは、インストール済み Solaris 10 ネイティブゾーンのアーカイブからのゾーンのインストールをサポートしています。インストーラの場合と同様に、\fBzonepath\fR の \fBcpio\fR(1) または \fBpax\fR(1) \fBxustar\fR アーカイブを使用できます。\fBcpio\fR アーカイブは \fBgzip(1)\fR または \fBbzip2(1)\fR で圧縮することもできます。このイメージとしては、Solaris 10 ゾーンの \fBzonepath\fR ディレクトリツリーの最上位パスもイメージとして使用できます。Solaris 10 ネイティブゾーンからの移行に加え、同じ移行オプションを使用して \fBsolaris10\fR ブランドゾーンをあるホストから別のホストに移行することもできます。Solaris 10 を移行するときに、ゾーンが「疎ルート」ゾーンとして構成されている場合があります。\fB\fRこの場合、アーカイブを作成する前に、ホスト上でゾーンを準備するようにしてください。これにより、継承されたディレクトリがアーカイブに含まれることが保証されます。
.SH サブコマンド
.sp
.LP
サポートされている \fBzoneadm\fR(1M) ブランド固有サブコマンドの引数は次のとおりです。 
.sp
.ne 2
.mk
.na
\fB\fBattach\fR [\fB-a\fR \fIarchive\fR | \fB-d\fR \fIpath\fR] [\fB-c\fR \fIsysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
指定された Solaris 10 ネイティブゾーンイメージをブランドゾーンに接続します。\fB-a\fR も \fB-d\fR も指定されていない場合は、ゾーンの \fBzonepath\fR にゾーンのファイルがすでに正しくインストールされているとみなされます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.RS 15n
.rt  
インストール済み Solaris 10 ネイティブゾーンまたは \fBsolaris10\fR ブランドゾーンの \fBzonepath\fR にある、\fBcpio\fR(1)、\fBpax\fR(1) \fBxustar\fR、または \fBzfs\fR アーカイブへのパス。\fBcpio\fR および \fBzfs\fR アーカイブは、\fB gzip\fR または \fBbzip2\fR を使用して圧縮できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.RS 15n
.rt  
\fIsysidcfg\fR ファイルを指定すると、接続後にゾーン上で sys-unconfig が実行されます。その後、\fIsysidcfg\fR ファイルがゾーンに適用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.RS 15n
.rt  
インストール済み Solaris 10 ネイティブゾーンまたは \fBsolaris10\fR ブランドゾーンの \fBzonepath\fR の、\fBzonepath\fR ディレクトリのパス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBclone\fR [\fB-c\fR \fBsysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
既存のインストール済みゾーンをコピーすることでゾーンのインストールを行います。このサブコマンドは、ゾーンをインストールするための代替手段となります。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fBsysidcfg\fR\fR
.ad
.RS 15n
.rt  
複製されたゾーンの構成解除後に適用する \fIsysidcfg\fR ファイルを指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstall\fR [\fB-a\fR \fIarchive\fR] [\fB-d\fR \fIpath\fR] [\fB-p\fR] [\fB-s\fR] [\fB-u\fR] [\fB-v\fR] \e\fR
.ad
.br
.na
\fB[\fB-c\fR \fBsysidcfg\fR] \fR
.ad
.sp .6
.RS 4n
指定された Solaris 10 システムイメージをゾーンにインストールします。\fB-u\fR オプションまたは \fB-p\fR オプションのどちらかが必須で、\fB-a\fR オプションまたは \fB- d\fR オプションのどちらかが必須です。\fB\fR
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.sp .6
.RS 4n
インストール済み Solaris 10 システムの \fBflash_archive\fR(4)、\fBcpio\fR(1)、\fBpax\fR(1) \fBxustar\fR、\fBzfs\fR アーカイブ、またはレベル \fB0\fR \fBufsdump\fR(1M) へのパス。\fBcpio\fR および \fBzfs\fR アーカイブは、\fBgzip\fR または \fBbzip2\fR を使用して圧縮できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.sp .6
.RS 4n
インストール後に適用する \fIsysidcfg\fR ファイルを指定します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
インストール済み Solaris 10 システムのルートディレクトリのパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
ゾーンのインストール後にシステム構成を維持します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
サイレントインストールします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
ゾーンのインストール後にゾーンに対して \fBsys-unconfig\fR を実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
インストールプロセスの詳細情報を出力します。
.RE

.RE

.SS "アプリケーションのサポート"
.sp
.LP
\fBsolaris10\fR ゾーンはユーザーレベルの Solaris 10 アプリケーションだけをサポートします。Solaris 10 デバイスドライバや Solaris 10 カーネルモジュールを \fBsolaris10\fR ゾーン内から使用することはできません。ただし、カーネルモジュールによっては、最新バージョンの Solaris カーネルモジュールをユーザーレベルの Solaris 10 アプリケーションに使用できる場合があります。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/zones/brand/brand-solaris10
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBcpio\fR(1), \fBmdb\fR(1), \fBpax\fR(1), \fBzlogin\fR(1), \fBdtrace\fR(1M), \fBufsdump\fR(1M), \fBzfs\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBflash_archive\fR(4), \fBattributes\fR(5), \fBbrands\fR(5), \fBzones\fR(5)
