Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man5/zones.5
'\" te
.\" Copyright (c) 2009 2011, Oracle and/or its affiliates. All rights reserved.
.TH zones 5 "2011 年 2 月 14 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
zones \- Solaris アプリケーションコンテナ
.SH 機能説明
.sp
.LP
Solaris のゾーン機能を使用して、アプリケーションを実行するための独立した環境を作成することができます。ゾーンで実行するプロセスは、システム上のほかのアクティビティーから監視されたり干渉されたりすることはありません。ほかのプロセス、ネットワークインタフェース、ファイルシステム、デバイス、およびプロセス間通信機能へのアクセスは、別のゾーンで実行されているプロセスと対話することがないように制限されます。 
.sp
.LP
ゾーンで使用できる特権は、操作がシステム全体に影響することがないように制限されます。\fBprivileges\fR(5) を参照してください。 
.sp
.LP
ゾーンの構成と管理は、\fBzoneadm\fR(1M) および \fBzonecfg\fR(1M) ユーティリティーを使って行います。ゾーンごとに詳細な構成を指定し、ファイルシステムの内容 (ソフトウェアパッケージなど) をゾーンにインストールし、ゾーンの実行時の状態を管理することができます。\fBzlogin\fR(1) を使用すれば、アクティブなゾーンでコマンドを実行することができます。この操作を行うときに、\fBin.rlogind\fR(1M) や \fBsshd\fR(1M) などのネットワークベースのログインサーバーからログインする必要はありません。
.sp
.LP
ゾーンを自動的にブートするかどうかは、次のように FMRI で識別されるゾーンサービスを使って切り替えます。
.sp
.LP
svc:/system/zones:default
.sp
.LP
\fBzoneadm\fR(1M) を参照してください。ゾーンの \fBautoboot\fR プロパティーに \fBtrue\fR を設定して、常に自動的にブートする方法もあります。ただし、ゾーンサービスが無効になっている場合は、ゾーンの autoboot プロパティーの設定に関係なく、ゾーンは自動的にブートしません。\fBzonecfg\fR(1M) を参照してください。
.sp
.LP
アクティブなゾーンは、英数字の名前と数値の ID によって識別されます。英数字の名前は、\fBzonecfg\fR(1M) ユーティリティーを使用して構成します。数値の ID は、ゾーンがブートするときに自動的に割り当てられます。\fBzonename\fR(1) ユーティリティーを実行すると、現在のゾーン名が報告されます。\fBzoneadm\fR(1M) ユーティリティーを実行すると、構成済みゾーンの名前と ID が報告されます。
.sp
.LP
ゾーンの状態には、次のいくつかの種類があります。
.sp
.ne 2
.mk
.na
\fB\fB構成済み\fR\fR
.ad
.RS 28n
.rt  
ゾーンの構成が完全に指定および確定されて、安定した記憶領域に保存されていることを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB不完全\fR\fR
.ad
.RS 28n
.rt  
ゾーンのインストールまたはアンインストールが完了していないか、またはそのような状態への移行中に操作が中断されたことを示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBインストール済み\fR\fR
.ad
.RS 28n
.rt  
ゾーンの構成がシステムにインストールされたことを示します。 パッケージはゾーンのルートパスにインストールされています。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB準備完了\fR\fR
.ad
.RS 28n
.rt  
ゾーンの仮想プラットフォームが確立されていることを示します。たとえば、ファイルシステムのマウントおよびデバイスの構成は完了していますが、ゾーンに関連付けられているプロセスはまだ開始していません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB稼働\fR\fR
.ad
.RS 28n
.rt  
ゾーンのアプリケーション環境に関連付けられたユーザープロセスが稼働状態であることを示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB停止処理中\fR\fR
.ad
.br
.na
\fB\fB停止\fR\fR
.ad
.RS 28n
.rt  
ゾーンが停止していることを示します。アプリケーション環境の状態 (ファイルシステムをマウントした状態など) を切り離せない場合、または仮想プラットフォームの一部を破棄できない場合に、ゾーンがそれらの状態に固定されることがあります。そのような場合には、オペレータの介入が必要です。 
.RE

.SS "プロセスのアクセス制限"
.sp
.LP
あるゾーン (大域ゾーンを除く) で実行中のプロセスからほかのプロセスへのアクセスは制限されています。\fB/proc\fR (\fBproc\fR(4) を参照) またはプロセス ID を引数に持つシステムコールインタフェース (\fBkill\fR(2)、\fBpriocntl\fR(2) など) を使用してアクセスできるプロセスは、同じゾーンのプロセスだけです。ほかのゾーン (大域ゾーンを含む) にあるプロセスにアクセスしようとすると、指定したプロセスがなかった場合に返されるエラーコードと同じエラーコードで失敗します。
.SS "特権の制限"
.sp
.LP
非大域ゾーンで実行されるプロセスでは、あるゾーンで実行する操作がほかのゾーンの操作に影響することがないように、一部の特権が制限されています。特権が制限されることによって、そのゾーンで特権ユーザー (スーパーユーザー、ルートユーザーなど) が実行できる操作が制限されます。ゾーンで許可される特権のリストは、\fBppriv\fR(1) ユーティリティーを使って表示できます。特権に関する詳細については、\fBprivileges\fR(5) を参照してください。
.SS "デバイスの制限"
.sp
.LP
あるゾーンのプロセスが別のゾーンのプロセスに干渉することがないよう、ゾーン内部で利用可能なデバイスセットには制限があります。たとえば、ゾーンで実行されるプロセスから、\fB/dev/kmem\fR を使用してカーネルメモリーを変更したり、ルートディスクの内容を変更したりすることはできません。このため、デフォルトでは、ゾーン内で安全に利用可能であると見なされるいくつかの仮想デバイスだけを使用できます。特定のゾーンで使用できるデバイスを追加するときは、\fBzonecfg\fR(1M) ユーティリティーを使用します。
.sp
.LP
デバイスおよび特権が制限されることで、非大域ゾーンで実行できるユーティリティーにもいくつかの影響があります。たとえば、\fBeeprom\fR(1M)、\fBprtdiag\fR(1M)、および \fBprtconf\fR(1M) ユーティリティーは、通常は利用できないデバイスを操作するため、ゾーンでは使用できません。
.SS "ブランド"
.sp
.LP
ゾーンを最初に作成するとき、ゾーンにブランドを割り当てることができます。ブランドゾーン内のソフトウェアは、大域ゾーンにある同じソフトウェアとは異なります。このようなソフトウェアには、構成や配置の異なる Solaris ソフトウェア、Solaris 以外のソフトウェアなどがあります。このような特定のソフトウェアの集まりを「ブランド」と呼びます (\fBbrands\fR(5) を参照)。いったんインストールされると、ゾーンをアンインストールしない限り、ゾーンのブランドは変更できません。
.SS "ファイルシステム"
.sp
.LP
各ゾーンは、ゾーンの root と呼ばれるディレクトリをルートとする、ファイルシステム階層の独自領域を保持します。ゾーンで実行されるプロセスがアクセスできるファイルは、階層のその領域にあるファイル (ゾーンのルートにあるファイル) だけです。この制限により、あるゾーンのプロセスから、別のゾーンに関連付けられているファイルシステムのデータを破壊または検査できないようになっています。\fBchroot\fR(1M) ユーティリティーをゾーンで使用することはできますが、その処理はゾーンでアクセスできるルートパスだけに制限されます。
.sp
.LP
ファイルシステムの領域を保護するために、ファイルシステムの領域を 1 つ以上のゾーンにマウントするときには、\fBlofs\fR(7FS) ファイルシステムの読み取り専用オプションを使用して行います。このように操作することで、同じファイルシステムのデータを複数のゾーンで共有するときに、ゾーンのセキュリティーを確保することができます。
.sp
.LP
あるゾーンで確立された NFS および autofs マウントへのアクセスは、そのゾーンだけに制限され、ほかのゾーン (大域ゾーンを含む) からアクセスすることはできません。ゾーンが停止またはリブートすると、マウントは削除されます。
.sp
.LP
ゾーンに委任された ZFS データセットは、そのゾーン内で管理できます。委任されたデータセット内に子データセットを作成できます。委任されたデータセット内にデータセットを作成すると、それらも委任されます。委任されたデータセットは、最上位のもの以外は破棄できます。委任されたデータセットには、ほとんどのプロパティーを設定できます。詳細については、\fBzfs\fR(1M) を参照してください。 
.sp
.LP
各ゾーンには委任された最上位のデータセットが 1 つあり、そのデータセットには \fBROOT\fR データセットがあるほか、\fB\&.../export\fR や \fB\&.../export/home\fR などのデータセットが含まれる場合もあります。\fBROOT\fR データセットの下にあるデータセットは、そのゾーンのブート環境を構成します。ブート環境のデータセットを作成または破棄する場合は、必ず \fBzoneadm\fR(1M) コマンドまたは \fBbeadm\fR(1M) コマンドを使用するようにしてください。
.SS "ネットワーク"
.sp
.LP
ゾーンでは、\fBTCP\fR、\fBUDP\fR、および \fBSCTP\fR アプリケーションに独自のポート番号空間を使用し、通常は 1 つ以上の個別の \fBIP\fR アドレスを使用します (ただし、Trusted Extensions の特定の構成ではゾーン間で IP アドレスが共有される)。
.sp
.LP
ゾーンでは、\fBIP\fR レイヤー (\fBIP\fR ルーティング、\fBARP\fR、\fBIPsec\fR、\fBIP\fR フィルタなど) の構成および状態を大域ゾーンと共有するか (共有 \fBIP\fR ゾーン)、異なる \fB IP\fR レイヤーの構成および状態を使用する (排他的 \fBIP\fR ゾーン) ことができます。
.sp
.LP
ゾーンが大域ゾーンと同じデータリンクに接続される、つまり、同じ \fBIP\fR サブネット上に配置される場合は、ゾーンに共有 \fBIP\fR インスタンスを使用することをお勧めします。
.sp
.LP
ゾーンが大域ゾーンやほかの非大域ゾーンとは異なる \fBVLAN\fR や \fBLAN\fR に接続される場合など、ネットワークの \fBIP\fR レイヤーで隔離されている必要がある場合は、隔離の理由から、ゾーンに排他的 \fBIP\fR を使用するようにしてください。
.sp
.LP
共有 \fBIP\fR ゾーンでは、ネットワークに対する特定の操作 (\fBIP\fR アドレスの変更、\fBIP\fR または Ethernet の偽装パケットの送信など) が禁止されます。これに対し、排他的 \fBIP\fR ゾーンでは、同じネットワークインタフェースに接続されている独立したホストと同等のネットワーク機能を使用できます。特に、そのようなゾーンのスーパーユーザーは、\fBIP\fR アドレスの変更および \fBARP\fR パケットの偽装を行うことができます。
.sp
.LP
共有 \fBIP\fR ゾーンには、1 つ以上のネットワークインタフェース名と \fBIP\fR アドレスが \fBzonecfg\fR(1M) で割り当てられます。ネットワークインタフェース名は大域ゾーンでも構成する必要があります。
.sp
.LP
排他的 \fBIP\fR ゾーンには、1 つ以上のネットワークインタフェース名が \fBzonecfg\fR(1M) で割り当てられます。ネットワークインタフェース名はそのゾーンに排他的に割り当てる必要があります。つまり、同じネットワークインタフェース名をほかの稼働中のゾーンに割り当てたり、大域ゾーンで使用したりすることはできません。
.sp
.LP
\fBDHCP\fR クライアント、\fBIPsec\fR および \fBIP\fR フィルタという形での \fBIP\fR レベルの完全な機能は、排他的 \fBIP\fR ゾーンで使用できますが、共有 \fBIP\fR ゾーンでは使用できません。
.SS "ホスト識別子"
.sp
.LP
ゾーンは 32 ビットのホスト識別子をエミュレートできます。ホスト識別子は、システム統合を目的として、\fBzonecfg\fR(1M) 経由で構成できます。ゾーンがホスト識別子をエミュレートすると、\fBhostid\fR(1) や \fBsysdef\fR(1M) などのコマンドだけでなく、ゾーンのコンテキスト内で実行される \fBsysinfo\fR(2) や \fBgethostid\fR(3C) などの C インタフェースも、ホストマシンの識別子ではなく、エミュレートされたゾーンのホスト識別子を表示するか、返します。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBhostid\fR(1), \fBzlogin\fR(1), \fBzonename\fR(1), \fBbeadm\fR(1M), \fBin.rlogind\fR(1M), \fBsshd\fR(1M), \fBsysdef\fR(1M), \fBzfs\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBkill\fR(2), \fBpriocntl\fR(2), \fBsysinfo\fR(2), \fBgethostid\fR(3C), \fBgetzoneid\fR(3C), \fBucred_get\fR(3C), \fBproc\fR(4), \fBattributes\fR(5), \fBbrands\fR(5), \fBprivileges\fR(5), \fBcrgetzoneid\fR(9F)
