Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/audiots.7d
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH audiots 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
audiots \- Acer Laboratories Inc. M5451 audio processor interface
.SH DESCRIPTION
.sp
.LP
The \fBaudiots\fR device uses the ALI M5451 audio processor and an AC-97 Codec to implement the audio device interface.
.sp
.LP
The \fBaudiots\fR device provides support for the internal speaker, headphone, line out, line in, and microphone.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/audiots\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBaudiots\fR driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiots.conf\fR\fR
.ad
.sp .6
.RS 4n
\fBaudiots\fR driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Availabilitysystem/io/audio
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.sp
.LP
Acer Laboratories Inc. \fBM5451\fR PCI Audio Processor Technical Specification
