Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/audiop16x.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved. 
.TH audiop16x 7D "8 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
audiop16x \- Creative Sound Blaster Live! OEM support
.SH DESCRIPTION
.sp
.LP
The \fBaudiop16x\fR driver provides support for the Creative Sound Blaster Live! products based on the P16X device. These chips are also known as the \fBEMU10K1X\fR device, not to be confused with the \fBEMU10K1\fR.
.sp
.LP
Add-in boards known to work with this driver are Sound Blaster Live! cards with model numbers SB0200 or SB0213.
.sp
.LP
This device is capable of 5.1 surround sound.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiop16x\fR\fR
.ad
.sp .6
.RS 4n
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audiop16x\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/audiop16x\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC kernel driver module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86, SPARC
_
Availabilitydriver/audio/audiop16x
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
