Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/audioens.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH audioens 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
audioens \- Ensoniq ESS 1371 and ESS 1373 audio driver
.SH DESCRIPTION
.sp
.LP
The \fBaudioens\fR driver provides support for the Ensoniq ESS1371, ESS1373, and Creative 5880 AC'97 devices. These devices are commonly known by several different names, including the Sound Blaster PCI128 and AudioPCI '97.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audioens\fR\fR
.ad
.sp .6
.RS 4n
32-bit kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/audioens\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/audioens\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i) 
lw(0i) |lw(5.5i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/io/audio
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBaudio\fR(7I), \fBdsp\fR(7I), \fBmixer\fR(7I)
