Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/blkdev.7d
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH blkdev 7D "16 Jun 2010" "SunOS 5.11" "Devices"
.SH NAME
blkdev \- generic block device driver
.SH DESCRIPTION
.sp
.LP
The \fBblkdev\fR module provides support services for generic block devices. See \fBsd\fR(7D)
.SS "Device Special Files"
.sp
.LP
Disk block special file names are located in \fB/dev/dsk\fR. Raw file names are located in \fB/dev/rdsk\fR. See \fBsd\fR(7D).
.SH IOCTLS
.sp
.LP
See \fBdkio\fR(7I).
.SH FILES
.sp
.LP
Device special files for the storage device are created in the same way as those for a SCSI disk. See sd(7D) for more information.
.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/cntndnsn\fR\fR
.ad
.RS 30n
.rt  
Block files for disks.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/cntndnsn\fR\fR
.ad
.RS 30n
.rt  
Raw files for disks.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/blkdev\fR\fR
.ad
.RS 30n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/blkdev\fR\fR
.ad
.RS 30n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/blkdev\fR\fR
.ad
.RS 30n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/kernel
.TE

.SH SEE ALSO
.sp
.LP
\fBeject\fR(1), \fBrmformat\fR(1), \fBrmmount\fR(1), \fBfdisk\fR(1M), \fBmount\fR(1M), \fBumount\fR(1M), \fBvfstab\fR(4), \fBattributes\fR(5), \fBdkio\fR(7I), \fBpcfs\fR(7FS), \fBsd\fR(7D)
