Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/chxge.7d
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved 
.TH chxge 7D "17 Jan 2005" "SunOS 5.11" "Devices"
.SH NAME
chxge \- Chelsio Ethernet network interface controllers
.SH SYNOPSIS
.LP
.nf
/dev/chxge
.fi

.SH DESCRIPTION
.sp
.LP
The \fBchxge\fR Ethernet driver is a  multi-threaded, loadable, clonable, STREAMS hardware driver supporting the connectionless Data Link Provider Interface, \fBdlpi\fR(7P), over Chelsio NIC controllers. Multiple (and  mixed) NIC controllers installed within the  system are supported  by  the driver. The \fBchxge\fR driver provides basic support for the NIC hardware. Functions include chip initialization, frame transmit and receive, and error recovery and reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning, character-special device \fB/dev/chxge\fR is used to access NIC devices installed within the system.
.SH CHXGE AND DLPI
.sp
.LP
The \fBchxge\fR driver is dependent on \fB/kernel/misc/gld\fR, a loadable kernel  module  that  provides the \fBchxge\fR driver with the DLPI and STREAMS functionality required of a LAN driver. See \fBgld\fR(7D) for more details on the primitives supported by the driver.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to the DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Default Maximum SDU is 1500 (ETHERMTU).
.RE
.RS +4
.TP
.ie t \(bu
.el o
dlsap address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The sap length value is  -2, meaning  the  physical address component is followed immediately by a 2-byte sap component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address  value is Ethernet/IEEE  broadcast address (FF:FF:FF:FF:FF:FF).
.RE
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/chxge\fR
.ad
.RS 29n
.rt  
Character special device.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/sparcv9/chxge\fR
.ad
.RS 29n
.rt  
SPARC chxge driver binary.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/chxge\fR
.ad
.RS 29n
.rt  
x86 platform kernel module. (32-bit).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/chxge\fR
.ad
.RS 29n
.rt  
x86 platform kernel module. (64-bit).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBnetstat\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P), \fBgld\fR(9F), \fBgld_mac_info\fR(9S)
