Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/daplt.7d
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH daplt 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
daplt \- Tavor uDAPL service driver 
.SH SYNOPSIS
.LP
.nf
daplt@0:daplt
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdaplt\fR module is the driver component of the uDAPL service provider for Tavor which implements the provider functions of the \fIuDAPL Specification 1.2\fR described under \fBlibdat(3LIB)\fR.
.sp
.LP
The \fBdaplt\fR module is a child of the IB nexus driver, \fBib\fR(7D), and layers on top of the Solaris kernel IB Transport Layer, \fBibtl\fR(7D). The \fBdaplt\fR driver uses the InfiniBand Transport Framework (IBTF). (See \fBibtl\fR(7D), \fBibcm\fR(7D), and \fBib\fR(7D) to access privileged IB VERBS.)
.sp
.LP
The \fBdaplt\fR driver copies out various HCA H/W object reference handles, including working and completion queues and User Access Region registers, to its own uDAPL service provider library for Tavor. The library can refer back to these object handles and use them to \fBmmap\fR(2) in the mapping of these H/W queues and registers from the Tavor HCA driver, \fBtavor\fR(7D). This process enables time-critical non-privileged IB VERBS such as send/receive work elements, RDMA read/write and memory window bind, to be invoked in the userland library and performed directly by the firmware or hardware. As a result, OS and network stack are bypassed, achieving true zero data copy with the lowest possible latency.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/daplt\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/daplt\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/daplt\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/daplt.conf\fR\fR
.ad
.RS 29n
.rt  
driver configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/daplt\fR\fR
.ad
.RS 29n
.rt  
special character device.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/io/infiniband/udapl
.TE

.SH SEE ALSO
.sp
.LP
\fBmmap\fR(2), \fBlibdat(3LIB)\fR, \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBib\fR(7D), \fBibcm\fR(7D), \fBibdm\fR(7D), \fBibtl\fR(7D), \fBtavor\fR(7D)
.sp
.LP
\fIuDAPL Specification 1.2\fR
