Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/dca.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.TH dca 7D "14 Aug 2005" "SunOS 5.11" "Devices"
.SH NAME
dca \- Crypto Accelerator device driver
.SH SYNOPSIS
.LP
.nf
\fBpci108e,5454@\fIpci-slot\fR\fR
.fi

.LP
.nf
\fBpci108e,5455@\fIpci-slot\fR\fR
.fi

.LP
.nf
\fBpci108e,5456@\fIpci-slot\fR\fR
.fi

.LP
.nf
\fBpci14e4,5820@\fIpci-slot\fR\fR
.fi

.LP
.nf
\fBpci14e4,5821@\fIpci-slot\fR\fR
.fi

.LP
.nf
\fBpci14e4,5822@\fIpci-slot\fR\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdca\fR device driver is a multi-threaded, loadable hardware driver supporting Sun PCI-based (\fBpci108e,5454\fR) cryptographic accelerators, such as the Sun Crypto Accelerator 1000.
.sp
.LP
The \fBdca\fR driver requires the presence of  Solaris Cryptographic Framework for applications and kernel clients to access the provided services.
.SH EXTENDED DESCRIPTION
.sp
.LP
The \fBdca\fR driver maintains the following statistics:
.sp
.ne 2
.mk
.na
\fB\fB3desjobs\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted to the device for 3DES encryption.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3desbytes\fR\fR
.ad
.RS 16n
.rt  
Total number of bytes submitted to the device for 3DES encryption.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsapublic\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted to the device for RSA public key operations.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsaprivate\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted to the device for RSA private key operations.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdsasign\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted to the device for DSA signing.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdsaverify\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted to the device for DSA verification.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrngjobs\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted for pure entropy generation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrngbytes\fR\fR
.ad
.RS 16n
.rt  
Total number of bytes of pure entropy requested from the device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrngsha1jobs\fR\fR
.ad
.RS 16n
.rt  
Total number of jobs submitted for entropy generation, with SHA-1 post-processing.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrngsha1bytes\fR\fR
.ad
.RS 16n
.rt  
Total number of bytes of entropy requested from the device, with SHA-1 post-processing.
.RE

.sp
.LP
Additional statistics may be supplied for Sun support personnel,  but are not useful to end users and are not documented here.
.sp
.LP
The \fBdca\fR driver can be configured by defining properties in \fB/kernel/drv/dca.conf\fR which override the default settings. The following properties are supported:
.sp
.ne 2
.mk
.na
\fB\fBnostats\fR\fR
.ad
.RS 13n
.rt  
Disables the generation of statistics. This property may be used to help prevent traffic analysis, but this may inhibit support personnel.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrngdirect\fR\fR
.ad
.RS 13n
.rt  
Disables the SHA-1 post-processing of generated entropy. This may give "truer" random numbers, but it may also introduce the risk of external biases influencing the distribution of generated random numbers.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Availabilitydriver/crypto/dca
_
Interface StabilityUncommitted
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/dca.conf\fR\fR
.ad
.RS 27n
.rt  
\fBdca\fR configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/dca\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/dca\fR\fR
.ad
.RS 27n
.rt  
32-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/dca\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel driver (AMD64)
.RE

.SH SEE ALSO
.sp
.LP
\fBcryptoadm\fR(1M), \fBkstat\fR(1M), \fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5)
.sp
.LP
\fISolaris Cryptographic Framework.\fR
