Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/fasttrap.7d
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fasttrap 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
fasttrap \- DTrace user instruction tracing provider
.SH DESCRIPTION
.sp
.LP
The \fBfasttrap\fR driver is a DTrace dynamic tracing provider that performs dynamic instrumentation of arbitrary instructions in Solaris processes. The \fBfasttrap\fR driver implements the DTrace \fBfasttrap\fR and \fBpid\fR providers.
.sp
.LP
The \fBfasttrap\fR driver is not a public interface and you access instrumentation offered by this provider through DTrace. Refer to the \fISolaris Dynamic Tracing Guide\fR for a description of the public documented interfaces available for the DTrace facility and the probes offered by the \fBfasttrap\fR provider.
.SH SPARC ONLY
.sp
.LP
The \fBfasttrap\fR provider provides a DTrace probe that fires each time a user process executes an instruction. The \fBpid\fR provider allows for the dynamic creation of DTrace probes corresponding to instruction locations inside any user process specified using a process ID and an instruction address or symbol name. Together these providers permit DTrace users to perform instrumentation of Solaris user processes and to trace the interactions between processes and the operating system. See the chapter entitled "User Process Tracing"  in the \fISolaris Dynamic Tracing Guide\fR for information on how to use these providers to instrument processes.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/dtrace
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBdtrace\fR(1M), \fBattributes\fR(5), \fBdtrace\fR(7D)
.sp
.LP
\fISolaris Dynamic Tracing Guide\fR
