Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/fp.7d
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fp 7d "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
fp \- Sun Fibre Channel port driver
.SH DESCRIPTION
.sp
.LP
The \fBfp\fR driver is a Sun fibre channel nexus driver that enables fibre channel topology discovery, device discovery, fibre channel adapter port management and other capabilities through well-defined fibre channel adapter driver interfaces.
.sp
.LP
The \fBfp\fR driver requires the presence of a fabric name server in fabric and public loop topologies to discover fibre channel devices. In private loop topologies, the driver discovers devices by performing \fBPLOGI\fR to all valid \fBAL_PA\fRs, provided that devices do not participate in \fBLIRP\fR and \fBLILP\fR stages of loop initialization. The \fBfp\fR driver also discovers devices in N_Port point-to-point topologies.
.SH CONFIGURATION
.sp
.LP
The \fBfp\fR driver is configured by defining  properties in the \fBfp.conf\fR file. Note that you must reboot the system to have any changes you make to \fBfp.conf\fR take effect. The \fBfp\fR driver supports the following properties:
.sp
.ne 2
.mk
.na
\fBmpxio-disable\fR
.ad
.sp .6
.RS 4n
Solaris I/O multipathing is enabled or disabled on fibre channel devices with the mpxio-disable property. Specifying mpxio-disable="no" activates I/O multipathing, while mpxio-disable="yes" disables the feature. Solaris I/O multipathing may be enabled or disabled on a per port basis. Per port settings override the global setting for the specified ports. The following example shows how to disable multipathing on port 0 whose parent is /pci@8,600000/SUNW,qlc@4:
.sp
.in +2
.nf
name="fp"    parent="/pci@8,600000/SUNW,qlc@4"    port=0
mpxio-disable="yes";
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
\fBmanual_configuration_only\fR
.ad
.sp .6
.RS 4n
Automatic configuration of SCSI devices in the fabric is enabled by default and thus allows all devices discovered in the SAN zone to  be enumerated  in the kernel's device tree automatically. The \fBmanual_configuration_only\fR property may be configured  to disable the default behavior and force the manual configuration of the devices in the SAN. Specifying manual_configuration_only=1 disables the automatic configuration of devices.
.RE

.sp
.ne 2
.mk
.na
\fBpwwn-lun-blacklist\fR
.ad
.sp .6
.RS 4n
Allows you to specify target port WWNs and LUN numbers you do not want configured. LUN numbers are interpreted as decimals. White spaces and commas (',') can be used in the list of LUN numbers.
.sp
.in +2
.nf
     #
     # pwwn-lun-blacklist=
     # "target-port-wwn,lun-list"
     #
     # To prevent LUNs 1 and 2 from being configured for target
     # port 510000f010fd92a1 and target port 510000e012079df1, set:
     #
     # pwwn-lun-blacklist=
     # "510000f010fd92a1,1,2",
     # "510000e012079df1,1,2";
     #
.fi
.in -2

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/fp\fR\fR
.ad
.RS 26n
.rt  
32-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/fp\fR\fR
.ad
.RS 26n
.rt  
64-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/fp\fR\fR
.ad
.RS 26n
.rt  
64-bit ELF kernel driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/fp.conf\fR\fR
.ad
.RS 26n
.rt  
\fBfp\fR driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
mpxio-disableUncommitted
_
manual_configuration_onlyObsolete
_
Availabilitysystem/io/fc/fc-port
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm_fp\fR(1M), \fBprtconf\fR(1M), \fBstmsboot\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBfcp\fR(7D), \fBfctl\fR(7D), \fBscsi_vhci\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIFibre Channel Physical and Signaling Interface (FC-PH) ANSI X3.230: 1994\fR
.sp
.LP
\fIFibre Channel Generic Services (FC-GS-2) Project 1134-D\fR
.sp
.LP
\fIFibre Channel Arbitrated Loop (FC-AL) ANSI X3.272-1996\fR
.sp
.LP
\fIFibre Channel Protocol for SCSI (FCP) ANSI X3.269-1996\fR
.sp
.LP
\fISCSI-3 Architecture Model (SAM) Fibre Channel Private Loop SCSI Direct Attach (FC-PLDA) ANSI X3.270-1996\fR
.sp
.LP
\fISCSI Direct Attach (FC-PLDA) ANSI X3.270-1996\fR
.sp
.LP
\fISCSI Direct Attach (FC-PLDA) NCITS TR-19:1998\fR
.sp
.LP
\fIFabric Loop Attachment (FC-FLA), NCITS TR-20:1998\fR
.SH NOTES
.sp
.LP
In N_Port point-to-point topologies, FCP error recovery does not work across events such as link bounce/cable pull. I/O to devices with FCP-2/FCP-3 support (for example, FC tape drives) will be disrupted by such events.
