Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/gpio_87317.7d
'\" te
.\" Copyright (2000 Sun Microsystems, Inc.  All Rights Reserved.
.TH gpio_87317 7D "12 April 2000" "SunOS 5.11" "Devices"
.SH NAME
gpio_87317 \- General purpose I/O driver for SuperIO 
.SH DESCRIPTION
.sp
.LP
The \fBgpio_87317\fR driver is the general purpose I/O driver for the National Semiconductor SuperIO (PC87317) chipset. It supports remote system controller (RSC) administration via an interface to the SuperIO's general purpose I/O bits.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureLimited to SPARC systems with  SuperIO
_
Availability system/library/processor
_
Interface Stability Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fIPC87317VUL/PC97317VUL SuperI/O Data Sheet \fR\(em National Semiconductor 
