Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/hwahc.7d
'\" te
.\"  Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hwahc 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
hwahc \- Host Wire Adapter Host Controller Driver
.SH DESCRIPTION
.sp
.LP
The \fBhwahc\fR driver is a USBA (Solaris USB Architecture) compliant nexus driver that supports the Wireless USB 1.0 Host Wire Adapter Host Controller, an industry standard developed by USB-IF.
.sp
.LP
A Host Wire Adapter (HWA) is a USB device whose upstream connection is a USB 2.0 wired interface. The HWA operates as a host to a cluster of downstream Wireless USB devices.
.sp
.LP
The \fBhwahc\fR driver supports bulk, interrupt and control transfers. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/hwahc\fR\fR
.ad
.RS 29n
.rt  
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/hwahc\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/hwahc\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fBprtconf\fR(1M), \fBrem_drv\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5), \fBehci\fR(7D), \fBhubd\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIOracle Solaris Administration: Common Tasks\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.oracle.com
.SH DIAGNOSTICS
.sp
.LP
All host controller errors are passed to the client drivers. In addition to being logged, the following messages can appear on the system console. All messages are formatted in the following way: 
.sp
.in +2
.nf
WARNING: \fIdevice_path hwahc instance_number\fR: Message ...

Connection device on WUSB port \fIport_number\fR fails
.fi
.in -2
.sp

.sp
.LP
The connecting device fails to connect to the HWA. Make sure the device has been associated with the host.
