Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/ibtl.7d
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ibtl 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
ibtl \- Solaris InfiniBand Transport Layer
.SH DESCRIPTION
.sp
.LP
InfiniBand (\fBIB\fR) is an I/O technology based on switched fabrics. The Solaris InfiniBand Transport Layer (\fBIBTL\fR) is a Solaris kernel misc module and adheres to the \fIIB Architecture Version 1.1\fR specification and provides a transport layer abstraction to \fBIB\fR client drivers.
.sp
.LP
\fBIBTL\fR implements the programming interfaces for the Solaris InfiniBand Transport Framework (\fBIBTF\fR), consisting of the IB Channel Interface (CI) and the IB Transport Interface (TI).
.sp
.LP
The CI consists of Host Channel Adapters (HCAs) and HCA drivers. A host is attached to the IB fabric through the CI layer. The Solaris InfiniBand CI is Sun's API rendering of the InfiniBand Architecture (IBTA) "verbs" specification.
.sp
.LP
The Solaris InfiniBand TI is the kernel service driver interface into the Solaris InfiniBand Transport Framework. It provides transport and communications setup programming interfaces for Unreliable Datagram (UD) and Reliable Connected (RC) transport types only.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/ibtl\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/ibtl\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/ibtl\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityConsolidation Private
_
Availabilitysystem/header, system/io/infiniband
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBib\fR(7D), \fBibcm\fR(7D), \fBibdm\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
