Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/igbvf.7d
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH igbvf 7D "29 Nov 2010" "SunOS 5.11" "Devices"
.SH NAME
igbvf \- Intel Gigabit Ethernet Virtual Function Driver
.SH SYNOPSIS
.sp
.LP
\fB/dev/igbvf*\fR
.SH DESCRIPTION
.sp
.LP
The \fBigbvf\fR Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on the Virtual Function of Intel 82576 Gigabit Ethernet controller.
.sp
.LP
The \fBigbvf\fR driver functions include Virtual Function initialization, frame transmit and receive, promiscuous and multicast support, and error recovery and reporting.
.sp
.LP
The \fBigbvf\fR driver works on the Virtual Function of Intel 82576  Gigabit Ethernet controller only when the SRIOV capability of the controller is enabled. 
.SS "Configuration"
.sp
.LP
The \fBigbvf\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBigbvf\fR instances and for \fBigbvf\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
The \fBigbvf\fR driver does not support link configuration. The link configuration is controlled by the Physical Function of the 82576 controller, which is supported by the \fBigb\fR(7D) driver.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/igbvf*\fR\fR
.ad
.RS 29n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/igbvf\fR\fR
.ad
.RS 29n
.rt  
32-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/igbvf\fR\fR
.ad
.RS 29n
.rt  
64-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/igbvf\fR\fR
.ad
.RS 29n
.rt  
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/igbvf.conf\fR\fR
.ad
.RS 29n
.rt  
Configuration file
.RE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBndd\fR(1M), \fBnetstat\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBdlpi\fR(7P), \fBigb\fR(7D), \fBstreamio\fR(7I)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
