Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/ixgbe.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ixgbe 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
ixgbe \- Intel 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ixgbe*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBixgbe\fR 10 Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on Intel 10-Gigabit PCI Express Ethernet controllers.
.sp
.LP
The \fBixgbe\fR driver functions include controller initialization, frame transmit and receive, promiscuous and multicast support, and error recovery and reporting.
.sp
.LP
The \fBixgbe\fR driver and hardware support auto-negotiation, a protocol specified by the \fIIEEE 802.3ae\fR specification.
.sp
.LP
The \fBixgbe\fR driver also supports the SRIOV capability on Intel 82599 and later 10 Gigabit Ethernet controllers. In SR-IOV enabled mode, it supports the Physical Function of the controller.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/ixgbe\fR, is used to access all Intel 10 -Gigabit PCI Express Ethernet devices installed within the system.
.sp
.LP
The \fBixgbe\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBixgbe\fR instances and for \fBixgbe\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
You must send an explicit \fBDL_ATTACH_REQ\fR message to associate the opened stream with a particular device (PPA). The PPA ID is interpreted as an unsigned integer data type and indicates the corresponding device instance (unit) number. The driver returns an error (\fBDL_ERROR_ACK\fR) if the PPA field value does not correspond to a valid device instance number for the system. The device is initialized on first attach and de-initialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in response to your \fBDL_INFO_REQ\fR are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 16366.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address component is followed immediately by a 2-byte SAP component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address (\fIFF:FF:FF:FF:FF:FF\fR).
.sp
Once in the \fBDL_ATTACHED\fR state, you must send a \fBDL_BIND_REQ\fR to associate a particular SAP with the stream.
.RE
.SH CONFIGURATION
.sp
.LP
By default, the \fBixgbe\fR driver performs auto-negotiation to select the link speed and mode. Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE802.3\fR standard for more information.
.sp
.LP
In SR-IOV mode, the following device specific parameters are exported by the ixgbe driver to supprot SR-IOV feature.
.sp
.ne 2
.mk
.na
\fB\fBmax-config-vfs\fR\fR
.ad
.RS 18n
.rt  
This is a read-only parameter describing the maximum number of VFs that can be configured. A value of \fB63\fR is exported to override the information that is found in PCI config space of the \fB82599\fR device. difference is due to the fact that \fBixgbe\fR driver utilizes hardware resources to provide a functional PF device along with VFs. parameter enables external management software to limit the number of configured VFs to be \fB63\fR or less.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax-vlans\fR\fR
.ad
.RS 18n
.rt  
This is a read-only parameter describing the maximum number of VLAN filters supported for PF and VFs. As the 82599 supports 64 VLAN filters for PF and VFs all together, a value of \fB64\fR is exported. parameter allows external management software entities to limit the number of VLAN filters configured to be with the supported limit.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax-vf-mtu\fR\fR
.ad
.RS 18n
.rt  
This is a read-only parameter describing the maximum MTU allowed for a VF. A value of \fB1500\fR is exported to indicate the \fB82599\fR VF hardware limit. parameter allows external management software to limit the maximum VF MTU setting to be within the described limit.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunicast-slots\fR\fR
.ad
.RS 18n
.rt  
This is a tunable parameter that allows the reservation of unicast mac-address slots to a PF or a VF. A total of \fB128\fR unicast \fBmac-address\fR slots are present in a \fB82599\fR device instance, out which one \fBmac-address\fR slot for the PF and each VFs is always reserved. The rest of the unicast \fBmac-address\fR slots can be reserved for the PF or VFs through this parameter. If not, the rest unicast \fBmac-address\fR slots are shared and allocated on first come first serve basis.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpvid-exclusive\fR\fR
.ad
.RS 18n
.rt  
This is a read-only parameter describing the hardware attribute that vlan IDs and port vlan ID are mutual exclusive on a 82599 device. Users cannot set \fBvlan\fR IDs successfully when port \fBvlan\fR ID has been set. Vice versa, users cannot set port \fBvlan\fR ID successfully when \fBvlan\fR IDs have been set.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ixgbe*\fR\fR
.ad
.RS 29n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ixgbe\fR\fR
.ad
.RS 29n
.rt  
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ixgbe\fR\fR
.ad
.RS 29n
.rt  
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ixgbe\fR\fR
.ad
.RS 29n
.rt  
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ixgbe.conf\fR\fR
.ad
.RS 29n
.rt  
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
Availabilitydriver/network/ethernet/ixgbe
ArchitectureSPARC, x86
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBstreamio\fR(7I), \fBdlpi\fR(7P)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specificiation\fR, IEEE - 2002
