Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/ixgb.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.TH ixgb 7d "16 Jul 2008" "SunOS 5.11" "Devices"
.SH NAME
ixgb \- SUNWixgb, 10 Gigabit  Ethernet driver  for Intel 82597ex controllers and Sun Ethernet PCI-X Adapter (X5544A-4) adapters.
.SH SYNOPSIS
.LP
.nf
\fB/dev/ixgb\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBixgb\fR 10 Gigabit Ethernet  driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBDLPI\fR on Intel  82597ex  10 Gigabit  Ethernet  controllers and  Sun 10 Gigabit Ethernet PCI-X Adapter (X5544A-4) on  x86 Platforms. The Intel 10G controller  incorporates both  MAC and  PHY  functions and provides 10G (fiber) Ethernet operation on  the  SR and LR connectors.  The Sun 10  Gigabit  Ethernet  PCI-X  Adapter (X5544A-4)  is a 133  MHz  PCI-X 10  Gigabit Ethernet card utilizing  the Intel  82597EX PCI-X  MAC  controller with XFP-based  10GigE optics.
.sp
.LP
The \fBixgb\fR driver functions include controller initialization, frame transmit and receive, promiscuous and multicast support and error recovery and reporting.
.sp
.LP
The \fBixgb\fR driver and hardware support auto-negotiation, a protocol specified by the \fIIEEE 802.3ae\fR specification.
.SH CONFIGURATION
.sp
.LP
The following \fBixgb.conf\fR configuration option is supported:
.sp
.ne 2
.mk
.na
\fBdefault_mtu\fR
.ad
.sp .6
.RS 4n
Upper limit on the maximum MTU size the driver allows. Intel 82597EX controller allows the configuration of jumbo frames. To configure jumbo frame, use \fBifconfig\fR(1M). Use ifconfig with the adapter  instance and the mtu argument (for example: ifconfig ixgb0 mtu 9000) to configure the adapter for the maximum allowable jumbo frame size. Allowed range is 1500 - 9000.
.RE

.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device /dev/ixgb is used to access all Intel 10G controllers and Sun 10 Gigabit Ethernet PCI-X adapters (X5544A-4) installed within the system
.sp
.LP
The \fBixgb\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBixgb\fR  instances and for \fBixgb\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened stream with a particular device (PPA). The PPA ID is interpreted as an unsigned integer data type and  indicates the corresponding device instance (unit) number. The driver returns an error  (\fBDL_ERROR_ACK\fR) if  the PPA  field value does not correspond to a valid device instance number for the system. The device is initialized  on  first attach and de-initialized (stopped) at last detach. 
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in response to the \fBDL_INFO_REQ\fR are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum \fBSDU\fR is \fB9000\fR (\fBETHERMTU\fR, as defined in  \fB<sys/ethernet.h>\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum \fBSDU\fR is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is \fB8.\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER.\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR length value is \fB\(mi2\fR meaning the physical address component is followed immediately  by a 2 byte \fBSAP\fR component within the \fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is Ethernet/IEEE broadcast address (\fBFF:FF:FF:FF:FF:FF\fR).
.RE
.sp
.LP
Once in the \fBDL_ATTACHED\fR state, you must send a \fBDL_BIND_REQ\fR to associate a particular Service Access Point (\fBSAP\fR) with the stream.
.sp
.LP
By default, the \fBixgb\fR driver performs auto-negotiation to select the 10G link speed.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ixgb\fR\fR
.ad
.RS 28n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ixgb\fR\fR
.ad
.RS 28n
.rt  
Driver binary.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ixgb\fR\fR
.ad
.RS 28n
.rt  
32-bit kernel module. (x86 only).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ixgb\fR\fR
.ad
.RS 28n
.rt  
64-bit kernel module (x86 only).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBifconfig\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBstreamio\fR(7I), \fBdlpi\fR(7P)
.sp
.LP
\fIIEEE 802.3ae 10 Gigabit Ethernet Specification\fR \(em June, 2002
.sp
.LP
\fISun  10  Gigabit  Ethernet  PCI-X  Adapter (X5544A-4) Driver Installation Notes for Solaris\fR
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
