Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/mediator.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.TH mediator 7D "20 Jun 2008" "SunOS 5.11" "Devices"
.SH NAME
mediator \- support for HA configurations consisting of two strings of drives
.SH DESCRIPTION
.sp
.LP
Beginning with a prior version, Solaris Volume Manager provided support for high-availability (HA) configurations consisting of two hosts that share at least three strings of drives and that run software enabling exclusive access to the data on those drives from one host. (Note:  Volume Manager, by itself, does not actually provide a high-availability environment. The diskset feature is an enabler for HA configurations.)
.sp
.LP
Volume Manager provides support for a low-end HA solution consisting of two hosts that share only two strings of drives. The hosts in this type of configuration, referred to as \fImediators\fR, run a special daemon, \fBrpc.metamedd\fR(1M). The mediator hosts take on additional responsibilities to ensure that data is available in the case of host or drive failures.
.sp
.LP
In a mediator configuration, two hosts are physically connected to two strings of drives. This configuration can survive the failure of a single host or a single string of drives, without administrative intervention. If both a host and a string of drives fail (multiple failures), the integrity of the data cannot be guaranteed. At this point, administrative intervention is required to make the data accessible.
.sp
.LP
The following definitions pertain to a mediator configuration:
.sp
.ne 2
.mk
.na
\fB\fBdiskset\fR\fR
.ad
.sp .6
.RS 4n
A set of drives containing metadevices and hot spares that can be shared exclusively (but not concurrently) by two hosts.
.RE

.sp
.ne 2
.mk
.na
\fB\fBVolume Manager\fR \fBstate\fR \fBdatabase\fR\fR
.ad
.sp .6
.RS 4n
A replicated database that stores metadevice configuration and state information.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmediator\fR \fBhost\fR\fR
.ad
.sp .6
.RS 4n
A host that runs the \fBrpc.metamedd(1M)\fR daemon and that has been added to a diskset. The mediator host participates in checking the state database and the mediator quorum.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmediator\fR \fBquorum\fR\fR
.ad
.sp .6
.RS 4n
The condition achieved when the number of accessible mediator hosts is equal to half+1 the total number of configured mediator hosts. Because it is expected that there will be two mediator hosts, this number will normally be 2 ([(2/2) + 1] = 2.)
.RE

.sp
.ne 2
.mk
.na
\fB\fBreplica\fR\fR
.ad
.sp .6
.RS 4n
A single copy of the Volume Manager metadevice state database.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreplica\fR \fBquorum\fR\fR
.ad
.sp .6
.RS 4n
The condition achieved when the number of accessible replicas is equal to half+1 the total number of configured replicas. For example, if a system is configured with ten replicas, the quorum is met when six are accessible ([(10/2) + 1 = 6]).
.RE

.sp
.LP
A mediator host running the \fBrpc.metamedd(1M)\fR daemon keeps track of replica updates. As long as the following conditions are met, access to data occurs without any administrative intervention:
.RS +4
.TP
.ie t \(bu
.el o
The replica quorum is not met.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Half of the replicas are still accessible.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The mediator quorum is met.
.RE
.sp
.LP
The following conditions describe the operation of mediator hosts:
.RS +4
.TP
1.
If the  is met, access to the diskset is granted. At this point no mediator host is involved.
.RE
.RS +4
.TP
2.
If the replica quorum is not met, half of the replicas are accessible, the mediator quorum is met, and the replica and mediator data match, access to the diskset is granted. The mediator host contributes the deciding vote.
.RE
.RS +4
.TP
3.
If the replica quorum is not met, half of the replicas are accessible, the mediator quorum is not met, half of the mediator hosts  is accessible, and the replica and mediator data match, the system prompts you to grant or deny access to the diskset.
.RE
.RS +4
.TP
4.
If the replica quorum is not met, half of the replicas are accessible, the mediator quorum is met, and the replica and mediator data do not match, access to the diskset is read-only. You can delete replicas, release the diskset, and retake the diskset to gain read-write access to the data in the diskset.
.RE
.RS +4
.TP
5.
In all other cases, the diskset access is read-only. You can delete replicas, release the diskset, and retake the diskset to gain read-write access to the data in the diskset.
.RE
.sp
.LP
The \fBmetaset\fR(1M) command administers disksets and mediator hosts. The following options to the \fBmetaset\fR command pertain only to administering mediator hosts.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fB-m\fR \fB\fImediator_host_list\fR\fR\fR
.ad
.RS 28n
.rt  
Adds mediator hosts to the named set.  A \fImediator_host_list\fR is the  nodename of the mediator host to be added and up to 2 other aliases for the mediator host. The nodename and aliases for each mediator host are separated by commas. Up to 3 mediator hosts can be specified for the named diskset.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fB-m\fR \fB\fImediator_host_list\fR\fR\fR
.ad
.RS 28n
.rt  
Deletes mediator hosts from the named diskset. Mediator hosts are deleted from the diskset by specifying the nodename of mediator host to delete.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 28n
.rt  
Displays an enumerated list of tags pertaining to ``tagged data'' that may be encountered during a take of the ownership of a diskset.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR [\fB-f\fR] \fB-y\fR\fR
.ad
.RS 28n
.rt  
Takes ownership of a diskset safely, unless \fB-f\fR is used, in which case the take is unconditional. If \fBmetaset\fR finds that another host owns the set, this host will not be allowed to take ownership of the set. If the set is not owned by any other host, all the disks  within the set will be owned by the host on which \fBmetaset\fR  was executed. The metadevice state database is read in and the shared metadevices contained in the set become accessible. The \fB-t\fR option will take a diskset that has stale databases. When the databases are stale, \fBmetaset\fR will exit with code 66, and a message will be printed. At that point, the only operations permitted are the addition and deletion of replicas. Once the addition or deletion of the replicas has been completed, the diskset should be released and retaken to gain full access to the data. If mediator hosts have been configured, some additional exit codes are  possible. If half of the replicas and half of the mediator hosts are operating properly, the take will exit with code 3. At this point, you can add or delete replicas, or use the \fB-y\fR option on a subsequent take. If the take operation encounters ``tagged data,'' the take operation will exit with code 2. You can then run the \fBmetaset\fR command with the  \fB-q\fR option to see an enumerated list of tags.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR [\fB-f\fR] \fB-u\fR \fItagnumber\fR\fR
.ad
.RS 28n
.rt  
Once a tag has been selected, a subsequent take with  \fB-u\fR \fB\fItagnumber\fR\fR can be executed to select the data associated with the given \fItagnumber\fR.
.RE

.SH SEE ALSO
.sp
.LP
\fBmetaset\fR(1M), \fBmd\fR(7D), \fBrpc.metamedd\fR(1M), \fBrpc.metad\fR(1M)
.sp
.LP
Sun Cluster documentation, \fISolaris Volume Manager Administration Guide\fR
.SH NOTES
.sp
.LP
Diskset administration, including the addition and deletion of hosts  and drives, requires all hosts in the set to be accessible from the network.
