Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/mr_sas.7d
'\" te
.\"  Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH mr_sas 7D "21 Feb 2011" "SunOS 5.11" "Devices"
.SH NAME
mr_sas \- LSI MegaRAID SAS2.0 Controller HBA driver
.SH DESCRIPTION
.sp
.LP
The \fBmr_sas\fR MegaRAID SAS2.0 controller host bus adapter driver is a SCSA-compliant nexus driver that supports the LSI SAS2208-based series of controllers running MegaRAID firmware, the LSI SAS2108-based series of MegaRAID controllers, and the Sun StorageTek 6Gb/s SAS RAID HBA series of controllers. 
.sp
.LP
Some of the RAID Features include the following:
.RS +4
.TP
.ie t \(bu
.el o
RAID levels 0, 1, 5, and 6
.RE
.RS +4
.TP
.ie t \(bu
.el o
RAID spans 10, 50, and 60
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online Capacity Expansion (OCE)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online RAID Level Migration (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Auto resume after loss of system power during arrays array rebuild or reconstruction (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configurable stripe size up to 1MB
.RE
.RS +4
.TP
.ie t \(bu
.el o
Check Consistency for background data integrity
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patrol read for media scanning and repairing
.RE
.RS +4
.TP
.ie t \(bu
.el o
64 logical drive support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Up to 64TB LUN support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Automatic rebuild
.RE
.RS +4
.TP
.ie t \(bu
.el o
Global and dedicated Hot Spare support
.RE
.sp
.LP
The \fBmr_sas\fR driver also supports the following Dell cards: PERC H700, H710, H710P, H800, and H810.
.SS "Configuration"
.sp
.LP
The uneditable \fBmr_sas.conf\fR file contains one user private configurable parameter, for MSI or MSI-X support. Configure your hardware through the related BIOS utility or the MegaCli Configuration Utility. If you want to install to a drive attached to a \fBmr_sas\fR HBA, create the virtual drive first from the BIOS (X86) before running Solaris install. The \fBMegaCli\fR utility can be downloaded from the LSI website. 
.sp
.LP
The LSI MegaRAID SAS device can support up to 64 virtual SAS2.0, SAS1.0, SATA3.0, or SATA 6.0 disks. The BIOS numbers the virtual disks as 1 through 64, however in Solaris these drives are numbered from 0 to 63. Also keep in mind that SAS and SATA drives can not be configured into the same virtual disk.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/mr_sas\fR\fR
.ad
.RS 30n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/mr_sas\fR\fR
.ad
.RS 30n
.rt  
64-bit kernel module x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/mr_sas\fR\fR
.ad
.RS 30n
.rt  
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/mr_sas.conf\fR\fR
.ad
.RS 30n
.rt  
Driver configuration file containing one user-configurable option. This file is not editable.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/storage/mr_sas
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBattributes\fR(5), \fBsata\fR(7D), \fBscsi_hba_attach_setup\fR(9F), \fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fISmall Computer System Interface-2 (SCSI-2)\fR
.SH NOTES
.sp
.LP
The \fBmr_sas\fR driver only supports internal and external expanders that are not fully SAS1.0 or fully SAS2.0 compliant.
