Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/n2rng.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH n2rng 7d "15 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
n2rng \- Ultra-SPARC T2 random number generator device driver
.SH DESCRIPTION
.sp
.LP
The \fBn2rng\fR device driver is a multi-threaded, loadable hardware driver supporting hardware assisted random numbers. This support is built into the Ultra-SPARC T2 CMT processor.
.sp
.LP
The \fBn2rng\fR driver requires the presence of the Solaris Cryptographic Framework to enable applications and kernel clients to access the provided services.
.SH CONFIGURATION
.sp
.LP
You configure the \fBn2rng\fR driver by defining properties in \fB/platform/sun4v/kernel/drv/n2cp.conf\fR which override the default settings. The following property is supported:
.sp
.ne 2
.mk
.na
\fBnostats\fR
.ad
.RS 28n
.rt  
Disables the generation of statistics. The nostats property may be used to help prevent traffic analysis, however, this may inhibit support personnel.
.RE

.SH CRYPTO STATISTICS
.sp
.LP
Solaris crypto drivers must implement statistics variables. Statistics are reported by \fBn2rng\fR using  the \fBkstat\fR(7D) and \fBkstat\fR(9S) mechanisms. The \fBn2rng\fR driver maintains the following statistics:
.sp
.ne 2
.mk
.na
\fBstatus\fR
.ad
.RS 28n
.rt  
Status (online, offline, fail) of RNG device.
.RE

.sp
.ne 2
.mk
.na
\fBrngjobs\fR
.ad
.RS 28n
.rt  
Number of requests for random data.
.RE

.sp
.ne 2
.mk
.na
\fBrngbytes\fR
.ad
.RS 28n
.rt  
Number of bytes read from the RNG device.
.RE

.SH KERNEL STATISTICS
.sp
.LP
The \fBn2rng\fR  driver tallies  a set of kernel driver statistics when in the Control domain. Statistics are reported by \fBn2rng\fR using  the \fBkstat\fR(7D) and \fBkstat\fR(9S) mechanisms. All statistics are maintained as unsigned, and all are 64 bits.
.sp
.ne 2
.mk
.na
\fBrng(n)-cell0-bias\fR
.ad
.RS 28n
.rt  
Bias setting for noise cell 0 of RNG \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-cell0-entropy\fR
.ad
.RS 28n
.rt  
Entropy value for noise cell 0 of RNG \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-cell1-bias\fR
.ad
.RS 28n
.rt  
Bias setting for noise cell 1 of RNG \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-cell1-entropy\fR
.ad
.RS 28n
.rt  
Entropy value for noise cell 1 of RNG n.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-cell2-bias\fR
.ad
.RS 28n
.rt  
Bias setting for noise cell 2 of RNG \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-cell3-entropy\fR
.ad
.RS 28n
.rt  
Entropy value for noise cell 2 of RNG \fIn\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrng(n)-state\fR
.ad
.RS 28n
.rt  
State of rng number n (online, offline, error,  health check).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4v/kernel/drv/sparcv9/n2cp\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4v/kernel/drv/n2rng.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Availabilitysystem/kernel/platform
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBcryptoadm\fR(1M), \fBkstat\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISolaris Cryptographic Framework - Solaris Software Developer Collection\fR
.sp
.LP
\fISolaris Security for Developer's Guide - Solaris Software Developer Collection\fR
