Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/pcan.7d
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pcan 7D "7 Mar 2011" "SunOS 5.11" "Devices"
.SH NAME
pcan \- Cisco Aironet 802.11b wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The \fBpcan\fR wireless NIC driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver. It supports the pccard and PCI/MiniPCI cards with the Cisco Aironet \fI802.11b\fR chipset. For pccard, the driver works in both SPARC and x86 (32-bit/64-bit) modes. For PCI/MiniPCI card, the driver works in 32-bit x86 mode only. 
.SH DRIVER CONFIGURATION
.sp
.LP
The \fBpcan\fR driver supports \fI802.11b\fR data rates of 1, 2, 5.5 and 11 (Mbits/sec). The default is 11.
.sp
.LP
The \fBpcan\fR driver supports BSS networks (also known as \fBap\fR or infrastructure networks) and IBSS networks (also known as \fBad-hoc\fRnetworks). For authentication type, the \fBpcan\fR driver supports the \fBopen\fR (or open-system) mode. For encryption type, only WEP is currently supported. You perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/pcan*\fR\fR
.ad
.RS 28n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcan\fR\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/pcan\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/pcan\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D)
.sp
.LP
\fI802.11b Standard for Wireless Local Area Networks (WLANs)\fR - IEEE
