Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/pcata.7d
'\" te
.\"  Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.TH pcata 7D "2 Mar 2007" "SunOS 5.11" "Devices"
.SH NAME
pcata \- PCMCIA ATA card device driver
.SH SYNOPSIS
.LP
.nf
pcata@socket#:a -u
.fi

.LP
.nf
pcata@socket#:a -u,raw
.fi

.SH DESCRIPTION
.sp
.LP
The \fBPCMCIA ATA\fR card device driver supports \fBPCMCIA ATA\fR disk and flash cards that follow the following standards:
.RS +4
.TP
.ie t \(bu
.el o
\fBPC\fR card 2.01 compliance (\fBMBR+fdisk\fR table required for all platforms).
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBPC\fR card \fBATA\fR 2.01 compliance.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBPC\fR card services 2.1 compliance.
.RE
.sp
.LP
The driver supports standard \fBPCMCIA ATA\fR cards that contain a Card Information Structure (CIS). For \fBPCMCIA,\fR nodes are created in \fB/devices\fR that include the socket number as one component of the device name referred to by the node. However, the names in \fB/dev\fR, \fB/dev/dsk\fR, and \fB/dev/rdsk\fR follow the current conventions for \fBATA\fR devices, which do not encode the socket number in any part of the name. For example, you may have the following:
.sp

.sp
.TS
tab() box;
lw(1.49i) |lw(2.08i) |lw(1.93i) 
lw(1.49i) |lw(2.08i) |lw(1.93i) 
.
\fBPlatform\fR\fB/devices name\fR\fB/dev/dsk name\fR
_
\fBx86\fR\fB/devices/isa/pcic@1,3e0 /disk@0:a\fR/dev/dsk/c1d0s0
_
SPARCT{
\fB/devices/iommu@f,e0000000 /sbus@f,e0001000 /SUNW, pcmcia@3,0 /disk@0:a\fR
T}/dev/dsk/c1d0s0
.TE

.SH PRECONFIGURATION
.sp
.LP
If a PC Card ATA device is recognized, the pcata driver is automatically loaded, IRQs allocated, devices nodes created, and special files created (if they do not already exist).
.SS "Known Problems and Limitations"
.RS +4
.TP
.ie t \(bu
.el o
You need to umount the file system before removing the disk. 
.RE
.RS +4
.TP
.ie t \(bu
.el o
The \fBufs\fR file systems on removable media (PC Card ATA) should have one of the \fBonerror={panic, lock, umount\fR} mount options set. 
.RE
.SH CONFIGURATION
.sp
.LP
Configuration topics include initial installation and configuration, identifying an unrecognized device, special files and hot-plugging. 
.SS "Initial Installation and Configuration"
.RS +4
.TP
1.
Install the Solaris software.
.RE
.RS +4
.TP
2.
Boot the system.
.RE
.RS +4
.TP
3.
Insert the PC card ATA device.
.RE
.SS "Identifying an Unrecognized Device"
.sp
.LP
If you insert a PC card ATA device and it is not recognized (no special files created), use the \fBprtconf\fR command to identify the problem.
.RS +4
.TP
1.
Run the \fBprtconf -D\fR command to see if your \fBpcata\fR card is recognized. (A recognized device will appear at the end of the \fBprtconf\fR output. For example:
.sp
.in +2
.nf
# prtconf -D
\&.  .  .
pcic, instance #0 (driver name: pcic)
    .  .  .
   disk, instance #0
.fi
.in -2

.RE
.RS +4
.TP
2.
If \fBpcata\fR does not appear in the \fBprtconf\fR output, there is a problem with the PC card adapter configuration or with the hardware. Check to see whether the problem is with the card or the adapter by trying to use the card on another machine and by seeing if it works on the same machine using DOS. 
.RE
.SS "Special Files"
.sp
.LP
For PC card devices, nodes are created in \fB/devices\fR that include the socket number as one component of a device name that the node refers to. However, the \fB/prtc/dev\fR names and the names in \fB/dev/dsk\fR and \fB/dev/rdsk\fR do follow the current convention for ATA devices, which do not encode the socket number in any part of the name. 
.SS "Hot-Plugging"
.RS +4
.TP
.ie t \(bu
.el o
If you want to remove the disk, you must unmount the file system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Use the \fBmkfs_pcfs\fR(1M) command to create a \fBpcfs\fR file system: 
.sp
.in +2
.nf
# mkfs -F pcfs /dev/rdsk/c#d#p0:d
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To mount a \fBpcfs\fR file system, type: 
.sp
.in +2
.nf
# mount -F pcfs /dev/dsk/c#d#p0:c /mnt
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
If you want to create a \fBufs\fR file system, use the \fBnewfs\fR command and type: 
.sp
.in +2
.nf
# newfs /dev/rdsk/c#d#s#
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To mount a \fBufs\fR file system, type: 
.sp
.in +2
.nf
# mount -F ufs /dev/dsk/c#d#s# /mnt
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To create a Solaris partition, run the format command and go to the Partition menu. For more information, see the \fBformat\fR(1M) man page.
.RE
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcata\fR\fR
.ad
.RS 21n
.rt  
\fBpcata\fR driver
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/storage/pcata
.TE

.SH SEE ALSO
.sp
.LP
\fBformat\fR(1M), \fBmount\fR(1M), \fBnewfs\fR(1M), \fBpcmcia\fR(7D), \fBattributes\fR(5), \fBpcfs\fR(7FS)
