Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/pcwl.7d
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pcwl 7D "7 Mar 2011" "SunOS 5.11" "Devices"
.SH NAME
pcwl \- Lucent/PrismII 802.11b wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The  \fBpcwl\fR  \fI802.11b\fR wireless NIC driver is a multi- threaded, loadable, clonable, GLDv3-based STREAMS driver. It supports the pccard and PCI/MiniPCI cards with the Lucent and PrismII \fI802.11b\fR chipsets on x86 and SPARC. 
.SH DRIVER CONFIGURATION
.sp
.LP
The \fBpcwl\fR driver supports \fI802.11b\fR data rates of 1, 2, 5.5 and 11 (Mbits/sec). The default is 11.
.sp
.LP
The \fBpcwl\fR driver supports BSS networks (also known as \fBap\fR or infrastructure networks) and IBSS (or \fBad-hoc\fR) networks. For authentication type, the \fBpcwl\fR driver supports the \fBopen\fR(or open-system) mode and the shared-key mode. For encryption type, only WEP is currently supported. You perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/pcwl*\fR\fR
.ad
.RS 28n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcwl\fR\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/pcwl\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/pcwl\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D)
.sp
.LP
\fI802.11b Standard for Wireless Local Area Networks (WLANs)\fR - IEEE
