Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/qlc.7d
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH qlc 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
qlc \- ISP2200, ISP2300, and SP212 Family Fibre Channel host bus adapter driver.
.SH SYNOPSIS
.LP
.nf
SUNW,qlc
.fi

.SH DESCRIPTION
.sp
.LP
The \fBqlc\fR host bus adapter driver is a Sun Fibre Channel transport  layer-compliant  nexus driver for the Qlogic ISP2200, ISP2200A,  ISP2310, ISP2312, and SP212 adapters. These adapters support  Fibre Channel SCSI and  IP Protocols, FC-AL public loop profile, point-to-point fabric connection and Fibre  Channel service classes two and three (see NOTES section below).
.sp
.LP
The \fBqlc\fR driver interfaces with the Sun Fibre Channel transport  layer to support the standard functions provided by the SCSA interface. It  supports auto request sense and tagged  queueing by default. The driver requires that all devices have unique hard addresses in private loop configurations. Devices with conflicting hard addresses are not accessible.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/qlc\fR\fR
.ad
.RS 27n
.rt  
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/qlc\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/qlc\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/qlc.conf\fR\fR
.ad
.RS 27n
.rt  
 Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/fc/qlc
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBfcp\fR(7D), \fBfp\fR(7d)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIANSI X3.230:1994, Fibre Channel Physical Signaling (FC-PH)\fR
.sp
.LP
\fIProject 1134-D, Fibre Channel Generic Services (FC-GS-2)\fR
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Arbitrated Loop (FC-AL)\fR
.sp
.LP
\fIANSI X3.270-1996, Fibre Channel Protocol for  SCSI (FCP-SCSI)\fR
.sp
.LP
\fIANSI X3.270-1996, SCSI-3 Architecture Model (SAM)\fR
.sp
.LP
\fIFibre Channel Private Loop SCSI Direct  Attach  (FC-PLDA)\fR
.sp
.LP
\fIFabric Loop Attachment (FC-FLA)\fR
.sp
.LP
\fIISP2200 Firmware Interface Specification, QLogic Corporation\fR
.sp
.LP
\fIISP2300 Series Firmware Specification, QLogic Corporation\fR
.SH NOTES
.sp
.LP
 SP-212-based host bus adapters (including QLA-210) are supported on x86 platforms only and are limited to a maximum of 8  targets in fabric and sixteen targets in local loop topology. FL topology is not supported with the SP-212-based host bus adapter.
