Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/qlge.7d
'\" te
.\" Copyright (c) 2009, QLogic Corporation. All Rights Reserved
.\" Portions Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH qlge 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
qlge \- 10 Gigabit Ethernet driver for QLogic QLE81XX  Converged Network Adapter Family
.SH SYNOPSIS
.sp
.in +2
.nf
SUNW,qlge
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The \fBqlge\fR 10 Gigabit Ethernet driver is a multi-threaded, Loadable, clonable, GLDv3-based driver. The \fBqlge\fR driver provides basic support including chip initialization, auto-negotiation, packet transmit and receive, Jumbo Frame, promiscuous and multicast support, 802.3x Standard Ethernet Flow Control and Class Based Flow Control (CBFC), Checksum Offload, Large Send Offload (LSO).
.SS "Configuration"
.sp
.LP
The \fBqlge\fR driver is managed by the \fBdladm\fR(1M)command line utility, which allows VLANs to be defined on top of qlge instances and for  qlge instances to be aggregated. See \fBdladm\fR(1M) for details.
.sp
.LP
Users can also modify \fBqlge.conf\fR to change default settings, like \fBmtu\fR, flow control mode, and so forth.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/qlge\fR\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module, x86
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/qlge\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module, x86
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/qlge\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module, SPARC
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/qlge.conf\fR\fR
.ad
.RS 28n
.rt  
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/fc/qlc
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBprtconf\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fIWriting Device Drivers\fR
