Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/se_hdlc.7d
'\" te
.\"  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.TH se_hdlc 7D "1 Jan 1997" "SunOS 5.11" "Devices"
.SH NAME
se_hdlc \- on-board high-performance serial HDLC interface
.SH SYNOPSIS
.LP
.nf
se\fI@bus_address\fR:\fIport_number\fR[, hdlc]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBse_hdlc\fR devices are a synchronous hdlc-framing interface for the  se serial devices. Both built-in serial ports (\fIport_number\fR)  on platforms which have the \fBse\fR serial devices, support synchronous data transfer at a maximum rate of 384 kbps. \fIbus_address\fR is the platform specific  \fBse\fR device bus address. \fIport_number\fR is a single digit number (0-9).
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The \fBse_hdlc\fR\fIn\fR devices provide a data path which supports  the transfer of data via \fBread\fR(2) and \fBwrite\fR(2) system calls, as well as \fBioctl\fR(2) calls.  Data path opens are exclusive in order to protect against injection or diversion of data by another process.
.sp
.LP
The \fBse_hdlc\fR device provides a separate control path for use by programs that need to configure or monitor a connection independent of any exclusive access restrictions imposed by data path opens.  Up to three control paths may be active on a particular serial channel at any one time.  Control path accesses are restricted to \fBioctl\fR(2) calls only; no data transfer is possible.
.sp
.LP
When used in synchronous modes, the SAB 82532 ESCC supports several options for clock sourcing and data encolding. Both the transmit and receive clock sources can be set to be the external Transmit clock (TRxC), external Receive Clock (RTxC), the internal Baud Rate Generator (BRG), or the output of the ESCC 's Digital Phase-Lock Loop (DPLL).
.sp
.LP
The \fBBRG\fR is a programmable divisor that derives a clock frequency from the \fBPCLK\fR input signal to the ESCC. The programmed baud rate is translated into a floating point  (6-bit mantissa, 4-bit exponent) number  time constant that is stored in the ESCC.
.sp
.LP
A local loopback mode is available, primarily for use by \fBsyncloop\fR(1M) for testing purposes, and should not be confused with \fBSDLC\fR loop mode, which is not supported on this interface.  Also, an auto-echo feature may be selected that causes all incoming data to be routed to the transmit data line, allowing the port to act as the remote end of a digital loop. Neither of these options should be selected casually, or left in use when not needed.
.sp
.LP
The \fBse\fR driver keeps running totals of various hardware generated events  for each channel.  These include numbers of packets and characters sent and received, abort conditions detected by the receiver, receive \fBCRC\fR errors, transmit underruns, receive overruns, input errors  and output errors, and message block allocation failures. Input errors are logged whenever an incoming message must be  discarded, such as when an abort or \fBCRC\fR error is detected, a receive overrun occurs, or when no message block is available to store incoming data. Output errors are logged when the data must be discarded due to underruns, \fBCTS\fR drops during transmission, \fBCTS\fR timeouts, or excessive watchdog timeouts caused by a cable break.
.SH IOCTLS
.sp
.LP
The \fBse\fR driver supports the following  \fBioctl()\fR commands.
.sp
.ne 2
.mk
.na
\fB\fBS_IOCGETMODE\fR\fR
.ad
.RS 17n
.rt  
Return a \fBstruct scc_mode\fR containing parameters currently in use. These include the transmit and receive clock sources, boolean loopback and  \fBNRZI\fR mode flags and the integer baud rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS_IOCSETMODE\fR\fR
.ad
.RS 17n
.rt  
The argument is a \fBstruct scc_mode\fR from which the ESCC channel will be programmed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS_IOCGETSTATS\fR\fR
.ad
.RS 17n
.rt  
Return a \fBstruct sl_stats\fR containing the current totals of hardware-generated events. These include numbers of packets and characters sent and received by the driver, aborts and \fBCRC\fR errors detected, transmit underruns, and receive overruns.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS_IOCCLRSTATS\fR\fR
.ad
.RS 17n
.rt  
Clear the hardware statistics for this channel.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS_IOCGETSPEED\fR\fR
.ad
.RS 17n
.rt  
Returns the currently set baud rate as an integer.  This may not reflect the actual data transfer rate if external clocks are used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS_IOCGETMCTL\fR\fR
.ad
.RS 17n
.rt  
Returns the current state of the \fBCTS\fR and \fBDCD\fR incoming modem interface signals as an integer.
.RE

.sp
.LP
The following structures are used with \fBse hdlc\fR \fBioctl()\fR commands:
.sp
.in +2
.nf
struct scc_mode {
 char sm_txclock;    /* transmit clock sources */
 char sm_rxclock;    /* receive clock sources */
 char sm_iflags;     /* data and clock inversion flags (non-zsh) */
 uchar_t sm_config;  /* boolean configuration options */
 int sm_baudrate;    /* real baud rate */
 int sm_retval;      /* reason codes for ioctl failures */
};
struct sl_stats {
 long	ipack;        /* input packets */
 long	opack;        /* output packets */
 long	ichar;        /* input bytes */
 long	ochar;        /* output bytes */
 long	abort;        /* abort received */
 long	crc;          /* CRC error */
 long	cts;          /* CTS timeouts */
 long	dcd;          /* Carrier drops */
 long	overrun;      /* receive overrun */
 long	underrun;     /* transmit underrun */
 long	ierror;       /* input error */
 long	oerror;       /* output error */
 long	nobuffers;    /* receive side memory allocation failure */
};
.fi
.in -2

.SH ERRORS
.sp
.LP
An \fBopen()\fR will fail if a \fBSTREAMS\fR message block cannot be allocated or under the following conditions:
.sp
.ne 2
.mk
.na
\fB\fBENXIO\fR\fR
.ad
.RS 9n
.rt  
The unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEBUSY\fR\fR
.ad
.RS 9n
.rt  
The device is in use by another serial protocol.
.RE

.sp
.LP
An \fBioctl()\fR will fail under the following conditions:
.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 10n
.rt  
An attempt was made to select an invalid clocking source.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 10n
.rt  
The baud rate specified for use with the baud rate generator would translate to a null time constant in the ESCC's registers.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/se_hdlc[0-1], /dev/se_hdlc\fR\fR
.ad
.sp .6
.RS 4n
character-special devices
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/include/sys/ser_sync.h\fR\fR
.ad
.sp .6
.RS 4n
header file specifying synchronous serial communication definitions
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
\fBsyncinit\fR(1M), \fBsyncloop\fR(1M), \fBsyncstat\fR(1M), \fBioctl\fR(2), \fBopen\fR(2), \fBread\fR(2), \fBwrite\fR(2), \fBattributes\fR(5), \fBse\fR(7D), \fBzsh\fR(7D)
.sp
.LP
\fISiemens ESCC2 SAB 82532 Enhanced Serial Communication Controller User's Manual\fR
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBse_hdlc clone open failed, no memory, rq=\fInnn\fR\fR
.ad
.sp .6
.RS 4n
A kernel memory allocation failed for one of the private data structures. The value of \fInnn\fR is the address of the read queue passed to \fBopen\fR(2).
.RE

.sp
.ne 2
.mk
.na
\fBse_hdlc: clone device must be attached before use!\fR
.ad
.sp .6
.RS 4n
An operation was attempted through a control path before that path had been attached to a particular serial channel.
.RE

.sp
.ne 2
.mk
.na
\fBse_hdlc\fIn\fR: not initialized, can't send message\fR
.ad
.sp .6
.RS 4n
An \fBM_DATA\fR message was passed to the driver for a channel that had not been programmed at least once since the driver was loaded.  The ESCC's registers were  in an unknown state.  The \fBS_IOCSETMODE\fR ioctl command performs the programming operation.
.RE

.sp
.ne 2
.mk
.na
\fBse\fIn\fR hdlc_start: Invalid message type \fId\fR on write queue\fR
.ad
.sp .6
.RS 4n
driver received an invalid message type from streams.
.RE

.sp
.ne 2
.mk
.na
\fBse_hdlc\fIn\fR: transmit hung\fR
.ad
.sp .6
.RS 4n
The transmitter was not successfully restarted after the watchdog timer expired. This is usually caused by a bad or disconnected cable.
.RE

