Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/smp.7d
'\" te
.\"  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH smp 7D "27 Aug 2010" "SunOS 5.11" "Devices"
.SH NAME
smp \- Serial Attached Management Protocol target driver
.SH SYNOPSIS
.sp
.LP
\fBsmp@w\fR\fIsas_addr\fR\fB:smp\fR
.SH DESCRIPTION
.sp
.LP
The \fBsmp\fR target driver binds to SMP target devices such as SAS switches or SAS expanders. Unlike a SCSI target  device, SMP target devices do not respond to a SCSI inquiry command. The SCSA framework can not enumerate SMP target devices by using  the standard SCSI probe methods. To enumerate SMP target devices the SAS HBA driver must support target device self-discover and self-enumeration.
.sp
.LP
The \fBsmp\fR driver exports the \fBusmp\fR(7I) interface to user processes.  With the interface, SMP request and response frames are transported between the management applications and SMP target devices.
.SS "Security"
.sp
.LP
The access is restricted and device nodes created by the \fBsmp\fR driver are readable and writable only by processes with the \fBPRIV_SYS_DEVICES\fR privilege exclusively.
.SS "Device Special Files"
.sp
.LP
The SMP target devices have device minor nodes created under the corresponding HBA path in \fB/devices\fR. Convenient links in the \fB/dev/smp\fR directory are created for the device minor nodes.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/smp.conf\fR\fR
.ad
.RS 24n
.rt  
Driver configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/smp/expd\fIX\fR\fR\fR
.ad
.RS 24n
.rt  
\fBsmp\fR device file, where \fIX\fR indicates a SMP target device instance.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusmp\fR(7I)
.sp
.LP
\fISerial Attached SCSI \(em2, Revision 10\fR
.sp
.LP
\fISCSI Primary Commands \(em4, Revision 7a\fR
