Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/sv.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH sv 7D "8 Jun 2007" "SunOS 5.11" "Devices"
.SH NAME
sv \- Storage Volume system call device
.SH DESCRIPTION
.sp
.LP
The \fBsv\fR driver allows standard system call access (see \fBIntro\fR(2)) to a disk device to be redirected into the StorageTek architecture software. This enables standard applications to use Sun StorageTek Availability Suite components such as Point-in-Time Copy and Remote Mirror software.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fBkernel/drv/sv\fR\fR
.ad
.RS 17n
.rt  
SV control and administration driver.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability driver/storage/sv
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBiiadm\fR(1M)
