Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/tavor.7d
'\" te
.\"  Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tavor 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
tavor \- InfiniHost MT23108/MT25208 InfiniBand (IB) Driver
.SH SYNOPSIS
.LP
.nf
PCI   pci15b3,5a44@pci-slot, pci15b3,5a45@pci-slot
.fi

.LP
.nf
PCI-E pci15b3,6278@pci-e-slot, pci15b3,6279@pci-e-slot
.fi

.SH DESCRIPTION
.sp
.LP
The tavor driver is an IB Architecture-compliant implementation of an HCA, which operates on the Mellanox MT23108 InfiniBand ASSP and the Mellanox MT25208 InfiniBand ASSP. These ASSP's support the  link and physical layers of the InfiniBand specification, while the ASSP and the driver support the transport layer.
.sp
.LP
The tavor driver interfaces with the InfiniBand Transport Framework \fB(IBTF\fR) and provides an implementation of the Channel Interfaces that are defined by that framework. It also enables management applications and agents to access the IB fabric.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/tavor\fR
.ad
.RS 29n
.rt  
32-bit ELF kernel module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/tavor\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/sparcv9/tavor\fR
.ad
.RS 29n
.rt  
64-bit ELF Kernel Module (SPARC platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/tavor.conf\fR
.ad
.RS 29n
.rt  
Driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Availabilitydriver/infiniband/tavor
.TE

.SH SEE ALSO
.sp
.LP
\fBdriver.conf\fR(4), \fBattributes\fR(5)
.sp
.LP
\fIWriting Device Drivers\fR
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the system console. 
.sp
.ne 2
.mk
.na
\fBtavor : driver attached for maintenance mode only.\fR
.ad
.sp .6
.RS 4n
There was a failure in the boot process of the tavor ASSP and the only function that can be performed is to re-flash firmware on the ASSP.
.RE

.sp
.ne 2
.mk
.na
\fBdriver failed to attach.\fR
.ad
.sp .6
.RS 4n
The ASSP could not boot into either operational (HCA) mode or into maintenance mode. The device in inoperable.
.RE

.sp
.ne 2
.mk
.na
\fBUnexpected port number in port state change event.\fR
.ad
.sp .6
.RS 4n
A port state change event occurred, but the port number in the message does not exist on this HCA. This message also indicates the port number that was in the port state change.
.RE

.sp
.ne 2
.mk
.na
\fBTavor driver successfully detached.\fR
.ad
.sp .6
.RS 4n
The driver has been removed from the system, and the HCA is no longer available for transfer operations.
.RE

.sp
.ne 2
.mk
.na
\fBtavor"n": port "m" up.\fR
.ad
.sp .6
.RS 4n
A port up asynchronous event has occured. "\fIn\fR" represents the instance of the Tavor device number, and "\fIm\fR" represents the port number on the Tavor device.
.RE

.sp
.ne 2
.mk
.na
\fBtavor"n": port "m" down.\fR
.ad
.sp .6
.RS 4n
A port down aynchronous event has occurred.
.RE

.sp
.ne 2
.mk
.na
\fBTavor: <command name> command failed.\fR
.ad
.sp .6
.RS 4n
A internal firmware command failed to execute.
.RE

