Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/tzmon.7d
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.TH tzmon 7d "31 Oct 2006" "SunOS 5.11" "Devices"
.SH NAME
tzmon \- ACPI Thermal Zone Monitor
.SH DESCRIPTION
.sp
.LP
The \fBtzmon\fR is a pseudo driver that serves as an ACPI thermal zone monitor. Thermal zones are logical regions  within a computer system for which ACPI performs temperature monitoring and control functions. The number of thermal zones on a system with ACPI support varies. For example, some systems may have one or more thermal zones, while others may have none. See the \fIAdvanced Configuration and Power Interface Specification, (ACPI) Version 3.0A.\fR for more details. 
.sp
.LP
The \fBtzmon\fR handles thermal Zone events from ACPI and polls the temperature for each zone exposed  by the ACPI implementation. If threshold temperatures are reached, \fBtzmon\fR takes appropriate action.  For example, if the temperature is sufficiently high and the ACPI implementation supports it, \fBtzmon\fR initiates system shutdown.
.sp
.LP
Note that by default,  system temperature control functions are usually performed by the BIOS and may supersede \fBtzmon\fR functions, depending on the BIOS implementation. Also, many ACPI implementations expose no thermal zones and in these cases, \fBtzmon\fR performs no functions.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/kernel
_
Architecture x86/x64 only
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.sp
.LP
\fIAdvanced Configuration and Power Interface Specification, (ACPI), Version 3.0A.\fR
