Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/uhci.7d
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH uhci 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
uhci \- host controller driver
.SH SYNOPSIS
.LP
.nf
\fBpcivid,pid@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBuhci\fR host controller driver is a \fBUSBA \fR (Solaris USB Architecture) compliant nexus driver that supports the \fIUniversal Host Controller Interface Specification 1.1\fR, an industry standard developed by Intel. The \fBuhci\fR driver supports all USB transfers, including interrupt, control, isochronous and bulk. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/uhci\fR\fR
.ad
.RS 28n
.rt  
32-bit ELF kernel module. (SPARC or x86). 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/uhci\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module. (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/uhci\fR\fR
.ad
.RS 28n
.rt  
64-bit SPARC ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/uhci.conf\fR\fR
.ad
.RS 28n
.rt  
Driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC or  x86  PCI-based systems
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBehci\fR(7D), \fBhubd\fR(7D), \fBohci\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR 
.sp
.LP
\fIUniversal Host Controller Interface Specification for USB 1.1\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.sp
.LP
\fIOracle Solaris Administration: Common Tasks\fR
.sp
.LP
 (http://www.oracle.com)
.SH DIAGNOSTICS
.sp
.LP
All host controller errors are passed to the client drivers. Root errors are documented in \fBhubd\fR(7D).
.sp
.LP
In addition to being logged, the following messages may appear on the system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <uhci><instance number>>: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBNo SOF interrupts have been received. This USB UHCI host controller is unusable.\fR
.ad
.sp .6
.RS 4n
The USB hardware is not generating Start Of Frame interrupts. Please reboot the system. If this problem persists, contact your system vendor.
.RE

