Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/usb_as.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH usb_as 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
usb_as \- USB audio streaming driver
.SH SYNOPSIS
.LP
.nf
sound@unit-address
.fi

.SH DESCRIPTION
.sp
.LP
The \fBusb_as\fR driver is a USBA (Solaris USB Architecture) compliant client driver that supports the \fIUSB Audio Class 1.0\fR specification.
.sp
.LP
The \fBusb_as\fR driver processes audio data messages during play and record and sets sample frequency, precision, encoding and other functions on request from the USB audio control driver. See \fBusb_ac\fR(7D).
.sp
.LP
This driver is plumbed under the USB audio control driver and does not directly interface with the user application.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/usb_as\fR\fR
.ad
.RS 30n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/usb_as\fR\fR
.ad
.RS 30n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/usb_as\fR\fR
.ad
.RS 30n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availabilitysystem/io/usb, driver/audio/audio-usb
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusba\fR(7D), \fBusb_ac\fR(7D), \fBaudio\fR(7I)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIUniversal Serial Bus Specification 1.0 and 1.1\fR
.sp
.LP
\fIOracle Solaris Administration: Common Tasks\fR
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages can appear on the system console. All messages are formatted in the following manner: 
.sp
.in +2
.nf
Warning: <device path> (usb_as<instance num>): Error Message...
.fi
.in -2
.sp

.sp
.LP
where \fI<device path>\fR is the physical path to the device in \fB/devices\fR directory.
.sp
.ne 2
.mk
.na
\fBNo bandwidth available.\fR
.ad
.sp .6
.RS 4n
There is no bandwidth available for the isochronous pipe. As a result, no data is transferred during play and record.
.RE

.sp
.ne 2
.mk
.na
\fBOperating a full/high speed audio device on a high speed port is not supported.\fR
.ad
.sp .6
.RS 4n
The USB software does not currently support full or high speed audio devices connected to an external USB 2.0 hub that is linked to a port of a USB 2.0 host controller. Audio devices must be connected directly to a port of a USB 2.0 controller or to any USB 1.1 port.
.RE

.sp
.ne 2
.mk
.na
\fBCannot access device. Please reconnect <name>.\fR
.ad
.sp .6
.RS 4n
There was an error in accessing the device during reconnect. Please reconnect the device.
.RE

.sp
.ne 2
.mk
.na
\fBDevice is not identical to the previous one on this port. Please disconnect and reconnect.\fR
.ad
.sp .6
.RS 4n
A USB audio streaming interface was hot-removed while open. A new device was hot-inserted which is not identical to the original USB audio device. Please disconnect the USB device and reconnect the device to the same port.
.RE

.SH NOTES
.sp
.LP
The USB audio streaming interface is power managed if the device is idle.
