Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/usb_ia.7d
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH usb_ia 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
usb_ia \- USB interface association driver
.SH SYNOPSIS
.LP
.nf
interface association@unit-address
.fi

.LP
.nf

.fi

.SH DESCRIPTION
.sp
.LP
The \fBusb_ia\fR driver is a USBA (Solaris Universal Serial Bus Architecture)-compliant nexus driver that binds to a device's interface association nodes when no vendor or class specific driver is available. To do this, \fBusb_ia\fR creates nodes for the internal interfaces and then attempts to bind drivers to each child interface.
.sp
.LP
Each interface association node has a parent device node that is created by \fBusb_mid\fR(7D) and all \fBugen\fR(7D) interfaces are exported by \fBusb_mid\fR(7D). (Note: attempting to export \fBugen\fR(7D) interfaces using \fBusb_ia\fR is prohibited.)
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/usb_ia\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/usb_ia\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/usb_ia\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC & x86 PCI-based systems
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5),\fBugen\fR(7D), \fBusb_mid\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR 
.sp
.LP
\fIOracle Solaris Administration: Common Tasks\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0 \(em 2000\fR
.sp
.LP
\fIInterface Association Descriptor Engineering Change Notice (ECN)\(em2003\fR
.sp
.LP
 (http://www.oracle.com)
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the system console. All messages are formatted in the     following manner:
.sp
.in +2
.nf
<device path> (usb_ia<instance num>):message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBNo driver found for interface <n> (nodename: <string>) of <device>.\fR
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

