Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/usbecm.7d
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH usbecm 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
usbecm \- USB communication device class ECM driver
.SH DESCRIPTION
.sp
.LP
The \fBusbecm\fR driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver. It is also a USBA(Solaris USB Architecture) compliant client driver. 
.sp
.LP
\fBusbecm\fRsupports the USB Communication Device Class(CDC) Ethernet Control Model(ECM) subclass devices. You can download the USB CDC-ECM specification from http://www.usb.org.
.SS "Configuration"
.sp
.LP
The regular network interface administration commands, \fBifconfig\fR(1M) and \fBdladm\fR(1M), can be used to manage the ECM interfaces.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/usbecm*\fR\fR
.ad
.sp .6
.RS 4n
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/usbecm\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/usbecm\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/kernel/drv/sparc9/usbecm\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE  TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/network/ethernet/usbecm
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBifconfig\fR(1M), \fBattributes\fR(5), \fBusba\fR(7D)
.sp
.LP
http://www.usb.org
