Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/uwba.7d
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH uwba 7D "16 Aug 2011" "SunOS 5.11" "Devices"
.SH NAME
uwba, uwb \- Solaris UWB Architecture (UWBA)
.SH DESCRIPTION
.sp
.LP
Ultra-WideBand (UWB) radio technology supports high bandwidth for wireless devices. UWBA is a miscellaneous module and it supports radio controller drivers for UWB based devices like HWA (Host Wire Adapter), WHCI (Wireless Host Controller Interface) and so forth. For example, both HWA radio controller driver (\fBhwarc\fR) and \fBwhci\fR driver register to \fBuwba\fR during attach.
.sp
.LP
UWBA provides a series of common interfaces for drivers that support UWB radio technology. Each radio controller driver register itself as a UWB dev to the uwba model in the attach entry, then other driver or module can control this device to perform the UWB functions through a list of common interface. For example, a \fBhwahc\fR driver can control the \fBhwarc\fR driver to scan in a specific channel, start/stop beacon, manage device/MAC address, and so forth.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/uwba\fR\fR
.ad
.RS 29n
.rt  
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/uwba\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/uwba\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Availabilitysystem/io/ultra-wideband
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBhwahc\fR(7D), \fBhwarc\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIECMA-368 High Rate Ultra Wideband PHY and MAC Standard, 1st Edition\fR
.sp
.LP
\fIWireless Host Controller Interface Specification for Certified Wireless Universal Serial Bus, Version 0.95\fR
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
