Arquivotheca/solaris11/usr/man/man/usr/share/man/man7d/zcons.7d
'\" te
.\"  Copyright 2003 Sun Microsystems, Inc. All rights reserved.
.TH zcons 7D "24 Aug 2003" "SunOS 5.11" "Devices"
.SH NAME
zcons \- Zone console device driver
.SH DESCRIPTION
.sp
.LP
The \fBzcons\fR character driver exports the console for system zones. The driver is comprised of two "sides:" a master side with which applications in the global zone communicate, and a slave side, which receives I/O from the master side. The slave side is available in the global zones.
.sp
.LP
Applications must not depend on the location of \fB/dev\fR or \fB/devices\fR entries exported by \fBzcons\fR. Inside a zone, the \fBzcons\fR slave  side is fronted by \fB/dev/console\fR and other console-related  symbolic links, which are used by applications that expect to write to the system console.
.sp
.LP
The \fBzcons\fR driver is Sun Private, and may change in future releases.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/zcons/<\fIzonename\fR>/masterconsole\fR \fR
.ad
.sp .6
.RS 4n
Global zone master side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/zcons/<\fIzonename\fR>/slaveconsole\fR \fR
.ad
.sp .6
.RS 4n
Global zone slave side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/zconsole\fR \fR
.ad
.sp .6
.RS 4n
Non-global zone console (slave side).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
 Interface StabilitySun Private
.TE

.SH SEE ALSO
.sp
.LP
\fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBzones\fR(5)
