Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/add_allocatable.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH add_allocatable 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
add_allocatable \- 割り当てデータベースへのエントリの追加
.SH 形式
.LP
.nf
\fB/usr/sbin/add_allocatable\fR [\fB-f\fR] [\fB-s\fR] [\fB-d\fR] \fB-n\fR \fIname\fR \fB-t\fR \fItype\fR \fB-l\fR \fIdevice-list\fR 
    [\fB-a\fR \fIauthorization\fR] [\fB-c\fR \fIclean\fR] [\fB-o\fR \fIkey\fR=\fIvalue\fR]
.fi

.SH 機能説明
.sp
.LP
\fBadd_allocatable\fR は、ユーザーが割り当て可能なデバイス用の新規エントリを作成します。このデバイスは、デバイス割り当てメカニズムにより管理されます。\fBadd_allocatable\fR を使用して、この種のデバイスの既存エントリを更新することもできます。
.sp
.LP
\fBadd_allocatable\fR を使用して、デバイス割り当てメカニズムによりラベル範囲が管理される、プリンタなどの割り当て不可能なデバイスのエントリを作成および更新することもできます。
.sp
.LP
\fBadd_allocatable\fR をシェルスクリプト (ドライバパッケージのインストールスクリプトなど) 内で実行して、新規デバイスの設定に関する管理作業を自動化できます。
.sp
.LP
割り当て可能なデバイスの名前とタイプ、属性、およびデバイスパスについては、\fBlist_devices\fR(1) を参照してください。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 20n
.rt  
指定された情報を使って、既存のエントリを強制的に更新します。このオプションを指定しない場合、指定したデバイス名を持つエントリが既に存在すると、\fBadd_allocatable\fR はエラーを出力して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 20n
.rt  
サイレントモードを有効にします。\fBadd_allocatable\fR は、エラーや警告メッセージを一切出力しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 20n
.rt  
このオプションが指定されている場合、\fBadd_allocatable\fR は、\fB-t\fR で指定されたデバイスタイプのシステム指定のデフォルト属性を更新します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIname\fR\fR
.ad
.RS 20n
.rt  
\fIname\fR で指定されたデバイスのエントリを追加または更新します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR\fR
.ad
.RS 20n
.rt  
\fItype\fR で指定されたタイプのデバイスエントリを追加または更新します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIdevice-list\fR\fR
.ad
.RS 20n
.rt  
\fB-n\fR で指定されたデバイスへのデバイスパスを追加または更新します。\fIdevice-list\fR 内の複数のパスは、スペースで区切る必要があります。また、リストは引用符で囲む必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIauthorization\fR\fR
.ad
.RS 20n
.rt  
\fB-n\fR で指定されたデバイス、または \fB-t\fR で指定されたタイプのデバイスに関連付けられている承認を追加または更新します。複数の承認を指定する場合は、リストをコンマで区切り、引用符で囲む必要があります。デバイスが割り当て不可能な場合、\fIauthorization\fR をアスタリスク (*) を使って指定し、引用符で囲む必要があります。すべてのユーザーがデバイスを割り当て可能である場合は、\fIauthorization\fR をアットマーク (@) を使って指定し、引用符で囲む必要があります。デフォルトの承認は '@' です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclean\fR\fR
.ad
.RS 20n
.rt  
\fB-n\fR で指定されたデバイス、または \fB-t\fR で指定されたデバイスタイプに対して \fBdevice_clean\fR(5) プログラム \fIclean\fR を使用するように指定します。デフォルトの clean プログラムは \fB/bin/true\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIkey\fR=\fI value\fR\fR
.ad
.RS 20n
.rt  
\fB-n\fR で指定されたデバイス、または \fB-t\fR で指定されたデバイスタイプに対して、コロンで区切られた \fB\fIkey\fR=\fIvalue\fR\fR ペアの文字列を受け入れます。現在、システムにより解釈されるキーを次に示します。
.sp
.ne 2
.mk
.na
\fB\fBminlabel\fR\fR
.ad
.RS 12n
.rt  
デバイスを使用可能な最下位のラベル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmaxlabel\fR\fR
.ad
.RS 12n
.rt  
デバイスを使用可能な最上位のラベル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclass\fR\fR
.ad
.RS 12n
.rt  
デバイスの論理グループを指定します。たとえば、すべての Sun Ray\u\s-2TM\s+2\d デバイスの、すべてのデバイスタイプは論理グループです。\fBclass\fR キーワードにはデフォルト値はありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxdpy\fR\fR
.ad
.RS 12n
.rt  
X セッションの表示名を指定します。このキーワードは、X セッションに関連するデバイスを特定するために使用します。\fBxdpy\fR キーワードにはデフォルト値はありません。
.RE

.RE

.SH 終了ステータス
.sp
.LP
成功した場合、\fBadd_allocate\fR は終了ステータス \fB0\fR (真) を返します。エラーが発生した場合、\fBadd_allocate\fR は、0 以外の終了ステータスを返します。終了コードとその意味を次に示します。
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
呼び出し時の構文エラー
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
原因不明のシステムエラー
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
指定されたデバイスのエントリは既に存在します。このエラーは、\fB-f\fR オプションが指定されていない場合にのみ発生します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 5n
.rt  
アクセス権が与えられていません。ユーザーは、DAC または MAC アクセス記録の更新を保持していません。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.82i) |cw(2.68i) 
lw(2.82i) |lw(2.68i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
呼び出しは不確実です。オプションは不確実です。出力は非インタフェースです。
.SH 関連項目
.sp
.LP
\fBallocate\fR(1), \fBdeallocate\fR(1), \fBlist_devices\fR(1), \fBremove_allocatable\fR(1M ), \fBattributes\fR(5), \fBdevice_clean\fR(5)
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
