Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/cfgadm_pci.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.TH cfgadm_pci 1M "2009 年 8 月 27 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
cfgadm_pci \- cfgadm の PCI、CompactPCI、および PCI Express ホットプラグ対応ハードウェア固有のコマンド
.SH 形式
.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-f\fR] [\fB-y\fR | \fB-n\fR] [\fB-v\fR] 
     [\fB-o\fR \fIhardware_options\fR] \fB-c\fR \fIfunction\fR \fIap_id\fR [\fIap_id\fR]
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-f\fR] [\fB-y\fR | \fB-n\fR] [\fB-v\fR] 
     [\fB-o\fR \fIhardware_options\fR] \fB-x\fR \fIhardware_function\fR \fIap_id\fR 
     [\fIap_id\fR]
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-v\fR] [\fB-s\fR \fIlisting_options\fR] 
     [\fB-o\fR \fIhardware_options\fR] [\fB-l\fR [\fIap_id\fR | \fIap_type\fR]]
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-v\fR] [\fB-o\fR \fIharware_options\fR] \fB-t\fR \fIap_id\fR [\fIap_id\fR]
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-v\fR] [\fB-o\fR \fIhardware_function\fR] \fB-h\fR 
     [\fIap_id\fR| \fIap_type\fR]
.fi

.SH 機能説明
.sp
.LP
PCI ハードウェア固有のライブラリ \fB/usr/lib/cfgadm/pci.so.1\fR では、\fBcfgadm\fR コマンド (\fBcfgadm\fR(1M) を参照) を使用した、ホットプラグ対応システムの各ホットプラグ対応スロットへの PCI および CompactPCI アダプタカードのホットプラグ操作がサポートされています。このライブラリでは、別のライブラリで提供される PCI Express ホットプラグ対応または標準 PCI ホットプラグ対応アダプタカード (\fBcfgadm_shp\fR(1M) を参照) はサポートされません。このドキュメントに示されている点を除き、PCI と CompactPCI 間のホットプラグ管理モデルは同じです。
.sp
.LP
PCI ホットプラグの場合、特定の PCI バス上の各ホットプラグスロットは、その特定の PCI バスの接続点によって表されます。 
.sp
.LP
接続点は、受容体と占有装置の 2 つの部分で構成されます。通常、PCI ホットプラグにおける受容体は、物理ホットプラグ対応スロットと見なされ、占有装置はスロットに接続される PCI アダプタカードと見なされます。\fB\fR\fB\fR 
.sp
.LP
接続点には、\fBap_id\fR を通じて名前が付けられます。\fBap_id\fR には、論理 ap_id と物理 ap_id の 2 種類があります。物理 \fBap_id\fR は物理パス名 (つまり、\fB/devices/pci@1/hpc0_slot3\fR) に基づきます。一方、論理 \fBap_id\fR はより短く、ユーザーにわかりやすい名前です。PCI ホットプラグ対応スロットの場合、通常 \fBap_id\fR は対応するホットプラグコントローラドライバ名に論理スロット番号を加えたものです。つまり、\fBpci0:hpc0slot1\fR は、\fBhpc\fR というホットプラグコントローラドライバとスロット番号 \fB1\fR を含む PCI 連結ドライバです。PCI ホットプラグの \fBap_type\fR は \fBpci\fR です。
.sp
.LP
\fBap_type\fR は、\fBType\fR フィールドの情報と同じではない点に注意してください。
.sp
.LP
ホットプラグプロシージャについての詳細は、\fI\fRを参照してください。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIfunction\fR\fR
.ad
.sp .6
.RS 4n
PCI ホットプラグ対応スロットでは、次の\fI関数\fRがサポートされています。
.sp
.ne 2
.mk
.na
\fBconfigure\fR
.ad
.sp .6
.RS 4n
スロット上の PCI デバイスが Solaris で使用されるように構成します。
.RE

.sp
.ne 2
.mk
.na
\fBconnect\fR
.ad
.sp .6
.RS 4n
スロットを PCI バスに接続します。
.RE

.sp
.ne 2
.mk
.na
\fBdisconnect\fR
.ad
.sp .6
.RS 4n
PCI バスからスロットを切断します。
.RE

.sp
.ne 2
.mk
.na
\fBinsert\fR
.ad
.sp .6
.RS 4n
サポートされていません。
.RE

.sp
.ne 2
.mk
.na
\fBremove\fR
.ad
.sp .6
.RS 4n
サポートされていません。
.RE

.sp
.ne 2
.mk
.na
\fBunconfigure\fR
.ad
.sp .6
.RS 4n
PCI デバイスのリソースをシステムから論理的に削除します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
サポートされていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIap_id\fR | \fIap_type\fR\fR
.ad
.sp .6
.RS 4n
PCI ホットプラグ固有のヘルプメッセージを出力します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlist\fR\fR
.ad
.sp .6
.RS 4n
PCI ホットプラグスロットの値を一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fIhardware_options\fR\fR
.ad
.sp .6
.RS 4n
現在定義されているハードウェア固有のオプションはありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fIlisting_options\fR\fR
.ad
.sp .6
.RS 4n
汎用の \fBcfgadm\fR(1M) と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIap_id\fR\fR
.ad
.sp .6
.RS 4n
このコマンドは、スロットでテスト機能をサポートするプラットフォームでのみサポートされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
詳細モードで実行します。
.sp
\fB-v\fR オプションを \fB-l\fR オプションとともに使用すると、\fBcfgadm\fR コマンドによって、接続点に関する情報が出力されます。PCI Express 階層内に存在する PCI ホットプラグの接続点については、\fBcfgadm_shp\fR(1M) を参照してください。PCI Express 階層内に存在しない PCI ホットプラグの接続点については、スロットのシステムラベルがあれば \fBInformation\fR フィールドに表示されます。この文字列は、スロットのバスノードの \fBslot-name\fR プロパティーから取得されます。\fBType\fR フィールドの情報は、\fBv\fR オプションを指定したかどうかにかかわらず出力されます。占有装置の \fBType\fR フィールドは、スロットの内容を示します。次の 2 種類の値があります。 
.sp
.ne 2
.mk
.na
\fBunknown\fR
.ad
.sp .6
.RS 4n
スロットは空です。スロットにカードが装着されている場合、カードが構成されていないか、カード上のデバイスのドライバがありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsubclass\fR/\fIboard\fR\fR
.ad
.sp .6
.RS 4n
スロットに装着されているカードは、シングルファンクションデバイスまたはマルチファンクションデバイスです。
.sp
\fIsubclass\fR はデバイスのサブクラスコードを表す文字列であり、SCSI、\fBethernet\fR、\fBpci-isa\fR などが示されます。カードがマルチファンクションデバイスである場合、代わりに \fBMULT\fR が出力されます。
.sp
\fIboard\fR は、デバイスのボードタイプを表す文字列です。たとえば、hp は PCI ホットプラグアダプタ、hs はホットスワップボード、nhs は非ホットスワップ cPCI ボード、bhs はベーシックホットスワップ cPCI ボード、fhs はフルホットスワップ cPCI ボードで使用される文字列です。
.sp
複数のデバイスが搭載された PCI カードはマルチファンクションデバイスではありませんが、背後に任意のデバイスが搭載された PCI ブリッジとして実装されます。このような場合、表示されるサブクラスはその PCI ブリッジのものです。一般には、ブリッジは \fBpci-pci\fR (PCI ブリッジへの汎用 PCI) または \fBstpci\fR (半透過性 PCI ブリッジ) です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fIhardware_function\fR\fR
.ad
.sp .6
.RS 4n
ハードウェア固有の関数を実行します。通常は、これらのハードウェア固有の機能を使用して、受容体または占有装置の状態を変更しないでください。 
.sp
次の \fIhardware_functions\fR がサポートされています。
.sp
.ne 2
.mk
.na
\fBenable_slot | disable_slot\fR
.ad
.sp .6
.RS 4n
スロットの状態を変更し、リブート後もスロットの状態を保持します。リブート後の状態の保持は、一部のプラットフォームでのみサポートされます。
.sp
\fBenable_slot\fR は、ホットプラグイン用およびブート時に、このスロットへのハードウェアの追加を有効にします。
.sp
\fBdisable_slot\fR は、ホットプラグイン用およびブート時に、このスロットへのハードウェア追加を無効にします。スロットを無効にすると、状態は unusable と表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBenable_autoconfig | disable_autoconfig\fR
.ad
.sp .6
.RS 4n
スロットの占有装置を自動構成する機能を変更します。自動構成がサポートされているプラットフォームのみが、この機能をサポートします。
.sp
\fBenable_autoconfig\fR は、スロットを自動構成する機能を有効にします。
.sp
\fBdiable_autoconfig\fR は、スロットを自動構成する機能を無効にします。
.sp
自動構成は、PCI Express プラットフォームのアテンションボタンおよび CompactPCI プラットフォームの取り付け/取り外しレバーから実行されます。自動構成を無効にすると、アテンションボタンまたはレバーメカニズムを使用してスロットの占有装置を構成できなくなります。
.RE

.sp
.ne 2
.mk
.na
\fBled=[\fIled_sub_arg\fR],mode=[\fImode_sub_arg\fR]\fR
.ad
.sp .6
.RS 4n
サブ引数を指定しない場合、現在の LED 設定の一覧を出力します。サブ引数を指定した場合、スロットの特定の LED のモードが設定されます。 
.sp
\fIled_sub_arg\fR は、\fBfault\fR、\fBpower\fR、\fBattn\fR、または \fBactive\fR に指定します。 
.sp
\fImode_sub_arg\fR は、\fBon\fR、\fBoff\fR、または \fBblink\fR に指定します。
.sp
LED の状態を変更しても、受容体または占有装置の状態は変更されません。通常は、LED はホットプラグコントローラによって制御され、ユーザーの操作は不要です。このコマンドは、テストのために使用します。
.sp
\fB注意:\fR LED の状態を変更すると、占有装置または受容体の状態が誤って示される場合があります。
.sp
次のコマンドは、LED の値を出力します。
.sp
.in +2
.nf
example#  \fBcfgadm -x led pci0:hpc0_slot1\fR
Ap_Id             Led
pci0:hpc0_slot1   power=on,fault=off,active=off,attn=off
.fi
.in -2
.sp

次のコマンドは、Fault LED をオンに設定します。
.sp
.in +2
.nf
example# \fBcfgadm -x led=fault,mode=on pci0:hpc0_slot1\fR
.fi
.in -2
.sp

次のコマンドは、Power LED をオフに設定します。
.sp
.in +2
.nf
example# \fBcfgadm -x led=power,mode=off pci0:hpc0_slot0\fR
.fi
.in -2
.sp

次のコマンドは、\fBアクティブな\fR LED が点滅してスロットの場所を示すように設定します。	
.sp
.in +2
.nf
example# \fBcfgadm -x led=active,mode=on pci0:hpc0_slot3\fR
.fi
.in -2
.sp

.RE

.RE

.SH 使用例
.LP
\fB例 1 \fR各スロットの値の出力
.sp
.LP
次のコマンドは、各スロットの値を出力します。

.sp
.in +2
.nf
example# \fBcfgadm -l\fR
Ap_Id            Type         Receptacle   Occupant       Condition
c0               scsi-bus     connected    configured     unknown
c1               scsi-bus     connected    unconfigured   unknown
c2               scsi-bus     connected    unconfigured   unknown
cpci_slot1       stpci/fhs    connected    configured     ok
cpci_slot2       unknown      empty        unconfigured   unknown
cpci_slot4       stpci/fhs    connected    configured     ok
cpci_slot5       stpci/fhs    connected    configured     ok
.fi
.in -2
.sp

.LP
\fB例 2 \fRカードの交換
.sp
.LP
次のコマンドは、すべての DR 対応の接続点を一覧表示します。

.sp
.in +2
.nf
example# \fBcfgadm\fR


Type             Receptacle   Occupant     Condition
c0               scsi-bus     connected    configured     unknown
c1               scsi-bus     connected    unconfigured   unknown
c2               scsi-bus     connected    unconfigured   unknown
cpci_slot1       stpci/fhs    connected    configured     ok
cpci_slot2       unknown      empty        unconfigured   unknown
cpci_slot4       stpci/fhs    connected    configured     ok
cpci_slot5       stpci/fhs    connected    configured     ok
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、カードを構成解除して電気的に切断します。

.sp
.in +2
.nf
example# \fBcfgadm -c disconnect cpci_slot4\fR
.fi
.in -2
.sp

.sp
.LP
次のコマンドを入力して変更を確認できます。

.sp
.in +2
.nf
example# \fBcfgadm cpci_slot4\fR 


Ap_Id                   Type         Receptacle   Occupant     Condition
cpci_slot4              unknown      disconnected unconfigured unknown
.fi
.in -2
.sp

.sp
.LP
この時点で、カードを交換できるようになります。次のコマンドは、カードを電気的に接続して構成します。

.sp
.in +2
.nf
example# \fBcfgadm -c configure cpci_slot4\fR
.fi
.in -2
.sp

.sp
.LP
次のコマンドを入力すると、変更を検証できます。

.sp
.in +2
.nf
example# \fBcfgadm cpci_slot4\fR 


Ap_Id                   Type         Receptacle   Occupant     Condition
cpci_slot4              stpcipci/fhs connected    configured   ok
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/cfgadm/pci.so.1\fR\fR
.ad
.sp .6
.RS 4n
PCI ホットプラグ操作のためのハードウェア固有のライブラリです。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/library
.TE

.SH 関連項目
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_shp\fR(1M), \fBconfig_admin\fR(3CFGADM), \fBlibcfgadm\fR(3LIB), \fBattributes\fR(5)
.sp
.LP
\fI\fR
