Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/chk_encodings.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH chk_encodings 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
chk_encodings \- ラベルエンコーディングファイルの構文の検査
.SH 形式
.LP
.nf
\fB/usr/sbin/chk_encodings\fR [\fB-a\fR] [\fB-c\fR \fImaxclass\fR] [\fIpathname\fR]
.fi

.SH 機能説明
.sp
.LP
\fBchk_encodings\fR は、\fIpathname\fR で指定されたラベルエンコーディングファイルの構文を検査します。\fB-a\fR オプションを使用すると、\fBchk_encodings\fR は、\fIpathname\fR で指定されたラベルエンコーディングファイルの意味解析も出力します。\fIpathname\fR が指定されない場合、\fBchk_encodings\fR は \fB/etc/security/tsol/label_encodings\fR ファイルを検査および解析します。
.sp
.LP
ラベルエンコーディングファイルの解析が要求された場合、エラーが検出された場合でも、実施可能な解析が標準出力ファイルに書き込まれます。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 15n
.rt  
ラベルエンコーディングファイルの意味解析を実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fImaxclass\fR\fR
.ad
.RS 15n
.rt  
ラベルエンコーディングファイルの \fBCLASSIFICATIONS\fR セクションに指定可能な最大格付け値 \fImaxclass\fR (デフォルトは 255) を指定します。
.RE

.SH 終了ステータス
.sp
.LP
正常終了時、\fBchk_encodings\fR は終了ステータス \fB0\fR (真) を返し、\fIpathname\fR 内にエラーが検出されなかったことを示すメッセージを標準出力ファイルに書き込みます。それ以外の場合、\fBchk_encodings\fR はゼロ以外 (偽) の終了コードを返し、診断メッセージを標準出力ファイルに書き込みます。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/label_encodings\fR\fR
.ad
.sp .6
.RS 4n
ラベルエンコーディングファイルには、このシステムの定義済みラベルに対する格付け名、語句、制約、および値が含まれます。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
_
標準T{
DDS-2600-6216-93、『\fIコンパートメントモードワークステーションのラベル作成: エンコード形式\fR』、1993 年 9 月
T}
.TE

.sp
.LP
コマンド出力は非インタフェースです。コマンド呼び出しは、DIA MAC ポリシーを実装するシステムでは「確実」です。
.SH 関連項目
.sp
.LP
\fBlabel_encodings\fR(4), \fBattributes\fR(5), \fBlabels\fR(5)
.sp
.LP
\fI「How to Analyze and Verify the label_encodings File」\fR in \fI『Solaris Trusted Extensions Label Administration』\fR
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
.sp
.LP
このファイルは、米国国防情報局 (DIA) の必須アクセス制御 (MAC) ポリシーの一部です。このファイルは、Solaris Trusted Extensions ソフトウェアの将来のリリース向けに作成されるその他の MAC ポリシーには適用されない可能性があります。
