Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/df.1m
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved Portions
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH df 1M "2010 年 9 月 23 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
df \- 使用可能なディスクブロックおよび使用可能なファイル数の表示
.SH 形式
.LP
.nf
\fBdf\fR [\fB-F\fR \fIFSType\fR] [\fB-abeghklntPVvZ\fR] 
     [\fB-o\fR \fIFSType-specific_options\fR] 
     [\fIblock_device\fR | \fIdirectory\fR | \fIfile\fR | \fIresource\fR ...]
.fi

.SH 機能説明
.sp
.LP
\fBdf\fR コマンドは、マウントされているもしくはマウントされていないファイルシステムが使用しているディスク容量を表示します。さらに、使用中の容量、使用可能な容量、ファイルシステムの全容量のうちどの程度が使用されたかを表示します。対象のファイルシステムとしては、デバイス、または特定のファイルシステム上のファイルあるいはディレクトリを指定します。
.sp
.LP
オペランドもオプションも指定せずに \fBdf\fR を実行すると、全ファイルシステムに関する情報が出力されます。
.sp
.LP
\fBdf\fR は一部の \fIFSTypes\fR (ファイルシステムタイプ) でサポートされない場合があります。
.sp
.LP
自動マウンタがまだマウントしていないネットワーク上のマウントポイントで \fBdf\fR を実行する場合、ファイルシステムサイズの情報がゼロとして出力されます。自動マウンタがファイルシステムをマウントすると、サイズの情報は正確に出力されるようになります。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
\fB/etc/mnttab\fR のエントリ (\fBmnttab\fR(4) を参照) に \fBignore\fR オプションセットを含むファイルシステムについても情報を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
使用可能な容量の合計を、K バイト単位で報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
使用可能なファイル数だけを報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.sp .6
.RS 4n
df コマンドが動作する \fIFSType\fR を指定します。\fB-F\fR オプションはマウントされていないファイルシステムを使用するためのオプションです。\fIFSType\fR は、このオプションで指定するか、あるいは \fB/etc/vfstab\fR 内の記述(\fBvfstab\fR(4) を参照) から特定できるようにしておく必要があります。後者の場合、具体的には \fIdirectory\fR、\fIblock_device\fR、または \fIresource\fR 引数の指定値とテーブル中のエントリの値を一致させるか、あるいは \fB/etc/default/fs\fR を参照して決定されます。詳細は \fBdefault_fs\fR(4) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
\fBstatvfs\fR(2) 構造体全体を報告します。このオプションはマウントされているファイルシステムに対してのみ有効です。\fB-o\fR オプションと同時に指定することはできません。このオプションは、\fB-b\fR、\fB-e\fR、\fB-k\fR、\fB-n\fR、\fB-P\fR、\fB-t\fR の各オプション (指定されている場合) よりも優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fB-k\fR と似ていますが、サイズ情報がより読みやすい形式で表示されます。1 つのファイルシステムにつき 1 行の情報が出力されます。情報の内容は、ファイルシステム名、そのファイルシステムに割り当てられている容量の合計、既存のファイルに割り当てられている容量の合計、特権を持たないユーザーが新たなファイルを生成する場合に使用できる容量の合計、そのファイルシステム上の全ファイルに現在割り当てられている通常使用可能な容量の割合 (パーセント単位) です。すべてのサイズは縮小され、読みやすい形式で表示されます。たとえば、\fB14K\fR、\fB234M\fR、\fB2.7G\fR、\fB3.0T\fR などのようになります。縮尺は、\fB1024\fR を除数として行われます。 
.sp
このオプションは \fB-b\fR、\fB-e\fR、\fB-g\fR、\fB-k\fR、\fB-n\fR、\fB-t\fR、および \fB-V\fR オプションを無効にします。このオプションはマウントされているファイルシステム上でのみ有効であり、\fB-o\fR オプションと一緒には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.sp .6
.RS 4n
割り当てられているディスク容量を K バイト単位で出力します。1 つのファイルシステムにつき 1 行の情報が出力されます。情報の内容は、ファイルシステム名、そのファイルシステムに割り当てられている容量の合計、既存のファイルに割り当てられている容量の合計、特権を持たないユーザーが新たなファイルを生成する場合に使用できる容量の合計、そのファイルシステム上の全ファイルに現在割り当てられている通常使用可能な容量の割合 (パーセント単位) です。このオプションは、\fB-b\fR、\fB-e\fR、\fB-n\fR、および \fB-t\fR オプションを無効にします。また、\fB-v\fR オプションと同時に指定できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
ローカルファイルシステムについての情報だけを報告します。このオプションはマウントされているファイルシステムに対してのみ有効です。\fB-o\fR オプションと同時に指定することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fIFSType\fR の名前だけを報告します。オペランド指定を省略すると、このオプションはマウントされているファイルシステムタイプの一覧を出力します。このオプションはマウントされているファイルシステムに対してのみ有効です。\fB-o\fR オプションと同時に指定することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIFSType-specific_options\fR\fR
.ad
.sp .6
.RS 4n
\fIFSType\fR 固有のオプションを指定します。オプションとオプションとの間はコンマだけで区切り、スペースは入れないでください。詳細については \fIFSType\fR コマンド用のマニュアルページを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
合計値を含む完全なリストを出力します。このオプションは、\fB-b\fR、\fB-e\fR、\fB-n\fR の各オプション (指定されている場合) よりも優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
\fB-h\fR オプションと同じですが、出力の単位は 512 バイトとなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
指定されたコマンド行の全内容のエコーだけを行い、コマンド自体は実行しません。コマンド行の内容としては、ユーザーが指定したオプションやオペランドに加え、\fB/etc/mnttab\fR、\fB/etc/vfstab\fR、\fB/etc/default/fs\fR の各ファイルから得られた情報が付加されます。このオプションは、コマンド行を確認および検証するときに使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
\fB-k\fR オプションと似ていますが、サイズ情報がそれぞれのファイルシステムを構成する最小ブロックサイズの倍数で表示されます。 
.sp
\fB-k\fR オプションと同時に指定できません。
.sp
1 つのファイルシステムにつき 1 行の情報が出力されます。1 行の情報の内容は次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステムのマウントポイント
.RE
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステム名
.RE
.RS +4
.TP
.ie t \(bu
.el o
そのファイルシステムに割り当てられているブロックの合計数
.RE
.RS +4
.TP
.ie t \(bu
.el o
既存のファイルに割り当てられているブロック数
.RE
.RS +4
.TP
.ie t \(bu
.el o
特権を持たないユーザーが新たなファイルを生成する場合に使用できるブロック数
.RE
.RS +4
.TP
.ie t \(bu
.el o
ファイルに使用されているブロックの割合 (パーセント単位)
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
すべての可視ゾーン内にあるマウントを表示します。デフォルトでは、\fBdf\fR は、現在のゾーン内にあるマウントだけを表示します。このオプションは、非大域ゾーンでは効果がありません。
.RE

.SH オペランド
.sp
.LP
\fBdf\fR ユーティリティーは、\fIblock_device\fR、\fIdirectory\fR、\fIfile\fR、\fIresource\fR の優先度に従ってオペランドを解釈します。次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIblock_device\fR\fR
.ad
.sp .6
.RS 4n
ブロック型特殊デバイス (たとえば、\fB/dev/dsk/c1d0s7\fR) を表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdirectory\fR\fR
.ad
.sp .6
.RS 4n
有効なディレクトリ名を指定します。\fBdf\fR は \fIdirectory\fR を含むファイルシステムについて報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.sp .6
.RS 4n
有効なファイル名を指定します。\fBdf\fR は \fIfile\fR があるファイルシステムについて報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR リソース名を指定します。
.RE

.SH 使用法
.sp
.LP
ファイルが 2G バイト (2^31 バイト) 以上ある場合の \fBdf\fR の動作については、\fBlargefile\fR(5)を参照してください。
.SH 使用例
.LP
\fB例 1 \fR\fBdf\fR コマンドを実行する
.sp
.LP
以下は、\fBdf\fR コマンドとその出力の例です。

.sp
.in +2
.nf
example% \fB/usr/bin/df\fR

/                  (/dev/dsk/c0t0d0s0 ):  287530 blocks    92028 files
/system/contract   (ctfs              ):       0 blocks 2147483572 files
/system/object     (objfs             ):       0 blocks 2147483511 files
/usr               (/dev/dsk/c0t0d0s6 ): 1020214 blocks   268550 files
/proc              (/proc             ):       0 blocks      878 files
/dev/fd            (fd                ):       0 blocks        0 files
/etc/mnttab        (mnttab            ):       0 blocks        0 files
/var/run           (swap              ):  396016 blocks     9375 files
/tmp               (swap              ):  396016 blocks     9375 files
/opt               (/dev/dsk/c0t0d0s5 ):  381552 blocks    96649 files
/export/home       (/dev/dsk/c0t0d0s7 ):  434364 blocks   108220 files
.fi
.in -2
.sp

.sp
.LP
各列は、左から、マウントポイント、デバイス (または、\fBdf\fR \fB-k\fR による「ファイルシステム」)、空きブロック、および空きファイルを示します。contract ファイルシステムの場合、マウントポイントは \fB/system/contract\fR、ファイルシステムは \fBctfs\fR (\fBSMF\fR が使用)、空きブロックは 0、そして、空きファイルは 2147483582 (\fBINTMAX\fR-1) です。object ファイルシステムの場合、マウントポイントは \fB/system/object\fR、ファイルシステムは \fBobjfs\fR (\fBobjfs\fR(7FS) を参照)、空きブロックは 0、そして、空きファイルは 2147483511 です。
.LP
\fB例 2 \fRファイルシステム \fB/usr\fR に関する情報を出力する
.sp
.LP
次の例は、ファイルシステム \fB/usr\fR に関する情報を出力します。

.sp
.in +2
.nf
example% \fB/usr/bin/df -P /usr\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRファイルシステム \fB/usr\fR に関する情報を出力する (/usr/src が /usr ファイルシステムの一部である場合)
.sp
.LP
\fB/usr/src\fR が \fB/usr\fR ファイルシステムの一部である場合、次の例も前述の例と同じ結果を出力します。

.sp
.in +2
.nf
example% \fB/usr/bin/df -P /usr/src\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRすべての ufs ファイルシステムの i ノード使用率を表示する\fB\fR
.sp
.LP
次の例は、すべての  \fBufs\fR ファイルシステムにおける i ノードの使用率を表示します。

.sp
.in +2
.nf
example%\fB/usr/bin/df -F ufs -o i\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
設定した場合、通常ファイルを表示するヘッダーは、すべてノードを表示するようになります。\fB\fR\fB\fR\fBdf\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。 \fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/*\fR\fR
.ad
.sp .6
.RS 4n
ディスクデバイス
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/fs\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのローカルのファイルシステムタイプ。デフォルト値は、\fB/etc/default/fs\fR 内で次のように設定されています。たとえば、次のように指定します。 FSType が指定されていない場合に  \fBLOCAL\fR  がコマンドに対するデフォルトパーティションの場合は、\fBLOCAL=ufs\fR  と指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mnttab\fR\fR
.ad
.sp .6
.RS 4n
マウントテーブル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.sp .6
.RS 4n
各ファイルシステム用のデフォルトのパラメータリスト
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBfind\fR(1), \fBdf_ufs\fR(1M), \fBmount\fR(1M), \fBstatvfs\fR(2), \fBdefault_fs\fR(4), \fBmnttab\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5), \fBobjfs\fR(7FS) 
.SH 注意事項
.sp
.LP
ファイルシステムで \fBUFS\fR ログが有効になっている場合、ログで使用されるディスク容量は \fBdf\fR の報告に反映されます。ログはファイルシステム上の空きブロックから割り当てられ、ファイルシステムの \fB1\fRG バイトあたり約 \fB1\fRM バイト、最大 256M バイトのサイズになります。ログサイズは、ファイルシステム内に存在するシリンダグループの数に応じて、さらに大きくなることがあります (最大 512M バイト)。
