Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/dladm.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH dladm 1M "2011 年 7 月 27 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dladm \- データリンクの管理
.SH 形式
.LP
.nf
\fBdladm show-link\fR [\fB-PZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]]
     [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
\fBdladm rename-link\fR [\fB-R\fR \fIroot-dir\fR] \fIlink\fR \fInew-link\fR
.fi

.LP
.nf
\fBdladm delete-phys\fR \fIphys-link\fR
\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-H\fR]
     [\fB-z\fR \fIzone\fR[,...]] [\fIphys-link\fR]
.fi

.LP
.nf
\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fImode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] \fIaggr-link\fR
\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fImode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fIaggr-link\fR
\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR
\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] 
     \fIaggr-link\fR
\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...]
     \fIaggr-link\fR
\fBdladm show-aggr\fR [\fB-PLxZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]]
     [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link\fR]
.fi

.LP
.nf
\fBdladm create-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm modify-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     \fIbridge-name\fR
\fBdladm delete-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fIbridge-name\fR
\fBdladm add-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...]\fIbridge-name\fR
\fBdladm remove-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...]
     [\fIbridge-name\fR]
.fi

.LP
.nf
\fBdladm create-vlan\fR [\fB-ft\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link\fR \fB-v\fR \fIvid\fR [\fIvlan-link\fR]
\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link\fR
\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link\fR]
.fi

.LP
.nf
\fBdladm scan-wifi\fR [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIwifi-link\fR]
\fBdladm connect-wifi\fR [\fB-e\fR \fIessid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...]
     [\fB-s\fR none | wep | wpa ] [\fB-a\fR open | shared] [\fB-b\fR bss | ibss] [\fB-c\fR]
     [\fB-m\fR a | b | g | n ] [\fB-T\fR \fItime\fR] [\fIwifi-link\fR]
\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]
\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link\fR]
.fi

.LP
.nf
\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIether-link\fR]
.fi

.LP
.nf
\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIprop\fR=\fIvalue\fR[,...] \fIlink\fR
\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIprop\fR[,...]] \fIlink\fR
\fBdladm show-linkprop\fR [\fB-PZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-p\fR \fIprop\fR[,...]]
     [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fIfile\fR] \fB-c\fR \fIclass\fR \fIsecobj\fR
\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...]
\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]
.fi

.LP
.nf
\fBdladm create-vnic\fR [\fB-t\fR] \fB-l\fR \fIlink\fR [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fIvalue\fR | auto | 
     {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR}
     | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fIvlan-id\fR] [\fB-p\fR \fIprop\fR=\fIvalue\fR[,...]] \fIvnic-link\fR
\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR
\fBdladm show-vnic\fR [\fB-pPZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [\fB-o\fR \fIfield\fR[,...]]
     [\fB-l\fR \fIlink\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIvnic-link\fR]
.fi

.LP
.nf
\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm delete-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub\fR]
.fi

.LP
.nf
\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fItype\fR [\fB-a\fR {local|remote}=\fIaddr\fR,...]
     \fIiptun-link\fR
\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {local|remote}=\fIaddr\fR,...
     \fIiptun-link\fR
\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR
\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link\fR]
.fi

.LP
.nf
\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] \fB-l\fR \fIib-link\fR [\fB-R\fR \fIroot-dir\fR] \fB-P\fR \fIpkey\fR
     [\fB-p\fR prop=\fIvalue\fR[,...]] \fIpart-link\fR
\fBdladm delete-part\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIpart-link\fR
\fBdladm show-part\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-l\fR \fIib-link\fR]  [\fIpart-link\fR]
.fi

.LP
.nf
\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]
.fi

.LP
.nf
\fBdladm show-usage\fR [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-p\fR \fIplotfile\fR \fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR]
     [\fB-e\fR \fItime\fR] [\fIlink\fR]
.fi

.SH 機能説明
.sp
.LP
\fBdladm\fR コマンドは、データリンクを管理するために使用されます。データリンクはシステム内で、\fBTCP/IP\fR などのプロトコルスタックの下で plumb できる \fBSTREAMS DLPI\fR (v2) インタフェースとして表されます。各データリンクは、単一のネットワークデバイスまたはデバイスの集積体を使用して、ネットワーク間でパケットを送受信します。
.sp
.LP
各 \fBdladm\fR サブコマンドは、次のいずれかのオブジェクトに対して動作します。
.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.sp .6
.RS 4n
データリンク。名前で識別されます。一般に、この名前には任意の英数字 (および、下線 \fB_\fR またはピリオド \fB\&.\fR) を使用できますが、英字で始まり、数字で終わる必要があります。データリンク名には最大 31 文字を使用でき、最後の数字は 0 - 4294967294 の間の値にする必要があります。最後の数字を 0 で始めてはいけません。データリンク名は 3 - 8 文字にすることをお勧めします。
.sp
一部のサブコマンドは、データリンクの特定のタイプまたはクラスに対してのみ動作します。その場合は、次のオブジェクト名が使用されます。
.sp
.ne 2
.mk
.na
\fB\fBaggr-link\fR\fR
.ad
.sp .6
.RS 4n
集約データリンク (またはキー、「注意事項」を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBether-link\fR\fR
.ad
.sp .6
.RS 4n
物理 Ethernet データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun-link\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart-link\fR\fR
.ad
.sp .6
.RS 4n
InfiniBand (IB) パーティションデータリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys-link\fR\fR
.ad
.sp .6
.RS 4n
物理データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic-link\fR\fR
.ad
.sp .6
.RS 4n
リンクまたは \fBetherstub\fR 上に作成された仮想ネットワークインタフェース。これは、マシン上でネットワークインタフェースカードであるかのように扱うことが可能な疑似デバイスです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwifi-link\fR\fR
.ad
.sp .6
.RS 4n
WiFi データリンク。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンス。管理用に選択された名前で識別されます。この名前には任意の英数字または下線 \fB_\fR を使用できますが、英字で始まり、英字で終わる必要があります。ブリッジ名には最大 31 文字を使用できます。\fBdefault\fR という名前は、\fBSUNW\fR で始まるすべての名前を表すため、予約されています。
.sp
ブリッジ名にゼロ (\fB0\fR) を付加すると、可観測性に使用される有効なリンク名が生成されることに注意してください。
.sp
また、下の \fBdladm\fR サブコマンドで説明されているブリッジ関連のサブコマンドには \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要であることに注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.sp .6
.RS 4n
ネットワークデバイス。ドライバ名とインスタンス番号の連結で識別されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
物理 NIC の代わりに Ethernet スタブを使用して VNIC を作成することもできます。\fBetherstub\fR 上に作成された VNIC は、仮想スイッチを経由して接続されているように表示されるため、物理ハードウェアなしで完全な仮想ネットワークを構築できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
IB 物理リンク上に作成された IB パーティションリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecobj\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクト。管理用に選択された名前で識別されます。この名前には、任意の英数字のほか、下線 (\fB_\fR)、ピリオド (\fB\&.\fR)、およびハイフン (\fB-\fR) を使用できます。セキュリティー保護されたオブジェクトの名前には最大 32 文字を使用できます。
.RE

.SS "オプション"
.sp
.LP
各 \fBdladm\fR サブコマンドには、独自のオプションセットがあります。ただし、多くのサブコマンドには次の共通オプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
作成、削除、名前変更などの操作が適用する代替ルートディレクトリを指定します。
.RE

.SS "サブコマンド"
.sp
.LP
次のサブコマンドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBdladm show-link\fR [\fB-PZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
すべてのデータリンクまたは指定されたリンクのリンク構成情報を表示します。デフォルトでは、システムは、既知のネットワークデバイスごとに 1 つのデータリンクで構成されます。リンクの統計情報を出力するためのオプションは \fBdlstat\fR(1M) に移行されました。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。\fB-s\fR オプション (下記参照) によって変更されていない場合、フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-link\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.sp .6
.RS 4n
データリンクの現在のゾーン。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
データリンクのクラス。\fBdladm\fR は、次のクラスを識別します。
.sp
.ne 2
.mk
.na
\fB\fBaggr\fR\fR
.ad
.sp .6
.RS 4n
IEEE 802.3ad リンク集積体。\fBshow-aggr\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンス。管理用に選択された名前で識別されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
etherstub のインスタンス。物理 NIC の代わりに Ethernet スタブを使用して VNIC を作成することもできます。\fBetherstub\fR 上に作成された VNIC は、仮想スイッチを経由して接続されているように表示されるため、物理ハードウェアなしで完全な仮想ネットワークを構築できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクのインスタンス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB インタフェース。\fBshow-part\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys\fR\fR
.ad
.sp .6
.RS 4n
物理データリンク。\fBshow-phys\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan\fR\fR
.ad
.sp .6
.RS 4n
VLAN データリンク。\fBshow-vlan\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic\fR\fR
.ad
.sp .6
.RS 4n
仮想ネットワークインタフェース。\fBshow-vnic\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBMTU\fR\fR
.ad
.sp .6
.RS 4n
表示されるデータリンクの最大送信単位のサイズ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
データリンクのリンク状態。この状態は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
このリンクが割り当てられているブリッジの名前 (ある場合)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
データリンクが動作している物理データリンク。これは、データリンクの \fBaggr\fR、\fBbridge\fR、\fBvlan\fR、および \fBpart\fR パーティションクラスに適用されます。1 つの VLAN または IB パーティションは 1 つの物理的なデータリンク上に作成され、1 つのブリッジには複数のリンクが接続され、1 つの集積体は 1 つ以上の物理的なデータリンクで構成されます。
.RE

\fB-o\fR オプションが、リンクの統計情報を表示するために使用される \fB-s\fR オプションと組み合わせて使用する場合、フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIPACKETS\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で受信されたパケット数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRBYTES\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で受信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIERRORS\fR\fR
.ad
.sp .6
.RS 4n
入力エラーの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPACKETS\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で送信されたパケット数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOBYTES\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で送信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOERRORS\fR\fR
.ad
.sp .6
.RS 4n
出力エラーの数。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続リンクの構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
リンクの統計情報を表示します。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR, \fB--interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が表示される間隔 (秒) を指定するために \fB-s\fR オプションとともに使用されます。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
指定されたゾーンからのリンクを表示します。デフォルトでは、大域ゾーンから実行されている場合、\fBdladm\fR はすべてのゾーン内のリンクを表示します。ほかのゾーン内のリンクは、対応するゾーン名がその接頭辞として付き、そのあとにスラッシュ (\fB/\fR) 区切り文字が続いて表示されます。例: \fBzone1/net0\fR
.sp
非大域ゾーンから実行されている場合、このサブコマンドはそのゾーンのリンクのみを表示します。非大域ゾーンでは、ほかのゾーン内のリンクを表示することはできません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm rename-link\fR [\fB-R\fR \fIroot-dir\fR] \fIlink\fR \fInew-link\fR\fR
.ad
.sp .6
.RS 4n
\fIlink\fR の名前を \fInew-link\fR に変更します。これは、リンクに意味のある名前を付けたり、削除されたデバイスのリンクプロパティーのような既存のリンク構成を新しいデバイスに関連付けたりするために使用されます。このサブコマンドの使用方法の具体例については、「使用例」の節を参照してください。\fB\fR
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-phys\fR \fIphys-link\fR\fR
.ad
.sp .6
.RS 4n
このコマンドは、システムから削除された物理ハードウェアに関連付けられているリンクの永続構成を削除するために使用されます。「\fB使用例\fR」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-H\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIphys-link\fR]\fR
.ad
.sp .6
.RS 4n
物理デバイスと、すべての物理リンクまたは指定された物理リンクの属性を表示します。\fB-P\fR を指定しない場合は、実行中のシステム上で使用可能な物理リンクのみが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
NIC ドライバによって返される、ハードウェアリソースの使用状況を表示します。\fB-H\fR からの出力には、次の要素が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
NIC ドライバに対応する物理デバイス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGTYPE\fR\fR
.ad
.sp .6
.RS 4n
リングのタイプ (RX または TX のどちらか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGS\fR\fR
.ad
.sp .6
.RS 4n
リングのインデックス。リングとはハードウェアリソースのことで、通常は DMA チャネルにマップされ、特定の用途のためにプログラムできます。たとえば、RX リングをプログラムすると、特定の MAC アドレスに属するパケットのみを受信できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLIENTS\fR\fR
.ad
.sp .6
.RS 4n
リングを使用している MAC クライアント。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
物理デバイス/リンクの位置情報を表示します。出力は配置順 (つまり、オンボードデバイス、拡張スロットの順) で行われ、位置情報 (PCIexp Slot 2、MB など) は利用可能な場合に提供されます。\fB-L\fR からの出力は、次の要素をサポートしています。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
NIC ドライバに対応する物理デバイス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR \fR
.ad
.sp .6
.RS 4n
このリンクの下にある物理デバイスの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLOC\fR\fR
.ad
.sp .6
.RS 4n
物理的な位置を記述する文字列 (利用可能な場合)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
ファクトリ MAC アドレス、そのスロット識別子、およびその可用性を一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR, \fB--output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMEDIA\fR\fR
.ad
.sp .6
.RS 4n
物理データリンクによって提供されるメディアタイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンクの状態。この状態は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
リンクの現在の速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
Ethernet リンクでリンクステータスが \fBup\fR の場合は、そのリンクの二重通信のステータス (全二重/半二重) が表示されます。それ以外の場合は、二重通信の状態は \fBunknown\fR と表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR \fR
.ad
.sp .6
.RS 4n
このリンクの下にある物理デバイスの名前。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
このオプションを指定すると、システムから削除されたリンクを含むすべてのリンクの永続構成が表示されます。出力には \fBFLAGS\fR 列が表示されます。この列の \fBr\fR フラグは、物理リンクに関連付けられた物理デバイスが削除されたことを示します。このようなリンクの場合は、\fBdelete-phys\fR を使用すると、そのリンクの構成をシステムから消去できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fImode\fR] [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
一連のリンクを、\fIaggr-link\fR という名前の 1 つの IEEE 802.3ad リンク集積体と組み合わせます。また、下位互換性のために、整数キーによる集積体用リンク名の生成もサポートされています。\fI\fR下記の \fB*\fR\fB -aggr\fR サブコマンドの多くでは、キーによる特定の集積体の参照もサポートされていますが、集約リンク名の使用をお勧めします。\fI\fRキーの詳細については、「注意事項」の節を参照してください。\fB\fR
.sp
\fBdladm\fR は、ポート集約のためのポート選択ポリシーをいくつかサポートしています。(下記の \fB-P\fR オプションの説明を参照してください。)ポリシーを指定しない場合、\fBcreate-aggr\fR は、\fB-P\fR オプションで説明されているデフォルトの L4 ポリシーを使用します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB--link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
集積体の各 Ethernet リンク (またはポート) は、\fB-l\fR オプションのあとに、その集積体に含めるリンクの名前を使用して指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクが集積体に含まれます。旧バージョンの Solaris との下位互換性を確保するため、\fBdladm\fR コマンドでは、\fB-d\fR オプション (または \fB--dev\fR) をデバイス名とともに使用して、基本となるデバイス名でリンクを指定する方法もサポートされています。また、\fB-l\fR オプションを取るほかの \fB*\fR\fB-aggr\fR サブコマンドでも \fB-d\fR を使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
集積体を一時的なものとして指定します。一時的な集積体は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR, \fB--policy\fR=\fIpolicy\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
送信トラフィックの負荷分散に使用するポート選択ポリシーを指定します。このポリシーでは、パケットを送信するためにどの \fIdev\fR オブジェクトが使用されるかを指定します。ポリシーは、1 つ以上のレイヤー指定子をコンマで区切ったリストです。レイヤー指定子は、次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBL2\fR\fR
.ad
.sp .6
.RS 4n
パケットの発信元および着信先 \fBMAC\fR アドレスに従って送信デバイスを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL3\fR\fR
.ad
.sp .6
.RS 4n
パケットの発信元および着信先 \fBIP\fR アドレスに従って送信デバイスを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL4\fR\fR
.ad
.sp .6
.RS 4n
パケットに含まれている上位レイヤーのプロトコル情報に従って送信デバイスを選択します。\fBTCP\fR と \fBUDP\fR の場合、これには発信元および着信先ポートが含まれます。IPsec の場合、これには \fBSPI\fR (セキュリティーパラメータインデックス) が含まれます。
.RE

たとえば、上位レイヤーのプロトコル情報を使用するには、次のポリシーを使用できます。
.sp
.in +2
.nf
-P L4
.fi
.in -2
.sp

ポリシー L4 がデフォルトであることに注意してください。
.sp
発信元および着信先 \fBMAC\fR アドレスとともに発信元および着信先 \fBIP\fR アドレスを使用するには、次のポリシーを使用できます。
.sp
.in +2
.nf
-P L2,L3
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fImode\fR, \fB--lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR を使用するかどうか、および使用する場合は LACP が動作するモードを指定します。サポートされている値は、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--lacp-timer\fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR タイマー値を指定します。サポートされている値は、\fBshort\fR または \fBlong\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR, \fB--unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
集積体に使用される固定のユニキャストハードウェアアドレスを指定します。このオプションが指定されていない場合、アドレスはコンポーネントデバイスのアドレスのセットから自動的に選択されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fImode\fR] [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定された集積体のパラメータを変更します。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な集積体は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR, \fB--policy\fR=\fIpolicy\fR\fR
.ad
.sp .6
.RS 4n
送信トラフィックの負荷分散に使用するポート選択ポリシーを指定します。有効なポリシー値については、\fBdladm create-aggr\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fImode\fR, \fB--lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR を使用するかどうか、および使用する場合は LACP が動作するモードを指定します。サポートされている値は、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--lacp-timer\fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR タイマー値を指定します。サポートされている値は、\fBshort\fR または \fBlong\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR, \fB--unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
集積体に使用される固定のユニキャストハードウェアアドレスを指定します。このオプションが指定されていない場合、アドレスはコンポーネントデバイスのアドレスのセットから自動的に選択されます。
.sp
(固定のユニキャストハードウェアアドレスを変更すると、集積体のために以前に定義された \fBmac-address\fR リンクプロパティーがすべて上書きされることに注意してください。「一般的なリンクのプロパティー」を参照してください。)
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定された集積体を削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB--link\fR=\fIether-link2\fR...] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定された集積体にリンクを追加します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB--link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
集積体に追加する Ethernet リンクを指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクを追加できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
追加を一時的なものとして指定します。一時的な追加は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB--l\fR=\fIether-link2\fR...] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定された集積体からリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB--link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
集積体から削除する Ethernet リンクを指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクを追加できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-aggr\fR [\fB-PLxZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての集積体または指定された集積体の集積構成 (デフォルト) または \fBLACP\fR 情報を表示します。
.sp
デフォルトでは (オプションの指定なし)、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOLICY\fR\fR
.ad
.sp .6
.RS 4n
集積体の LACP ポリシー。指定可能な値については、\fBcreate-aggr\fR の \fB-P\fR オプションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRPOLICY\fR\fR
.ad
.sp .6
.RS 4n
集積体がユニキャスト MAC アドレスを自動的に構成するように構成されている場合は \fBauto\fR (集積体を作成または変更するために \fB-u\fR オプションが使用されなかった場合のデフォルトです)、\fB-u\fR を使用して固定の MAC アドレスが設定された場合は \fBfixed\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPACTIVITY\fR\fR
.ad
.sp .6
.RS 4n
集積体の LACP モード。指定可能な値は、\fBcreate-aggr\fR または \fBmodify-aggr\fR の \fB-l\fR オプションで設定された、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPTIMER\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-aggr\fR または \fBmodify-aggr\fR の \fB-T\fR オプションで設定された、集積体の LACP タイマー値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
集積体に関連付けられた状態フラグのセット。指定可能なフラグは \fBf\fR のみです。このフラグは、管理者が \fBcreate-aggr\fR の \fB-f\fR オプションを使用して集積体を強制的に作成した場合に表示されます。将来、ほかのフラグが定義される可能性があります。
.RE

\fBshow-aggr\fR コマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-L\fR, \fB--lacp\fR\fR
.ad
.sp .6
.RS 4n
集約リンクおよび基本となる各ポートの詳細な \fBLACP\fR 情報を表示します。このオプションによって表示される状態情報のほとんどは、IEEE 802.3 で定義されています。このオプションを使用すると、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
基本となるいずれかの集約ポートの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGGREGATABLE\fR\fR
.ad
.sp .6
.RS 4n
集積体にポートを追加できるかどうか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYNC\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、システムはこのポートが同期されていて、集積体の一部であるとみなします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOLL\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、関連付けられたポート上で受信フレームの収集が有効になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDIST\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、関連付けられたポート上で送信フレームの配信が有効になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULTED\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、ポートはデフォルトのパートナー情報を使用しています (つまり、LACP パートナーから LACP データを受信していません)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEXPIRED\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、ポートの受信状態が \fBEXPIRED\fR 状態になっています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
基本となる各ポートに関する詳細情報を含む追加の集積体情報を表示します。\fB-x\fR を使用すると、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
基本となるいずれかの集約ポートの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
リンクまたはポートの速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
リンクステータスが \fBup\fR の場合は、そのリンクまたはポートの二重通信のステータス (全二重/半二重) のステータスが表示されます。それ以外の場合は、二重通信のステータスは \fBunknown\fR と表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンク状態。この状態は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
リンクまたはポートの MAC アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTSTATE\fR\fR
.ad
.sp .6
.RS 4n
これは、個々の集約ポートが \fBstandby\fR または \fBattached\fR のどちらの状態にあるかを示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、前述のフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。\fB-o\fR オプションに適用できるフィールドは、各出力モードの下に一覧表示されているフィールドに制限されます。たとえば、\fB-L\fR を使用している場合は、前述のように、\fB-L\fR の下に一覧表示されているフィールドのみを \fB-o\fR とともに使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
実行中のシステムの状態ではなく、永続的な集積構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
集積体の統計情報を表示します。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR, \fB--interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が表示される間隔 (秒) を指定するために \fB-s\fR オプションとともに使用されます。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-bridge\fR [ \fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fImax-age\fR] [ \fB-h\fR \fI hello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fIforce-protocol\fR] [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
802.1D ブリッジインスタンスを作成し、必要に応じて新しいブリッジに 1 つ以上のネットワークリンクを割り当てます。デフォルトでは、システム上にブリッジインスタンスは存在しません。
.sp
リンクをブリッジするには、少なくとも 1 つのブリッジインスタンスを作成する必要があります。各ブリッジインスタンスは独立しており、ブリッジ間の転送接続は存在しません。
.sp
ブリッジ関連のサブコマンド (特に \fBcreate-bridge\fR) には \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要であることに注意してください。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotect\fR, \fB--protect\fR=\fIprotect\fR\fR
.ad
.sp .6
.RS 4n
保護の方式を指定します。定義されている保護方式は、Spanning Tree Protocol の \fBstp\fR と、RBridge 上で使用される TRILL の \fBtrill\fR です。デフォルト値は \fBstp\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpriority\fR, \fB--priority\fR=\fIpriority\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの優先度を指定します。これにより、ネットワーク内のルートブリッジノードを決定する IEEE STP の優先度の値が設定されます。デフォルト値は \fB32768\fR です。有効な値は \fB0\fR (もっとも高い優先度) - \fB61440\fR (もっとも低い優先度) で、4096 ずつ増分します。
.sp
4096 で割り切れない値が使用された場合、システムはその値を自動的に 4096 で割り切れる次の小さい値に切り捨てます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImax-age\fR, \fB--max-age\fR=\fImax-age\fR\fR
.ad
.sp .6
.RS 4n
構成情報の最長有効期間 (秒単位) を指定します。これにより、STP Bridge Max Age パラメータが設定されます。このノードがルートブリッジである場合は、ネットワーク内のすべてのノードに対してこの値が使用されます。この時間より前のブリッジリンク情報は破棄されます。デフォルトは 20 秒です。有効な値は 6 - 40 秒です。その他の制約については、\fB-d\fR \fIforward-delay\fR パラメータを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhello-time\fR, \fB--hello-time\fR=\fIhello-time\fR\fR
.ad
.sp .6
.RS 4n
STP Bridge Hello Time パラメータを指定します。このノードがルートノードである場合、このノードは、ネットワーク全体にわたってこの間隔で構成 BPDU を送信します。デフォルト値は 2 秒です。有効な値は 1 - 10 秒です。その他の制約については、\fB-d\fR \fIforward-delay\fR パラメータを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIforward-delay\fR, \fB--forward-delay\fR=\fIforward-delay\fR\fR
.ad
.sp .6
.RS 4n
STP Bridge Forward Delay パラメータを指定します。このノードがルートノードである場合、ポートが有効になっていると、ネットワーク内のすべてのブリッジがこのタイマーを使用してリンク状態を順序付けます。デフォルト値は 15 秒です。有効な値は 4 - 30 秒です。
.sp
ブリッジは次の 2 つの制約に従う必要があります。
.sp
.in +2
.nf
2 * (\fIforward-delay\fR - 1.0) >= \fImax-age\fR

\fImax-age\fR >= 2 * (\fIhello-time\fR + 1.0)
.fi
.in -2
.sp

これらの制約に違反するパラメータ設定はすべてエラーとして扱われるため、コマンドが失敗して診断メッセージが生成されます。このメッセージには、指定された値に代わる有効な値が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIforce-protocol\fR, \fB--force-protocol\fR=\fIforce-protocol\fR\fR
.ad
.sp .6
.RS 4n
MSTP で強制的にサポートされる最大プロトコルを指定します。デフォルトの値は 3 です。有効な値は、負ではない整数です。現在の実装では RSTP や MSTP がサポートされていないため、現在この値は無視されます。ただし、将来 MSTP が使用されないようにするために、このパラメータを STP のみの場合は \fB0\fR に、STP と RSTP の場合は \fB2\fR に設定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB--link\fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
新しく作成されたブリッジに追加する 1 つ以上のリンクを指定します。これは、\fBadd-bridge\fR サブコマンドのように、ブリッジを作成してから 1 つ以上のリンクを追加する場合と同様です。ただし、いずれかのリンクを追加できない場合は、コマンド全体が失敗し、新しいブリッジ自体が作成されません。同じコマンド行で複数のリンクを追加するには、リンクごとにこのオプションを繰り返します。リンクなしのブリッジも作成できます。リンクの割り当ての詳細については、\fBadd-bridge\fR サブコマンドを参照してください。
.RE

ブリッジの作成およびリンクの割り当てには、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。オプションのブリッジ機能がシステムにインストールされていない場合、ブリッジの作成が失敗する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-bridge\fR [ \fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fImax-age\fR] [ \fB-h\fR \fI hello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fIforce-protocol\fR] [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
既存のブリッジの動作パラメータを変更します。これらのオプションは \fBcreate-bridge\fR サブコマンドの場合と同じですが、\fB-l\fR オプションが許可されていない点が異なります。既存のブリッジにリンクを追加するには、\fBadd-bridge\fR サブコマンドを使用します。
.sp
ブリッジのパラメータの変更には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンスを削除します。削除されるブリッジにリンクが追加されていてはいけません。ブリッジを削除する前にリンクを無効にするには、\fBremove-bridge\fR サブコマンドを使用します。
.sp
ブリッジの削除には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
\fB-R\fR (\fB--root-dir\fR) オプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
既存のブリッジに 1 つ以上のリンクを追加します。複数のリンクが指定され、そのいずれかを追加するときにエラーが発生した場合、そのコマンドは失敗し、システムには変更が加えられません。
.sp
ブリッジへのリンクの追加には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
1 つのリンクは、最大 1 つのブリッジのメンバーになることができます。すでに別のブリッジに属しているリンクを追加しようとすると、エラーが発生します。あるブリッジインスタンスから別のブリッジインスタンスにリンクを移動するには、現在のブリッジからそのリンクを削除してから、新しいブリッジに追加します。
.sp
ブリッジに割り当てるリンクが、同時に VLAN、VNIC、またはトンネルであってはいけません。ブリッジに割り当てられるのは、物理 Ethernet データリンク、集約データリンク、および Ethernet スタブだけです。
.sp
ブリッジに割り当てるリンクはすべて、MTU が同じである必要があります。これは、リンクが割り当てられるときにチェックされます。リンクがブリッジ上の最初のリンクでなく、MTU が異なっている場合、そのリンクは無効な形式でブリッジに追加されます。
.sp
ブリッジを使用しているシステムでは、\fBeeprom\fR(1M) \fBlocal-mac-address?\fR 変数を false に設定するべきではないことに注意してください。
.sp
これらのオプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンスから 1 つ以上のリンクを削除します。複数のリンクが指定されていて、そのいずれかを削除するときにエラーが発生した場合、そのコマンドは失敗し、何も削除されません。
.sp
ブリッジからのリンクの削除には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
これらのオプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fIbridge-name\fR]\fR
.ad
.sp .6
.RS 4n
ブリッジの実行ステータスと構成、追加されているリンク、学習された転送エントリ、および \fBTRILL\fR ニックネームデータベースを表示します。全体的なブリッジのステータスと構成を表示する場合は、ブリッジ名を省略すると、すべてのブリッジを表示できます。その他の形式の場合は、ブリッジの指定が必要です。
.sp
show-bridge サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR, \fB--interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が表示される間隔 (秒) を指定するために \fB-s\fR オプションとともに使用されます。このオプションが指定されていない場合、統計情報は 1 回だけ表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
指定されたブリッジ、または特定のブリッジに追加されたリンクの統計情報を表示します。このオプションは \fB-f\fR オプションおよび \fB-t\fR オプションとともに使用することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名については、あとで説明します。特殊な値 all はすべてのフィールドを表示します。\fB-o\fR が指定されていない場合、フィールドの各セットには、表示する独自のデフォルトセットがあります。
.RE

デフォルトでは、\fBshow-bridge\fR サブコマンドはブリッジ構成を表示します。次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの一意の識別子の値 (MAC アドレス)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRIORITY\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-p\fR で設定された、構成済みの優先度の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-m\fR で設定された、構成済みのブリッジ最長有効期間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-h\fR で設定された、構成済みのブリッジ Hello 時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-d\fR で設定された、構成済みの転送遅延。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORCEPROTO\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-f\fR で設定された、構成済みの強制適用最大プロトコル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCTIME\fR\fR
.ad
.sp .6
.RS 4n
最後のトポロジ変更からの時間 (秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCCOUNT\fR\fR
.ad
.sp .6
.RS 4n
トポロジ変更の回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCHANGE\fR\fR
.ad
.sp .6
.RS 4n
これは、トポロジ変更が検出されたことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
ルートノードのブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTCOST\fR\fR
.ad
.sp .6
.RS 4n
ルートノードへのパスのコスト。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTPORT\fR\fR
.ad
.sp .6
.RS 4n
ルートノードに到達するために使用されるポート番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの最長有効期間の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの Hello 時間の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの転送遅延の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHOLDTIME\fR\fR
.ad
.sp .6
.RS 4n
最小の BPDU 間隔。
.RE

デフォルトでは、\fB-o\fR オプションが指定されていない場合、\fBBRIDGE\fR、\fBADDRESS\fR、\fBPRIORITY\fR、および \fBDESROOT\fR フィールドのみが表示されます。
.sp
\fB-s\fR オプションが指定されている場合、\fBshow-bridge\fR サブコマンドはブリッジの統計情報を表示します。次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
ブリッジ名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
リソースの問題のためにドロップされたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORWARDS\fR\fR
.ad
.sp .6
.RS 4n
あるリンクから別のリンクに転送されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMBCAST\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって処理されたマルチキャストパケットとブロードキャストパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
追加されているすべてのリンク上で受信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSENT\fR\fR
.ad
.sp .6
.RS 4n
追加されているすべてのリンク上で送信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNKNOWN\fR\fR
.ad
.sp .6
.RS 4n
不明な宛先を含んだ処理済みパケットの数。これらのパケットはすべてのリンクに送信されます。
.RE

デフォルトでは、\fB-o\fR オプションが指定されていない場合、\fBBRIDGE\fR、\fBDROPS\fR、および \fBFORWARDS\fR フィールドのみが表示されます。
.sp
\fBshow-bridge\fR サブコマンドでは、次のオプションも使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR, \fB--link\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスに追加されているすべてのリンクについて、リンク関連のステータスと統計情報を表示します。\fB-s\fR オプションを指定せずにこのオプションを使用すると、リンクごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINDEX\fR\fR
.ad
.sp .6
.RS 4n
ブリッジ上のポート (リンク) のインデックス番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンクの状態。この状態は、\fBdisabled\fR、\fBdiscarding\fR、\fBlearning\fR、\fBforwarding\fR、\fBnon-stp\fR、\fBbad-mtu\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUPTIME\fR\fR
.ad
.sp .6
.RS 4n
最後のリセットまたは初期化からの秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERCOST\fR\fR
.ad
.sp .6
.RS 4n
使用されている実際のコスト (1 - 65535)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERP2P\fR\fR
.ad
.sp .6
.RS 4n
これは、ポイントツーポイント (\fBP2P\fR) モードが検出されたかどうかを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPEREDGE\fR\fR
.ad
.sp .6
.RS 4n
これは、エッジモードが検出されたかどうかを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
このポート上で確認されたルートブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESCOST\fR\fR
.ad
.sp .6
.RS 4n
指定されたポートを経由するネットワークルートノードへのパスコスト。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
このポートのブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESPORT\fR\fR
.ad
.sp .6
.RS 4n
このポートの構成メッセージを送信するために使用されるポートの ID と優先度。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCACK\fR\fR
.ad
.sp .6
.RS 4n
これは、トポロジ変更確認応答が検出されたかどうかを示します。
.RE

\fB-o\fR オプションなしで \fB-l\fR オプションが指定されている場合、\fBLINK\fR、\fBSTATE\fR、\fBUPTIME\fR、および \fBDESROOT\fR フィールドのみが表示されます。
.sp
\fB-l\fR オプションが指定されている場合、\fB-s\fR オプションを使用すると、リンクごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCFGBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信された構成 BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCNBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信されたトポロジ変更 BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRSTPBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信された Rapid Spanning Tree BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTXBPDU\fR\fR
.ad
.sp .6
.RS 4n
送信された BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
リソースの問題のためにドロップされたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって受信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBXMIT\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって送信されたパケットの数。
.RE

\fB-o\fR オプションが指定されていない場合、\fBLINK\fR、\fBDROPS\fR、\fBRECV\fR、および \fBXMIT\fR フィールドのみが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--forwarding\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスの転送エントリを表示します。このオプションを使用すると、転送エントリごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBDEST\fR\fR
.ad
.sp .6
.RS 4n
着信先 MAC アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGE\fR\fR
.ad
.sp .6
.RS 4n
エントリの有効期間 (秒およびミリ秒単位)。ローカルエントリでは省略されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
MAC アドレスが、追加されたリンクか、またはいずれかの追加されたリンク上の VNIC に属している場合は、\fBL\fR (ローカル) フラグが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOUTPUT\fR\fR
.ad
.sp .6
.RS 4n
ローカルエントリの場合、これは MAC アドレスを含む追加されたリンクの名前です。それ以外の場合、Spanning Tree Protocol を使用するブリッジでは、これは出力インタフェースの名前になります。RBridge では、これは出力 \fBTRILL\fR ニックネームになります。
.RE

\fB-o\fR オプションが指定されていない場合、\fBDEST\fR、\fBAGE\fR、\fBFLAGS\fR、および \fBOUTPUT\fR フィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--trill\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスの \fBTRILL\fR ニックネームエントリを表示します。このオプションを使用すると、\fBTRILL\fR ニックネームエントリごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBNICK\fR\fR
.ad
.sp .6
.RS 4n
この RBridge の \fBTRILL\fR ニックネーム。これは、1 - 65535 の数字です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
このニックネームでローカルシステムが識別される場合は、\fBL\fR フラグが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
この RBridge にメッセージを送信するときの出力のリンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNEXTHOP\fR\fR
.ad
.sp .6
.RS 4n
このニックネームを持つ RBridge に到達するために使用される次のホップの RBridge の MAC アドレス。
.RE

\fB-o\fR オプションが指定されていない場合、\fBNICK\fR、\fBFLAGS\fR、\fBLINK\fR、および \fBNEXTHOP\fR フィールドが表示されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vlan\fR [\fB-ft\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link\fR \fB-v\fR \fIvid\fR [\fIvlan-link\fR]\fR
.ad
.sp .6
.RS 4n
Ethernet リンク \fIether-link\fR 上に \fIvid\fR の ID を持つタグ付き VLAN リンクを作成します。VLAN リンクの名前は、\fIvlan\fR-\fIlink\fR として指定できます。名前が指定されていない場合、次の名前が自動的に生成されます (\fIether-link\fR が \fIname\fR\fIPPA\fR であると仮定)。
.sp
.in +2
.nf
<\fIname\fR><1000 * \fIvlan-tag\fR + \fIPPA\fR>
.fi
.in -2
.sp

たとえば、\fIether-link\fR が \fBbge1\fR で \fIvid\fR が 2 の場合、生成される名前は \fBbge2001\fR になります。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--force\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクの作成を強制します。一部のデバイスでは、VLAN ヘッダーを含めることができる大きさのフレームサイズが許可されません。このようなデバイス上に VLAN リンクを作成するには \fB-f\fR オプションが必要で、結果として得られる VLAN 上の IP インタフェースの MTU を 1500 ではなく 1496 に設定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN が作成される Ethernet リンクを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクを一時的なものとして指定します。一時的な VLAN リンクは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link\fR\fR
.ad
.sp .6
.RS 4n
指定された VLAN リンクを削除します。
.sp
\fBdelete-vlan\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての VLAN リンクまたは指定された VLAN リンクの VLAN 構成を表示します。
.sp
\fBshow-vlan\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]、\fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。VLAN リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVID\fR\fR
.ad
.sp .6
.RS 4n
VLAN に関連付けられた ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
この VLAN が構成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクに関連付けられたフラグのセット。指定可能なフラグは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
この VLAN は、\fBcreate-vlan\fR の \fB-f\fR オプションを使用して作成されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
この VLAN は、DLPI リンクが開かれたときに暗黙的に作成されました。これらの VLAN リンクは、その DLPI リンクが最後に閉じられたときに (たとえば、その VLAN リンクに関連付けられている IP インタフェースが unplumb されたときに) 自動的に削除されます。
.RE

将来、追加のフラグが定義される可能性があります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
実行中のシステムの状態ではなく、永続的な VLAN 構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm scan-wifi\fR [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての \fBWiFi\fR リンク上、または指定された \fIwifi-link\fR 上のみにある \fBWiFi\fR ネットワークを調べます。
.sp
デフォルトでは、\fBBSSTYPE\fR を除く現在のすべてのフィールドが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。見つかった \fBWiFi\fR ネットワークごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークが存在するリンクの名前。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークの \fBESSID\fR (名前)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークのアクセスポイントのハードウェアアドレス (\fBBSS\fR ネットワークの場合)、または \fBWiFi\fR ネットワークのランダムに生成された一意のトークン (\fBIBSS\fR ネットワークの場合) のどちらか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
\fBnone\fR (セキュリティーを使用しない \fBWiFi\fR ネットワークの場合)、\fBwep\fR (WEP (Wired Equivalent Privacy) が必要な \fBWiFi\fR ネットワークの場合)、または \fBwpa\fR (WPA (Wi-Fi Protected Access) が必要な WiFi ネットワークの場合) のいずれか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
サポートされている接続モード (\fBa\fR、\fBb\fR、\fBg\fR、\fBn\fR のうちの 1 つまたは複数)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
信号の強さ (\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR、\fBvery weak\fR のうちのいずれか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークの最大速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBbss\fR (\fBBSS\fR (インフラストラクチャー) ネットワークの場合)、または \fBibss\fR (\fBIBSS\fR (アドホック) ネットワークの場合) のどちらか。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm connect-wifi\fR [\fB-e\fR \fIessid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...] [\fB-s\fR \fBnone\fR | \fBwep\fR | \fB wpa\fR] [\fB-a\fR \fBopen\fR|\fBshared\fR] [\fB-b\fR \fBbss\fR|\fBibss\fR] [\fB-c\fR] [\fB-m\fR \fBa\fR|\fBb\fR|\fBg\fR|\fBn\fR] [\fB-T\fR \fI time\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークに接続します。これは、検出、フィルタ処理、優先順位付け、および関連付けの 4 つの手順で構成されます。\fI\fR\fI\fR\fI\fR\fI\fRただし、非ブロードキャスト \fBWiFi\fR ネットワークへの接続を可能にし、パフォーマンスを向上させるために、\fB-e\fR または \fB-i\fR オプションを使用して \fBBSSID\fR または \fBESSID\fR が指定されている場合、最初の 3 つの手順は省略され、\fBconnect-wifi\fR は、指定された残りのパラメータに一致する \fBBSSID\fR または \fBESSID\fR への関連付けをただちに試みます。この関連付けが失敗したものの、指定された条件に一致するほかのネットワークが存在する可能性がある場合は、後述する従来の発見プロセスが開始されます。 
.sp
発見の手順では、指定された WiFi リンク上の使用可能なすべての \fBWiFi\fR ネットワークが検索されますが、この段階では接続を実行してはいけません。管理の便宜上、システム上に \fBWiFi\fR リンクが 1 つしか存在しない場合は、\fIwifi-link\fR を省略できます。
.sp
検出が完了すると、次のオプションの値に従ってネットワークのリストがフィルタ処理されます。 
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIessid,\fR \fB--essid\fR=\fIessid\fR\fR
.ad
.sp .6
.RS 4n
同じ \fIessid\fR を持たないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fBbss\fR|\fBibss\fR, \fB--bsstype\fR=\fBbss\fR|\fBibss\fR\fR
.ad
.sp .6
.RS 4n
同じ \fBbsstype\fR を持たないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fBa\fR|\fBb\fR|\fBg\fR, \fB--mode\fR=\fBa\fR|\fBb\fR|\fBg\fR|\fBn\fR\fR
.ad
.sp .6
.RS 4n
指定された 802.11 モードに適していないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR, \fB--key\fR=\fIkey, ...\fR\fR
.ad
.sp .6
.RS 4n
キーで指定された \fBsecobj\fR を使用してネットワークに接続します。指定されたキーに適していないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fBnone\fR|\fBwep\fR|\fBwpa\fR, \fB--sec\fR=\fBnone\fR|\fBwep\fR|\fBwpa\fR\fR
.ad
.sp .6
.RS 4n
指定されたセキュリティーモードに適していないネットワークがフィルタ処理によって除外されます。
.RE

次に、残りのネットワークが、最初に信号強度で、次に最大速度で優先付けされます。最後に、リスト内の各ネットワークに (順番に) 関連付けする試みが、1 つのネットワークで成功するか、または残りのネットワークがなくなるまで行われます。 
.sp
前述のオプションに加えて、次のオプションも \fBconnect-wifi\fR の動作を制御します。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fBopen\fR|\fBshared\fR, \fB--auth\fR=\fBopen\fR|\fBshared\fR\fR
.ad
.sp .6
.RS 4n
指定された認証モードを使用して接続します。デフォルトでは、\fBopen\fR と \fBshared\fR が順番に試行されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR, \fB--create-ibss\fR\fR
.ad
.sp .6
.RS 4n
指定された \fBESSID\fR に一致するアドホックネットワークが見つからない場合に、新しいアドホックネットワークを作成するために \fB-b ibss\fR とともに使用されます。\fBESSID\fR が指定されていない場合、\fB-c -b ibss\fR は、常に新しいアドホックネットワークの作成を開始します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--timeout\fR=\fItime\fR\fR
.ad
.sp .6
.RS 4n
関連付けが成功するまで待機する秒数を指定します。\fItime\fR を \fBforever\fR にすると、関連付けを無期限に待機します。現在のデフォルト値は 10 秒ですが、将来変更される可能性があります。デフォルト値より短いタイムアウトは、成功しない可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR, \fB--key\fR=\fIkey,...\fR\fR
.ad
.sp .6
.RS 4n
前述のフィルタ処理に加えて、関連付けが確実に行われるようにするために、指定されたキーが使用されます。使用するセキュリティーモードはキークラスに基づきます。セキュリティーモードが明示的に指定された場合、そのセキュリティーモードはキークラスと互換性を持っている必要があります。すべてのキーが同じクラスに属している必要があります。 
.sp
複数のキースロットをサポートするセキュリティーモードの場合、キーを格納するスロットは、コロンとそれに続くインデックスで指定されます。したがって、\fB-k mykey:3\fR と指定すると、\fBmykey\fR がスロット 3 に格納されます。デフォルトでは、スロット 1 とみなされます。複数のキーをサポートするセキュリティーモードの場合、最初のキーをアクティブなキーにしたコンマ区切りリストを指定できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
1 つ以上の \fBWiFi\fR ネットワークとの接続を切断します。接続済みの \fBWiFi\fR リンクが \fIwifi-link\fR で指定されている場合は、そのリンクが切断されます。管理の便宜上、\fBWiFi\fR リンクが 1 つしか接続されていない場合は、\fIwifi-link\fR を省略できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR, \fB--all-links\fR\fR
.ad
.sp .6
.RS 4n
すべての接続されているリンクを切断します。これは、スクリプトによる使用を主に想定しています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての \fBWiFi\fR リンクまたは指定されたリンク \fIwifi-link\fR の \fBWiFi\fR 構成情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield,...\fR, \fB--output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。\fBWiFi\fR リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
表示されているリンクの名前。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATUS\fR\fR
.ad
.sp .6
.RS 4n
\fBconnected\fR (リンクが接続されている場合)、または \fBdisconnected\fR (リンクが接続されていない場合) のどちらか。リンクが切断されている場合は、残りのすべてのフィールドに値 \fB--\fR が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
接続されている \fBWiFi\fR ネットワークの \fBESSID\fR (名前)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークのアクセスポイントのハードウェアアドレス (\fBBSS\fR ネットワークの場合)、または \fBWiFi\fR ネットワークのランダムに生成された一意のトークン (\fBIBSS\fR ネットワークの場合) のどちらか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
\fBnone\fR (セキュリティーを使用しない \fBWiFi\fR ネットワークの場合)、\fBwep\fR (WEP が必要な \fBWiFi\fR ネットワークの場合)、または \fBwpa\fR (WPA が必要な WiFi ネットワークの場合) のいずれか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
サポートされている接続モード (\fBa\fR、\fBb\fR、\fBg\fR、\fBn\fR のうちの 1 つまたは複数)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
接続の強さ (\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR、\fBvery weak\fR のうちのいずれか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
接続速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTH\fR\fR
.ad
.sp .6
.RS 4n
\fBopen\fR または \fBshared\fR のどちらか (\fBconnect-wifi\fR を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBbss\fR (\fBBSS\fR (インフラストラクチャー) ネットワークの場合)、または \fBibss\fR (\fBIBSS\fR (アドホック) ネットワークの場合) のどちらか。
.RE

デフォルトでは、\fBAUTH\fR、\fBBSSID\fR、\fBBSSTYPE\fR を除く現在のすべてのフィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fIether-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての物理 Ethernet リンクまたは指定された物理 Ethernet リンクの状態情報を表示します。
.sp
\fBshow-ether\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR,..., \fB--output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
表示されているリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPTYPE\fR\fR
.ad
.sp .6
.RS 4n
パラメータのタイプ。ここで、\fBcurrent\fR はリンクのネゴシエーションの状態を、\fBcapable\fR はデバイスでサポートされている機能を、\fBadv\fR は通知された機能を、\fBpeeradv\fR はリンクパートナーによって通知された機能を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンクの状態。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTO\fR\fR
.ad
.sp .6
.RS 4n
自動ネゴシエーションが通知されるかどうかを示す \fByes\fR/\fBno\fR の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED-DUPLEX\fR\fR
.ad
.sp .6
.RS 4n
指定可能な速度と二重通信の値の組み合わせ。速度の単位は、\fBG\fR (Gbps) または \fBM\fR (Mbps) の接尾辞でエンコードされます。二重通信の値は、\fBf\fR (全二重) または \fBh\fR (半二重) としてエンコードされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAUSE\fR\fR
.ad
.sp .6
.RS 4n
フロー制御情報。\fBno\fR (フロー制御が使用できないことを示す場合)、\fBtx\fR (エンドポイントは一時停止フレームを送信できるものの、受信した一時停止フレームをすべて無視することを示す場合)、\fBrx\fR (エンドポイントは一時停止フレームを受信し、受信した一時停止フレームに基づいて動作することを示す場合)、\fBbi\fR (双方向のフロー制御を示す場合) のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREM_FAULT\fR\fR
.ad
.sp .6
.RS 4n
障害検出情報。有効な値は \fBnone\fR または \fBfault\fR です。
.RE

デフォルトでは、\fBREM_FAULT\fR を除くすべてのフィールドが「現在」の \fBPTYPE\fR で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
\fBcurrent\fR、\fBcapable\fR、\fBadv\fR、および \fBpeeradv\fR の \fBPTYPE\fR 値に対して、拡張出力が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIprop\fR=\fIvalue\fR[,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上の 1 つ以上のプロパティーの値を設定します。プロパティーとそれらのプロパティーで指定可能なリストは、リンクタイプ、ネットワークデバイスドライバ、およびネットワーキングハードウェアによって異なります。これらのプロパティーは、\fBshow-linkprop\fR を使用すると取得できます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fIvalue\fR[,...], \fB--prop\fR \fIprop\fR=\fIvalue\fR[,...]\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。
.RE

永続的な値が設定されると、一時的な値が同じ値に変更されることに注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIprop\fR,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上のプロパティーを、指定されたリンク上のそれらの値にリセットします。プロパティーは、起動時に設定されていた値にリセットされます。プロパティーが指定されていない場合、すべてのプロパティーがリセットされます。プロパティーについては、\fBshow-linkprop\fR を参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
リセットを一時的なものとして指定します。値はデフォルト値にリセットされます。一時的なリセットは、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR, \fB--prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
リセットするプロパティーのコンマ区切りのリスト。
.RE

永続的な値がリセットされると、一時的な値は同じ値に変更されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-linkprop\fR [\fB-PZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]][\fB-p\fR \fIprop\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR] \fR
.ad
.sp .6
.RS 4n
すべてのデータリンクまたは指定されたリンクについて、1 つ以上のプロパティーの現在の値または永続的な値を表示します。デフォルトでは、現在の値が表示されます。プロパティーが指定されていない場合、使用可能なすべてのリンクプロパティーが表示されます。プロパティーごとに、次のフィールドが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROPERTY\fR\fR
.ad
.sp .6
.RS 4n
プロパティーの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPERM\fR\fR
.ad
.sp .6
.RS 4n
プロパティーの読み取り権と書き込み権。表示される値は \fBro\fR または \fBrw\fR のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVALUE\fR\fR
.ad
.sp .6
.RS 4n
現在の (または永続的な) プロパティー値。値が設定されていない場合は、\fB--\fR と表示されます。値が不明な場合は、\fB?\fR と表示されます。設定されていないか、またはリセットされた永続的な値は \fB--\fR と表示され、システムの \fBDEFAULT\fR 値 (ある場合) を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULT\fR\fR
.ad
.sp .6
.RS 4n
プロパティーのデフォルト値。プロパティーにデフォルト値がない場合は、\fB--\fR が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
プロパティーに設定できる値のコンマ区切りのリスト。値に数値の範囲がある場合は、短縮形として \fImin\fR - \fImax\fR が表示される可能性があります。指定可能な値が不明または無限の場合は、\fB--\fR が表示されます。
.RE

プロパティーのリストはリンクタイプやネットワークデバイスドライバによって異なり、特定のプロパティーに対して指定可能な値はさらに、基本となるネットワークハードウェアやその状態によって異なります。一般的なリンクのプロパティーについては、「一般的なリンクのプロパティー」の節で説明されています。ただし、「\fB_\fR」(下線) で始まるリンクプロパティーは特定のリンクまたはその基礎となるネットワークデバイスに固有であり、変更または削除される可能性があります。詳細については、該当するネットワークデバイスドライバのマニュアルページを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。このオプションには \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的なリンクプロパティーの情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR, \fB--prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
表示するプロパティーのコンマ区切りのリスト。サブコマンドの説明に続くリンクプロパティーの節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fIfile\fR] \fB-c\fR \fIclass\fR \fIsecobj\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIclass\fR 内に、暗号化されたネットワークへの接続時に WEP または WPA キーとしてあとで使用される \fIsecobj\fR という名前のセキュリティー保護されたオブジェクトを作成します。セキュリティー保護されたオブジェクトの値は、対話形式で指定することも、ファイルから読み取ることもできます。対話形式のプロンプトの並びやファイル形式は、セキュリティー保護されたオブジェクトのクラスによって異なります。 
.sp
現在、\fBwep\fR クラスと \fBwpa\fR クラスがサポートされています。\fBWEP\fR (Wired Equivalent Privacy) キーには、5 または 13 バイト長のいずれかを指定できます。\fBASCII\fR 文字列または 16 進数文字列として指定できるため、\fB12345\fR と \fB0x3132333435\fR は同じ 5 バイトキーです (接頭辞 \fB0x\fR は省略できます)。\fBWEP\fR キーを含むファイルは、いずれかの \fBWEP\fR キー形式を使用した 1 行で構成されている必要があります。WPA (Wi-Fi Protected Access) キーは、8 - 63 バイトまでの長さを持つ ASCII 文字列として指定する必要があります。
.sp
このサブコマンドは、「ネットワークリンクセキュリティー」\fBRBAC\fR プロファイルに属しているユーザーまたは役割のみが使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclass\fR, \fB--class\fR=\fIclass\fR\fR
.ad
.sp .6
.RS 4n
\fIclass\fR は \fBwep\fR または \fBwpa\fR のいずれかです。前の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
作成を一時的なものとして指定します。一時的な作成は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR, \fB--file\fR=\fIfile\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトの値を取得するために使用するべきファイルを指定します。このファイルの形式は、セキュリティー保護されたオブジェクトのクラスによって異なります。このオプションを使用して \fBWEP\fR キーを設定する例については、「使用例」の節を参照してください。\fB\fR
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...]\fR
.ad
.sp .6
.RS 4n
指定された 1 つ以上のセキュリティー保護されたオブジェクトを削除します。このサブコマンドは、「ネットワークリンクセキュリティー」\fBRBAC\fR プロファイルに属しているユーザーまたは役割のみが使用できます。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]\fR
.ad
.sp .6
.RS 4n
セキュリティー保護された現在のオブジェクトまたは永続オブジェクトの情報を表示します。1 つ以上のセキュリティー保護されたオブジェクトが指定されている場合は、各オブジェクトの情報が表示されます。それ以外の場合は、セキュリティー保護された現在のオブジェクトまたは永続オブジェクトがすべて表示されます。
.sp
デフォルトでは、セキュリティー保護された現在のオブジェクトが表示されます。これは、永続的に作成されてから一時的に削除されていないか、または一時的に作成されたすべてのセキュリティー保護されたオブジェクトです。
.sp
セキュリティー上の理由から、セキュリティー保護されたオブジェクトの値を表示することはできません。 
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれかである必要があります。表示されるセキュリティー保護されたオブジェクトの場合は、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBOBJECT\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトのクラス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護された永続オブジェクトの情報を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vnic\fR [\fB-t\fR] \fB-l\fR \fIlink\fR [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fIvalue\fR | auto | {factory [\fB-n\fR \fIslot-identifier \fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR} | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fIvlan-id\fR] [\fB-p\fR \fIprop\fR=\fIvalue \fR[,...]] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上に \fIvnic-link\fR という名前の VNIC を作成します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VNIC を一時的なものとして指定します。一時的な VNIC は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB--link\fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
\fIlink\fR には物理リンクまたは \fBetherstub\fR を指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIvalue\fR | \fIkeyword\fR, \fB--mac-address\fR=\fIvalue\fR | \fIkeyword\fR\fR
.ad
.sp .6
.RS 4n
指定された値またはキーワードに基づいて VNIC の MAC アドレスを設定します。\fIvalue\fR がキーワードでない場合は、ユニキャスト MAC アドレスとして解釈されます。これは、基礎となる NIC にとって有効なアドレスである必要があります。ユーザー指定の MAC アドレスは、MAC アドレスのグローバルで一意のタイプおよびローカルで管理されるタイプによって指定された範囲から取得する必要があります。
.sp
次の特殊なキーワードを使用できます。
.sp
.ne 2
.mk
.na
\fBfactory [\fB-n\fR \fIslot-identifier\fR],\fR
.ad
.br
.na
\fBfactory [\fB--slot\fR=\fIslot-identifier\fR]\fR
.ad
.sp .6
.RS 4n
ファクトリ MAC アドレスを VNIC に割り当てます。ファクトリ MAC アドレスが要求される場合は、\fB-m\fR を \fB-n\fR オプションと組み合わせて、MAC アドレススロットを指定して使用できます。\fB-n\fR が指定されていない場合、システムは、次に使用可能なファクトリ MAC アドレスを選択します。\fBshow-phys\fR サブコマンドの \fB-m\fR オプションを使用すると、ファクトリ MAC アドレス、そのスロット識別子、およびその可用性を一覧表示できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBrandom\fR [\fB-r\fR \fIprefix\fR],\fR
.ad
.br
.na
\fBrandom [\fB--mac-prefix\fR=\fIprefix\fR]\fR
.ad
.sp .6
.RS 4n
ランダムな MAC アドレスを VNIC に割り当てます。ローカルビットが設定された有効な IEEE OUI で構成されたデフォルトの接頭辞が使用されます。その接頭辞は、\fB-r\fR オプションを使用すると上書きできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvrrp\fR \fB-A\fR {\fBinet\fR | \fBinet6\fR} \fB-V\fR \fIvrid\fR\fR
.ad
.sp .6
.RS 4n
指定されたアドレスファミリと \fIvrid\fR に基づいて、VRRP 仮想 MAC アドレスを VNIC に割り当てます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
最初に、ファクトリ MAC アドレスの使用を試みます。どれも使用できない場合は、ランダムな MAC アドレスを割り当てます。\fB-m\fR オプションが指定されていない場合は、\fBauto\fR がデフォルトの動作です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIvlan-id\fR\fR
.ad
.sp .6
.RS 4n
この VNIC の VLAN タグ付けを有効にします。VLAN タグには、ID \fIvlan-id\fR が割り当てられます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fIvalue\fR,..., \fB--prop\fR \fIprop\fR=\fIvalue\fR,...\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
指定された VNIC を削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vnic\fR [\fB-pPZ\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [\fB-o\fR \fIfield\fR[,...]] [\fB-l\fR \fIlink\fR] [\fB-z\fR \fI zone\fR[,...]] [\fIvnic-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての VNIC、リンク上のすべての VNIC、または指定された \fIvnic-link\fR のみの VNIC 構成情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...] , \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-vnic\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VNIC の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
この VNIC が構成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
VNIC の最大速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESS\fR\fR
.ad
.sp .6
.RS 4n
VNIC の MAC アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRTYPE\fR\fR
.ad
.sp .6
.RS 4n
VNIC の MAC アドレスタイプ。\fBdladm\fR は、次の MAC アドレスタイプを識別します。
.sp
.ne 2
.mk
.na
\fB\fBrandom\fR\fR
.ad
.sp .6
.RS 4n
VNIC に割り当てられたランダムなアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfactory\fR\fR
.ad
.sp .6
.RS 4n
VNIC によって使用されるファクトリ MAC アドレス。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な VNIC 構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
VNIC の統計情報を表示します。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR, \fB--interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が表示される間隔 (秒) を指定するために \fB-s\fR オプションとともに使用されます。このオプションは \fBdlstat\fR(1M) によって廃止されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB--link\fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべての VNIC の情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIib-link\fR [\fB-p\fR \fIprop\fR=\fIvalue\fR[,..]] \fB- P\fR \fIpkey\fR \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上に \fIpart-link\fR という名前の IP-over-IB リンクを作成します。このサブコマンドは、InfiniBand 物理リンク上でのみサポートされます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--force\fR\fR
.ad
.sp .6
.RS 4n
\fIpkey\fR がポート上に存在しない場合、マルチキャストグループが存在しない場合、またはポートが停止している場合でも、パーティションリンクを強制的に作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR, \fB--link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB 物理リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--pkey\fR=\fIpkey\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクを作成するために使用されるパーティションキー。指定された \fIpkey\fR は、接頭辞 \fB0x\fR が付いているかどうかにかかわらず、常に 16 進数として扱われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fIvalue\fR[,..]\fR
.ad
.br
.na
\fB\fB--prop\fR \fIprop\fR=\fIvalue\fR[,..]\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。サポートされるプロパティーについては、後述の「一般的なリンクのプロパティー」の節で説明します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの作成を一時的なものとして指定します。一時的なパーティションリンクは、次回のリブートまで保持されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-part\fR [\fB-R\fR \fIroot-dir\fR] \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたパーティションリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの削除が一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-part\fR [\fB-pP\fR] [\fB-l\fR \fIib-link\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIpart-link\fR]\fR
.ad
.sp .6
.RS 4n
すべてのパーティションリンク、\fIib-link\fR 上のすべてのパーティション、または指定された \fIpart-link\fR のみの IB パーティションリンク情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR, \fB--link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべてのパーティションの情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-part\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEY\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクに関連付けられた \fBPkey\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
このパーティションリンクが作成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの現在の状態。指定可能な値は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクを作成するために使用される状態フラグのセット。指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.RS 5n
.rt  
パーティションは (パーティションが作成可能かどうかがチェックされることなく) 強制的に作成されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
パーティションリンクは一時的なものであり、次回のリブートまでしか保持されません。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IB パーティションリンク構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての IB リンクまたは指定された IB リンク上の IB 物理リンク情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-ib\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHCAGUID\fR\fR
.ad
.sp .6
.RS 4n
HCA のグローバル一意識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTGUID\fR\fR
.ad
.sp .6
.RS 4n
ポートのグローバル一意識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
ポート番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
物理リンクの現在の状態。指定可能な値は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEYS\fR\fR
.ad
.sp .6
.RS 4n
\fBLINK\fR フィールドで指定された IP-over-IB リンクに関連付けられたポート上で使用可能な \fBPkey\fR。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IB 物理リンク構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR\fR
.ad
.sp .6
.RS 4n
指定された名前で etherstub を作成します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
etherstub を一時的なものとして指定します。一時的な etherstub は、リブート後には無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

VNIC は、物理 NIC ではなく etherstub 上に作成できます。物理 NIC と同様に、このような作成によって、スタックは、同じ etherstub 上に作成された VNIC 間に仮想スイッチを暗黙的に作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm delete-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR\fR
.ad
.sp .6
.RS 4n
指定された etherstub を削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub\fR]\fR
.ad
.sp .6
.RS 4n
デフォルトでは、構成されているすべての etherstub を表示します。\fIetherstub\fR が指定されている場合は、指定された etherstub を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fItype\fR [\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,...] \fI iptun-link\fR\fR
.ad
.sp .6
.RS 4n
\fIiptun-link\fR という名前の IP トンネルリンクを作成します。\fBipsecconf\fR(1M) を使用すると、このようなリンクを IPsec でさらに保護できます。
.sp
IP トンネルは、概念的に 2 つの部分で構成されます。1 つは、2 つ以上の IP ノード間の仮想リンク、もう 1 つはこのリンク上の IP インタフェースです。このインタフェースを使用すると、基礎となるリンクによってカプセル化された IP パケットをシステムで送受信できます。このサブコマンドは、仮想リンクを作成します。そのリンク上の IP インタフェースを構成するには、\fBipadm\fR(1M) コマンドを使用します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクを一時的なものとして指定します。一時的なトンネルは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItype\fR, \fB--tunnel-type\fR=\fItype\fR\fR
.ad
.sp .6
.RS 4n
作成されるトンネルのタイプを指定します。タイプは、次のいずれかである必要があります。
.sp
.ne 2
.mk
.na
\fB\fBipv4\fR\fR
.ad
.sp .6
.RS 4n
2 つの IPv4 ノード間のポイントツーポイントな IP-over-IP トンネル。このタイプのトンネルを機能させるには、IPv4 発信元および着信先アドレスが必要です。このようなトンネル上で IPv4 インタフェースと IPv6 インタフェースを plumb すると、IPv4-over-IPv4 および IPv6-over-IPv4 トンネル構成を作成できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBipv6\fR\fR
.ad
.sp .6
.RS 4n
IETF RFC 2473 で定義されている、2 つの IPv6 ノード間のポイントツーポイントな IP-over-IP トンネル。このタイプのトンネルを機能させるには、IPv6 発信元および着信先アドレスが必要です。このようなトンネルの上で IPv4 インタフェースと IPv6 インタフェースを plumb すると、IPv4-over-IPv6 および IPv6-over-IPv6 トンネル構成を作成できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB6to4\fR\fR
.ad
.sp .6
.RS 4n
IETF RFC 3056 で定義されている、6to4 なポイントツーマルチポイントトンネル。このタイプのトンネルを機能させるには、IPv4 発信元アドレスが必要です。このようなトンネルリンク上で IPv6 インタフェースを plumb すると、6to4 ルーターを構成できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,...\fR
.ad
.br
.na
\fB\fB--address\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,...\fR
.ad
.sp .6
.RS 4n
ローカルまたはリモートのトンネルアドレスに対応するリテラル IP アドレスまたはホスト名。ローカルまたはリモートのどちらかを個別に指定することも、その両方をコンマで区切って指定することもできます (たとえば、\fB-a\fR \fBlocal=\fR\fIladdr\fR\fB,remote=\fR\fIraddr\fR)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,... \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
指定された IP トンネルのパラメータを変更します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fR
.ad
.br
.na
\fB\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,...\fR
.ad
.br
.na
\fB\fB--address\fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,...\fR
.ad
.sp .6
.RS 4n
トンネルリンクの新しいローカルアドレスまたはリモートアドレスを指定します。説明については、\fBcreate-iptun\fR を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
指定された IP トンネルリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link\fR]\fR
.ad
.sp .6
.RS 4n
1 つの IP トンネルまたはすべての IP トンネルの IP トンネルリンク構成を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IP トンネル構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。-p には -o オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...] , \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-iptun\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-iptun\fR の \fB-T\fR オプションで指定されたトンネルのタイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクに関連付けられたフラグのセット。指定可能なフラグは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクは IPsec ポリシーによって保護されます。トンネルリンクに関連付けられた IPsec ポリシーを表示するには、次のように入力します。
.sp
.in +2
.nf
# \fBipsecconf -ln -i \fItunnel-link\fR\fR
.fi
.in -2
.sp

IPsec ポリシーを構成する方法の詳細については、\fBipsecconf\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
この IP トンネルリンクは \fBipadm\fR(1M) を使用して暗黙的に作成されたもので、参照されなくなると (つまり、そのトンネルを経由する最後の IP インタフェースが削除されると) 自動的に削除されます。暗黙的なトンネル作成の詳細については、\fBipadm\fR(1M) を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBLOCAL\fR\fR
.ad
.sp .6
.RS 4n
ローカルのトンネルアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREMOTE\fR\fR
.ad
.sp .6
.RS 4n
リモートのトンネルアドレス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-usage\fR [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-p\fR \fIplotfile\fR \fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR] [\fB-e\fR \fItime\fR] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
このサブコマンドは \fBdlstat\fR(1M) \fBshow-link\fR \fB-h\fR コマンドによって廃止されています。
.RE

.SS "解析可能な出力形式"
.sp
.LP
\fBdladm\fR サブコマンドの多くには、出力をマシン解析可能な形式で表示するオプションがあります。出力形式は、コロン (\fB:\fR) で区切られたフィールドで構成された 1 つ以上の行です。表示されるフィールドは、使用されているサブコマンドに固有のもので、特定のサブコマンドの \fB-o\fR オプションに対するエントリの下に一覧表示されます。出力には、\fB-o\fR オプションを使用して要求されたフィールドのみが、要求された順序で表示されます。
.sp
.LP
複数のフィールドを要求した場合、すべてのコロン文字は、バックスラッシュ (\fB\e\fR) でエスケープされてから出力されます。同様に、バックスラッシュ文字もエスケープされます (\fB\e\e\fR)。シェルの \fBread\fR(1) 関数を環境変数 \fBIFS=:\fR とともに使用すると、このエスケープ形式を解析できます (下の「使用例」を参照)。\fB\fR1 つのフィールドのみを要求した場合はエスケープが実行されないことに注意してください。
.SS "一般的なリンクのプロパティー"
.sp
.LP
次の一般的なリンクのプロパティーがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBautopush\fR\fR
.ad
.sp .6
.RS 4n
対応する DLPI デバイスが開かれたときに、あるリンクに関連付けられたストリームにプッシュする STREAMS モジュールのセットを指定します。これは、モジュールのスペース区切りリストです。
.sp
オプションの特殊文字シーケンス \fB[anchor]\fR は、ストリーム上にある、リストで以前に指定されたモジュールに STREAMS アンカーを配置するよう指示します。複数のアンカーを指定したり、リストの先頭にアンカーを配置したりするとエラーになります。
.sp
\fBautopush\fR プロパティーは、より汎用的な \fBautopush\fR(1M) コマンドよりも優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcpus\fR\fR
.ad
.sp .6
.RS 4n
特定のデータリンクのパケットの処理を 1 つのプロセッサまたはプロセッサのセットにバインドします。この値は、1 つ以上のプロセッサ ID のコンマ区切りリストか、または ID の範囲として指定できます。リストが複数のプロセッサで構成されている場合は、処理がすべてのプロセッサに分散されます。各接続について、プロセッサアフィニティーへの接続とパケットの順序は保持されます。
.sp
プロセッサまたはプロセッサのセットは、リンク用に排他的に予約されます。そのリンクの処理に関連付けられたカーネルスレッドと割り込みのみが、指定されたプロセッサまたはプロセッサのセットにバインドされます。指定のプロセッサをそのリンク専用にする場合は、\fBpsrset\fR(1M) を使用すると、プロセッサセットを作成し、そのプロセッサセットからリンクをバインドするプロセッサを指定できます。
.sp
以前の操作によってリンクがすでにプロセッサまたはプロセッサのセットにバインドされている場合、そのバインドは削除され、代わりに新しいプロセッサセットが使用されます。
.sp
デフォルトでは、CPU はバインドされません。つまり、パケットの処理は、どの特定のプロセッサまたはプロセッサセットにもバインドされません。
.sp
\fBpool\fR リンクプロパティーが設定されているリンクでは、\fBcpus\fR プロパティーを指定できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcpus-effective\fR\fR
.ad
.sp .6
.RS 4n
この読み取り専用プロパティーは、指定されたデータリンク上のパケット処理に使用される CPU のリストを表示します。
.sp
\fBcpus\fR プロパティーが設定されている場合、\fBcpus-effective\fR は同じ設定になります。
.sp
\fBpool\fR プロパティーが設定されている場合、\fBcpus-effective\fR は、管理者によって指定されたプールから選択されます。
.sp
\fBpool\fR プロパティーも \fBcpus\fR プロパティーも設定されていない場合、システムは \fBcpus-effective\fR の適切な値を選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxfanout\fR\fR
.ad
.sp .6
.RS 4n
受信側のファンアウトスレッドの数を指定できるようにします。
.sp
受信リング上で受信されるトラフィックを複数のスレッドにファンアウトし、並行して処理することができます。これは特に、システムに多数の CPU が搭載されている場合に有効です。このプロパティーは、特定のデータリンクの受信側のファンアウトスレッドの数を表すカウントです。このプロパティーによって管理者は必要な \fBrxfanout\fR を指定できます。ただし、利用可能な CPU とハードウェア RX リングの数に基づいて、システムは異なる (より小さいか、さらに大きい) ファンアウト値を選択する場合があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxfanout-effective\fR\fR
.ad
.sp .6
.RS 4n
CPU の数が受信側のファンアウトの上限となり、\fBrxrings\fR の数が下限となります。このため、受信側の実際のファンアウト数は、ユーザーが設定したものと異なる可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_limit\fR\fR
.ad
.sp .6
.RS 4n
ブリッジリンク上で学習される新しい MAC 発信元または変更された MAC 発信元の数を制限します。その数がこの値を超えると、そのリンク上での学習は一時的に無効になります。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。
.sp
デフォルト値は \fB1000\fR です。有効な値は 0 以上です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_decay\fR\fR
.ad
.sp .6
.RS 4n
\fBlearn_limit\fR によって制限された発信元の変更の減衰率を指定します。この数値は、5 秒ごとにブリッジリンクのカウンタから減算されます。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。
.sp
デフォルト値は \fB200\fR です。有効な値は 0 以上です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmac-address\fR\fR
.ad
.sp .6
.RS 4n
データリンクのプライマリ MAC アドレスを設定します。設定されている場合は、基本となるデータリンクの現在および将来のすべての MAC クライアントによって使用されるプライマリ MAC アドレスを変更します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmaxbw\fR\fR
.ad
.sp .6
.RS 4n
リンクの全二重帯域幅を設定します。この帯域幅は、いずれかのスケールサフィックス (Kbps、Mbps、または Gbps を示す \fBK\fR、\fBM\fR、または \fBG\fR) が付いた整数として指定されます。単位が指定されていない場合、入力値は Mbps として読み取られます。デフォルトでは、帯域幅の制限はありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpool\fR\fR
.ad
.sp .6
.RS 4n
特定のデータリンクのパケットの処理を、\fBpoolcfg\fR(1M) と \fBpooladm\fR(1M) によって定義および管理されるプロセッサのプールにバインドします。この処理のバインドは、CPU のリストが明示されず、代わりにプール機能によって保持される点を除き、\fBcpus\fR リンクプロパティーで実行される処理と同様です。
.sp
プールが有効になっており、リンクに対してプールが指定されていない場合は、\fBpool_default\fR がパケット処理に使用されます。
.sp
\fBip-type=exclusive\fR が設定されているゾーンで、あるプールが pool zone プロパティーまたは \fBdedicated-cpus\fR 割り当てによって指定されている場合は、そのプールもゾーンに関連付けられているすべてのデータリンクに使用されます。
.sp
\fBcpus\fR リンクプロパティーが設定されているリンクでは \fBpool\fR プロパティーを指定できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpool-effective\fR\fR
.ad
.sp .6
.RS 4n
プール機能が有効になっている場合、この読み取り専用プロパティーは、パケット処理に使用されているプールを表示します。管理者がデータリンクにプールを割り当てていない場合、プールは \fBpool_default\fR になります。
.sp
プール機能が無効になっている場合、有効なプールは存在せず、この値は空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpriority\fR\fR
.ad
.sp .6
.RS 4n
リンクの相対的な優先度を設定します。この値は、トークン \fBhigh\fR、\fBmedium\fR、\fBlow\fR のいずれかとして指定できます。デフォルト値は \fBhigh\fR です。この優先順位は、回線上のどのプロトコル優先順位フィールドでも反映されませんが、システム内のパケット処理スケジューリングに使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxringsavail\fR\fR
.ad
.sp .6
.RS 4n
受信側で使用可能なリングの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxrings\fR\fR
.ad
.sp .6
.RS 4n
MAC クライアントの受信リングの数を指定します。\fBsw\fR という値は、この MAC クライアントに RX リングが割り当てられず、ソフトウェアベースになることを意味します。\fBhw\fR という値は、この MAC クライアントが RX リング (使用可能な場合) を 1 つ取得でき、そうでなければ、ソフトウェアベースになることを意味します。ゼロ以外の値は、この MAC クライアントに対してその数だけリングを予約し (使用可能な場合)、そうでない場合は失敗することを意味します。このプロパティーを指定しない場合、MAC クライアントは RX リング (使用可能な場合) を 1 つ取得でき、そうでなければソフトウェアベースになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
作成可能な追加の RX ハードウェアベースの MAC クライアントの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxringsavail\fR\fR
.ad
.sp .6
.RS 4n
送信側で使用可能なリングの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxrings\fR\fR
.ad
.sp .6
.RS 4n
MAC クライアントの送信リングの数を指定します。\fBsw\fR という値は、この MAC クライアントに TX リングが割り当てられないことを意味します。\fBhw\fR という値は、この MAC クライアントが TX リング (使用可能な場合) を 1 つ取得でき、そうでなければ、ソフトウェアベースになることを意味します。ゼロ以外の値は、この MAC クライアントに対してその数だけリングを予約し (使用可能な場合)、そうでない場合は失敗することを意味します。このプロパティーを指定しない場合、MAC クライアントは TX リング (使用可能な場合) を 1 つ取得でき、そうでなければソフトウェアベースになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
作成可能な追加の TX ハードウェアベースの MAC クライアントの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp\fR\fR
.ad
.sp .6
.RS 4n
ブリッジリンク上の Spanning Tree Protocol を有効または無効にします。この値を \fB0\fR に設定すると、スパニングツリーが無効になり、リンクが BPDU 保護の有効な転送モードになります。このモードは、エンドノードにのみ接続されたポイントツーポイントリンクに適しています。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。デフォルト値は \fB1\fR で、STP が有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBforward\fR\fR
.ad
.sp .6
.RS 4n
VLAN の転送を有効または無効にします。この値を \fB0\fR に設定すると、VLAN リンクのブリッジ転送が無効になります。ブリッジ転送を無効にすると、その VLAN がブリッジの「許可されたセット」から削除されます。デフォルト値は \fB1\fR で、構成された VLAN のブリッジ転送が有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefault_tag\fR\fR
.ad
.sp .6
.RS 4n
デフォルトの VLAN ID を、このリンクとの間で送受信されるタグなしパケットとして設定します。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。この値を \fB0\fR に設定すると、ポートとの間で送受信されるタグなしパケットのブリッジ転送が無効になります。デフォルト値は \fBVLAN ID 1\fR です。有効な値は 0 - 4094 です。デフォルトの VLAN ID は、PVID (Port VLAN Identifier) とも呼ばれます。
.sp
基礎となるリンクのデフォルトの VLAN 値に一致する VLAN ID を持つタグ付き VLAN および VLAN タグ付き VNIC リンクを作成することはできません。リンク上のすべてのタグなしパケットは、すでにデフォルトの VLAN (PVID) に関連付けられています。デフォルトの VLAN 値に等しい VLAN ID を持つタグ付き VLAN または VLAN タグ付き VNIC リンクを正常に作成するには、まず基本となるリンクの \fBdefault_tag\fR プロパティーを別の VLAN 値に変更する必要があります。
.sp
\fBdefault_tag=0\fR に設定すると、リンク上のすべてのタグなしパケットがどの VLAN にも関連付けられなくなります。結果として、1 - 4094 の任意の VLAN ID を持つ VLAN リンクを作成できます。エンドポイントで誤って PVID のタグが付けられた受信パケットはすべてドロップされる可能性があることに注意してください。この状況は、特定のリンク上の一部のエンドポイントが PVID に同意していない場合に発生します。リンク上のエンドポイントはすべて同じ PVID を使用する必要があり、トラフィックに PVID のタグを付けてはいけません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_priority\fR\fR
.ad
.sp .6
.RS 4n
STP と RSTP のポート優先度の値を設定します。この値は、ブリッジ上の推奨されるルートポートを決定するために使用されます。数値が小さいほど、優先度は高くなります。デフォルト値は \fB128\fR です。有効な値の範囲は 0 - 255 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_cost\fR\fR
.ad
.sp .6
.RS 4n
リンクを使用するための STP と RSTP のコストを設定します。デフォルト値は \fBauto\fR です。この場合はリンク速度に基づいてコストが設定され、10Mbps に \fB100\fR、100Mbps に \fB19\fR、1Gbps に \fB4\fR、および 10Gbps に \fB2\fR が使用されます。有効な値の範囲は 1 - 65535 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_edge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジのエッジポート検出を有効または無効にします。\fB0\fR (false) に設定されていると、どのタイプのブリッジ PDU も認識されない場合でも、システムはポートがほかのブリッジに接続されているとみなします。デフォルト値は \fB1\fR で、エッジポートが自動的に検出されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_p2p\fR\fR
.ad
.sp .6
.RS 4n
ブリッジのポイントツーポイント動作モードを設定します。指定可能な値は、\fBtrue\fR、\fBfalse\fR、および \fBauto\fR です。\fBauto\fR に設定すると、ポイントツーポイント接続が自動的に検出されます。\fBtrue\fR に設定すると、ポートモードで強制的にポイントツーポイントが使用されます。\fBfalse\fR に設定すると、ポートモードで強制的に通常のマルチポイントモードが使用されます。デフォルト値は \fBauto\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_mcheck\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で RSTP の \fBForce BPDU Migration Check\fR 手順を実行するようにシステムを起動します。この手順は、このプロパティー値を \fB1\fR に設定することによって開始されます。このプロパティーは、元の \fB0\fR に自動的にリセットされます。この値は、次の条件が満たされないかぎり設定できません。
.RS +4
.TP
.ie t \(bu
.el o
リンクがブリッジされている
.RE
.RS +4
.TP
.ie t \(bu
.el o
ブリッジがスパニングツリーによって保護されている
.RE
.RS +4
.TP
.ie t \(bu
.el o
ブリッジの \fBforce-protocol\fR 値が少なくとも 2 (RSTP) である
.RE
デフォルトの値は 0 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprotection\fR\fR
.ad
.sp .6
.RS 4n
リンク保護の 1 つ以上のタイプを有効にします。有効な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBmac-nospoof\fR\fR
.ad
.sp .6
.RS 4n
MAC アドレスのスプーフィング対策。送信パケットの発信元 MAC アドレスが、そのリンクの構成済み MAC アドレスに一致している必要があります。一致していないパケットはドロップされます。リンクがゾーンに属している場合、\fBmac-nospoof\fR を有効にすると、ゾーンの所有者によってそのリンクの MAC アドレスが変更されることを防止できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBip-nospoof\fR\fR
.ad
.sp .6
.RS 4n
IP アドレスのスプーフィング対策。この保護タイプは、リンクプロパティー \fBallowed-ips\fR と連動します。
.sp
\fBallowed-ips\fR は、IP (IPv4 または IPv6) アドレスを含むリストです。このリストは、デフォルトでは空の状態です。このリストに暗黙的に含まれているアドレスには、RFC 2464 に準拠したリンクローカル IPv6 アドレス (リンクの MAC アドレスから派生)、DHCP 応答から学習された IPv4/IPv6 アドレス、および指定されない (すべて 0 の) IPv4/IPv6 アドレスがあります。
.sp
送信 IP パケットは、その発信元アドレスが \fBallowed-ips\fR に含まれている場合に通過できます。
.sp
送信 ARP パケットは、その送信側プロトコルアドレスが \fBallowed-ips\fR に含まれている場合に通過できます。
.sp
\fBallowed-ips\fR を 1 つ以上の IP アドレスのセットに設定することによってデータリンクが保護されている場、このセットに含まれていない IP アドレスを構成しようとしても失敗し、\fBEPERM\fR エラーがユーザーに返されます。さらに、このインタフェースは IP パケットの転送には使用できず、このインタフェース上で \fBipadm\fR(1M) 転送プロパティーを設定しようとすると \fBEPERM\fR エラーが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdhcp-nospoof\fR\fR
.ad
.sp .6
.RS 4n
DHCP クライアント ID (DHCPv6 の DUID) およびハードウェアアドレスのスプーフィング対策。この保護タイプは、リンクプロパティー \fBallowed-dhcp-cids\fR と連動します。
.sp
\fBallowed-dhcp-cids\fR リスト内の項目は、\fB/etc/default/dhcpagent\fR ファイル内の \fBCLIENT_ID\fR フィールドと同じ方法で書式設定するようにしてください。唯一の違いは、DUID を指定するときに \fB,\fR (コンマ) の代わりに \fB\&.\fR (ピリオド) を使用することです。詳細については、\fBdhcpagent\fR(1M) を参照してください。
.sp
送信 DHCP (v4/v6) パケットは、次の条件が満たされた場合にのみ通過できます。
.RS +4
.TP
.ie t \(bu
.el o
\fBallowed-dhcp-cids\fR が構成されておらず、パケットタイプが次の場合。
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4 の場合、クライアント ID フィールドが構成済み MAC アドレスに一致している必要があります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6 の場合、DUID のタイプが 1 または 3 で、DUID のリンクレイヤーアドレス部が構成済み MAC アドレスに一致している必要があります。
.RE
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBallowed-dhcp-cids\fR が構成されていて、パケットタイプが次の場合。
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4 の場合、クライアント ID フィールドが、このリスト上のいずれかの ID または構成済み MAC アドレスに一致している必要があります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6 の場合、DUID フィールドがこのリスト上のいずれかの ID に一致している必要があるか、または DUID のタイプが 1 または 3 で、かつ DUID のリンクレイヤーアドレス部が構成済み MAC アドレスに一致している必要があります。
.RE
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestricted\fR\fR
.ad
.sp .6
.RS 4n
この保護によって、送信パケットのタイプが IPv4、IPv6、および ARP だけに制限されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
リンクが属しているゾーンを指定します。\fBdladm\fR ではこのプロパティーを一時的にしか変更できないため、\fB-t\fR オプションを指定する必要があります。ゾーンの割り当てがリブート後も持続するように変更するには、\fBzonecfg\fR(1M) を使用してください。指定可能な値は、システム上で現在実行されている任意の排他的 IP ゾーンで構成されます。デフォルトでは、ゾーンのバインドは \fBzonecfg\fR(1M) に従います。
.RE

.SS "WiFi リンクのプロパティー"
.sp
.LP
次の \fBWiFi\fR リンクのプロパティーがサポートされています。あるプロパティーを特定の値に設定できるかどうかは、ドライバやハードウェアによって異なることに注意してください。
.sp
.ne 2
.mk
.na
\fB\fBchannel\fR\fR
.ad
.sp .6
.RS 4n
使用するチャネルを指定します。このプロパティーは、\fBIBSS\fR モードにあるときに、特定の \fBWiFi\fR リンクによってのみ変更できます。デフォルト値や、許可される値の範囲は、規定のドメインごとに異なります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpowermode\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの電源管理モードを指定します。指定可能な値は、\fBoff\fR (電源管理が無効)、\fBmax\fR (最大限の省電力)、および \fBfast\fR (パフォーマンス依存の電源管理) です。デフォルトは \fBoff\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBradio\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの無線モードを指定します。指定可能な値は、\fBon\fR または \fBoff\fR です。デフォルトは \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの固定速度を指定します (Mbps 単位)。設定可能な値のセットは、ドライバやハードウェアによって異なります (ただし、\fBshow-linkprop\fR で表示されます)。一般的な速度は 1、2、11、および 54 です。デフォルトでは、固定速度はありません。 
.RE

.SS "Ethernet リンクのプロパティー"
.sp
.LP
\fBieee802.3\fR(5) に記載されている次の MII プロパティーが、読み取り専用モードでサポートされています。
.RS +4
.TP
.ie t \(bu
.el o
\fBduplex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBstate\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_autoneg_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10gfdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10hdx_cap\fR
.RE
.sp
.LP
各 \fBadv_\fR プロパティー (たとえば \fBadv_10fdx_cap\fR) には、自動ネゴシエーションで使用されるパラメータを制御する、読み取り/書き込み用の対応する \fBen_\fR プロパティー (たとえば \fBen_10fdx_cap\fR) もあります。電源管理が行われていない場合、速度/二重通信の \fBadv\fR* パラメータによって、ネゴシエーション済みで、かつハードウェアで現在有効な値が提供されます。ただし、電源管理が有効になっている場合には、ハードウェアで現在公開されている速度/二重通信機能が、最初のリンクパラメータネゴシエーションで使用されたビットセットのサブセットになっている可能性があります。そのため、MII の \fBadv_\fR* パラメータは読み取り専用としてマークされており、最初のネゴシエーションで速度と二重通信のプロパティーを構成するための \fBen_\fR* パラメータセットが追加されています。
.sp
.LP
\fBadv_autoneg_cap\fR には、対応するプロパティー \fBen_autoneg_cap\fR がないことに注意してください。\fBadv_autoneg_cap\fR は自動ネゴシエーション自体を有効または無効にする 0/1 スイッチであるため、電源管理の影響は受けません。
.sp
.LP
さらに、次の Ethernet プロパティーが報告されます。
.sp
.ne 2
.mk
.na
\fB\fBflowctrl\fR\fR
.ad
.sp .6
.RS 4n
デバイスによって通知されるフロー制御モードを確立します。有効な入力は次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
デバイス上のフロー制御モードは動的に決められます。デバイスで設定された実際のフロー制御モードを表示するには、\fBflowctrl-effective\fR リンクプロパティーを確認します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.sp .6
.RS 4n
有効なフロー制御がありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrx\fR\fR
.ad
.sp .6
.RS 4n
一時停止フレームを受信し、その受信した一時停止フレームに基づいて動作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx\fR\fR
.ad
.sp .6
.RS 4n
輻輳が発生すると相手に一時停止フレームを送信しますが、受信した一時停止フレームは無視します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfc\fR\fR
.ad
.sp .6
.RS 4n
一時停止されるトラフィックの優先順位の値を含む一時停止フレームを送信します。一時停止フレームを受信し、優先順位の値がフレーム内に指定されている値であるトラフィックを操作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbi\fR\fR
.ad
.sp .6
.RS 4n
双方向のフロー制御。
.RE

この値の実際の設定は、デバイスやリンクパートナーによって許可されている機能により制約を受けることに注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp-timeout\fR\fR
.ad
.sp .6
.RS 4n
VID 通知ブロードキャスト間の待機時間を指定します (ミリ秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBflowctrl-effective\fR\fR
.ad
.sp .6
.RS 4n
デバイスで設定された実際のフロー制御モード。\fBflowctrl\fR プロパティーが \fBauto\fR に設定されている場合、これはフロー制御モードが有効であることを表します。これは読み取り専用プロパティーです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtu\fR\fR
.ad
.sp .6
.RS 4n
デバイスでサポートされているクライアントの最大 SDU (送信データ単位)。有効な範囲は 68 - 65536 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntcs\fR\fR
.ad
.sp .6
.RS 4n
デバイスでサポートされているトラフィッククラスの数です。DCB (Data Center Bridging) の拡張機能をサポートしているデバイスは、複数のトラフィッククラスをサポートできます。このプロパティーを使用すると、デバイスが DCB の拡張機能をサポートしているかどうかを判断できます。これは読み取り専用プロパティーです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfcmap\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、PFC (優先順位ベースのフロー制御) が有効になっている 802.1p の優先順位の値を表すために使用します。これは 8 ビットマスクであり、対応する優先順位に対して PFC が有効かどうかを個々のビットで示します。PFC が有効になっている優先順位では、輻輳が発生した場合にデバイスはその優先順位に対して一時停止フレームを送信します。これが関係しているのは、\fBntcs\fR がゼロよりも大きく、\fBflowctrl-effective\fR が \fBpfc\fR である場合のみです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
(読み取り専用) デバイスの動作速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtagmode\fR\fR
.ad
.sp .6
.RS 4n
このリンクプロパティーは、リンク上で送信されているパケットに 802.1Q VLAN タグが挿入される条件を制御します。このプロパティーに割り当てることができるモード値は次の 2 つです。
.sp
.ne 2
.mk
.na
\fB\fBnormal\fR\fR
.ad
.RS 12n
.rt  
次の条件のときに、送信パケットに VLAN タグを挿入します。
.RS +4
.TP
.ie t \(bu
.el o
そのパケットが VLAN に属している。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザーが優先度のタグ付けを要求しました。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlanonly\fR\fR
.ad
.RS 12n
.rt  
送信パケットが VLAN に属している場合にのみ VLAN タグを挿入します。このモードでタグが挿入されているときにユーザーが 0 以外の優先度も要求した場合は、その優先度が尊重されて VLAN タグに含まれます。
.RE

デフォルト値は \fBvlanonly\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-announce\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、VLAN ID の自動通知を制御します。有効になっている場合、デバイス上で構成されているすべての VNIC または VLAN の VID をブロードキャストします。このプロパティーは、物理リンクと集積体の両方をサポートします。指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.sp .6
.RS 4n
VID 通知は送信されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp\fR\fR
.ad
.sp .6
.RS 4n
802.1D で定義されている GVRP プロトコルを使用して通知が送信されます。ブロードキャストの頻度の構成については、\fBgvrp-timeout\fR を参照してください。
.RE

.RE

.SS "InfiniBand リンクのプロパティー"
.sp
.LP
次のプロパティーは、IB パーティションオブジェクトリンク上でのみサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBlinkmode\fR\fR
.ad
.sp .6
.RS 4n
IB パーティションデータリンク上のリンクトランスポートのサービスタイプを設定します。デフォルト値は \fBcm\fR です。有効な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBcm\fR\fR
.ad
.sp .6
.RS 4n
接続モード。このモードでは 65520 のデフォルトの MTU を使用し、65535 バイトの最大 MTU をサポートします。リモートノードに対して接続モードが使用できない場合は、代わりに低信頼データグラムモードが自動的に使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBud\fR\fR
.ad
.sp .6
.RS 4n
低信頼データグラムモード。このモードでは 2044 のデフォルトの MTU を使用し、4092 バイトの最大 MTU をサポートします。
.RE

.RE

.SS "IP トンネルリンクのプロパティー"
.sp
.LP
次の IP トンネルリンクのプロパティーがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBhoplimit\fR\fR
.ad
.sp .6
.RS 4n
トンネルリンクのカプセル化している外側の IP ヘッダーの IPv4 TTL または IPv6 ホップ制限を指定します。このプロパティーは、すべてのトンネルタイプに対して存在します。デフォルトの値は 64 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBencaplimit\fR\fR
.ad
.sp .6
.RS 4n
RFC 2473 で定義されている IPv6 トンネルの IPv6 カプセル化制限を指定します。この値は、特定のトンネルパケットに対するトンネルのネスト制限です。デフォルトの値は 4 です。0 の値を指定すると、カプセル化制限が無効になります。
.RE

.SH 使用例
.LP
\fB例 1 \fR集積体の構成
.sp
.LP
キー 1 を使用してデバイス \fBbge0\fR (リンク名 \fBnet0\fR) および \fBbge1\fR (リンク名 \fBnet1\fR) の集積体上にデータリンクを構成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-aggr -d net0 -d net1 1\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRWiFi リンクへの接続
.sp
.LP
システム上で使用できるセキュリティー保護されていない最適なネットワークに 1 つの \fBWiFi\fR リンクで (\fBconnect-wifi\fR に対して指定された優先順位付け規則に従って) 接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRWiFi キーの作成
.sp
.LP
\fBWEP\fR キー \fBmykey\fR を対話形式で作成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-secobj -c wep mykey\fR
.fi
.in -2
.sp

.sp
.LP
あるいは、ファイルの内容を使用して \fBWEP\fR キー \fBmykey\fR を非対話形式で作成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBumask 077\fR
 # \fBcat >/tmp/mykey.$$ <<EOF\fR
 \fB12345\fR
 \fBEOF\fR
 # \fBdladm create-secobj -c wep -f /tmp/mykey.$$ mykey\fR
 # \fBrm /tmp/mykey.$$\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fR暗号化された指定の WiFi リンクへの接続
.sp
.LP
キー \fBmykey\fR を使用してリンク \fBath0\fR 上の \fBESSID\fR \fBwlan\fR に接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi -k mykey -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fRリンクのプロパティーの変更
.sp
.LP
リンク \fBpcwl0\fR 上で \fBpowermode\fR を値 \fBfast\fR に設定するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p powermode=fast pcwl0\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fRWPA で保護された WiFi リンクへの接続
.sp
.LP
WPA キー \fBpsk\fR を作成し、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
次に、キー \fBpsk\fR を使用してリンク \fBath0\fR 上の ESSID \fBwlan\fR に接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB例 7 \fRリンクの名前の変更
.sp
.LP
\fBbge0\fR リンクの名前を \fBmgmt0\fR に変更するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm rename-link bge0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fRネットワークカードの交換
.sp
.LP
前の例で示した \fBmgmt0\fR というリンク名の \fBbge0\fR デバイスを、ハードウェア障害のために \fBce0\fR デバイスに交換する必要があるとします。\fBbge0\fR NIC を物理的に取り外し、新しい \fBce0\fR NIC に交換します。新しく追加した \fBce0\fR デバイスを、以前に \fBbge0\fR に関連付けられていた \fBmgmt0\fR 構成に関連付けるには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm rename-link ce0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 9 \fRネットワークカードの取り外し
.sp
.LP
前の例で、\fBbge0\fR NIC を別の NIC に交換するのではなく、ハードウェアを取り外すだけで交換は行わない場合を考えてみます。この場合、\fBmgmt0\fR のデータリンク構成を、前の例で示したように別の物理デバイスに関連付けるのではなく、削除する必要があります。物理ハードウェア (この場合は \fBbge0\fR) が取り外された \fBmgmt0\fR データリンクに関連付けられたデータリンク構成を削除するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm delete-phys mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 10 \fR解析可能な出力による単一のフィールドの取得
.sp
.LP
次の割り当てによって、リンク \fBnet0\fR の MTU が \fBmtu\fR という名前の変数に保存されます。

.sp
.in +2
.nf
# \fBmtu=`dladm show-link -p -o mtu net0`\fR
.fi
.in -2
.sp

.LP
\fB例 11 \fR解析可能な出力によるリンクの状態表示
.sp
.LP
次のスクリプトは、システム上の各リンクの状態を表示します。

.sp
.in +2
.nf
# \fBdladm show-link -p -o link,state | while IFS=: read link state; do
            print "Link $link is in state $state"
        done\fR
.fi
.in -2
.sp

.LP
\fB例 12 \fRVNIC の構成
.sp
.LP
1 つの物理リンク \fBbge0\fR 上に \fBhello0\fR および \fBtest1\fR という名前の 2 つの VNIC を作成します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l bge0 hello0\fR
# \fBdladm create-vnic -l bge0 test1\fR
.fi
.in -2
.sp

.LP
\fB例 13 \fRVNIC の構成、および帯域幅と優先度の割り当て
.sp
.LP
1 つの物理リンク \fBbge0\fR 上に \fBhello0\fR および \fBtest1\fR という名前の 2 つの VNIC を作成し、\fBhello0\fR を、ファクトリ MAC アドレスと 50Mbps の最大帯域幅を持つ高優先度の VNIC にします。\fBtest1\fR を、ランダムな MAC アドレスと 100Mbps の最大帯域幅を持つ低優先度の VNIC にします。

.sp
.in +2
.nf
# \fBdladm create-vnic -l bge0 -m factory -p maxbw=50,priority=high hello0\fR
# \fBdladm create-vnic -l bge0 -m random -p maxbw=100M,priority=low test1\fR
.fi
.in -2
.sp

.LP
\fB例 14 \fRファクトリ MAC アドレスを持つ VNIC の構成
.sp
.LP
最初に、使用可能なファクトリ MAC アドレスを一覧表示し、いずれかのアドレスを選択します。

.sp
.in +2
.nf
# \fBdladm show-phys -m bge0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      no
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.sp
.LP
\fBhello0\fR という名前の VNIC を作成し、スロット 1 のアドレスを使用します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l bge0 -m factory -n 1 hello0\fR
# \fBdladm show-phys -m bge0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      yes      hello0
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.LP
\fB例 15 \fRユーザー指定の MAC アドレスを持つ VNIC の作成、およびプロセッサのセットへのバインド
.sp
.LP
ユーザー指定の MAC アドレスと \fB0、2、4-6\fR のプロセッサバインドを持つ、VNIC という名前の \fBhello0\fR を作成します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l bge0 -m 8:0:20:fe:4e:b8 -p cpus=0,2,4-6 hello0\fR
.fi
.in -2
.sp

.LP
\fB例 16 \fR物理 NIC のない仮想ネットワークの作成
.sp
.LP
最初に、\fBstub1\fR という名前の etherstub を作成します。

.sp
.in +2
.nf
# \fBdladm create-etherstub stub1\fR
.fi
.in -2
.sp

.sp
.LP
etherstub 上に \fBhello0\fR と \fBtest1\fR という名前の 2 つの VNIC を作成します。この操作によって、\fBhello0\fR と \fBtest1\fR を接続する仮想スイッチが暗黙的に作成されます。

.sp
.in +2
.nf
# \fBdladm create-vnic -l stub1 hello0\fR
# \fBdladm create-vnic -l stub1 test1\fR
.fi
.in -2
.sp

.LP
\fB例 17 \fRブリッジ情報の表示
.sp
.LP
次の各コマンドは、オプションを指定しない場合とさまざまなオプションを指定した場合の \fBshow-bridge\fR サブコマンドを使用しています。

.sp
.in +2
.nf
# \fBdladm show-bridge\fR
BRIDGE       PROTECT ADDRESS           PRIORITY DESROOT
foo          stp     32768/8:0:20:bf:f 32768    8192/0:d0:0:76:14:38
bar          stp     32768/8:0:20:e5:8 32768    8192/0:d0:0:76:14:38

# \fBdladm show-bridge -l foo\fR
LINK         STATE        UPTIME   DESROOT
hme0         forwarding   117      8192/0:d0:0:76:14:38
qfe1         forwarding   117      8192/0:d0:0:76:14:38

# \fBdladm show-bridge -s foo\fR
BRIDGE       DROPS        FORWARDS
foo          0            302

# \fBdladm show-bridge -ls foo\fR
LINK         DROPS     RECV      XMIT
hme0         0         360832    31797
qfe1         0         322311    356852

# \fBdladm show-bridge -f foo\fR
DEST              AGE     FLAGS  OUTPUT
8:0:20:bc:a7:dc   10.860  --     hme0
8:0:20:bf:f9:69   --      L      hme0
8:0:20:c0:20:26   17.420  --     hme0
8:0:20:e5:86:11   --      L      qfe1
.fi
.in -2
.sp

.LP
\fB例 18 \fRIPv4 トンネルの作成
.sp
.LP
次の一連のコマンドは、66.1.2.3 と 192.4.5.6 の間に \fBmytunnel0\fR という名前の永続的な IPv4 トンネルリンクを作成してから、そのリンクを表示しています。

.sp
.in +2
.nf
# \fBdladm create-iptun -T ipv4 -a local=66.1.2.3,remote=192.4.5.6 mytunnel0\fR
# \fBdladm show-iptun mytunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
mytunnel0       ipv4  --     66.1.2.3            192.4.5.6
.fi
.in -2
.sp

.sp
.LP
このトンネルリンク上に、ポイントツーポイント IP インタフェースを作成できます。

.sp
.in +2
.nf
# \fBipadm create-ip mytunnel0\fR
# \fBipadm create-addr -T static -a local=10.1.0.1,remote=10.1.0.2 \e\fR
\fBmytunnel0/addr\fR
# \fBipadm show-addr mytunnel0/addr\fR
ADDROBJ           TYPE     STATE        ADDR
mytunnel0/addr    static   ok           10.1.0.1->10.1.0.2
.fi
.in -2
.sp

.LP
\fB例 19 \fR6to4 トンネルの作成
.sp
.LP
次のコマンドは、6to4 トンネルリンクを作成します。6to4 ルーターの IPv4 アドレスは 75.10.11.12 です。

.sp
.in +2
.nf
# \fBdladm create-iptun -T 6to4 -a local=75.10.11.12 sitetunnel0\fR
# \fBdladm show-iptun sitetunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
sitetunnel0     6to4  --     75.10.11.12         --
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、このトンネル上に IPv6 インタフェースを作成します。

.sp
.in +2
.nf
# \fBipadm create-ip sitetunnel0\fR
# \fBipadm show-addr sitetunnel0/_a\fR
ADDROBJ           TYPE     STATE        ADDR
sitetunnel0/_a    static   ok           2002:4b0a:b0c::1/16
.fi
.in -2
.sp

.sp
.LP
システムは 6to4 IP インタフェース上に IPv6 アドレスを自動的に構成することに注意してください。6to4 トンネルリンク上で IPv6 アドレスが構成される方法については、\fBipadm\fR(1M) を参照してください。

.LP
\fB例 20 \fRリンク保護の使用
.sp
.LP
リンク保護を有効にするには:

.sp
.in +2
.nf
# \fBdladm set-linkprop \e\fR
\fB-p protection=mac-nospoof,restricted,ip-nospoof,dhcp-nospoof vnic0\fR
.fi
.in -2
.sp

.sp
.LP
リンク保護を無効にするには: 

.sp
.in +2
.nf
# \fBdladm reset-linkprop -p protection vnic0\fR
.fi
.in -2
.sp

.sp
.LP
\fBallowed-ips\fR リストを変更するには: 

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-ips=10.0.0.1,10.0.0.2 vnic0\fR
.fi
.in -2
.sp

.sp
.LP
\fBallowed-dhcp-cids\fR リストを変更するには: 

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-dhcp-cids=hello vnic0\fR
.fi
.in -2
.sp

.sp
.LP
結果の構成を表示するには: 

.sp
.in +2
.nf
# \fBdladm show-linkprop -p protection,allowed-ips vnic0\fR

LINK     PROPERTY         PERM   VALUE        DEFAULT   POSSIBLE
vnic0    protection       rw     mac-nospoof, --        mac-nospoof,
                                 restricted,            restricted,
                                 ip-nospoof,            ip-nospoof,
                                 dhcp-nospoof           dhcp-nospoof

vnic0    allowed-ips      rw     10.0.0.1,    --        --
                                 10.0.0.2

vnic0    allowed-dhcp-cids rw    hello        --        --
.fi
.in -2
.sp

.LP
\fB例 21 \fRIB パーティションの作成
.sp
.LP
次のコマンドは、物理リンク \fBibp0\fR 上にパーティションキー \fB0xffff\fR を持つパーティション \fBffff.ibp0\fR を作成します。

.sp
.in +2
.nf
# \fBdladm create-part -P ffff -l ibp0 ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB例 22 \fRIB パーティション情報の表示
.sp
.LP
次のコマンドは、IB パーティション情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-part\fR
LINK         PKEY OVER         STATE    FLAGS
ffff.ibp0    FFFF ibp0         up       ----
.fi
.in -2
.sp

.LP
\fB例 23 \fRIB データリンク情報の表示
.sp
.LP
次のコマンドは、IB データリンク情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-ib\fR
LINK         HCAGUID         PORTGUID        PORT STATE  PKEYS
ibp0         3BA000100CD7C   3BA000100CD7D   1    down   FFFF
ibp1         3BA000100CD7C   3BA000100CD7E   2    down   FFFF
ibp3         5AD0000033634   5AD0000033636   2    up     FFFF,8001
ibp2         5AD0000033634   5AD0000033635   1    up     FFFF,8001
.fi
.in -2
.sp

.LP
\fB例 24 \fRパーティションの削除
.sp
.LP
次のコマンドは、パーティション \fBffff.ibp0\fR を削除します。

.sp
.in +2
.nf
# \fBdladm delete-part ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB例 25 \fR\fBshow-link\fR によるパーティション情報の表示
.sp
.LP
次のコマンドは、\fBshow-link\fR サブコマンドを使用してパーティション情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK        CLASS     MTU    STATE    OVER
e1000g0     phys      1500   up       --
e1000g1     phys      1500   unknown  --
ibp0        phys      65520  down     --
ibp3        phys      65520  up       --
ibp2        phys      65520  up       --
ibp1        phys      65520  down     --
pffff.ibp0  part      2044   down     ibp0
p8001.ibp2  part      65520  unknown  ibp2
.fi
.in -2
.sp

.LP
\fB例 26 \fR大域ゾーンからのすべてのゾーン内のリンクの表示
.sp
.LP
次に示す \fBshow-link\fR コマンドは、大域ゾーンからすべてのゾーン内のデータリンクを表示します。大域ゾーンに含まれないリンクは、ゾーン名の接頭辞のあとにスラッシュ (\fB/\fR) 区切り文字を付けて表示されます。

.sp
.LP
この例では、\fBnet0\fR は大域ゾーン内で作成された VNIC であり、\fBzone1/net0\fR は \fBzone1\fR に対して自動的に作成された VNIC であり、\fBzone2/net0\fR は \fBzone2\fR に対して自動的に作成された VNIC です。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
zone1/net0          vnic      1500   up       e1000g0
zone2/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 27 \fR大域ゾーン内のリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、大域ゾーン内のデータリンクのみを表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z global\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 28 \fR指定されたゾーンのリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、特定の非大域ゾーン内のデータリンクを表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 29 \fR大域ゾーンからの指定されたゾーンのリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、特定の非大域ゾーン内のデータリンクを大域ゾーンから表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 30 \fR非大域ゾーン内のリンクの表示
.sp
.LP
次に示す \fBshow-link\fR は、\fBzone1\fR から呼び出され、そのゾーンのデータリンクのみを表示します。

.sp
.LP
\fBshow-link\fR の出力では、\fBzone1/\fR 接頭辞は表示されません。接頭辞が表示されないのは、このコマンドがゾーンの内部から呼び出されたからです。

.sp
.in +2
.nf
# \fBzlogin zone1\fR
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
net0                vnic      1500   up       ?
.fi
.in -2
.sp

.LP
\fB例 31 \fR-Z オプションを使用した現在のゾーンの表示
.sp
.LP
下記のコマンドでは、次の条件を前提としています。

.RS +4
.TP
.ie t \(bu
.el o
リンク \fBnet1\fR は現在 \fBzoneA\fR に割り当てられています。エントリ \fBnet1\fR および \fBzoneA/net1\fR は同じリンクを表しています。これらの 2 つのエントリの \fBZONE\fR 列は同じで、リンクが現在割り当てられているゾーンの名前になります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBnet2\fR はどの非大域ゾーンにも割り当てられていません。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneB/net2\fR は、\fBzoneB\fR 用に作成された自動 VNIC です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneC/net2\fR は、\fBzoneC\fR 用に作成された自動 VNIC です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneD/net2\fR は、\fBzoneD\fR の内側で作成された IP トンネルです。\fBnet1\fR の場合と異なり、\fBnet2\fR の各エントリは異なるリンクを表します。これらのエントリの \fBZONE\fR 列は異なります。
.RE
.sp
.in +2
.nf
# \fBdladm show-link -Z\fR
LINK        ZONE      CLASS     MTU    STATE    OVER
e1000g0     global    phys      1500   up       --
e1000g1     global    phys      1500   up       --
net1        zoneA     vnic      1500   up       e1000g0
zoneA/net1  zoneA     vnic      1500   up       e1000g0
net2        global    vnic      1500   up       e1000g1
zoneB/net2  zoneB     vnic      1500   up       e1000g1
zoneC/net2  zoneC     vnic      1500   up       e1000g1
zoneD/net2  zoneD     iptun     65515  up       --
.fi
.in -2
.sp

.SH 属性
.sp
.LP
次の属性については、\fBattributes\fR(5) を参照してください。
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.sp
.LP
\fB/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.sp
.LP
\fB/usr/sbin\fR と \fB/sbin\fR の両方について、\fBshow-aggr\fR、\fBshow-link\fR、および \fBshow-vnic\fR サブコマンドの \fB-s\fR オプションと \fB-i\fR オプションは「確実/廃止」です。
.sp
.LP
\fB/usr/sbin\fR と \fB/sbin\fR の両方について、\fBshow-linkprop\fR の *\fBeffective\fR プロパティーはインタフェースの安定性が「流動的」です。
.sp
.LP
前述の \fBdladm\fR サブコマンドで説明されているブリッジ関連のサブコマンドを使用するには \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要です。
.SH 関連項目
.sp
.LP
\fBacctadm\fR(1M), \fBautopush\fR(1M), \fBdhcpagent\fR(1M), \fBdlstat\fR(1M), \fBifconfig\fR(1M), \fBipadm\fR(1M), \fBipsecconf\fR(1M), \fBndd\fR(1M), \fBpooladm\fR(1M), \fBpoolcfg\fR(1M), \fBpsrset\fR(1M), \fBvrrpadm\fR(1M), \fBwpad\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBieee802.3\fR(5), \fBdlpi\fR(7P)
.SH 注意事項
.sp
.LP
集積体のサブコマンドで集積体を参照する場合は、リンク名で参照することをお勧めします。整数キーによる集積体の参照は、下位互換性のためにサポートされていますが、必要ではありません。\fI\fR集積体を作成するときにリンク名の代わりにキーが指定されている場合は、その集積体のリンク名が \fBdladm\fR によって \fBaggr\fR\fIkey\fR として自動的に生成されます。\fI\fR
