Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/dlstat.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH dlstat 1M "2011 年 8 月 4 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dlstat \- データリンクの統計情報の報告
.SH 形式
.LP
.nf
\fBdlstat\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat\fR [\fB-a\fR | \fB-A\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]]
     [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-phys\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR]
     [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-link\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR]
     [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-link\fR \fB-h\fR [\fB-Z\fR] [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR]
          [\fB-e\fR time] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdlstat show-aggr\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [\fB-o\fR \fIfield\fR[,...]]
     [\fB-u\fR R|K|M|G|T|P] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.SH 機能説明
.sp
.LP
\fBdlstat\fR コマンドは、データリンクに関する実行時統計情報を報告します。\fBdladm\fR(1M) \fBshow-phys\fR は、\fBdlstat show-phys\fR にリンク名情報を提供します。\fBdladm\fR(1M) \fBshow-link\fR は、\fBdlstat show-link\fR にリンク名情報を提供します。\fBdladm\fR(1M) \fBshow-aggr\fR は、\fBdlstat show-aggr\fR にリンク集積体情報を提供します。
.sp
.LP
\fBdlstat\fR には、前述の「\fB形式\fR」に示されている 6 つの形式のコマンドがあります。最初の 2 つの形式にはサブコマンドがないのに対し、残りの形式にはあります。6 つの形式はすべて、後述の「サブコマンド」で説明されています。
.SH オプション
.sp
.LP
\fBdlstat\fR コマンドには次のオプションとオペランドがあります。これらは、(特に明示的にマークされていないかぎり) 後述の「サブコマンド」に示されているいくつかのコマンド形式の間で共通です。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
統計情報フィールド全体をすべてダンプします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が更新される間隔を秒単位で指定します。デフォルトの間隔は 1 秒です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りリストを表示します (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはサポートされるすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。
.sp
サポートされる RX フィールドは次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
\fBlink\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBindex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBrbytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBintrs\fR (サブコマンドなしで、または \fBshow-link\fR とともにのみ適用可能)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBpolls\fR (サブコマンドなしで、または \fBshow-link\fR とともにのみ適用可能)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBidrops\fR (サブコマンドなしで、または \fBshow-link\fR とともにのみ適用可能)
.RE
TX 側のフィールドは次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
\fBlink\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBindex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBobytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBopkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBodrops\fR (サブコマンドなしで、または \fBshow-link\fR とともにのみ適用可能)
.RE
\fBshow-phys\fR サブコマンドでは、\fBindex\fR カラムは物理デバイス内の個々の RX および TX ハードウェアリングを識別します。\fBshow-link\fR サブコマンドでは、\fBindex\fR カラムはデータリンク内の RX および TX ハードウェアレーンを識別します。ハードウェアリングとハードウェアレーンの違いについての説明は、\fI『『Oracle Solaris Administration: Network Interfaces and Network Virtualization』』\fRを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
受信側の統計情報のみを表示します。受信されたバイト数とパケット数や、ハードウェアとソフトウェアのドロップなどが含まれます。完全な一覧については、「使用例」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
送信側の統計情報のみを表示します。送信されたバイト数とパケット数や、ドロップなどが含まれます。完全な一覧については、「使用例」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR\fR
.ad
.sp .6
.RS 4n
使用した場合、すべての統計情報の表示単位を選択できます (たとえば、\fBR\fR: 生カウント、\fBK\fR: キロビット、\fBM\fR: メガビット、\fBT\fR: テラビット、\fBP\fR: ペタビット)。使用しない場合、必要に応じて異なる単位が使用され、\fIxy.zU\fR 形式で統計情報が表示されます (\fIx\fR、\fIy\fR、および \fIz\fR は数値、\fIU\fR は該当する単位です)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
指定されたゾーン内のリンクのみの統計情報を表示します。デフォルトでは、大域ゾーンから実行されている場合、\fBdlstat\fR はすべてのゾーン内のリンクの統計情報を表示します。
.sp
非大域ゾーンから実行されている場合、\fBdlstat\fR はそのゾーン内のリンクのみの統計情報を表示します。非大域ゾーンでは、ほかのゾーン内のリンクを表示することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fIlink\fR\fR
.ad
.sp .6
.RS 4n
使用した場合、指定のリンク、物理デバイス (\fBshow-phys\fR の場合)、または集積体 (\fBshow-aggr\fR の場合) のみの統計情報を表示します。それ以外の場合は、すべてのリンク、デバイス、または集積体の統計情報を表示します。
.RE

.SH サブコマンド
.sp
.LP
\fBdlstat\fR は、次のコマンド形式をサポートします。
.sp
.ne 2
.mk
.na
\fB\fBdlstat\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
すべてのリンクを繰り返し検査して、統計情報を報告します。出力は、リンク使用率の高い順にソートされます。リンクが指定されていない場合、システムはすべてのリンクの統計情報を表示します。トラフィックの統計情報は、物理デバイスごとにではなく、リンクごとに表示されます。たとえば、ある物理リンク上に構成されている VNIC について、その VNIC を通過するトラフィックは、ベースとなる物理リンクの統計情報には反映されません。ただし、リンクの統計情報には、そのリンク上に構成されたユーザー定義のフローに一致するトラフィックが含まれます。
.sp
このコマンド形式には、前述の「オプション」で説明されていないオプションが 1 つあります。
.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
このデータリンクのすべての統計情報フィールドをダンプします。このコマンドの出力統計情報には、ほかのすべての \fBdlstat\fR コマンドによって報告されるすべての統計情報が含まれます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat\fR [\fB-a\fR | \fB-A\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fB M\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
どの統計情報を表示するかを指定できます。
.sp
このコマンド形式のオプションは、前述の「オプション」で説明されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat show-phys\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fB R\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
物理デバイスの統計情報を表示します。
.sp
このサブコマンドのオプションは、前述の「オプション」で説明されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlstat show-link\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-a\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fB R\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
リンクの統計情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdlstat show-link\fR \fB-h\fR [\fB-Z\fR] [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR] [\fB-e\fR \fItime\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
格納されている拡張アカウンティングファイルからネットワーク使用率の履歴を表示します。この構文を使用するには、\fBacctadm\fR(1M) によってネットワークアカウンティングがあらかじめ構成され、有効になっている必要があります。デフォルトの出力は、拡張アカウンティングが有効になっていた全期間における既存のリンクのネットワーク使用率の要約です。
.sp
\fIlink\fR 引数は、前述の「オプション」で説明されているとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
拡張アカウンティングが有効になっている場合に、特定の期間におけるすべてのネットワーク使用率の履歴を表示します。これには、すでに削除されたリンクに関する使用率の情報が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
ネットワーク使用率の履歴の拡張アカウンティングレコードが読み取られるファイルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
ロギング情報が存在する日付を表示します。日付は、\fImm\fR/\fIdd\fR/\fI yyyy\fR の形式で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
ネットワーク使用率の履歴情報の出力形式を指定します。\fBgnuplot\fR が唯一のサポートされる形式です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fItime\fR\fR
.ad
.br
.na
\fB\fB-e\fR \fItime\fR\fR
.ad
.sp .6
.RS 4n
データ表示の開始時刻と停止時刻を指定します。時刻は、\fIMM\fR/\fIDD\fR/\fI \fRYYYY\fI,\fRhh\fI:\fRmm\fI ss\fR の形式で指定します。\fIhh\fR は 24 時間表記を使用します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdlstat show-aggr\fR [\fB-r\fR | \fB-t\fR] [\fB-Z\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR \fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
1 つの集積体についてポートごとの統計情報を表示します。
.sp
このサブコマンドのオプションは、前述の「オプション」で説明されています。
.RE

.SH 使用例
.LP
\fB例 1 \fR統計情報の表示
.sp
.LP
すべてのリンクの統計情報を表示するには、次のコマンドを入力します。統計情報は、3 桁の数値 + 小数点 + 2 桁の数値に、該当する単位が付けられた形で表示されます。

.sp
.in +2
.nf
# \fBdlstat\fR
      LINK   IPKTS  RBYTES   OPKTS  OBYTES
   e1000g0 101.88K  32.86M  40.16K   4.37M
     nxge1   4.50M   6.78G   1.38M  90.90M
     vnic1       8     336       0       0
      net0  73.96K   6.81M       0       0
zone1/net0 144.47K  13.32M     247  16.29K
zone2/net0 132.89K  12.25M     236  15.82K
.fi
.in -2
.sp

.LP
\fB例 2 \fRRX 側の統計情報の表示
.sp
.LP
次のコマンドは、1 秒ごとの受信側の統計情報を表示します。

.sp
.in +2
.nf
# \fBdlstat -r -i 1\fR
    LINK   IPKTS  RBYTES   INTRS   POLLS   IDROPS
e1000g0 101.91K  32.86M  87.56K  14.35K         0
  nxge1   9.61M  14.47G   5.79M   3.82M         0
  vnic1       8     336       0       0         0
e1000g0       0       0       0       0         0
  nxge1  82.13K 123.69M  50.00K  32.13K         0
  vnic1       0       0       0       0         0
      .       .       .       .       .         .
      .       .       .       .       .         .
.fi
.in -2
.sp

.LP
\fB例 3 \fRハードウェアリングごとの統計情報の表示
.sp
.LP
次のコマンドは、受信側のハードウェアリングごとの統計情報を表示します。

.sp
.in +2
.nf
# \fBdlstat show-phys -r nxge1\fR
 LINK TYPE   INDEX   IPKTS  RBYTES
nxge1   rx       0       0       0
nxge1   rx       1       0       0
nxge1   rx       2   1.73M   2.61G
nxge1   rx       3       0       0
nxge1   rx       4   8.44M  12.71G
nxge1   rx       5   5.68M   8.56G
nxge1   rx       6   4.90M   7.38G
nxge1   rx       7       0       0
.fi
.in -2
.sp

.LP
\fB例 4 \fRレーンごとの統計情報の表示
.sp
.LP
次のコマンドは、受信側のレーンごとの統計情報を表示します。最初に、専用のハードウェアレーンを備えたインタフェースが表示されます。

.sp
.in +2
.nf
# \fBdlstat show-link -r nxge1\fR
 LINK TYPE     ID INDEX   IPKTS  RBYTES   INTRS   POLLS  IDROPS
nxge1   rx  local    --       0       0       0       0       0
nxge1   rx     hw     1       0       0       0       0       0
nxge1   rx     hw     2   1.73M   2.61G   1.33M 400.22K       0
nxge1   rx     hw     3       0       0       0       0       0
nxge1   rx     hw     4   8.44M  12.71G   4.35M   4.09M       0
nxge1   rx     hw     5   5.68M   8.56G   3.72M   1.97M       0
nxge1   rx     hw     6   4.90M   7.38G   3.11M   1.80M       0
nxge1   rx     hw     7       0       0       0       0       0
.fi
.in -2
.sp

.sp
.LP
次に、専用のハードウェアレーンがなく、ソフトウェアレーンのみを備えたインタフェースが表示されます。

.sp
.in +2
.nf
# \fBdlstat show-link -r ixgbe0\fR
  LINK TYPE     ID INDEX   IPKTS  RBYTES   INTRS   POLLS IDROPS
ixgbe0   rx  local    --       0       0       0       0      0
ixgbe0   rx     sw    -- 794.28K   1.19G 794.28K       0      0
.fi
.in -2
.sp

.LP
\fB例 5 \fR送信側の統計情報の表示
.sp
.LP
次のコマンドは、送信側の統計情報を 5 秒間隔で表示します。

.sp
.in +2
.nf
# \fBdlstat -t -i 5\fR
  LINK   OPKTS  OBYTES  ODROPS
e1000g0  40.24K   4.37M      0
  nxge1   9.76M 644.14M      0
  vnic1       0       0      0
e1000g0       0       0      0
  nxge1  26.82K   1.77M      0
  vnic1       0       0      0
      .       .       .      .
      .       .       .      .
      .       .       .      .
.fi
.in -2
.sp

.LP
\fB例 6 \fR送信側のリングの統計情報の表示
.sp
.LP
次のコマンドは、送信側のハードウェアリングの統計情報を表示します。

.sp
.in +2
.nf
# \fBdlstat show-phys -t nxge1\fR
 LINK TYPE INDEX   OPKTS  OBYTES
nxge1   tx     0      44   3.96K
nxge1   tx     1       0       0
nxge1   tx     2   1.48M 121.68M
nxge1   tx     3   2.45M 201.11M
nxge1   tx     4   1.47M 120.82M
nxge1   tx     5       0       0
nxge1   tx     6   1.97M 161.57M
nxge1   tx     7   4.59M 376.21M
nxge1   tx     8   2.43M 199.24M
nxge1   tx     9       0       0
nxge1   tx     10  3.23M 264.69M
nxge1   tx     11  1.88M 153.96M
.fi
.in -2
.sp

.LP
\fB例 7 \fR送信側のレーンの統計情報の表示
.sp
.LP
次のコマンドは、送信側のレーンの統計情報を表示します。

.sp
.in +2
.nf
# \fBdlstat show-link -t nxge1\fR
 LINK TYPE     ID INDEX   OPKTS  OBYTES  ODROPS
nxge1   tx     hw     0      32   1.44K       0
nxge1   tx     hw     1       0       0       0
nxge1   tx     hw     2   1.48M  97.95M       0
nxge1   tx     hw     3   2.45M 161.87M       0
nxge1   tx     hw     4   1.47M  97.25M       0
nxge1   tx     hw     5       3     276       0
nxge1   tx     hw     6   1.97M 130.05M       0
nxge1   tx     hw     7   4.59M 302.80M       0
nxge1   tx     hw     8   2.42M 302.80M       0
nxge1   tx     hw     9       0       0       0
nxge1   tx     hw     10  3.23M 213.05M       0
nxge1   tx     hw     11  1.88M 123.93M       0
.fi
.in -2
.sp

.LP
\fB例 8 \fR統計情報の特定のセットの選択
.sp
.LP
次のコマンドは、表示したい統計情報のセットを選択する方法を示しています。

.sp
.in +2
.nf
# \fBdlstat show-link -r -o LINK,TYPE,ID,INDEX,INTRS,POLLS nxge1\fR
 LINK TYPE     ID INDEX   INTRS   POLLS
nxge1   rx  local    --       0       0
nxge1   rx  other    --       0       0
nxge1   rx     hw     1       0       0
nxge1   rx     hw     2   2.47M 753.90K
nxge1   rx     hw     3       0       0
nxge1   rx     hw     4   8.24M   7.72M
nxge1   rx     hw     5   6.96M   3.68M
nxge1   rx     hw     6   5.82M   3.36M
nxge1   rx     hw     7       0       0
.fi
.in -2
.sp

.LP
\fB例 9 \fRネットワーク使用率の履歴の表示
.sp
.LP
ネットワーク使用率の履歴の統計情報は、拡張アカウンティング機能 \fBacctadm\fR(1M) を使用すると格納できます。そのためには、次のようなコマンドを使用します。

.sp
.in +2
.nf
# \fBacctadm -e basic -f /var/log/net.log net\fR
\fBacctadm net\fR
Network accounting: active
    Network accounting file: /var/log/net.log
  Tracked Network resources: basic
Untracked Network resources: src_ip,dst_ip,src_port,dst_port,protocol,
                             dsfield
.fi
.in -2
.sp

.sp
.LP
その後、格納された履歴データは、次のようなコマンドを使用することで、要約形式で取得できます。

.sp
.in +2
.nf
# \fBdlstat show-link -h -f /var/log/net.log\fR
LINK      DURATION  IPACKETS RBYTES      OPACKETS OBYTES      BANDWIDTH
e1000g0   80        1031     546908      0        0           2.44 Kbps
.fi
.in -2
.sp

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照
.TE

.sp
.LP
画面出力は「不確実」です。呼び出しは「確実」です。
.SH 関連項目
.sp
.LP
\fBacctadm\fR(1M), \fBdladm\fR(1M), \fBifconfig\fR(1M), \fBkstat\fR(1M), \fBnetstat\fR(1M), \fBattributes\fR(5)
