Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/dsbitmap.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH dsbitmap 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dsbitmap \- Availability Suite ビットマップボリュームのサイズ計算
.SH 形式
.LP
.nf
\fBdsbitmap\fR \fB-h\fR
.fi

.LP
.nf
\fBdsbitmap\fR \fB-p\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.LP
.nf
\fBdsbitmap\fR \fB-r\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.SH 機能説明
.sp
.LP
\fBdsbitmap\fR コマンドは、指定されたデータボリュームで使用するために必要な Availability Suite ビットマップボリュームのサイズを計算します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBdsbitmap\fR コマンドの使用法に関するメッセージを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fB\fIdata_volume\fR\fR \fB[\fIbitmap_volume\fR]\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIdata_volume\fR について、\fBdsbitmap\fR は、関連付けられている Availability Suite ポイントインタイムのビットマップボリュームにとって必要なサイズを計算して表示します。可能性のあるすべての Availability Suite ポイントインタイムセット構成のビットマップボリュームサイズが表示されます。これらの構成には、独立シャドウ、フルサイズ依存シャドウ、および小型依存シャドウが含まれます。オプションの \fIbitmap_volume\fR 引数が指定された場合、\fBdsbitmap\fR は、このボリュームが \fIdata_volume\fR のビットマップボリュームとして使用するための十分な大きさがあるかどうかを判定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fB\fIdata_volume\fR\fR \fB[\fIbitmap_volume\fR]\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIdata_volume\fR について、\fBdsbitmap\fR は、関連付けられている Availability Suite 遠隔ミラーのビットマップボリュームにとって必要なサイズを計算して表示します。可能性のあるすべての Availability Suite 遠隔ミラーセット構成のビットマップボリュームサイズが表示されます。これらの構成には、同期複製のほか、メモリーキュー、ディスクキュー、および 32 ビットの refcount を備えた非同期複製が含まれます。オプションの \fIbitmap_volume\fR 引数が指定された場合、\fBdsbitmap\fR は、このボリュームが \fIdata_volume\fR のビットマップボリュームとして使用するための十分な大きさがあるかどうかを判定します。
.RE

.SH 使用法
.sp
.LP
\fBdsbitmap\fR は通常、必要なビットマップボリュームサイズを判定したあと、作成されたビットマップボリュームが適切かどうかを確認するために、Sun StorageTek Availability Suite ソフトウェアの初期の構成段階でシステム管理者によって使用されます。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
正常終了。ビットマップボリュームの名前が指定された場合は、そのボリュームのサイズが十分な大きさで、可能性のあるすべての使用方法に対応できることを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 13n
.rt  
コマンド行で無効なオプションが指定されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 13n
.rt  
指定されたビットマップボリュームは、ディスクキューを備えた非同期セットの Availability Suite 遠隔ミラービットマップとして使用するための十分な大きさはありませんが、ほかのすべての遠隔ミラーセット構成に使用するための十分な大きさはあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 13n
.rt  
指定されたビットマップボリュームは、遠隔ミラーセット構成の Availability Suite 遠隔ミラービットマップとして使用するための十分な大きさがありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 13n
.rt  
指定されたビットマップボリュームは、遠隔ミラーセット構成の Availability Suite 遠隔ミラービットマップとして使用するための十分な大きさがありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 13n
.rt  
指定されたビットマップボリュームは、小型依存シャドウの Availability Suite ポイントインタイムビットマップとして使用するための十分な大きさがありませんが、ほかのすべてのポイントインタイムセット構成に使用できるだけの大きさは持っています。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-cache-management
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBiiadm\fR(1M), \fBsndradm\fR(1M), \fBattributes\fR(5)
