Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/dscfgadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH dscfgadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dscfgadm \- Availability Suite 構成の場所およびサービスのための管理コマンド
.SH 形式
.LP
.nf
\fBdscfgadm\fR \fB-i\fR
.fi

.LP
.nf
\fBdscfgadm\fR \fB-e\fR [\fB-r\fR] [\fB-p\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-d\fR [\fB-r\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-s\fR
.fi

.SH 機能説明
.sp
.LP
\fBdscfgadm\fR コマンドは、構成の場所を設定したり、Availability Suite サービスを有効または無効にしたりする機能を提供することによって、Availability Suite 構成の場所とサービスを制御します。
.SH オプション
.sp
.LP
\fBdscfgadm\fR コマンドの引数を指定しない場合、このユーティリティーでは、構成の場所の設定やサービスの開始を対話形式で実行できます。構成の場所は、サイズやファイルタイプなどの条件を満たしていることを確認するために検証されてから、使用のために初期化されます。
.sp
.LP
\fBdscfgadm\fR コマンドは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR [\fB-r\fR ]\fR
.ad
.sp .6
.RS 4n
Availability Suite SMF サービスを無効にします。これには、デーモンの停止や、現在 Availability Suite ソフトウェアの下で有効になっているすべてのポイントインタイムコピーまたは遠隔ミラーセットの中断が含まれます。追加オプションなしで実行された場合は、\fB-d\fR オプションによって、すべての Availability Suite サービスが無効になります。この設定はシステムのブート後も永続します。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
\fB-d\fR または \fB-e\fR オプションに渡された場合は、遠隔ミラーサービス上でのみ動作します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR [\fB-r\fR ] [\fB-p\fR]\fR
.ad
.sp .6
.RS 4n
Availability Suite SMF サービスを有効にします。これには、デーモンの起動や、以前に Availability Suite ソフトウェアの下で構成されたすべてのポイントインタイムコピーまたは遠隔ミラーセットの再開が含まれます。追加オプションなしで実行された場合は、\fB-e\fR オプションによって、すべての Availability Suite サービスが有効になります。この設定はシステムのブート後も永続します。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
\fB-d\fR または \fB-e\fR オプションに渡された場合は、遠隔ミラーサービス上でのみ動作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
\fB-e\fR オプションに渡された場合は、ポイントインタイムコピーサービスのみが有効になります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
Availability Suite SMF サービスに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Sun Cluster 構成に固有の情報を含む構成データベースの場所を設定できるようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
プログラム実行中に詳細なデバッグ情報を表示します。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-cache-management
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfg\fR(1M), \fBiiadm\fR(1M), \fBscmadm\fR(1M), \fBsndradm\fR(1M), \fBsvadm\fR(1M), \fBattributes\fR(5)
