Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/dscfg.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH dscfg 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dscfg \- Sun StorageTek Availability Suite ソフトウェアの構成ツール
.SH 形式
.LP
.nf
\fBdscfg\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-L\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-h\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-i\fR [\fB-p\fR \fIparser_config_file\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-a\fR \fIconfig_file\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR] \fB-s\fR \fIconfig_location\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-D\fR \fIdgname\fR
.fi

.SH 機能説明
.sp
.LP
\fBdscfg\fR コマンドは、構成データベースを初期化、一覧表示、フォーマット、および復元する機能を提供することによって Availability Suite 構成を制御します。 
.SH オプション
.sp
.LP
オプションが指定されていない場合、\fBdscfg\fR は現在のローカル構成の場所を表示します。\fBdscfg\fR コマンドは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
構成データベースへのアクセスを制御するロックのステータスを表示します。構成データベースがロックされている場合は、ロックのタイプ (読み取りまたは書き込み) が、そのロックを保持するプロセスのプロセス ID とともに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBdscfg\fR コマンドの使用法に関するメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
構成データベースを初期化します。以前または現在の構成情報が削除されるため、このオプションでは、続行する前に削除を確認するプロンプトが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIparser_config_file\fR\fR
.ad
.sp .6
.RS 4n
\fB-i\fR オプションとともに使用された場合、\fBdscfg\fR はパーサー構成ファイルを永続構成に読み込み、構成データベースを再フォーマットします。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIconfig_file\fR を構成に復元します。このオプションでは、ファイルのエラーチェックは行われません。このオプションを使用すると、構成ファイルが無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
現在の構成データベースの内容を \fB-a\fR オプションに適した形式で一覧表示します。\fB-s\fR オプションと組み合わせて使用された場合は、\fB-s\fR オプションに渡された場所に格納されている内容を表示しますが、構成の場所は設定しません。
.RE

.sp
.LP
次のオプションは、Sun Cluster で構成されたシステムでのみ有効です。\fIgroup\fR には、Sun Cluster デバイスグループ、またはローカルデバイスを示す '-' のどちらかを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIgroup\fR\fR
.ad
.sp .6
.RS 4n
クラスタ構成データベースの場所を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-i\fR\fR
.ad
.sp .6
.RS 4n
指定されたグループにのみ関連付けられた構成データベースエントリを初期化します。以前または現在の構成情報が削除されるため、このオプションでは、続行する前に削除を確認するプロンプトが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-p\fR\ \fIparser_config_file\fR\fR
.ad
.sp .6
.RS 4n
\fB-i\fR オプションとともに使用された場合、\fBdscfg\fR はパーサー構成ファイルを永続的な構成に読み込み、指定されたグループにのみ関連付けられた構成データベースエントリを再フォーマットします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \ \fIgroup\fR\ \fB-a\fR\ \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIconfig_file\fR を、指定されたグループにのみ関連付けられた構成データベースエントリに復元します。このオプションでは、ファイルのエラーチェックは行われません。このオプションを使用すると、構成ファイルが無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\ \fIgroup\fR\ \fB-l\fR\fR
.ad
.sp .6
.RS 4n
指定されたリソースグループに関連付けられた現在の構成データベースの内容を一覧表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \ \fIgroup\fR\ \fB-s\fR\ \fIconfig_file_location\fR\fR
.ad
.sp .6
.RS 4n
Sun Cluster 構成データベースが存在する場所を指定します。この場所は、DID デバイスである必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIdevice_group\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIdevice_group\fR が Sun Cluster によって認識されているかどうか、およびこのノード上で使用可能かどうかを確認します。デバイスグループのステータスを示す情報を表示します。戻り値は次のとおりです。 
.sp
(echo $? を使用して戻り値を取得します) 
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
デバイスグループは Sun Cluster 内にあり、このノード上でアクティブです。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
デバイスグループは Sun Cluster 内にありますが、別のノード上でアクティブです。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.RS 13n
.rt  
デバイスグループは Sun Cluster 内にありません。
.RE

.RE

.SH 使用法
.sp
.LP
\fBdscfg\fR コマンドは通常、パッケージインストールスクリプトなどのほかのスクリプトや、\fBdscfgadm\fR(1M) から実行されます。これは一般的な用途向けではありません。\fBdscfgadm\fR に含まれていない \fBdscfg\fR の使用については、『\fIAvailability Suite Troubleshooting Guide\fR』を参照してください。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_format\fR\fR
.ad
.sp .6
.RS 4n
パーサー構成ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_local\fR\fR
.ad
.sp .6
.RS 4n
クラスタタグを持たないすべてのエントリ用の構成の場所
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dscfg_cluster\fR\fR
.ad
.sp .6
.RS 4n
Sun Cluster 構成データベースの場所を指定する参照ファイル
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-cache-management
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfgadm\fR(1M), \fBiiadm\fR(1M), \fBscmadm\fR(1M), \fBsndradm\fR(1M), \fBsvadm\fR(1M), \fBds.log\fR(4), \fBattributes\fR(5)
