Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/flowstat.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH flowstat 1M "2011 年 7 月 13 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
flowstat \- フロー統計の報告
.SH 形式
.LP
.nf
\fBflowstat\fR [\fB-r\fR | \fB-t\fR] [\fB-i\fR \fIinterval\fR] [\fB-l\fR \fIlink\fR] [\fIflow\fR]
.fi

.LP
.nf
\fBflowstat\fR [\fB-S\fR] [\fB-A\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]]
     [\fB-u\fR R|K|M|G|T|P] [\fIlink\fR] [\fB-l\fR \fIlink\fR] [\fIflow\fR]
.fi

.LP
.nf
\fBflowstat\fR \fB-h\fR [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR]
     [\fB-e\fR time] [\fIflow\fR]
.fi

.SH 機能説明
.sp
.LP
\fBflowstat\fR コマンドは、ユーザー定義フローに関する実行時統計情報を報告します。\fBflowadm show-flow\fR は、このコマンド向けにフロー名の情報を提供します。
.SH オプション
.sp
.LP
\fBflowstat\fR コマンドには次のオプションとオペランドがあります。これらは、後述の「サブコマンド」に示されているいくつかのコマンド形式の間で共通です。
.SH サブコマンド
.sp
.LP
\fBflowstat\fR は、次のコマンド形式をサポートします。
.sp
.ne 2
.mk
.na
\fB\fBflowstat\fR [\fB-r\fR | \fB-t\fR] [\fB-i\fR \fIinterval\fR] [\fB-l\fR \fIlink\fR] [\fIflow\fR]\fR
.ad
.sp .6
.RS 4n
この形式のコマンドは、すべてのフローを繰り返し検査して統計情報を報告します。出力は、フロー使用率の高い順にソートされます。フローが指定されていない場合、システムはすべてのフローの統計情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
受信側の統計情報のみを表示します。受信されたバイト数とパケット数や、ドロップなどが含まれます。完全な一覧については、例を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
送信側の統計情報のみを表示します。送信されたバイト数とパケット数や、ドロップなどが含まれます。後述の例を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が更新される間隔を秒単位で指定します。デフォルトの間隔は 1 秒です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR | \fIflow\fR]\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべてのフローの統計情報または指定されたフローの統計情報を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBflowstat\fR [\fB-S\fR] [\fB-A\fR] [\fB-i\fR \fIinterval\fR] [\fB-p\fR] [ \fB-o\fR \fIfield\fR[,...]] [\fB-u\fR \fBR\fR|\fBK\fR|\fBM \fR|\fBG\fR|\fBT\fR|\fBP\fR] [\fB-l\fR \fIlink\fR] [\fIflow\fR]\fR
.ad
.sp .6
.RS 4n
この形式のコマンドでは、どの統計情報を表示するかを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
このフローのすべての統計情報フィールドをダンプします。このコマンドの出力統計情報には、ほかのすべての \fBflowstat\fR コマンドによって報告されるすべての統計情報が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報が更新される間隔を秒単位で指定します。デフォルトの間隔は 1 秒です。
.RE

.sp
.ne 2
.mk
.na
\fB{\fB-l\fR \fIlink\fR} | \fIflow\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべてのフローまたは指定されたフローの統計情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りリストを表示します (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはサポートされるすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。
.sp
サポートされる RX フィールドの一覧:
.RS +4
.TP
.ie t \(bu
.el o
\fBflow\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBrbytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBidrops\fR
.RE
TX フィールドの一覧:
.RS +4
.TP
.ie t \(bu
.el o
\fBflow\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBobytes\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBopkts\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBodrops\fR
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
\fBprstat\fR(1M) が CPU 使用率をプロセス別に表示するのと似た方法で、フロー別のネットワーク使用率を継続的に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fBR\fR|\fBK\fR|\fBM\fR|\fBG\fR|\fBT\fR|\fBP\fR\fR
.ad
.sp .6
.RS 4n
使用した場合、すべての統計情報の表示単位を選択できます (たとえば、\fBR\fR: 生の数値、\fBK\fR: キロビット、\fBM\fR: メガビット、\fBT\fR: テラビット、\fBP\fR: ペタビット)。使用しなかった場合、必要に応じて異なる単位を使用して統計情報が表示されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBflowstat\fR \fB-h\fR [\fB-a\fR] \fB-f\fR \fIfilename\fR [\fB-d\fR] [\fB-F\fR \fIformat\fR] [\fB-s\fR \fItime\fR] [\fB-e\fR \fI time\fR] [\fIflow\fR]\fR
.ad
.sp .6
.RS 4n
格納されている拡張アカウンティングファイルからネットワーク使用率の履歴を表示します。この構文を使用するには、\fBacctadm\fR(1M ) によってネットワークアカウンティングがあらかじめ構成され、有効になっている必要があります。デフォルトでは、拡張アカウンティングが有効になっていた全期間における既存のリンクのネットワーク使用率の要約が出力されます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
拡張アカウンティングが有効になっている場合に、特定の期間におけるすべてのネットワーク使用率の履歴を表示します。これには、すでに削除されたフローの使用率の情報が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
ネットワークフロー使用率の履歴の拡張アカウンティングレコードが読み取られるファイルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
ロギング情報が存在する日付を表示します。日付は、\fImm\fR/\fIdd\fR/\fI yyyy\fR の形式で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
ネットワークフロー使用率の履歴情報の出力形式を指定します。\fBgnuplot\fR が唯一のサポートされる形式です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fItime\fR\fR
.ad
.br
.na
\fB\fB-e\fR \fItime\fR\fR
.ad
.sp .6
.RS 4n
データ表示の開始時刻と停止時刻を指定します。時刻は、\fIMM\fR/\fIDD\fR/\fI \fRYYYY\fI,\fRhh\fI:\fRmm\fI ss\fR の形式で指定します。\fIhh\fR は 24 時間表記を使用します。
.RE

.RE

.SH オペランド
.sp
.LP
\fBflowstat\fR コマンドの各形式にはオペランドが 1 つ含まれていますが、これは省略可能です。
.sp
.ne 2
.mk
.na
\fB\fIflow\fR\fR
.ad
.sp .6
.RS 4n
指定された場合、指定されたフローについてのみ報告します。それ以外の場合は、すべてのフローについて報告します。フローは \fIzonename\fR/\fIflowname\fR という形式の名前を持ちます。\fIzonename\fR 修飾子の付いていない \fIflowname\fR は、大域ゾーン内に存在するものと理解されます。
.RE

.SH 使用例
.LP
\fB例 1 \fR統計情報の表示
.sp
.LP
すべてのフローの統計情報を表示するには、次のコマンドを入力します。統計情報は、3 桁の数値に該当する単位が付けられた形で表示されます。デフォルトの間隔は 1 秒です。

.sp
.in +2
.nf
# \fBflowstat -i 1\fR
 FLOW   IPKTS  RBYTES  IDROPS   OPKTS  OBYTES  ODROPS
flow1 528.54K 787.39M       0 179.39K  11.85M       0
flow2 742.81K   1.10G       0       0       0       0
flow3       0       0       0       0       0       0
flow1  67.73K 101.02M       0  21.04K   1.39M       0
flow2       0       0       0       0       0       0
flow3       0       0       0       0       0       0
            .       .       .       .       .       .
            .       .       .       .       .       .
            .       .       .       .       .       .
.fi
.in -2
.sp

.LP
\fB例 2 \fR受信側の統計情報の表示
.sp
.LP
次のコマンドは受信側の統計情報を表示します

.sp
.in +2
.nf
# \fBflowstat -r\fR
 FLOW   IPKTS  RBYTES  IDROPS
flow1   4.01M   5.98G       0
flow2 742.81K   1.10G       0
flow3       0       0       0
.fi
.in -2
.sp

.LP
\fB例 3 \fR送信側の統計情報の表示
.sp
.LP
次のコマンドは、送信側の統計情報を 5 秒間隔で表示します。

.sp
.in +2
.nf
# \fBflowstat -t\fR
 FLOW   OPKTS  OBYTES  ODROPS
flow1  24.37M   1.61G       0
flow2       0       0       0
flow3       4     216       0
.fi
.in -2
.sp

.LP
\fB例 4 \fR統計情報の特定のセットの表示
.sp
.LP
次のコマンドは、指定された一連の統計情報フィールドを表示します。

.sp
.in +2
.nf
# \fBflowstat -o FLOW,IPKTS\fR
 FLOW   IPKTS
flow1  68.58M
flow2 742.81K
flow3       4
.fi
.in -2
.sp

.LP
\fB例 5 \fRネットワーク使用率の履歴の表示
.sp
.LP
フロー使用率の統計は、拡張アカウンティング機能 \fBacctadm\fR(1M) を使用すると格納できます。

.sp
.in +2
.nf
# \fBacctadm -e extended -f /var/log/net.log net\fR
# \fBacctadm net\fR
         Network accounting: active
    Network accounting file: /var/log/net.log
  Tracked Network resources: extended
Untracked Network resources: none
.fi
.in -2
.sp

.sp
.LP
保存されたデータを取得するには、次のようにします。

.sp
.in +2
.nf
# \fBflowstat -h -f /var/log/net.log\fR
LINK      DURATION  IPACKETS RBYTES      OPACKETS OBYTES      BANDWIDTH
flowtcp   100       1031     546908      0        0            43.76Kbps
flowudp   0         0        0           0        0             0.00Mbps
.fi
.in -2
.sp

.sp
.LP
2008 年 2 月 19 日 10 時 38 分 46 秒から同じ日の 10 時 40 分 06 秒までの \fBflowtcp\fR のロギング情報を表示するには、次のようにします。

.sp
.in +2
.nf
# \fBflowstat -h -s 02/19/2008,10:39:06 -e 02/19/2008,10:40:06 \e\fR
\fB-f /var/log/net.log flowtcp\fR
FLOW      START       END         RBYTES   OBYTES     BANDWIDTH
flowtcp   10:39:06    10:39:26    1546     6539        3.23 Kbps
flowtcp   10:39:26    10:39:46    3586     9922        5.40 Kbps
flowtcp   10:39:46    10:40:06    240      216       182.40 bps
flowtcp   10:40:06    10:40:26    0        0           0.00 bps
.fi
.in -2
.sp

.sp
.LP
上と同じ出力情報をプロットファイルとして生成するには、次のようにします。

.sp
.in +2
.nf
# \fBflowstat -h -s 02/19/2008,10:39:06 -e 02/19/2008,10:40:06 \e\fR
\fB-F gnuplot -f /var/log/net.log flowtcp\fR
# \fBTime tcp-flow\fR
10:39:06 3.23
10:39:26 5.40
10:39:46 0.18
10:40:06 0.00
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
アクションはすべて正常に実行されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照
.TE

.sp
.LP
画面出力は「不確実」です。呼び出しは「確実」です。
.SH 関連項目
.sp
.LP
\fBacctadm\fR(1M), \fBdladm\fR(1M), \fBdlstat\fR(1M), \fBflowadm\fR(1M), \fBifconfig\fR(1M), \fBprstat\fR(1M), \fBroute\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P)
