Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/fmstat.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH fmstat 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
fmstat \- 障害管理モジュールの統計情報の報告
.SH 形式
.LP
.nf
\fBfmstat\fR [\fB-astTz\fR] [\fB-d\fR u | d ] [\fB-m\fR \fImodule\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH 機能説明
.sp
.LP
\fBfmstat\fR ユーティリティーは、管理者とサービス担当者が Solaris Fault Manager (\fBfmd\fR(1M)) および関連する一連のモジュールに関連付けられた統計情報を報告するために使用できます。Fault Manager は各 Solaris システムのバックグラウンドで実行されます。Fault Manager は、システムソフトウェアが検出した問題に関する遠隔測定情報を受け取り、問題を診断し、障害のあるコンポーネントの無効化などの予測的自己修復操作を開始します。
.sp
.LP
\fBfmstat\fR を使って、障害管理に現在関与している診断エンジンおよびエージェントの統計情報を表示できます。\fBfmd\fR(1M)、\fBfmadm\fR(1M)、および \fBfmdump\fR(1M) の各ドキュメントには、障害管理操作を監視するツールに関する詳しい説明があります。 
.sp
.LP
\fBfmstat\fR に \fB-m\fR オプションまたは \fB-t\fR オプションを指定すると、指定した障害管理モジュールに保持されている統計情報が報告されます。モジュールのリストは、\fBfmadm config\fR を使って取得できます。 
.sp
.LP
\fBfmstat\fR に \fB-m\fR オプションを指定しないと、クライアントモジュールごとに次の統計情報が報告されます。 
.sp
.ne 2
.mk
.na
\fB\fBmodule\fR\fR
.ad
.RS 11n
.rt  
\fBfmadm config\fR で報告される障害管理モジュールの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBev_recv\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが受け取った遠隔測定イベントの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBev_acpt\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが診断に必要なものとして受け入れたイベントの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwait\fR\fR
.ad
.RS 11n
.rt  
そのモジュールによる検査を待っている遠隔測定イベントの平均数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsvc_t\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが受け取った遠隔測定イベントの平均サービス時間 (ミリ秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%w\fR\fR
.ad
.RS 11n
.rt  
そのモジュールによる検査を待っている遠隔測定イベントが存在した時間の割合。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%b\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが遠隔測定イベントを処理していた時間の割合。
.RE

.sp
.ne 2
.mk
.na
\fB\fBopen\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが所有するアクティブなケース (未完了の問題調査) の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsolve\fR\fR
.ad
.RS 11n
.rt  
そのモジュールが読み込み後に解決したケースの合計数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmemsz\fR\fR
.ad
.RS 11n
.rt  
そのモジュールによって現在割り当てられている動的メモリーの量。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbufsz\fR\fR
.ad
.RS 11n
.rt  
そのモジュールによって現在割り当てられている永続バッファー領域の量。
.RE

.sp
.LP
\fBfmstat\fR ユーティリティーを使用するユーザーは、\fBSYS_ADMIN\fR 特権を持っている必要があります。Solaris 特権を構成する方法の詳細については、\fI『System Administration Guide: Security Services』\fRを参照してください。
.SH オプション
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 13n
.rt  
\fBfmd\fR に保持されている情報も含めて、モジュールに関するすべての統計情報を出力します。\fB-a\fR オプションを指定しないと、モジュールに保持されている統計情報だけが報告されます。\fB-m\fR \fImodule\fR を設定せずに \fB-a\fR オプションを使用すると、\fBfmd\fR に関連する一連のグローバル統計情報が表示されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBu\fR | \fBd\fR\fR
.ad
.RS 13n
.rt  
タイムスタンプを表示します。
.sp
時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。 標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImodule\fR\fR
.ad
.RS 13n
.rt  
デフォルトの統計レポートの代わりに、指定した障害管理モジュールに関連する統計情報のレポートを出力します。モジュールは、Sun が障害管理ソフトウェア自体を保守するのに役立つ任意の統計情報を公開できます。モジュールの統計情報は、非公開インタフェースとなります。非公開インタフェースに関する Sun の規則については、\fBattributes\fR(5) を参照してください。障害管理モジュールの統計情報の値は予告なしに変更されることがあるため、これらの値に依存するスクリプトを作成しないでください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 13n
.rt  
デフォルトのモジュール統計レポートの代わりに、モジュールに関連付けられた Soft Error Rate Discrimination (SERD) エンジンに関するレポートを出力します。SERD エンジンは、一定の時間 \fIT\fR におけるイベント数 \fIN\fR として測定された統計値がしきい値を超えたかどうかを判定するために障害管理ソフトウェアが使用する構成体です。\fB-s\fR オプションは、必ず \fB-m\fR オプションと組み合わせて使用します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 13n
.rt  
個々の障害管理イベント転送に関連する統計情報のレポートを出力します。個々の障害管理モジュールは、1 つ以上のイベント転送の実装を提供できます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.RS 13n
.rt  
個々の障害管理イベント転送に関連する権限情報のテーブルを出力します。\fB-m\fR オプションを指定すると、指定したモジュールに関連する転送だけが表示されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.RS 13n
.rt  
指定した障害管理モジュールに関するレポートから、値が 0 の統計情報を省略します。\fB-z\fR オプションは、必ず \fB-m\fR オプションと組み合わせて使用します。 
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
count レポートのみを出力して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
\fIinterval\fR 秒ごとに新しいレポートを出力します。
.RE

.sp
.LP
\fIinterval\fR と \fIcount\fR を指定しないと、レポートを 1 つだけ出力して \fBfmstat\fR が終了します。\fIinterval\fR を指定して \fIcount\fR を指定しないと、\fBfmstat\fR はコマンドが中断されるまで \fIinterval\fR 秒ごとにレポートを出力し続けます。
.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
致命的なエラーが発生。致命的なエラーは、\fBfmd\fR(1M) との通信の失敗である可能性があります。また、要求された操作を実行するのに必要な特権が不十分だった可能性もあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR \fR
.ad
.RS 6n
.rt  
無効なコマンド行オプションが指定されました。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/fault-management
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
コマンド行オプションは「確実」です。人間が読めるデフォルトのレポートは不確実です。人間が読めるモジュールレポートは非公開です。
.SH 関連項目
.sp
.LP
\fBfmadm\fR(1M), \fBfmd\fR(1M), \fB fmdump\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fI『System Administration Guide: Security Services 』\fR
