Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/format.1m
'\" te
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH format 1M "2011 年 6 月 23 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
format \- ディスクのパーティション分割および保守のためのユーティリティー
.SH 形式
.LP
.nf
\fBformat\fR [\fB-f\fR \fIcommand-file\fR] [\fB-l\fR \fIlog-file\fR] [\fB-x\fR \fIdata-file\fR] 
     [\fB-d\fR \fIdisk-name\fR] [\fB-t\fR \fIdisk-type\fR] [\fB-p\fR \fIpartition-name\fR] 
     [\fB-s\fR] [\fB-m\fR] [\fB-M\fR] [\fB-e\fR] [\fIdisk-list\fR]
.fi

.LP
.nf
\fBformat\fR \fB-L\fR \fIlabel-type\fR \fB-d\fR \fIdisk-name\fR
.fi

.SH 機能説明
.sp
.LP
\fBformat\fR を使用すると、システムディスクのフォーマット、ラベル付け、修復、および分析が行えます。従来のディスク保守用プログラムとは異なり、\fBformat\fR は SunOS 環境で実行します。システムの稼働中はシステムディスクへの操作が制限されるので、\fBformat\fR はメモリー常駐型のシステム環境でも使用することができます。しかし、大部分のアプリケーションでは、SunOS 環境で \fBformat\fR を実行する方が簡単です。
.sp
.LP
\fB-x\fR オプションが指定されると、\fBformat\fR は最初に \fIdata-file\fR で定義されているディスクリストを使用します。次に \fBformat\fR は、\fBFORMAT_PATH\fR 環境変数、コロンで区切られたファイル名またはディレクトリ (あるいはその両方) のリストを調べます。ディレクトリの場合、\fBformat\fR はそのディレクトリで \fBformat.dat\fR というファイルを検索します。ファイル名は絶対パス名でなければならず、そのまま使用されます。\fBformat\fR は指定された各ファイルのディスクおよびパーティション定義をすべて作業用セットに追加します。複数の同じ定義は無視され、そのことが通知されることはありません。\fBFORMAT_PATH\fR が設定されていない場合、パスはデフォルトで \fB/etc/format.dat\fR になります。
.sp
.LP
\fIdisk-list\fR は、\fBc?t?d?\fR、\fB/dev/rdsk/c?t?d?s?\fR、または \fB/dev/chassis/?/disk\fR 形式のディスクリストです。最後の 2 つの形式では、シェルのワイルドカード指定がサポートされています。たとえば、\fB/dev/rdsk/c2*\fR を指定すると、\fBformat\fR はコントローラ \fBc2\fR だけに接続されている全ドライブを操作対象とします。\fIdisk-list\fR が指定されていない場合、\fBformat\fR は、操作対象となり得る、システム上に存在するすべてのディスクを一覧表示します。\fB\fR
.sp
.LP
着脱式メディア装置がリストに含まれるのは、ユーザーがエキスパートモード (\fB-e\fR オプション) で \fBformat\fR を実行した場合だけです。この機能は、下位互換性を確保するために用意されています。書き替え可能な着脱式メディア装置には \fBrmformat\fR(1) を使用します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdisk-name\fR\fR
.ad
.RS 21n
.rt  
format プログラム開始時にカレントにするディスクを指定します。ディスクは、その論理名 (\fB-d\fR \fBc0t1d0\fR や \fB/dev/chassis/SYS/HD0/disk\fR など) で指定します。ディスクリストにディスクを 1 つだけ指定しても、同じ結果が得られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 21n
.rt  
\fBSCSI\fR エキスパートメニューを有効にします。ただし、このオプションは、不用意に使用しないでください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIcommand-file\fR\fR
.ad
.RS 21n
.rt  
標準入力ではなく、\fIcommand-file\fR からコマンド入力を受け付けます。ファイルにはキーボードから入力した場合とまったく同じコマンドが指定されていなければなりません。このオプションが指定されている場合、\fBformat\fR は \fBcontinue?\fR プロンプトを出力しません。\fIcommand-file\fR 内に y(es) または n(o) の応答を指定する必要はありません。非対話モードの場合、\fBformat\fR はディスク選択番号の入力を求めることはありません。format を起動するときに、\fB-d\fR\fI disk-name\fR オプションを使用して現在の作業用ディスクを指定するか、または \fIcommand-file\fR に \fBdisk\fR およびディスク選択番号を指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlog-file\fR\fR
.ad
.RS 21n
.rt  
指定された \fIlog-file\fR に \fBformat\fR セッションのトランスクリプトを記録します。これには標準入力、標準出力、および標準エラー出力が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIlabel-type\fR\fR
.ad
.RS 21n
.rt  
ただちに、かつ非対話形式でタイプ \fIlabel-type\fR のデフォルトラベルを、\fB-d\fR で指定されたディスクに書き込みます。\fIlabel-type\fR には \fBefi\fR または \fBvtoc\fR を指定する必要があります。既存のラベルがある場合は、\fIlabel-type\fR で上書きされます。x86 マシンでは、ディスク全体がデフォルトで、\fIlabel-type\fR のラベルが付いた 1 つの Solaris パーティションになり、すべての \fBfdisk\fR パーティションは失われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 21n
.rt  
拡張メッセージを有効にします。エラー発生時に詳細情報が得られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.RS 21n
.rt  
拡張メッセージおよび診断メッセージを有効にします。フォーマット中に、 \fBSCSI\fR デバイスのモードページの状態についてさまざまな情報が得られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpartition-name\fR\fR
.ad
.RS 21n
.rt  
プログラムの開始時にカレントにするディスクのパーティションテーブルを指定します。このテーブルは、データファイルで定義されている名前を使用して指定します。このオプションを使用できるのは、ディスクがカレントになっており、さらにディスクタイプが指定されているか、ディスクタイプがディスクラベルから取得できる場合に限られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 21n
.rt  
サイレント。あらゆる標準出力を抑制します。エラーメッセージは引き続き表示されます。このオプションは通常、\fB-f\fR オプションと組み合わせて使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdisk-type\fR\fR
.ad
.RS 21n
.rt  
プログラムの開始時にカレントにするディスクのタイプを指定します。ディスクタイプは、データファイルで定義されている名前を使用して指定します。このオプションを使用できるのは、前述のとおり、ディスクがカレントになっている場合に限られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fIdata-file\fR\fR
.ad
.RS 21n
.rt  
\fIdata-file\fR に指定されているディスクのリストを使用します。
.RE

.SH 使用法
.sp
.LP
オプションを指定しないで format を起動した場合、あるいは、\fB-e\fR、\fB-l\fR、\fB-m\fR、\fB-M\fR、または \fB-s\fR オプションを指定して format を起動した場合、使用できるディスクを示した番号付きリストが表示され、リスト内の番号でディスクを指定するように求められます。マシンに 2 画面以上のディスクが搭載されている場合は、スペースキーを押して、次の 1 画面分のディスクを表示します。
.sp
.LP
ディスクが現在の画面に表示されていなくても、リスト内の番号でディスクを指定できます。たとえば、画面にディスク 11 ～ 20 が表示されている場合に \fB25\fR を入力すると、リスト内の 25 番目のディスクを指定できます。現在の画面に表示されていないディスクの番号を入力した場合は、選択の確認を求めるプロンプトが表示されます。\fB\fR表示リストに含まれている番号を入力した場合は、そのまま選択が受け入れられ、プロンプトは出力されません。\fB\fR
.sp
.LP
ディスクを指定すると、メインメニューが表示されます。\fB\fRこのメニューでは次の作業を実行できます。
.sp
.ne 2
.mk
.na
\fBanalyze\fR
.ad
.RS 13n
.rt  
読み取り、書き込み、比較テスト、およびデータ消去を実行します。データ消去機能には、米国コンピュータセキュリティーセンター (National Computer Security Center、NCSC) の『A Guide to Understanding Data Remanence in Automated Information Systems』(\fBNCSC-TG-025 バージョン 2\fR) による上書きアルゴリズムが実装されています。「注意事項」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBbackup\fR
.ad
.RS 13n
.rt  
バックアップラベルを検索します。
.RE

.sp
.ne 2
.mk
.na
\fBcache\fR
.ad
.RS 13n
.rt  
書き込みキャッシュおよび読み取りキャッシュを有効または無効にします。またはその状態を照会します。このメニュー項目が表示されるのは、\fB-e\fR オプションを指定して \fBformat\fR を起動した場合だけです。このオプションを使用できるのは、\fBSCSI\fR デバイスに限られます。 
.RE

.sp
.ne 2
.mk
.na
\fBcurrent\fR
.ad
.RS 13n
.rt  
デバイス名、ディスクジオメトリ、およびディスク装置のパス名を表示します。
.RE

.sp
.ne 2
.mk
.na
\fBdefect\fR
.ad
.RS 13n
.rt  
欠陥領域リストを検索して出力します。このオプションを使用できるのは、\fBSCSI\fR デバイスに限られます。\fBIDE\fR ディスクの場合は、自動欠陥領域管理機能が実行されます。\fBdefect\fR オプションを \fBIDE\fR ディスクで使用すると、次のメッセージが出力されます。 
.sp
.in +2
.nf
Controller does not support defect management
or disk supports automatic defect management.
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBdisk\fR
.ad
.RS 13n
.rt  
以降の操作で使用するディスク (カレントディスク) を選択します。
.RE

.sp
.ne 2
.mk
.na
\fBfdisk\fR
.ad
.RS 13n
.rt  
\fBfdisk\fR(1M) プログラムを実行し、Solaris ソフトウェア (x86 ベースのシステムのみ) 用の \fBfdisk\fR パーティションを作成します。
.RE

.sp
.ne 2
.mk
.na
\fBformat\fR
.ad
.RS 13n
.rt  
カレントディスクをフォーマットして検証します。このオプションを使用できるのは、\fBSCSI\fR デバイスに限られます。\fBIDE\fR ディスクは製造元により、あらかじめフォーマットされています。\fBIDE\fR ディスクに対して \fBformat\fR オプションを使用すると、次のメッセージが出力されます。 
.sp
.in +2
.nf
Cannot format this drive. Please use your 
manufacturer-supplied formatting utility.
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBinquiry\fR
.ad
.RS 13n
.rt  
カレントドライブの製造元、製品名、およびリビジョンレベルを表示します。
.RE

.sp
.ne 2
.mk
.na
\fBlabel\fR
.ad
.RS 13n
.rt  
カレントディスクに新しいラベルを書き込みます。
.RE

.sp
.ne 2
.mk
.na
\fBpartition\fR
.ad
.RS 13n
.rt  
スライスを作成または変更します。
.RE

.sp
.ne 2
.mk
.na
\fBquit\fR
.ad
.RS 13n
.rt  
フォーマットメニューを終了します。
.RE

.sp
.ne 2
.mk
.na
\fBrepair\fR
.ad
.RS 13n
.rt  
ディスク上の特定のブロックを修復します。
.RE

.sp
.ne 2
.mk
.na
\fBsave\fR
.ad
.RS 13n
.rt  
新しいディスクおよびスライス情報を保存します。
.RE

.sp
.ne 2
.mk
.na
\fBtype\fR
.ad
.RS 13n
.rt  
ディスクタイプを選択 (定義) します。
.RE

.sp
.ne 2
.mk
.na
\fBverify\fR
.ad
.RS 13n
.rt  
ラベルを読み取って表示します。シリンダ数、代替シリンダ数、ヘッド数、セクター数、パーティションテーブルなどの情報を出力します。
.RE

.sp
.ne 2
.mk
.na
\fBvolname\fR
.ad
.RS 13n
.rt  
8 文字の新しいボリューム名を用いて、ディスクにラベルを付けます。
.RE

.SH 環境
.sp
.ne 2
.mk
.na
\fB\fBFORMAT_PATH\fR\fR
.ad
.RS 15n
.rt  
ディスクとパーティション定義用のコロンで区切られたファイル名またはディレクトリ (あるいはその両方)。ディレクトリを指定した場合、\fBformat\fR はそのディレクトリでファイル \fBformat.dat\fR を検索します。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/format.dat\fR\fR
.ad
.RS 19n
.rt  
デフォルトのデータファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBfmthard\fR(1M), \fBprtvtoc\fR(1M), \fBrmformat\fR(1), \fBformat.dat\fR(4), \fBattributes\fR(5), \fB sd\fR(7D)
.sp
.LP
\fI\fR
.SS "x86 のみ"
.sp
.LP
\fBfdisk\fR(1M)
.SH 警告
.sp
.LP
\fBformat\fR 機能を選択して Maxtor 207MB ディスクをフォーマットすると、次のメッセージが出力されます。
.sp
.in +2
.nf
Mode sense page(4) reports rpm value as 0, adjusting it to 3600
.fi
.in -2
.sp

.sp
.LP
これはドライバのバグであり、他社の旧式のドライブでも発生する可能性があります。前述のメッセージはエラーではありません。ドライブは正常に動作します。
.sp
.LP
シリンダ 0 にはパーティションテーブル (ディスクラベル) がありますが、raw ディスクパーティションで使用すると、他社のソフトウェアによって上書きされることがあります。
.sp
.LP
\fBformat\fR は容量が 1 TB を超えるディスクまたは \fBLUN\fR をサポートするために、\fBEFI\fR に準拠したディスクラベルの記載をサポートします。しかし、ファイルシステムやボリュームマネージャなど、多くのソフトウェアコンポーネントは容量がまだ 1 TB もしくはそれ以下に制限されているので、注意が必要です。詳細は、『\fI『Solaris のシステム管理 (基本編)』\fR』を参照してください。
.sp
.LP
デフォルトでは、ディスクにラベルがない場合、2T バイトを超えるディスクには EFI ラベルが書き込まれます。\fBformat\fR を \fB-e\fR オプションを指定して呼び出した場合は、ラベルの書き込み時にラベルの種類を選択できます。EFI ラベルが付いたディスク上でのブートは、現在サポートされていません。
.SH 注意事項
.sp
.LP
\fBformat\fR にはヘルプ機能が用意されており、入力を求められたときにいつでも使用できます。要求されている情報についてヘルプが必要な場合は、単に疑問符 (\fB?\fR) を入力します。求められている情報についての簡単な説明が出力されます。\fB\fRメニュープロンプトに \fB?\fR を入力すると、使用できるコマンドの一覧が表示されます。
.sp
.LP
\fBSCSI\fR ディスクの場合、Primary および Grown 両方の欠陥領域リストでフォーマットがデフォルトで実行されます。フォーマットを実行する前に、欠陥領域メニューで Primary リストだけを抽出しておくと、Primary リストに対するフォーマットだけが実行されます。
.sp
.LP
キャッシュの状態を変更できるのは、\fBSCSI\fR デバイスだけです。また、すべての \fBSCSI\fR デバイスがキャッシュ状態の変更または保存をサポートしているわけではありません。
.sp
.LP
上書きのための \fBNCSC-TG-025\fR アルゴリズムは、\fBDoD\fR 5200.28-M (自動データ処理 (\fBADP\fR) セキュリティ マニュアル) の「ERASE PROCEDURES」による仕様を満たしています。また、米国立標準技術研究所 (National Institute of Standards and Technology、\fBNIST\fR) による『Guidelines for Media Sanitization』(\fBNIST\fR \fBSP\fR 800-88) もこのアルゴリズムを参照しています。
