Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/hal-fdi-validate.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-fdi-validate 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
hal-fdi-validate \- HAL デバイス情報ファイルの検証
.SH 形式
.LP
.nf
\fBhal-fdi-validate\fR  [\fB-f\fR \fIdtd\fR] \fIfile\fR [\fIfile\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBhal-fdi-validate\fR コマンドは、1 つ以上のデバイス情報ファイルを検証します。\fBfdi\fR(4) を参照してください。\fB-f\fR オプションを使用して別のファイルを指定しないかぎり、標準の DTD ファイルが使用されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIdtd\fR\fR
.ad
.RS 10n
.rt  
DTD ファイルへのパスを指定します。
.RE

.SH オペランド
.sp
.LP
\fBhal-fdi-validate\fR コマンドで使用できるオペランドは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR [\fIfile\fR...]\fR
.ad
.RS 18n
.rt  
検証対象となる 1 つ以上の DTD ファイル。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/hal
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBhald\fR(1M), \fBfdi\fR(4), \fBattributes\fR(5), \fBhal\fR(5)
