Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/hal-find.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-find 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
hal-find, hal-find-by-capability, hal-find-by-property \- HAL グローバルデバイスリストの検索
.SH 形式
.LP
.nf
\fBhal-find-by-capability\fR \fB--capability\fR \fIcapability\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.LP
.nf
\fBhal-find-by-property\fR  \fB--key\fR \fIkey\fR \fB--string\fR \fIvalue\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.SH 機能説明
.sp
.LP
\fBhal-find\fR コマンド \fBhal-find-by-capability\fR と \fBhal-find-by-property\fR は、指定された条件に基づいてハードウェア抽象化レイヤー (HAL) デバイスリストの検索を行い、結果を標準出力に表示します。\fBhal-find-by-capability\fR は、\fBvolume\fR や \fBblock\fR などの機能に基づいて検索を行います。\fBhal-find-by-property\fR は、\fBblock.is_volume\fR や \fBvolume.disc.has_audio\fR などのプロパティーに基づいて検索を行います。
.SH オプション
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB--capability\fR \fIcapability\fR\fR
.ad
.RS 27n
.rt  
検索対象となる HAL デバイス機能。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.RS 27n
.rt  
オプションの一覧を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--key\fR \fIkey\fR\fR
.ad
.RS 27n
.rt  
検索の基準となるプロパティーの\fIキー\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--string\fR \fIvalue\fR\fR
.ad
.RS 27n
.rt  
検索の基準となるプロパティーに関連付けられた文字列 \fIvalue\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--verbose\fR\fR
.ad
.RS 27n
.rt  
冗長モード。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.RS 27n
.rt  
バージョンを表示して終了します。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/hal
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBhald\fR(1M), \fBattributes\fR(5), \fBhal\fR(5)
