Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/hal-get-property.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal-get-property 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
hal-get-property, hal-set-property \- HAL デバイスプロパティーの取得と設定
.SH 形式
.LP
.nf
\fBhal-get-property\fR \fB--udi\fR \fIudi\fR \fB--key\fR \fIkey\fR [\fB--help\fR] [\fB--verbose\fR]
 [\fB--version\fR]
.fi

.LP
.nf
\fBhal-set-property\fR  \fB--udi\fR \fIudi\fR \fB--key\fR \fIkey\fR {\fB--int\fR \fIvalue\fR |  \fB--uint64\fR \fIvalue\fR
 |  \fB--string\fR \fIvalue\fR |  \fB--bool\fR \fIvalue\fR |  \fB--strlist-pre\fR \fIvalue\fR
 |  \fB--strlist-post\fR \fIvalue\fR |  \fB--strlist-rem\fR \fIvalue\fR |  \fB--double\fR \fIvalue\fR
 |  \fB--remove\fR \fIvalue\fR} [\fB--help\fR] [\fB--version\fR]
.fi

.SH 機能説明
.sp
.LP
ハードウェア抽象化レイヤー (HAL) は、システムに接続されている各種ハードウェアのビューを提供します。このビューは、ハードウェア構成に変化があると、ホットプラグなどのメカニズムを通じて動的に更新されます。HAL は、ハードウェアの断片をデバイスオブジェクトとして表します。デバイスオブジェクトは、一意の識別子によって識別され、デバイスプロパティーと呼ばれる一連のキーと値のペアを保持します。プロパティーには、実際のハードウェアから取得されるもの、デバイス情報ファイル (\fB\&.fdi\fR ファイル) からマージされるもの、実際のデバイス構成に関連しているものがあります。
.sp
.LP
\fBhal-get-property\fR および \fBhal-set-property\fR コマンドを使用すると、HAL 仕様に準拠したハードウェアのプロパティーを取得および設定できます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB--udi\fR \fIudi\fR\fR
.ad
.sp .6
.RS 4n
一意のデバイス ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--key\fR \fIkey\fR\fR
.ad
.sp .6
.RS 4n
設定するプロパティーのキー。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--int\fR\fR
.ad
.sp .6
.RS 4n
値を整数に設定します。10 進数値、または先頭に \fB0x\fR または \fBx\fR の付いた 16 進値のいずれかを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--uint64\fR\fR
.ad
.sp .6
.RS 4n
値を整数に設定します。10 進数値、または先頭に \fB0x\fR または \fBx\fR の付いた 16 進値のいずれかを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--string\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
値を文字列に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--double\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
値を浮動小数点数に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--boolean\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
値をブール値、つまり true または false に設定します
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-pre\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
リストの先頭に文字列を追加します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-post\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
リストの末尾に文字列を追加します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--strlist-rem\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
リストから文字列を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--remove\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーを削除するべきであることを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョンを表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.sp .6
.RS 4n
オプションの一覧を表示して終了します
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/hal
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBhald\fR(1M), \fBattributes\fR(5), \fBhal\fR(5)
