Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/hald.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hald 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
hald \- ハードウェア抽象化レイヤーをサポートするデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/hal/hald\fR [\fB--daemon\fR={\fByes\fR | \fBno\fR}]] [\fB--help\fR] [\fB--use-syslog\fR]
 [\fB--verbose\fR={\fByes\fR | \fBno\fR}] [\fB--version\fR]
.fi

.SH 機能説明
.sp
.LP
\fBhald\fR デーモンは、ハードウェア抽象化レイヤー (HAL) 仕様に準拠したデバイスのハードウェア変更の認識をサポートします。
.sp
.LP
\fBhald\fR の有効化や無効化を実行するには、サービス管理機能 (SMF) を使用します (\fBsmf\fR(5) を参照)。\fBhald\fR は、障害管理リソース識別子 (FMRI) \fBsvc:/system/hal\fR を使用して管理されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB--daemon\fR=\fByes\fR|\fBno\fR\fR
.ad
.RS 20n
.rt  
デーモンとして実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--help\fR\fR
.ad
.RS 20n
.rt  
使用法の情報を表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--use-syslog\fR\fR
.ad
.RS 20n
.rt  
\fBstderr\fR ではなく \fBsyslog\fR にデバッグメッセージを表示します。このオプションは、HAL をデーモンとして実行する場合にデバッグメッセージを記録するために使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--verbose\fR=\fByes\fR|\fBno\fR\fR
.ad
.RS 20n
.rt  
デバッグ情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.RS 20n
.rt  
バージョン情報を表示して終了します。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/hal\fR\fR
.ad
.RS 16n
.rt  
HAL 関連のファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/hal/fdi\fR\fR
.ad
.RS 16n
.rt  
デバイス情報ファイル
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/hal
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBsvccfg\fR(1M), \fBattributes\fR(5), \fBhal\fR(5), \fBsmf\fR(5)
