Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/hextoalabel.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hextoalabel 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
hextoalabel \- 内部テキストラベルの人間が読める形式への変換
.SH 形式
.LP
.nf
\fB/usr/sbin/hextoalabel\fR [\fIinternal-text-sensitivity-label\fR]
.fi

.LP
.nf
\fB/usr/sbin/hextoalabel\fR \fB-c\fR [\fIinternal-text-clearance\fR]
.fi

.SH 機能説明
.sp
.LP
\fBhextoalabel\fR は、内部テキストラベルを人間が読める形式に変換し、結果を標準出力ファイルに書き込みます。多くの場合、内部形式は 16 進数で記述されます。オプションが指定されない場合、ラベルは機密ラベルと見なされます。
.sp
.LP
内部テキストラベルを指定しない場合、標準入力ファイルからラベルが読み取られます。このコマンドは、内部データベース内に格納されているラベルを緊急に修復する場合に使用できます。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
内部テキストラベルを認可上限として識別します。
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功の場合。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
エラーが発生しました。診断は標準エラーファイルに書き込まれます。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
コマンド出力は、同一の \fBlabel_encodings\fR ファイルを使用する場合は「確実」です。コマンド呼び出しは、DIA MAC ポリシーを実装するシステムでは「確実」です。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/label_encodings\fR\fR
.ad
.sp .6
.RS 4n
ラベルエンコーディングファイルには、このシステムの定義済みラベルに対する格付け名、語句、制約、および値が含まれます。
.RE

.SH 関連項目
.sp
.LP
\fBatohexlabel\fR(1M), \fBlabel_to_str\fR(3TSOL), \fBstr_to_label\fR(3TSOL), \fBlabel_encodings\fR(4), \fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions 管理の手順\fR
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合のみです。
.sp
.LP
このファイルは、米国国防情報局 (DIA) の必須アクセス制御 (MAC) ポリシーの一部です。このファイルは、Solaris Trusted Extensions ソフトウェアの将来のリリース向けに作成されるその他の MAC ポリシーには適用されない可能性があります。
