Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/idmapd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH idmapd 1M "2007 年 6 月 5 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
idmapd \- ネイティブアイデンティティーマッピングサービスデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/idmapd\fR
.fi

.SH 機能説明
.sp
.LP
\fBidmapd\fR デーモンは、Windows セキュリティー識別子 (SID) から POSIX 識別子 (UID/GID) へのマッピングおよびその逆を行います。
.sp
.LP
\fBidmap\fR(1M) ユーティリティーは、\fBidmapd\fR デーモンへのフロントエンドを提供します。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/var/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
ローカルの名前ベース ID マッピング規則の格納先となるデータベース。このデータベースの内容は非公開です。このデータベースへのアクセスや変更を直接行わないようにしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
一時 ID マッピングおよび名前ベースマッピングによって生成された ID マッピングのキャッシュ先となるデータベース。このデータベースの内容は非公開です。このデータベースへのアクセスや変更を直接行わないようにしてください。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
これらのコンポーネントのインタフェースの安定性は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBsvc:/system/idmap\fR\fR
.ad
.sp .6
.RS 4n
確実
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
プロジェクト非公開
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/idmap/idmap.db\fR\fR
.ad
.sp .6
.RS 4n
プロジェクト非公開
.RE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBidmap\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBdefaultdomain\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBidmapd\fR サービスは、サービス管理機能 (SMF) によって管理されます。\fBidmapd\fR サービスのサービス識別子は、\fBsvc:/system/idmap\fR です。
.sp
.LP
サービスの有効化、無効化、再起動などの管理操作をこのサービスで実行するには、\fBsvcadm\fR コマンドを使用します。これらのアクションには \fBsolaris.smf.manage.idmap\fR 承認が必要となります。サービスのステータスに対するクエリーを実行するには、\fBsvcs\fR コマンドを使用します。
.sp
.LP
このデーモンの機能は、Solaris オペレーティングシステムの将来のリリースで変更される可能性があります。
