Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/iiadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH iiadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
iiadm \- Sun StorageTek Availability Suite ポイントインタイムコピー操作を制御するコマンド行インタフェース
.SH 形式
.LP
.nf
\fBiiadm\fR \fB-e\fR {ind | shd} \fImaster_vol\fR \fIshadow_vol\fR \fIbitmap_vol\fR
.fi

.LP
.nf
\fBiiadm\fR \fB-ne\fR ind \fImaster_vol\fR \fIshadow_vol\fR \fIbitmap_vol\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-p\fR] [\fB-n\fR] {\fB-c\fR | \fB-u\fR} {s | m} \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-adDilR\fR] \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-p\fR] [\fB-n\fR] \fB-w\fR \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-hilLv\fR]
.fi

.LP
.nf
\fBiiadm\fR \fB-P\fR \fIdelay\fR \fIunits\fR \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR \fB-P\fR \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR \fB-A\fR \fIoverflow_vol\fR \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-OQ\fR] \fIoverflow_vol\fR
.fi

.LP
.nf
\fBiiadm\fR \fB-E\fR \fIvolume_set\fR
.fi

.LP
.nf
\fBiiadm\fR [\fB-IJ\fR] \fIvolume_set\fR \fIbitmap\fR
.fi

.LP
.nf
\fBiiadm\fR \fB-g\fR \fIgroup_name\fR [\fB-aAcdDeEilLmPRuw\fR]
.fi

.LP
.nf
\fBiiadm\fR [\fB-C\fR] \fIcluster_tag\fR [\fIoptions\fR]
.fi

.SH 機能説明
.sp
.LP
ポイントインタイムコピーソフトウェアは、Solaris オペレーティングシステムのポイントインタイムスナップショット機能です。
.sp
.LP
ポイントインタイムコピースナップショットは、すぐに使用可能になる、時間を固定し、瞬間的に休止したボリュームの複製ビューです。スナップショットがいったん取得されると、ポイントインタイムコピーソフトウェアは、マスターボリュームとシャドウボリュームの両方のデータへの読み取り/書き込みアクセスを即座に可能にします。
.sp
.LP
ポイントインタイムコピーソフトウェアは、スナップショット確立以降の (書き込みによって発生した) マスターボリュームとシャドウボリュームとの差異を追跡します。この機能により、シャドウボリュームのデータにアクセスするアプリケーションとは時間的に無関係にマスターボリュームのデータにアクセスするアプリケーションの処理を進めたり、その逆を行なったりすることが可能になります。
.sp
.LP
マスターボリュームとシャドウボリュームとの差異を追跡するポイントインタイムコピーソフトウェアの機能により、あとで行う高速再同期やフルコピーが容易になります。ボリュームの再同期は、シャドウからマスターへ行うことも、マスターからシャドウへ行うこともできます。
.sp
.LP
ポイントインタイムが確立または再確立されたすぐあと (CLI プロンプトが復帰するか次のシェルスクリプトコマンドが読み取られたあと) で、マスターボリュームを再びマウントしたり、マスターボリュームを使用するアプリケーションを再開したりできます。また、シャドウボリュームをマウントしてすぐにアクセスを開始することもできます。
.sp
.LP
\fBiiadm\fR コマンド行ユーティリティーは、コマンドが呼び出されるたびに 1 つのアクションだけを実行します。このため、複数のオプションを組み合わせることはできません。ただし、次の全体用のコマンド修飾子との組み合わせは例外です。
.RS +4
.TP
.ie t \(bu
.el o
処理項目が 1 つも入力されなかった場合、\fBiiadm\fR は、現在構成されているポイントインタイムコピーセット (中断されていないもの) の一覧を表示します。処理項目が複数入力された場合や入力された処理項目の指定方法が間違っていた場合、\fBiiadm\fR は特定のエラーメッセージと使用法の簡単な要約を標準エラーに表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ポイントインタイムコピーのオプション ENABLE (\fB-e\fR)、COPY (\fB-c\fR)、および UPDATE (\fB-u\fR) には、関連する 2 つのシャドウボリューム選択修飾子 \fB{ind|dep}\fR があります。これらの修飾子は、作成するポイントインタイムコピーボリュームセットの種類を指定するために使用されます。
.RE
.sp
.LP
独立 (\fBind\fR) スナップショットの場合、ポイントインタイムコピーソフトウェアがマスターからシャドウへのフルボリュームコピー操作を実行します。コピーが完了すると、シャドウボリュームのデータは、確立時のマスターボリュームのデータと同一になります。独立シャドウは、データの物理コピーが 2 つ必要な場合に作成します。独立シャドウボリュームのサイズは、マスターボリュームのサイズと同じか、それより大きい必要があります。シャドウからマスターへの再同期が検討されている環境では、マスターボリュームとシャドウボリュームのサイズを同じにすることをお勧めします。
.sp
.LP
依存 (\fBdep\fR) スナップショットの場合、ポイントインタイムコピーソフトウェアはフルボリュームコピーを実行しません。結果として得られるシャドウボリュームは、変更されていないすべてのデータブロックでマスターボリュームに依存します。これらのデータブロックは要求されるまでコピーされません。依存シャドウは、データの物理コピーが 2 つも必要ない場合に作成します。依存シャドウボリュームのサイズは、マスターボリュームと同じか、それより小さくすることができます。マスターより小さいシャドウボリュームは「\fB小型依存シャドウボリューム\fR」と呼ばれ、通常は、ポイントインタイムコピーボリュームセットに対する変更量がマスターボリューム全体のサイズに比べて少ない場合に使用されます。
.sp
.LP
次の構文を使用すると、エクスポート可能な独立シャドウボリュームを Sun Cluster 環境で作成できます。
.sp
.in +2
.nf
# iiadm -ne ind master shadow bitmap
.fi
.in -2
.sp

.sp
.LP
小型依存シャドウボリュームを使用する場合には問題が 1 つ発生します。ポイントインタイムコピーボリュームセットが有効化される時点で、そのサイズが確定されてしまうという問題です。使用期間中のボリュームセット全体に対する変更量がシャドウボリュームに割り当てられた容量を超えると、シャドウボリュームが容量不足としてマークされます。容量不足が発生したあとも、その容量不足が発生したデータ部分が要求されないかぎり、シャドウボリュームからデータを読み取ることができます。その要求がいったん発生すると読み取りが失敗し、シャドウボリュームがオフラインとしてマークされます。
.sp
.LP
ポイントインタイムコピーではこの問題を解決するため、ポイントインタイムコピーの既存の依存ボリュームセットに\fBオーバーフロー\fRボリュームを関連付ける機能がサポートされています。したがって、小型依存シャドウボリュームのサイズが小さすぎた場合やボリュームセットに対して予想外の量の変更が発生した場合、変更されたデータを関連オーバーフローボリュームにリダイレクトできます。このオーバーフローボリュームの効率的な使用を促進するため、必要に応じてこのボリュームを複数のポイントインタイムコピーボリュームセットに関連付けられるようになっています。
.SS "考慮事項"
.sp
.LP
ポイントインタイムコピーの \fBenable\fR、\fBcopy\fR、または \fBupdate\fR 操作の呼び出し前に、ポイントインタイムコピーは、ファイルシステムのパニックが発生しないように、シャドウボリュームがマウントされていないことを確認します。また、ポイントインタイムスナップショットが取得される短時間の間だけ、マスターボリュームを使用するすべてのアプリケーションをマウント解除または中断 (休止) することをお勧めします。これにより、原子的に一貫性のあるポイントインタイムスナップショットの取得が保証されます。
.sp
.LP
マスターボリュームがマウント解除ではなく中断された場合には、\fBfsck\fR(1M) などのボリューム検証ユーティリティーを使用して新しいポイントインタイムシャドウボリュームの整合性を検証することをお勧めします。その理由は、ポイントインタイムコピーにより、マウントされたマスターボリュームからマウント解除されたシャドウボリュームへのポイントインタイムコピーが行われているためです。\fB\fR\fB\fRシャドウボリュームのマウント中、ファイルシステムはそのボリュームがマウントされた状態にあることを検出します。\fB\fR通常、この状態が発生するのはシステムがクラッシュした場合だけであるため、ファイルシステムはポイントインタイムコピーが実行されたのではなくシステム障害が発生したものと仮定して、ボリュームの整合性の検証を試みます。
.SS "環境オプション"
.sp
.LP
\fB/usr/kernel/drv/ii.conf\fR 構成ファイルの \fBii_bitmap\fR 変数によって、次のようにビットマップボリュームの動作セマンティクスが決定されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
ビットマップがメモリー内のみ、または復元再開操作で保持されることを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
ビットマップがメモリー内とディスク上に保持されることを示します。これがデフォルト値です。
.RE

.sp
.LP
\fBii_bitmap=0\fR の使用中にシステム障害が発生すると、シャドウボリュームの整合性がくずれ、高速再同期が不可能となることがあります。
.sp
.LP
ポイントインタイムコピーをネットワークストレージのコンポーネントである遠隔ミラーと組み合わせて使用する場合や Sun Cluster 内で使用する場合には、\fBii_bitmap=1\fR を設定します。
.sp
.LP
\fB/usr/kernel/drv/ii.conf\fR 構成ファイルの \fBii_debug\fR 変数によって、ポイントインタイムコピーの処理中にシステムコンソール \fB/dev/console\fR に出力される情報ロギングの量が決まります。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
ロギングをシステムコンソールに送信しないことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
情報ロギングをシステムコンソールに送信することを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 13n
.rt  
開発ロギングをシステムコンソールに送信することを示します。
.RE

.SH オプション
.sp
.LP
\fBiiadm\fR ユーティリティーは次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fB{ind|dep}\fR \fImaster_vol shadow_vol bitmap_vol\fR\fR
.ad
.sp .6
.RS 4n
指定されたマスター、シャドウ、ビットマップの各ボリュームでポイントインタイムコピーを有効化します。
.sp
シャドウセット有効化処理は、指定されたボリュームにアクセスできること、\fIshadow_vol\fR がマウントされていないこと、および \fIbitmap_vol\fR のサイズが作成するシャドウセットのタイプに適したものであることを確認します。さらにこの処理は、それらのボリュームが SV ドライバの制御下にあることを確認し (制御下にないときは制御下に入れる)、ビットマップボリュームを初期化します。そして、ボリュームセットが独立シャドウセットである場合には、フルコピー操作が開始されます。
.sp
有効化が成功すると、ポイントインタイムコピーは指定された \fImaster_vol\fR、\fIshadow_vol\fR、\fIbitmap_vol\fR の名前と有効化タイプ (\fBind\fR または \fBdep\fR) をポイントインタイムコピー構成ストア内に格納します。構成ストアには、現在構成されているすべてのポイントインタイムコピーボリュームセットと関連する構成属性が含まれています。(独立および依存シャドウボリュームのセマンティクスに関する前述の説明を参照。)
.sp
\fImaster_vol\fR は、ポイントインタイムスナップショットの作成元となるボリュームです。
.sp
\fIshadow_vol\fR は、ポイントインタイムスナップショットが格納されるボリュームです。
.sp
\fIbitmap_vol\fR は、シャドウボリュームとマスターボリュームの差異を追跡するために使用されます。ポイントインタイムコピーのシャドウ操作が中断または再開された場合、(カーネルメモリーに保持されている) ビットマップボリュームを永続記録領域に格納したりそこから取得したりできます。ビットマップボリュームに関連付けられた記憶領域には、シャドウボリュームの記憶領域と同等の冗長性を持たせるべきです。
.sp
\fIshadow_vol\fR の名前は、\fIvolume_set\fR 名を指定する必要のあるすべての \fBiiadm\fR オプションでのポイントインタイムコピーシャドウセットの名前になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIvolume_set\fR に関連付けられたポイントインタイムコピーボリュームセットを無効化します。
.sp
ポイントインタイムコピーの動作モードが前述の \fB-e\fR \fBind\fR オプションで指定される独立モードであった場合、シャドウボリュームのデータには、無効化する前と同じデータが含まれています (書き込みが一切発生しなかった場合)。\fB\fRマスターボリュームとシャドウボリュームはこの時点でスタンドアロンのポイントインタイムコピーになっているため、ユーザーはそれらのボリュームにアクセスできます。
.sp
フルコピーがアクティブになっている間、独立ボリュームはまるで依存ボリュームであるかのように動作します。\fB\fR\fB\fRボリュームのモードがフルコピーでないことを保証するには、次のコマンドを発行してフルコピーが完了するまで待機します。
.sp
.in +2
.nf
# iiadm -w \fIvolume_set\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB[\fB-p\fR] \fB-u\fR \fBs\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
マスターボリュームからシャドウボリュームを更新します。
.sp
マスターボリュームのポイントインタイムコピーをシャドウボリュームに更新します。\fIvolume_set\fR は、マスターボリュームとシャドウボリュームを含むポイントインタイムコピーシャドウセットです。このオプションは、シャドウボリュームの高速再同期を提供し、マスターの増分コピーを作成します。この更新では、マスターボリュームとシャドウボリュームとで異なるというフラグの付いた 32K バイトセグメントがすべてコピーされます。コピーされるのは、マスターボリュームのすべてのデータではなく、変更されたデータだけです。データがコピーされている間、シャドウはマスターボリュームに依存します。
.sp
このオプションを使用する前に、ボリュームへのワークロードを短時間停止します。ホストアプリケーションがボリュームに書き込みを行わないようにします。これにより、ポイントインタイムデータの一貫性が保証されます。対象ボリュームをほかの操作で使用する前に、このコピー操作や更新操作のステータスを、\fBiiadm\fR \fB-i\fR \fI volume_set\fR で視覚的に確認することも、(シェルやスクリプト経由で) \fBiiadm\fR \fB-w\fR \fIvolume_set\fR を使用して対話形式で確認することもできます。
.sp
このコマンドは、\fBiiadm\fR \fB-p\fR \fB-u\fR \fBs\fR のようにオプション \fB-p\fR を使用することで、PID (Process IDentifier) のロックをサポートします。このオプションを有効にすると、ほかのプロセスの新しいポイントインタイムスナップショットの取得によって以前のポイントインタイムデータが無効になるのを防ぐことができます。
.RE

.sp
.ne 2
.mk
.na
\fB[\fB-p\fR] [\fB-n\fR] \fB-u\fR \fBm\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
マスターボリュームのポイントインタイムコピーをシャドウから更新します。\fIvolume_set\fR は、マスターおよびシャドウを含むポイントインタイムコピーボリュームセットです。このオプションは、マスターボリュームの高速再同期を提供し、シャドウの増分コピーを作成します。この更新では、マスターボリュームとシャドウボリュームとで異なることを示すフラグの付いた 32K バイトセグメントがすべてコピーされます。コピーされるのは、シャドウボリュームのすべてのデータではなく、変更されたデータだけです。データがコピーされている間、マスターはシャドウボリュームに依存します。
.sp
このオプションを使用する前に、ボリュームへのワークロードを短時間停止します。ホストアプリケーションがボリュームに書き込みを行わないようにします。これにより、ポイントインタイムデータの一貫性が保証されます。対象ボリュームをほかの操作で使用する前に、このコピー操作や更新操作のステータスを、\fBiiadm\fR \fB-i\fR \fI volume_set\fR で視覚的に確認することも、(シェルやスクリプト経由で) \fBiiadm\fR \fB-w\fR \fIvolume_set\fR を使用して対話形式で確認することもできます。
.sp
このコマンドでは、マスターボリュームのデータを間違って上書きしてしまわないように、クエリーが有効化されます。このコマンドオプションをスクリプト内で使用する場合は、\fB-n\fR オプションを追加してクエリーが発生しないようにします。
.sp
このコマンドは、\fBiiadm\fR \fB-p\fR \fB-u\fR \fBm\fR のようにオプション \fB-p\fR を使用することで、PID (Process IDentifier) のロックをサポートします。このオプションを有効にすると、ほかのプロセスの新しいポイントインタイムスナップショットの取得によって以前のポイントインタイムデータが無効になるのを防ぐことができます。
.RE

.sp
.ne 2
.mk
.na
\fB[\fB-p\fR] \fB-c\fR s \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
マスターボリュームをシャドウにコピーします。
.sp
マスターボリュームのポイントインタイムコピーをシャドウボリュームに作成します。\fIvolume_set\fR は、マスターおよびシャドウを含むポイントインタイムコピーボリュームセットです。このオプションは、マスターボリュームのポイントインタイムコピー内のすべてのデータをシャドウボリュームに書き込みます。データがマスターからシャドウにコピーされている間、シャドウはマスターボリュームに依存します。
.sp
このオプションはフルボリュームコピーを実行します。独立シャドウボリュームのデータの整合性が疑われる場合以外は、\fBiiadm\fR \fB-u\fR \fBs\fR を使用してください。それ以外の場合は、このオプションを使用してマスターボリュームとシャドウボリュームの同期をとる、つまりそれぞれのボリュームのデータを一致させます。
.sp
このオプションを使用する前に、ボリュームへのワークロードを短時間停止します。ホストアプリケーションがボリュームに書き込みを行わないようにします。これにより、ポイントインタイムデータの一貫性が保証されます。対象ボリュームをほかの操作で使用する前に、このコピー操作や更新操作のステータスを、\fBiiadm\fR \fB-i\fR \fI volume_set\fR で視覚的に確認することも、(シェルやスクリプト経由で) \fBiiadm\fR \fB-w\fR \fIvolume_set\fR を使用して対話形式で確認することもできます。
.sp
このコマンドは、\fBiiadm\fR \fB-p\fR \fB-c\fR \fBs\fR のようにオプション \fB-p\fR を使用することで、PID (Process IDentifier) のロックをサポートします。このオプションを有効にすると、ほかのプロセスの新しいポイントインタイムスナップショットの取得によって以前のポイントインタイムデータが無効になるのを防ぐことができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fBm\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
シャドウボリュームをマスターにコピーします。
.sp
シャドウボリュームのポイントインタイムコピーをマスターボリュームに作成します。\fIvolume_set\fR は、マスターおよびシャドウボリュームを含むポイントインタイムコピーボリュームセットです。このオプションは、シャドウボリュームのポイントインタイムコピー内のすべてのデータをマスターボリュームに書き込みます。データがシャドウからマスターにコピーされている間、マスターはシャドウボリュームに依存します。
.sp
このオプションはフルボリュームコピーを実行します。独立マスターのデータの整合性が疑われる場合以外は、\fBiiadm\fR \fB-u\fR \fBm\fR を使用してください。それ以外の場合は、このオプションを使用してマスターボリュームとシャドウボリュームの同期をとる、つまりそれぞれのボリュームのデータを一致させます。
.sp
このオプションを使用する前に、ボリュームへのワークロードを短時間停止します。ホストアプリケーションがボリュームに書き込みを行わないようにします。これにより、ポイントインタイムデータの一貫性が保証されます。対象ボリュームをほかの操作で使用する前に、このコピー操作や更新操作のステータスを、\fBiiadm\fR \fB-i\fR \fI volume_set\fR で視覚的に確認することも、(シェルやスクリプト経由で) \fBiiadm\fR \fB-w\fR \fIvolume_set\fR を使用して対話形式で確認することもできます。
.sp
このコマンドでは、マスターボリュームのデータを間違って上書きしてしまわないように、クエリーが有効化されます。このコマンドオプションをスクリプト内で使用する場合は、\fB-n\fR オプションを追加してクエリーが発生しないようにします。
.sp
このコマンドは、\fBiiadm\fR \fB-p\fR \fB-c\fR \fBm\fR のようにオプション \fB-p\fR を使用することで、PID (Process IDentifier) のロックをサポートします。このオプションを有効にすると、ほかのプロセスの新しいポイントインタイムスナップショットの取得によって以前のポイントインタイムデータが無効になるのを防ぐことができます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
マスターボリュームとシャドウボリュームとの間で現在アクティブになっている可能性のあるコピー操作をすべて中止します。\fIvolume_set\fR は、マスターおよびシャドウボリュームを含むポイントインタイムコピーボリュームセットです。\fBiiadm\fR \fB-a\fR の実行後、対象 (マスターまたはシャドウ) ボリュームに対する更新またはコピーは不完全になっています。この時点で、コピー先のボリュームはコピー元のボリュームの依存コピーになっています。更新またはコピーコマンドオプションを再発行してボリュームの再同期を行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB[\fR\fB-p\fR\fB] [\fR\fB-n\fR\fB] \fR\fB-w\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
実行中のすべてのコピー操作または更新操作が完了するか異常終了するまで待機します。\fIvolume_set\fR は、マスターおよびシャドウボリュームを含むポイントインタイムコピーボリュームセットです。
.sp
このオプションは、現在のポイントインタイムコピー操作が完了するまで待機するため、後続の \fBiiadm\fR コマンドが (シェルやスクリプトから) 実行されるのを防ぎます。このコマンドオプションは、コピー操作や更新操作が完了したことを確認する必要がある場合に使用します。
.sp
このコマンドは PID (Process IDentifier) のロック解除をサポートします。コマンド \fBiiadm\fR \fB-p\fR \fB{\fR\fB-c\fR\fB|\fR\fB-u\fR\fB} {m|s}\fR を使用して前に行われたコピーや更新で \fB-p\fR オプションが指定されていて、現在の PID がポイントインタイムデータをロックした PID であった場合、待機処理の完了時にこのオプションはそのデータのロックを解除します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
現在有効化または中断されているポイントインタイムコピーボリュームセットのステータスを表示します。\fIvolume_set\fR は、マスターおよびシャドウボリュームを含むポイントインタイムコピーボリュームセットです。\fIvolume_set\fR を指定しなかった場合は、構成されているすべてのポイントインタイムコピーボリュームセットのステータスが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
現在構成されているすべてのポイントインタイムコピーボリュームを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR \fIoverflow_vol\fR\fR
.ad
.sp .6
.RS 4n
このオプションを使用すると、指定した \fIoverflow_vol\fR がポイントインタイムコピーによって初期化され、あとで小型依存シャドウボリュームと組み合わせてオーバーフローボリュームとして使用できるようになります。このオーバーフローボリュームの効率的な共有使用を促進するため、必要に応じてこのボリュームを複数のポイントインタイムコピーボリュームセットに関連付けられるようになっています。
.sp
\fIoverflow_vol\fR の初期化中、このオプションの起動元は次の質問に答える必要があります。「Initialize this overflow volume?yes/no」続行するには、「yes」、「no」のいずれかの応答が必要です。
.sp
このオプションでは \fB-n\fR オプションがサポートされており、要求された処理がプロンプトなしで実行できます。このオプションは、スクリプト内に含める場合に便利です。\fB-n\fR オプションを最初に指定する必要があります。たとえば、「\fBiiadm\fR \fB-nO\fR \fBvol\fR」は有効ですが、「\fBiiadm\fR \fB-On\fR \fBvol\fR」は無効です。
.sp
特に \fB-n\fR オプションを使用する場合には、指定された \fIoverflow_vol\fR のデータを初期化してよいか確認してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIoverflow_vol\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
このオプションは、指定された \fIoverflow_vol\fR を有効化し、あとで小型依存シャドウボリュームのサイズが小さすぎた場合やボリュームセットに対して予定されていない量の変更が発生した場合にオーバーフローボリュームとして使用できるようにします。オーバーフローした変更データは、関連付けられたオーバーフローボリュームにリダイレクトされます。\fIvolume_set\fR は、マスターおよびシャドウボリュームを含むポイントインタイムコピーボリュームセットです。
.sp
\fIoverflow_vol\fR が初期化されていなかった場合、このオプションは、\fIoverflow_vol\fR を初期化 (\fB-O\fR オプションを参照) したあと、\fIoverflow_vol\fR を \fIvolume_set\fR に接続します。
.sp
\fIoverflow_vol\fR が事前に初期化されていた場合、このオプションは、\fIoverflow_vol\fR を \fIvolume_set\fR に接続します。
.sp
このオプションでは \fB-n\fR オプションがサポートされていますが、このオプションを使用すると、要求された処理がプロンプトなしで実行されます。このオプションは、スクリプト内に含める場合に便利です。\fB-n\fR オプションを最初に指定する必要があります。たとえば、「\fBiiadm\fR \fB-nA\fR \fBvol\fR」は有効ですが、「\fBiiadm\fR \fB-An\fR \fBvol\fR」は無効です。
.sp
特に \fB-n\fR オプションを使用する場合には、指定された \fIoverflow_vol\fR のデータを初期化してよいか確認してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
このオプションは、指定された \fIvolume_set\fR に現在関連付けられているオーバーフローボリュームを削除します。オーバーフローボリュームが現在 \fIvolume_set\fR によって使用されている場合、この操作は失敗し、「Overflow volume still in use」というエラーメッセージが表示されます。この状況を解決するには、次に説明する操作のいずれかを \fIvolume_set\fR に対して実行します。これらの操作は、このボリュームセットに関連付けられたすべてのオーバーフロー書き込みを短時間でクリアします。
.sp
.ne 2
.mk
.na
\fB\fBabort\fR(\fB-a\fR)\fR
.ad
.sp .6
.RS 4n
コピー操作を中止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisable\fR(\fB-d\fR)\fR
.ad
.sp .6
.RS 4n
ボリュームセットを破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBupdate\fR(\fB-u\fR)\fR
.ad
.sp .6
.RS 4n
ボリュームセットを更新します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
このオプションは、1 つ以上のボリュームセットに関連付けられたオーバーフローボリュームをすべて一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Q\fR \fIoverflow_vol\fR\fR
.ad
.sp .6
.RS 4n
このオプションは、\fIoverflow_vol\fR の現在のステータスを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
\fIvolume_set\fR で指定されたポイントインタイムコピーボリュームセットの独立シャドウボリュームをエクスポートします。このシャドウボリュームは、マルチポートデバイスなどの実現技術を利用して、別のホストから読み取り/書き込み可能になるものです。差異ビットマップの管理はこの別のホストが担当することになりますが、このビットマップは、シャドウボリュームをマスターボリュームに再結合する際に、ローカルで記録されたマスターとの差異とマージするために使用されます。シャドウボリュームのエクスポート中は、そのボリュームに対して更新またはコピー操作を行わないでください。エクスポートコマンドを呼び出す前に、\fBiiadm\fR \fB-w\fR \fIvolume_set\fR コマンドを実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIvolume_set\fR \fIbitmap_vol\fR\fR
.ad
.sp .6
.RS 4n
\fIvolume_set\fR で指定されたポイントインタイムコピーボリュームセットの独立シャドウボリュームをインポートします。このシャドウボリュームは、マルチポートデバイスなどの実現技術を使用して事前にあるホストからエクスポートされたものである必要があります。インポート操作を行うと、このホストが、ボリュームの変更に伴う差異ビットマップの維持管理を開始します。\fIbitmap_vol\fR は、シャドウボリュームが最初にシャドウグループ内に形成されたときに使用されたビットマップと同じにならないようにしてください。
.sp
エクスポート/インポートされた独立シャドウボリュームがこの別のノードで不要になったら、\fIbitmap_vol\fR とその関連 \fIshadow_vol\fR が一貫性を保てるように、結合操作の実行前に無効化コマンドを入力する必要があります。たとえば、
.sp
.in +2
.nf
# iiadm -d \fIvolume_set\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-J\fR \fIvolume_set\fR \fIbitmap_vol\fR\fR
.ad
.sp .6
.RS 4n
\fIbitmap_vol\fR を使用して、\fIvolume_set\fR をポイントインタイムコピーボリュームセットのマスターボリュームセットに結合します。設定したビットマップボリュームが読み取られて元のボリュームとマージされ、マスター、シャドウ、ビットマップの各ボリュームから構成される、元のボリュームセットが再構築されます。マージ対象となる \fIbitmap_vol\fR は、独立シャドウボリュームをインポートしたノード上で取得されたものです。インポート先のマシン上では、ビットマップがコピーされてからシャドウが再度インポートされるまでの間、シャドウボリュームに対する書き込みが発生してはいけません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgroup_name\fR \fB-m\fR \fIvolume_set [volume_set2 ...]\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上の既存ポイントインタイムコピー \fIvolume_set\fR をユーザー指定の \fIgroup_name\fR に追加します。このように 1 つ以上のポイントインタイムコピーボリュームセットをグループ内で関連付けることで、\fIgroup_name\fR 内のすべてのボリュームセット全体に対し、後述の一連の \fBiiadm\fR オプションを実行できるようになります。
.sp
グループ内のすべてのポイントインタイムコピーセットにわたって原子的に実行できるコマンドは、\fBCOPY\fR (\fB-c\fR) と \fBUPDATE\fR (\fB-u\fR) だけです。その他のグループ化された \fBiiadm\fR コマンドはすべて、グループの各メンバーに対して順番に実行されます。 
.sp
\fBiiadm\fR グループコマンドの構文は次のとおりです。
.sp
.in +2
.nf
iiadm -g \fIgroup_name\fR [\fIoptions\fR]
.fi
.in -2
.sp

\fIオプション\fRは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットでコピー操作を中止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットに \fIoverflow_vol\fR を接続します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fB{s | m}\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットでシャドウ/マスターをコピーします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットから \fIoverflow_vol\fR を切り離します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットを無効化します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセットをエクスポートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセットのステータス。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセットを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
すべてのグループを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
マスターボリュームを本当に更新するかどうかをユーザーに確認しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセットにパラメータを設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセットをリセットします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fB{s | m}\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのセットでシャドウ/マスターを更新します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.sp .6
.RS 4n
\fIgroup_name\fR 内のすべてのボリュームセット上で待機します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fB-" "\fR \fB-m\fR \fIvolume_set\fR [\fIvolume_set2 ...\fR]\fR
.ad
.sp .6
.RS 4n
1 つ以上の既存ポイントインタイムコピー \fIvolume_set\fR を、現在関連付けられている \fIgroup_name\fR から削除します。すべてのポイントインタイムコピー \fIvolume_set\fR はデフォルトで、またはユーザー指定の \fIgroup_name\fR に移動されるまで、空 (\fB" "\fR) のグループ内に存在しています。この関連付けを行うと、空 (\fB" "\fR) の \fBiiadm\fR \fIgroup_name\fR に対して前述のすべての \fBiiadm\fR グループコマンドを実行できるようになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIcluster_tag\fR\fR
.ad
.sp .6
.RS 4n
このポイントインタイムコピーオプションは、Sun Cluster のリソースグループまたはディスクグループに属するボリュームだけに構成操作を制限する修飾子です。
.sp
Sun Cluster に対応したボリュームマネージャーを持つ Sun Cluster では \fBiiadm\fR が正しいディスクグループ情報を自動的に取得するため、このオプションは通常、ボリュームが広範囲をカバーするリソースグループの一部になっていないかぎり不要です。
.sp
ローカルノードでしかボリュームにアクセスできないような Sun Cluster では、Sun Cluster のリソースグループまたはディスクグループの一部になっていないボリュームを示すために、特殊な \fIcluster_tag\fR \fBlocal\fR が使用されます。
.sp
\fIcluster_tag\fR 引数として \fB-L\fR が指定された場合、\fBiiadm\fR は、ポイントインタイムコピーに関連するクラスタタグをすべて一覧表示します。
.sp
Sun Cluster パッケージがインストールまたは構成されていない Solaris システム上では、このオプションは無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBiiadm\fR の使用法の要約を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
ポイントインタイムコピーソフトウェアコンポーネントの現在のバージョンを表示します。
.RE

.sp
.LP
この節の残りのコマンドの使用方法について支援が必要な場合には、Sun Enterprise サービス窓口までご連絡ください。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIdelay\fR \fIunit\fR \fIvolume_set\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIvolume_set\fR のポイントインタイムコピーボリュームセットチューニングパラメータを\fIunit\fR 件の入出力ごとの \fIdelay\fR クロック刻み数に変更します。delay の範囲は 2 から 10000、unit の範囲は 100 から 60000 であり、どちらも両端を含みます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
あるボリュームで障害が発生すると、ポイントインタイムコピーはそのボリュームをオフライン状態にします。ボリュームの交換が完了したら、このオプションを使用してボリュームをオンライン状態に戻します。ポイントインタイムコピーボリュームセット内の関連する依存ボリュームもオンライン状態になります。ボリュームをオンライン状態にしたあと、このコマンドはさらに、必要なすべてのポイントインタイムボリューム更新を開始します。
.RE

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
コマンドが正常に完了しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-point-in-time-copy
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfg\fR(1M), \fBsvadm\fR(1M), \fBds.log\fR(4), \fBrdc.cf\fR(4), \fBattributes\fR(5), \fBii\fR(7D), \fBsv\fR(7D)
