Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/iicpshd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH iicpshd 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
iicpshd \- Availability Suite ポイントインタイムシャドウボリュームのコピー
.SH 形式
.LP
.nf
\fBiicpshd\fR [\fB-s\fR] \fIold_shadow\fR \fInew_shadow\fR...
.fi

.SH 機能説明
.sp
.LP
\fBiicpshd\fR コマンドは、Availability Suite Instant Image シャドウボリュームをコピーし、ビットマップヘッダーと Availability Suite 構成を更新して新しいシャドウボリュームの情報を反映させます。
.sp
.LP
古いシャドウボリュームや新しいシャドウボリュームの現在の使用状況はチェックされません。\fBiicpshd\fR コマンドを実行するのは、古いシャドウボリュームを使用する Instant Image シャドウセットが中断されている場合だけにしてください。
.SH オプション
.sp
.LP
\fBiicpshd\fR コマンドは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 13n
.rt  
ポイントインタイムシャドウセットの StorageTek 構成情報は更新しますが、古いシャドウボリュームから新しいシャドウボリュームへのデータコピーは行い\fBません\fR。
.RE

.SH オペランド
.sp
.LP
\fBiicpshd\fR コマンド行のオペランドは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fIold_shadow\fR \fInew_shadow\fR\fR
.ad
.sp .6
.RS 4n
\fBiicpshd\fR は、古い Availability Suite Instant Image シャドウボリュームのデータを新しいシャドウボリュームにコピーし、ビットマップヘッダーと構成データを更新します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-point-in-time-copy
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBiiadm\fR(1M), \fBiicpbmp\fR(1M), \fBattributes\fR(5)
.SH 警告
.sp
.LP
\fBiicpshd\fR を実行するのは、システムがシングルユーザーモードの場合だけにしてください。ユーザーが \fBiicpshd\fR を実行した際に、このコマンドは、ポイントインタイムセットが使用中かどうかのチェックを試みません。ポイントインタイムが古いシャドウボリュームを使用している最中に \fB-s\fR フラグを指定して \fBiicpshd\fR を実行すると、シャドウボリュームのデータが失われる可能性があります。\fB-s\fR オプションを使用する場合には、古いシャドウボリュームのデータを新しいシャドウボリュームに手動でコピーする必要があります。
