Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/inetadm.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH inetadm 1M "2007 年 7 月 5 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
inetadm \- inetd が制御するサービスを監視または構成する
.SH 形式
.LP
.nf
\fBinetadm\fR 
.fi

.LP
.nf
\fBinetadm\fR \fB-?\fR
.fi

.LP
.nf
\fBinetadm\fR \fB-p\fR
.fi

.LP
.nf
\fBinetadm\fR \fB-l\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-e\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-d\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-m\fR {\fIFMRI\fR | \fIpattern\fR}... {\fIname\fR=\fIvalue\fR}...
.fi

.LP
.nf
\fBinetadm\fR \fB-M\fR {\fIname\fR=\fIvalue\fR}...
.fi

.SH 機能説明
.sp
.LP
\fBinetadm\fR ユーティリティーは、\fBinetd\fR が管理する SMF サービスに次の機能を提供します。
.RS +4
.TP
.ie t \(bu
.el o
インストールされているすべてのサービスの一覧を表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サービスのプロパティーと値の一覧を表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サービスを有効に、または無効にすることができます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サービスのプロパティー値を変更したり、\fBinetd\fR によって提供されるデフォルト値を変更したりできます。
.RE
.sp
.LP
SMF サービスについては、\fBsmf\fR(5) を参照してください。
.sp
.LP
引数を指定しない場合、\fBinetadm\fR は \fBinetd\fR(1M) によって制御されるすべてのサービス (現在の実行状態や有効であるかどうかなどの属性を含む) を表示します。
.SH オプション
.sp
.LP
オプションが 1 つ以上の FMRI オペランド (FMRI の説明については、\fBsmf\fR(5) を参照) をとるときに、オペランドが (サービスインスタンスではなく) サービスを指定し、そのサービスが単一のインスタンスしか持たない場合、\fBinetadm\fR はそのインスタンス上で動作します。
.sp
.LP
サービス名が指定されていてサービス名に複数のインスタンスが含まれている場合、またはパターンが指定されていてパターンが複数のインスタンスに一致する場合は、警告メッセージが表示され、そのオペランドは無視されます。
.sp
.LP
\fIname\fR=\fIvalue\fR パラメータをとるオプションに使用できる名前と許可されている値の説明は、\fBinetd\fR(1M) のマニュアルページに記載されています。
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.sp .6
.RS 4n
使用方法に関するメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
\fBinetd\fR によって提供されるすべてのデフォルトの \fBinet\fR サービスプロパティー値を、\fIname\fR=\fIvalue\fR の組の形式で一覧表示します。値がブール型の場合は、TRUE または FALSE で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR {\fIFMRI\fR | \fIpattern\fR}...\fR
.ad
.sp .6
.RS 4n
指定されたサービスインスタンスのすべてのプロパティーを、\fIname\fR=\fIvalue\fR の組で一覧表示します。また、\fBinetd\fR によって提供されたデフォルト値からプロパティー値が継承されている場合、その \fIname\fR=\fIvalue\fR の組には「default」というトークンも表示されます。プロパティーの継承は、プロパティーにサービスインスタンスのデフォルトが指定されていない場合に発生します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR {\fIFMRI\fR | \fIpattern\fR}...\fR
.ad
.sp .6
.RS 4n
指定されたサービスインスタンスを有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR {\fIFMRI\fR | \fIpattern\fR}...\fR
.ad
.sp .6
.RS 4n
指定されたサービスインスタンスを無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR {\fIFMRI\fR | \fIpattern\fR}...{\fIname\fR=\fIvalue\fR}...\fR
.ad
.sp .6
.RS 4n
識別されたサービスインスタンスの指定されたプロパティーの値を変更します。プロパティーは、\fIname\fR=\fIvalue\fR の組をスペースで区切って指定します。インスタンス固有の値を削除し、プロパティーのデフォルト値を使うように指定するには、たとえば、\fBname=\fR のように、値なしでプロパティーを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR {\fIname\fR=\fIvalue\fR}...\fR
.ad
.sp .6
.RS 4n
指定された \fBinetd\fR のデフォルトのプロパティー値を変更します。プロパティーは、\fIname\fR=\fIvalue\fR の組をスペースで区切って指定します。
.RE

.SH 使用例
.LP
\fB例 1 \fRサービスのプロパティーの表示
.sp
.LP
次のコマンドは \fBspray\fR サービスのプロパティーを表示します。

.sp
.in +2
.nf
# inetadm -l network/rpc/spray:default
SCOPE    NAME=VALUE
         name="sprayd"
         endpoint_type="tli"
         proto="datagram_v"
         isrpc=TRUE
         rpc_low_version=1
         rpc_high_version=1
         wait=TRUE
         exec="/usr/lib/netsvc/spray/rpc.sprayd"
         user="root"
default  bind_addr=""
default  bind_fail_max=-1
default  bind_fail_interval=-1
default  max_con_rate=-1
default  max_copies=-1
default  con_rate_offline=-1
default  failrate_cnt=40
default  failrate_interval=60
default  inherit_env=TRUE
default  tcp_trace=FALSE
default  tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.LP
\fB例 2 \fRデフォルトプロパティーの表示
.sp
.LP
次のコマンドは、デフォルトプロパティーを表示します。

.sp
.in +2
.nf
# inetadm -p
NAME=VALUE
bind_addr=""
bind_fail_max=-1
bind_fail_interval=-1
max_con_rate=-1
max_copies=-1
con_rate_offline=-1
failrate_cnt=40
failrate_interval=60
inherit_env=TRUE
tcp_trace=FALSE
tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.LP
\fB例 3 \fRサービスのプロパティー値の変更
.sp
.LP
次のコマンドは、\fBspray\fR サービスの \fBrpc_high_version\fR を \fB3\fR に、\fBtcp_trace\fR を \fBTRUE\fR に変更します。

.sp
.in +2
.nf
# inetadm -m network/rpc/spray:default \e
         rpc_high_version=3 tcp_trace=TRUE
# inetadm -l network/rpc/spray:default
SCOPE    NAME=VALUE
         name="sprayd"
         endpoint_type="tli"
         proto="datagram_v"
         isrpc=TRUE
         rpc_low_version=1
         rpc_high_version=3
         wait=TRUE
         exec="/usr/lib/netsvc/spray/rpc.sprayd"
         user="root"
default  bind_addr=""
default  bind_fail_max=-1
default  bind_fail_interval=-1
default  max_con_rate=-1
default  max_copies=-1
default  con_rate_offline=-1
default  failrate_cnt=40
default  failrate_interval=60
default  inherit_env=TRUE
         tcp_trace=TRUE
default  tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
操作は正常に完了しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
致命的なエラーが発生しました。詳細情報は同時に表示されるエラーメッセージに記述されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
無効な引数 (あいまいなサービス FMRI またはパターンなど) が指定されました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBinetd\fR(1M), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
