Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/Intro.1m
'\" te
.\" Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH Intro 1M "2010 年 9 月 13 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
Intro, intro \- 管理コマンドおよびアプリケーションプログラムの序章
.SH 機能説明
.sp
.LP
本セクションでは、主にシステムの保守や管理に使用するコマンドを、アルファベット順に説明します。
.sp
.LP
コマンドが仮想ファイルシステムのアーキテクチャに合わせて再構成されているため、同じ名前で始まる複数のマニュアルページが存在します。たとえば、\fBmount\fR の名前に関しては、\fBmount \fR(1M)、\fBmount_hsfs\fR(1M)、\fBmount_nfs\fR(1M)、\fB mount_tmpfs\fR(1M)、および \fBmount_ufs\fR(1M) のように 5 つが存在します。このような場合、最初にだけ、その総称コマンドの構文およびオプションが説明されています。つまり、これらのオプションは、すべてのファイルシステムのタイプに適用されるということです。以降には、そのコマンドの機能のうちファイルシステムタイプに特有な部分が説明されています。このようなマニュアルページ名には、下線 ( _ ) とそのコマンドに関係するファイルシステムのタイプ名が伴われています。管理者は、このようなファイルシステムに特有な部分を直接呼び出してはいけません。総称コマンドは、すべてのファイルシステムに共通なインタフェースを提供します。ですから、ファイルシステムタイプに特有なマニュアルページは、個々のコマンドを説明していると考えるべきではなく、コマンドのファイルシステムに特有な面を詳細に述べたものだと考えるべきです。
.SH コマンドの構文
.sp
.LP
特に説明しないかぎり、本セクションで説明するコマンドは、以下の構文に従って、オプションやその他の引数を受け入れます。
.sp
.in +2
.nf
\fIname\fR [\fIoption\fR(\fIs\fR)] [\fIcmdarg\fR(\fIs\fR)]
.fi
.in -2

.sp
.LP
出力形式の説明
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 15n
.rt  
実行可能ファイルの名前です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIoption\fR\fR
.ad
.RS 15n
.rt  
\fB\(mi\fR \fInoargletter\fR(\fIs\fR) または
.sp
\fB\(mi\fR \fIargletter\fR<\|>\fIoptarg\fR
.sp
<\|> は、スペース (オプション)。
.RE

.sp
.ne 2
.mk
.na
\fB\fInoargletter\fR\fR
.ad
.RS 15n
.rt  
引数が必要でないオプション 1 文字を表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIargletter\fR\fR
.ad
.RS 15n
.rt  
引数が必要なオプション 1 文字を表します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIoptarg\fR\fR
.ad
.RS 15n
.rt  
\fIargletter\fR に必要な引数 (文字列) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIcmdarg\fR\fR
.ad
.RS 15n
.rt  
\fI\fR\fB\fRパス名 (または他のコマンドの引数)。\fB\(mi\fR だけを指定すると標準入力を表します。
.RE

.SH 属性
.sp
.LP
このセクション中にリストされている属性については、\fBattributes\fR(5)を参照してください。
.SH 謝辞
.sp
.LP
Oracle America, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/\&.
.sp
.LP
The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.
.sp
.LP
In the following statement, the phrase ``this text'' refers to portions of the system documentation.
.sp
.LP
Portions of this text are reprinted and reproduced in electronic form in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html\&.
.sp
.LP
This notice shall appear on any product containing this material. 
.SH 関連項目
.sp
.LP
\fBgetopt\fR(1), \fBgetopt\fR(3C), \fBattributes\fR(5)
.SH 診断
.sp
.LP
終了時、すべてのコマンドは、正常に終了すると 0 を返します。ゼロでない値を返した場合、間違った引数を指定した、不良で受け入れることができないデータを指定した、その他、現在はうまく処理できないなどの障害を示します。このような値は、「終了コード」、「終了ステータス」、「リターンコード」などさまざまな呼ばれ方をします。そして、特別な使い方がある場合にかぎって説明されます。
.SH 注意事項
.sp
.LP
すべてのコマンドにおいて標準の構文に準拠しているわけではありません。
