Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/ipfstat.1m
'\" te
.\" To view license terms, attribution, and copyright for IP Filter, the default path is /usr/lib/ipf/IPFILTER.LICENCE. If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the installed location.
.\" Portions Copyright (c) 2008, Sun Microsystems Inc. All Rights Reserved.
.TH ipfstat 1M "2008 年 4 月 3 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ipfstat \- パケットフィルタ統計およびフィルタリストに関する報告
.SH 形式
.LP
.nf
\fBipfstat\fR [\fB-6aACdfghIilnoRstv\fR]
.fi

.LP
.nf
\fBipfstat\fR [\fB-C\fR] [\fB-D\fR \fIaddrport\fR] [\fB-P\fR \fIprotocol\fR] [\fB-S\fR \fIaddrport\fR] 
     [\fB-T\fR \fIrefreshtime\fR]
.fi

.SH 機能説明
.sp
.LP
\fBipfstat\fR コマンドは、Solaris IP フィルタ機能に関連するコマンド群の 1 つです。\fBipfilter\fR(5) を参照してください。
.sp
.LP
\fBipfstat\fR コマンドは、シンボル \fB_fr_flags\fR、\fB_frstats\fR、\fB_filterin\fR、および \fB_filterout\fR を使用して \fB/dev/kmem\fR を調べます。このコマンドを実行して機能させるには、\fB/dev/kmem\fR とカーネル自体を読み取れることが必要です。
.sp
.LP
デフォルトの動作では、\fBipfstat\fR は、カーネルがフィルタを通してパケットをやりとりする間に蓄積された統計を取得して表示します。
.sp
.LP
\fBipfstat\fR の役割は、有効になっているフィルタがあればそれらをカーネルに出入りするパケットに適用し、その結果として収集された現在のカーネル統計を表示することです。これは、コマンド行パラメータが指定されていない場合のデフォルトの動作です。\fB-i \fR または \fB-o\fR が指定された場合、\fBipfstat\fR は、現在インストールされカーネルで使用されているフィルタ規則のリストを取得して表示します。
.sp
.LP
\fBipfstat\fR はカーネルのデバイスファイルを使用して情報を取得します。これらのファイルのデフォルトのアクセス権では、\fBipfstat\fR のすべての操作を root ユーザーとして実行する必要があります。
.sp
.LP
\fBipfstat\fR コマンドは \fBkstat\fR(3KSTAT) カーネル機能をサポートしています。このサポートのため、\fBipfstat\fR の代わりに \fBkstat\fR(1M) を使用できます。例: 
.sp
.LP
# kstat \(hym ipf
.sp
.LP
\fBipfstat\fR \fB-t\fR オプションを使用すると、\fBipfstat\fR は top 形式の状態表示モードになります。このモードでは、Unix の \fBtop\fR ユーティリティーがプロセステーブルを表示するのと同様の方法で、状態テーブルが表示されます。\fB-C\fR、\fB-D\fR、\fB- P\fR、\fB-S\fR、および \fB-T\fR コマンド行オプションを使用すると、表示する状態エントリを限定したり、表示の更新頻度を指定したりできます。
.sp
.LP
top 形式の状態表示モードでは、次のキーを使用すると、表示する情報を変更できます。
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
表示する情報を選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.RS 5n
.rt  
画面を描画し直します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBq\fR\fR
.ad
.RS 5n
.rt  
プログラムを終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
ソート基準を切り替えます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 5n
.rt  
ソート基準を逆にします。
.RE

.sp
.LP
状態エントリのプロトコル番号、IP パケット数、バイト数、および生存期間で状態をソートできます。デフォルトでは、バイト数でソートされます。状態は降順にソートされますが、\fBr\fR キーを使用すると昇順にソートできます。
.sp
.LP
発信元、着信先、およびプロトコルの各フィルタおよび更新頻度は、対話形式では変更できません。これはコマンド行から行う必要があります。
.sp
.LP
正しく表示するには、画面には少なくとも 80 カラム必要です。ただし、\fBipfstat\fR では画面幅は検査されません。
.sp
.LP
ソート基準とフィルタ基準に一致する、最初の \fIX\fR-5 エントリだけが表示されます (\fIX\fR は画面の行数)。それ以上のエントリを表示する方法はありません。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-6\fR\fR
.ad
.RS 18n
.rt  
可能であれば、IPv6 のフィルタリストと状態を表示します。このオプションは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 18n
.rt  
アカウンティングフィルタリストを表示し、各規則に対してカウントされたバイト数を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.RS 18n
.rt  
パケット認証統計を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 18n
.rt  
\fB-t\fR との組み合わせでのみ有効です。「クローズ」状態も上位に表示します。通常、\fBCLOSE_WAIT\fR プロトコル状態に達した TCP 接続は表示されません。このオプションを有効にすると、すべての状態エントリが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 18n
.rt  
データを表示する際にデバッグ出力を生成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIaddrport\fR\fR
.ad
.RS 18n
.rt  
\fB-t\fR との組み合わせでのみ有効です。top 形式の状態表示に表示する対象を、着信先 IP アドレスおよびポートが \fIaddrport\fR 引数に一致する状態エントリに限定します。\fIaddrport\fR は \fIipaddress \fR[,\fIport\fR] という形式で指定します。\fIipaddress\fR と \fIport\fR には、数値または文字列 \fBany\fR (この順に、任意の IP アドレスおよび任意のポートを指定) を指定する必要があります。\fB-D\fR オプションを指定しない場合、 デフォルトで \fB-D\fR \fBany,any\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 18n
.rt  
フラグメントの状態情報 (統計) および保持された状態情報 (カーネル内) があれば表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 18n
.rt  
現在設定されているグループ (アクティブなグループとアクティブでないグループの両方) を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 18n
.rt  
各規則で記録された「ヒット」の回数を規則ごとに表示します。\fB-i\fR と組み合わせて使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 18n
.rt  
カーネルの IP 処理の入力側に使用されるフィルタリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR\fR
.ad
.RS 18n
.rt  
アクティブでないフィルタリストの詳細を取得するか、アクティブなフィルタリストの詳細を取得するかを切り替えます。\fB\fR\fB\fR\fB-i\fR と組み合わせて使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 18n
.rt  
\fB-s\fR オプションとともに使用すると、アクティブな状態エントリのリストが表示されます (統計なし)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 18n
.rt  
各規則の出力時にその規則番号を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 18n
.rt  
カーネルの IP 処理の出力側に使用されるフィルタリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.RS 18n
.rt  
\fB-t\fR との組み合わせでのみ有効です。top 形式の状態表示に表示する対象を、特定のプロトコルに一致する状態エントリに限定します。引数には、プロトコル名 (\fB/etc/protocols\fR で定義されているもの) またはプロトコル番号を指定できます。このオプションを指定しない場合、 すべてのプロトコルの状態エントリが指定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 18n
.rt  
IP アドレスからホスト名への解決とポート番号からサービス名への解決の両方を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIaddrport\fR\fR
.ad
.RS 18n
.rt  
\fB-t\fR との組み合わせでのみ有効です。top 形式の状態表示に表示する対象を、発信元 IP アドレスおよびポートが \fIaddrport\fR 引数に一致する状態エントリに限定します。\fIaddrport\fR は \fIipaddress \fR[,\fIport\fR] という形式で指定します。\fIipaddress\fR と \fIport\fR には、数値または文字列 \fBany\fR (この順に、任意の IP アドレスおよび任意のポートを指定) を指定する必要があります。\fB-S\fR オプションを指定しない場合、 デフォルトで \fB-S\fR \fBany,any\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 18n
.rt  
パケット/フローの状態情報 (統計のみ) を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fIrefreshtime\fR\fR
.ad
.RS 18n
.rt  
\fB-t\fR との組み合わせでのみ有効です。\fBtop\fR 形式の状態表示を更新する頻度を指定します。refreshtime は更新間隔の秒数です。任意の正の整数を使用できます。デフォルトは 1 (最小の更新間隔) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 18n
.rt  
Unix ユーティリティー \fBtop\fR がプロセステーブルを表示するのと同様の方法で、状態テーブルを表示します。状態はいくつかの方法でソートできます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 18n
.rt  
詳細モードを有効にします。追加のデバッグ情報を表示します。
.RE

.SH ファイル
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/kmem\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ksyms\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ipl\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ipstate\fR
.RE
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件network/ipfilter
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBipf\fR(1M), \fBkstat\fR(1M), \fBkstat\fR(3KSTAT), \fBattributes\fR(5), \fBipfilter\fR(5)
.sp
.LP
\fI\fR
