Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/ipmpstat.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ipmpstat 1M "2011 年 3 月 31 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ipmpstat \- IPMP サブシステムのステータスの表示
.SH 形式
.LP
.nf
\fBipmpstat\fR [\fB-n\fR] [\fB-o\fR \fIfield\fR[,...] [\fB-P\fR]] \fB-a\fR|\fB-g\fR|\fB-i\fR|\fB-p\fR|\fB-t\fR
.fi

.SH 機能説明
.sp
.LP
\fBipmpstat\fR コマンドは、IPMP サブシステムに関する情報を簡潔に表示します。5 種類の出力モードがサポートされており、後述のとおり、IPMP サブシステムの状態をそれぞれ異なる視点で (アドレス、グループ、インタフェース、プローブ、およびターゲット) 表示できます。呼び出しごとに最大 1 つの出力モードを指定できます。表示される情報には自己矛盾のないことが保証されます。解析可能な出力形式も用意されているため、それをスクリプトで使用して IPMP サブシステムの状態を調べることができます。\fBipmpstat\fR は基本的な特権のみで呼び出すことができますが、プローブモードだけはすべての特権を必要とします。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
IPMP データアドレスの情報を表示します (「アドレス」出力モード)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
IPMP グループの情報を表示します (「グループ」出力モード)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
IP インタフェースの情報を表示します (「インタフェース」出力モード)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
IP アドレスからホスト名への解決を試みずに、IP アドレスを数値で表示します。このオプションはどの出力モードでも使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
指定された出力フィールドだけを、指定どおりの順序で表示します。フィールド名はコンマで区切って指定します。大文字と小文字が区別されます。サポートされるフィールド名は、選択した出力モードによって異なります (後述の説明を参照)。特殊なフィールド名 \fBall\fR を使用すると、特定の出力モードの全フィールドを表示できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
IPMP プローブの情報を表示します (「プローブ」出力モード)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
IPMP ターゲットの情報を表示します (「ターゲット」出力モード)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
後述のマシン解析可能な形式を使用して表示します。このオプションを指定する場合は、\fB-o\fR オプションを使用してフィールドのリストを明示的に指定する必要があります。
.RE

.SH 出力モード
.sp
.LP
\fBipmpstat\fR ユーティリティーでは、次の出力モードがサポートされています。これらのモードは、前述のオプションの一部に対応しています。
.sp
.ne 2
.mk
.na
\fBアドレスモード\fR
.ad
.sp .6
.RS 4n
アドレスモードでは、システム上にあるすべての IPMP データアドレスの状態が表示されます。サポートされている出力フィールドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
情報に関連付けられているホスト名 (または IP アドレス)。「down」状態のアドレスには重複するものが存在する可能性があるため、一意の識別情報を形成するにはアドレスと \fBGROUP\fR を組み合わせる必要があります。ある特定の IPMP グループで重複アドレスが存在する場合は、最大 1 つが表示されます。また、「up」状態のアドレスが常に優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
アドレスの状態。アドレスが \fBIFF_UP\fR (\fBifconfig\fR(1M) を参照) であれば \fBup\fR、アドレスが \fBIFF_UP\fR でなければ \fBdown\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
このアドレスが属している IPMP IP インタフェース。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINBOUND\fR\fR
.ad
.sp .6
.RS 4n
このアドレス宛のパケットを受信する、基になる IP インタフェース。これは、IP インタフェース障害などの外部イベントに応じて変更されることがあります。このフィールドが空の場合、システムはこのアドレス宛に送信された IP パケットを受け入れません (アドレスが「down」状態である場合や、その IPMP グループにはアクティブな IP インタフェースが残っていない場合など)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOUTBOUND\fR\fR
.ad
.sp .6
.RS 4n
この発信元アドレスを使用してパケットを送信する、基になる IP インタフェース。これは、IP インタフェース障害などの外部イベントに応じて変更されることがあります。このフィールドが空の場合、システムはこのアドレスを発信元としてパケットを送信することはありません (アドレスが「down」状態である場合や、その IPMP グループにはアクティブな IP インタフェースが残っていない場合など)。
.RE

\fB-o\fR を指定しない場合、 すべての出力フィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBグループモード\fR
.ad
.sp .6
.RS 4n
グループモードでは、システム上にあるすべての IPMP グループの状態が表示されます。サポートされている出力フィールドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
情報に関連付けられている IPMP IP インタフェース名。匿名グループ (\fBin.mpathd\fR(1M) を参照) の場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUPNAME\fR\fR
.ad
.sp .6
.RS 4n
IPMP グループ名。匿名グループの場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
グループの状態。次のようになります。
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.RS 12n
.rt  
グループのすべてのインタフェースが使用可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdegraded\fR\fR
.ad
.RS 12n
.rt  
グループのインタフェースのすべてではなく一部のみが使用可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.RS 12n
.rt  
グループのすべてのインタフェースが使用不能です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBFDT\fR\fR
.ad
.sp .6
.RS 4n
プローブベースの障害検出時間。プローブベースの障害検出が無効になっている場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINTERFACES\fR\fR
.ad
.sp .6
.RS 4n
グループ内の基になる IP インタフェースのリスト。このリストは、3 つのパートに分かれています。
.RS +4
.TP
1.
リストの最初の部分には、アクティブなインタフェースが表示されます。各括弧や丸括弧には囲まれません。アクティブなインタフェースとは、システムでデータトラフィックの送受信に使用されているインタフェースのことです。
.RE
.RS +4
.TP
2.
次に、\fBINACTIVE\fR 状態のインタフェースが丸括弧に囲まれて表示されます。\fBINACTIVE\fR 状態のインタフェースとは、機能してはいるが、管理ポリシーに従って使用されていないインタフェースのことです。
.RE
.RS +4
.TP
3.
最後に、使用不能なインタフェースが角括弧に囲まれて表示されます。使用不能なインタフェースとは、現在の設定ではまったく使用できないインタフェースのことです (\fBFAILED\fR や \fBOFFLINE\fR など)。
.RE
.RE

\fB-o\fR を指定しない場合、 すべての出力フィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBインタフェースモード\fR
.ad
.sp .6
.RS 4n
インタフェースモードでは、システム上にあり \fBin.mpathd\fR によって追跡されているすべての IPMP インタフェースの状態が表示されます。サポートされている出力フィールドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
情報に関連付けられている IP インタフェース名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBACTIVE\fR\fR
.ad
.sp .6
.RS 4n
その IP インタフェースがシステムで IP データトラフィックに使用されているかどうかによって、\fByes\fR または \fBno\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGROUP\fR\fR
.ad
.sp .6
.RS 4n
IP インタフェースに関連付けられている IPMP IP インタフェース。匿名グループ (\fBin.mpathd\fR(1M) を参照) の IP インタフェースの場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
IP インタフェースに関するさまざまな情報。
.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
\fBINACTIVE\fR 状態なので使用不能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
\fBSTANDBY\fR としてマークされています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
その IPMP グループの IPv4 マルチキャスト送受信用として指定されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 5n
.rt  
その IPMP グループの IPv4 ブロードキャスト送受信用として指定されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
その IPMP グループの IPv6 マルチキャスト送受信用として指定されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
\fBdown\fR 状態なので使用不能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBh\fR\fR
.ad
.RS 5n
.rt  
ハードウェアアドレスの重複のため \fBin.mpathd\fR によって \fBOFFLINE\fR にされているので使用不能です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
リンクベースの障害検出の状態。
.sp
.ne 2
.mk
.na
\fB\fBup\fR\fR
.ad
.sp .6
.RS 4n
リンクは稼働しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdown\fR\fR
.ad
.sp .6
.RS 4n
リンクは停止しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
ネットワークドライバからリンクの状態変化が報告されません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBPROBE\fR\fR
.ad
.sp .6
.RS 4n
プローブベースの障害検出の状態。
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.sp .6
.RS 4n
プローブで問題は検出されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.sp .6
.RS 4n
プローブで障害が検出されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
適切なプローブターゲットが認識されていないため、プローブを送信できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisabled\fR\fR
.ad
.sp .6
.RS 4n
一意の IP テストアドレスが設定されていないため、プローブは無効になっています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
インタフェースの全体的な状態。
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.sp .6
.RS 4n
設定されている障害検出方法によれば、インタフェースはオンライン状態で正しく動作しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailed\fR\fR
.ad
.sp .6
.RS 4n
インタフェースはオンライン状態ですが、リンク状態が \fBdown\fR またはプローブ状態が \fBfailed\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoffline\fR\fR
.ad
.sp .6
.RS 4n
インタフェースはオフライン状態です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.sp .6
.RS 4n
インタフェースはオンライン状態ですが、設定されている障害検出方法が \fBunknown\fR 状態なので、動作しているかどうかは不明です。
.RE

.RE

\fB-o\fR を指定しない場合、 すべての出力フィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBプローブモード\fR
.ad
.sp .6
.RS 4n
プローブモードでは、\fBin.mpathd\fR によって送信されているプローブに関する情報が表示されます。ほかの出力モードとは異なり、このモードは \fBCtrl-C\fR で明示的に終了されるまで実行し続けます。サポートされている出力フィールドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBTIME\fR\fR
.ad
.sp .6
.RS 4n
\fBipmpstat\fR の開始時からの時間で表した、プローブが送信された時間。\fBipmpstat\fR の開始前にプローブが送信された場合、この時間は負になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROBE\fR\fR
.ad
.sp .6
.RS 4n
プローブを表す識別子。この識別子には、プローブタイプを示す接頭辞に続き、プローブの数値識別子が埋め込まれています。プローブタイプに使用できる値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.RS 5n
.rt  
ICMP プローブ
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
推移的プローブ
.RE

ICMP プローブはアクティブなインタフェースから送信されます。プローブの数値識別子は、ある特定のアクティブインタフェースから \fBin.mpathd\fR によって IP プローブが送信されるたびに増分されます。数値識別子は ICMP プローブパケットの \fBicmp_seq\fR フィールドに一致します。これをパケット監視ツールで使用することで、より詳細な分析を行うことができます。
.sp
IPMP グループ内のどのインタフェースにも \fBNOFAILOVER\fR テストアドレスが設定されていない場合は、データパケットの受信にアクティブには使用されていないすべてのインタフェースから、推移的プローブが送信されます。推移的プローブの数値識別子は、ある特定のインタフェースから推移的プローブが送信されるたびに増分されます。プローブパケットの形式は実装内部のものです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
プローブが送信された IP インタフェース。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGET\fR\fR
.ad
.sp .6
.RS 4n
アクティブなインタフェースから送信された ICMP プローブのターゲットのホスト名 (または IP アドレス)。あるいは、推移的プローブが送信された IP インタフェースの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNETRTT\fR\fR
.ad
.sp .6
.RS 4n
プローブのネットワーク往復時間。これは、IP モジュールがプローブを送信してから肯定応答を受信するまでの時間です。プローブが失われたと \fBin.mpathd\fR で判断された場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTT\fR\fR
.ad
.sp .6
.RS 4n
プローブの合計往復時間。これは、\fBin.mpathd\fR がプローブ送信用のコードの実行を開始してから \fBack\fR の処理を完了するまでの時間です。プローブが失われたと \fBin.mpathd\fR で判断された場合、このフィールドは空になります。合計往復時間が急上昇し、ネットワーク往復時間にはそのような急上昇が見られない場合は、ローカルシステム自体の過負荷を示しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTTAVG\fR\fR
.ad
.sp .6
.RS 4n
\fBINTERFACE\fR から \fBTARGET\fR までの往復時間の平均。これは、低速なターゲットの特定に役立ちます。十分なデータがないため平均を計算できない場合、このフィールドは空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRTTDEV\fR\fR
.ad
.sp .6
.RS 4n
\fBINTERFACE\fR から \fBTARGET\fR までの往復時間の標準偏差。これは、ばらつきの多いターゲットの特定に役立ちます。十分なデータがないため標準偏差を計算できない場合、このフィールドは空になります。
.RE

\fB-o\fR を指定しない場合、 \fBRTTAVG\fR と \fBRTTDEV\fR を除くすべてのフィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBターゲットモード\fR
.ad
.sp .6
.RS 4n
ターゲットモードでは、IPMP プローブターゲットの情報が表示されます。サポートされている出力フィールドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBINTERFACE\fR\fR
.ad
.sp .6
.RS 4n
情報に関連付けられている IP インタフェース名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
プローブターゲットの発見モード
.sp
.ne 2
.mk
.na
\fB\fBroutes\fR\fR
.ad
.RS 14n
.rt  
ルーティングテーブルによって見つかったプローブターゲット。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmulticast\fR\fR
.ad
.RS 14n
.rt  
マルチキャスト ICMP プローブによって見つかったプローブターゲット。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisabled\fR\fR
.ad
.RS 14n
.rt  
プローブベースの障害検出はすべて無効になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtransitive\fR\fR
.ad
.RS 14n
.rt  
障害検出は推移的プローブによって行われます。このモードでは、グループ内にあるほかのアクティブインタフェースをプローブで調べることにより、IP インタフェースの健全性が判定されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBTESTADDR\fR\fR
.ad
.sp .6
.RS 4n
送信プローブで使用される発信元アドレス。データトラフィックに使用されているアクティブなインタフェース、および \fBNOFAILOVER\fR テストアドレスが明示的に設定されているインタフェースについては、ICMP プローブの送受信に使用されるホスト名 (または IP アドレス) が表示されます。グループ内にあるほかのすべてのインタフェースについては、プローブの送信元のインタフェースの名前が表示されます。アクティブな IP インタフェースに IPv4 テストアドレスと IPv6 テストアドレスの両方が設定されている場合、プローブターゲットの情報は各テストアドレスについて個別に表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGETS\fR\fR
.ad
.sp .6
.RS 4n
ICMP プローブの場合はプローブターゲットのホスト名 (または IP アドレス) を、推移的プローブの場合はターゲットインタフェースを、それぞれスペースで区切ったリスト。IP ターゲットは調査順に表示されます。プローブターゲットが見つからなかった場合、このフィールドは空になります。
.RE

\fB-o\fR を指定しない場合、 すべての出力フィールドが表示されます。
.RE

.SH 出力形式
.sp
.LP
デフォルトでは、\fBipmpstat\fR の出力モードには人間に読みやすい表形式が使用されます。各行には、特定の対象に関する情報が 1 つ以上のフィールドで表示されます。また、この対象は、これらのフィールドを 1 つ以上組み合わせることで一意に識別されます。この形式では、テーブルの上に (および 1 画面分の情報ごとに) フィールドを表すヘッダーが表示されます。フィールドはスペースで区切られ、空のフィールドは \fB--\fR (2 つのハイフン) で表されます。ほかにも、読みやすくするための方法が使用されます。フィールドの値を特定できない場合、その値は「\fB?\fR」と表示され、標準エラーに診断メッセージが出力されます。
.sp
.LP
マシン解析可能な形式にも表形式が使用されますが、プログラムで効率よく解析できるように設計されています。具体的には、解析可能な形式は、人間に読みやすい形式と次の点で異なります。
.RS +4
.TP
.ie t \(bu
.el o
ヘッダーは表示されません。
.RE
.RS +4
.TP
.ie t \(bu
.el o
空のフィールドには \fB--\fR は表示されず、何も出力されません。
.RE
.RS +4
.TP
.ie t \(bu
.el o
フィールドの区切りは、可変な数のスペースではなく、1 つのコロン (\fB:\fR) です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
複数のフィールドが要求される場合、フィールドの値に文字としてコロン (\fB:\fR) またはバックスラッシュ (\fB\e\fR) があると、これらの文字は前に \fB\e\fR を付けてエスケープされます。
.RE
.SH 使用例
.LP
\fB例 1 \fR特定のインタフェースの障害検出時間の取得
.sp
.LP
次のコードは、マシン解析可能な出力形式を使用して、特定の IPMP IP インタフェースの障害検出時間を出力する \fBksh\fR 関数を作成します。

.sp
.in +2
.nf
     getfdt() {
         ipmpstat -gP -o group,fdt | while IFS=: read group fdt; do
             [[ "$group" = "$1" ]] && { echo "$fdt"; return; }
         done
     }
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp
.LP
\fB/usr/sbin/ipmpstat\fR:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
_
マシン解析可能な形式確実
_
人間に読みやすい形式インタフェースではない
.TE

.sp
.LP
\fB/usr/sbin/ipmpstat\fR は「確実」インタフェースではありません。
.SH 関連項目
.sp
.LP
\fBif_mpadm\fR(1M), \fBifconfig\fR(1M), \fBin.mpathd\fR(1M), \fBattributes\fR(5)
