Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/ipnat.1m
'\" te
.\" To view license terms, attribution, and copyright for IP Filter, the default path is /usr/lib/ipf/IPFILTER.LICENCE. If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the installed location.
.\" Portions Copyright (c) 2008, Sun Microsystems Inc. All Rights Reserved.
.TH ipnat 1M "2008 年 4 月 3 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ipnat \- NAT サブシステムのユーザーインタフェース
.SH 形式
.LP
.nf
\fBipnat\fR [\fB-CdFhlnRrsv\fR] \fB-f\fR \fIfilename\fR
.fi

.SH 機能説明
.sp
.LP
\fBipnat\fR ユーティリティーは、指定されたファイル (ハイフン (\fB-\fR) は標準入力として扱う) を開き、そのファイルを解析して、IP NAT に対して追加または削除する規則のセットを抽出します。
.sp
.LP
解析に問題がない場合は、\fBipnat\fR によって処理された各規則がカーネルの内部リストに追加されます。規則は、\fBipnat\fR に指定したときの順序で内部リストの末尾に追加されます。
.sp
.LP
\fBipnat\fR の使用は、\fB/dev/ipauth\fR、\fB/dev/ipl\fR、および \fB/dev/ipstate\fR へのアクセスによって制限されます。これらのファイルのデフォルトのアクセス権では、\fBipnat\fR のすべての操作を root ユーザーとして実行する必要があります。
.sp
.LP
\fBipnat\fR の使用は、\fB/dev/ipnat\fR へのアクセスによって制限されます。\fB/dev/ipnat\fR のデフォルトのアクセス権では、\fBipnat\fR のすべての操作を root ユーザーとして実行する必要があります。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 15n
.rt  
現在の NAT 規則リストに含まれるすべてのエントリ (NAT 規則) を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
デバッグモードを有効にします。フィルタ規則が処理されるたびに、生成されるフィルタ規則の 16 進ダンプが出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 15n
.rt  
現在の NAT 変換テーブルに含まれるすべてのアクティブなエントリ (現在アクティブな NAT マッピング) を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 15n
.rt  
指定されたファイルを解析して、IP NAT に対して追加または削除する規則を抽出します。\fIfilename\fR を標準入力にすることもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 15n
.rt  
各マップ/リダイレクトフィルタのヒット数を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 15n
.rt  
現在の NAT テーブルエントリマッピングのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
\fBipf\fR が現在実行中のカーネルを変更する操作 (ioctl コールなど) を実行しないようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 15n
.rt  
IP アドレスからホスト名への解決とポート番号からサービス名への解決の両方を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 15n
.rt  
一致する NAT 規則を、内部リストに追加するのではなく、内部リストから削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 15n
.rt  
NAT の統計情報を検索して表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 15n
.rt  
詳細モードを有効にします。規則の処理およびアクティブな規則/テーブルエントリに関する情報が表示されます。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/dev/ipnat\fR\fR
.ad
.sp .6
.RS 4n
IP フィルタ疑似デバイスへのリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/kmem\fR\fR
.ad
.sp .6
.RS 4n
仮想アドレス空間へのアクセスを提供する特殊ファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/ipf/ipnat.conf\fR\fR
.ad
.sp .6
.RS 4n
\fBipnat\fR の起動時構成ファイルの場所。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/ipfilter/examples/\fR\fR
.ad
.sp .6
.RS 4n
IP フィルタの例が多数含まれています。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件network/ipfilter
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBipf\fR(1M), \fBipfstat\fR(1M), \fBipnat\fR(4), \fBattributes\fR(5)
