Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/isnsadm.1m
'\" te
.\" Copyright (c) 2010, Sun Microsystems, Inc. All Rights Reserved
.TH isnsadm 1M "2010 年 3 月 10 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
isnsadm \- iSNS (internet Storage Name Server) サーバーの管理
.SH 形式
.LP
.nf
\fBisnsadm\fR \fIoptions\fR
.fi

.LP
.nf
\fBisnsadm\fR \fIsubcommand\fR [\fIsubcommand_options\fR] [\fIoperand\fR]
.fi

.SH 機能説明
.sp
.LP
\fBisnsadm\fR コマンドは、iSNS (Internet Storage Name Service) サーバーのコマンド行インタフェースです。\fBisnsadm\fR は、iSNS サーバー管理機能の 1 つを実行する個々のサブコマンドのセットで構成されています。各サブコマンドについては、それぞれの節を参照してください。
.sp
.LP
iSNS 構成を変更する操作には、\fBsolaris.isnsmgr.write\fR 承認が必要です。\fBisns\fR(1M ) を参照してください。読み取り操作では、このコマンドに特別な承認は不要です。
.sp
.LP
\fBisnsadm\fR には一般的なオプションのセットとサブコマンド固有オプションのセットが存在します。最初のカテゴリについては「オプション」を参照してください。2 つ目のカテゴリについては、各サブコマンドの説明を参照してください。
.SH オプション
.sp
.LP
次のオプションがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fB-?\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
コンテキストヘルプを表示します。以降の引数の解釈を停止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン情報を表示します。以降の引数の解釈を停止します。
.RE

.SH オペランド
.sp
.LP
1 つ以上の \fBisnsadm\fR サブコマンドにより、次のオペランドが使用されます。
.sp
.ne 2
.mk
.na
\fB\fIiscsi-node-name\fR\fR
.ad
.sp .6
.RS 4n
iSCSI ターゲットまたは iSCSI イニシエータの記号名。文字列の最大長は 223 文字。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインの記号名。文字列の最大長は 256 文字。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインセットの記号名。文字列の最大長は 256 文字。
.RE

.SH サブコマンド
.sp
.LP
\fBisnsadm\fR コマンドは、次のサブコマンドをサポートします。
.SS "\fBadd-dd\fR"
.sp
.LP
\fBadd-dd\fR サブコマンドは、発見ドメインを発見ドメインセットに追加します。
.sp
.LP
\fBadd-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm add-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-dd\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインセットを指定します。
.RE

.SS "\fBadd-node\fR"
.sp
.LP
\fBadd-node\fR サブコマンドは、指定された発見ドメインにノードを追加します。
.sp
.LP
\fBadd-node\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm add-node \fIoption\fR \fIiscsi-node-name\fR,...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-node\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR、\fB--dd\fR \fIdiscovery-domain-name \fR\fR
.ad
.sp .6
.RS 4n
発見ドメインを指定します。
.RE

.SS "\fBcreate-dd\fR"
.sp
.LP
\fBcreate-dd\fR サブコマンドは、指定された名前の発見ドメインを作成します。
.sp
.LP
\fBcreate-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm create-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd\fR にオプションはありません。
.SS "\fBcreate-dd-set\fR"
.sp
.LP
\fBcreate-dd-set\fR サブコマンドは、指定された名前の発見ドメインセットを作成します。
.sp
.LP
\fBcreate-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm create-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd-set\fR にオプションはありません。
.SS "\fBdelete-dd\fR"
.sp
.LP
\fBdelete-dd\fR サブコマンドは、指定された名前の発見ドメインを削除します。
.sp
.LP
\fBdelete-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm delete-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd\fR にオプションはありません。
.SS "\fBdelete-dd-set\fR"
.sp
.LP
\fBdelete-dd-set\fR サブコマンドは、指定された名前の発見ドメインセットを削除します。
.sp
.LP
\fBdelete-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm delete-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd-set\fR にオプションはありません。
.SS "\fBdisable-dd-set\fR"
.sp
.LP
\fBdisable-dd-set\fR サブコマンドは、発見ドメインセットを無効にします。
.sp
.LP
\fBdisable-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm disable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdisable-dd-set\fR にオプションはありません。
.SS "\fBenable-dd-set\fR"
.sp
.LP
\fBenable-dd-set\fR サブコマンドは、発見ドメインセットを有効にします。
.sp
.LP
\fBenable-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm enable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBenable-dd-set\fR にオプションはありません。
.SS "\fBlist-dd\fR"
.sp
.LP
\fBlist-dd\fR サブコマンドは、発見ドメインに関する情報を表示します。オペランドが指定されない場合、現在 iSNS サーバーに存在するすべての発見ドメインの一覧を表示します。
.sp
.LP
\fBlist-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm list-dd [\fIoption\fR] [\fIdiscovery-domain-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd\fR には、次のオプションを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインのメンバーの内容を表示します。
.RE

.SS "\fBlist-dd-set\fR"
.sp
.LP
\fBlist-dd-set\fR サブコマンドは、iSNS サーバーに存在する有効な発見ドメインセットと無効なドメインセットの両方を一覧表示します。\fBdd-set\fR の登録は行われないことに注意してください。オペランドが指定されていない場合は、すべての発見ドメインセットの一覧が表示されます。
.sp
.LP
\fBlist-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm list-dd-set [\fIoption\fR] [\fIdiscovery-domain-set-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd-set\fR には、次のオプションを設定できます。
.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインセット内のすべての発見ドメインを表示します。
.RE

.SS "\fBlist-node\fR"
.sp
.LP
\fBlist-node\fR サブコマンドは、iSNS サーバーに現在登録されているノード、または登録されておらず、デフォルト以外の発見ドメインに属するノードに関する情報を表示します。後者の場合、ノードにはタイプフィールド \fBunknown\fR が含まれています。オペランドが指定されていない場合、\fBlist-node\fR は iSNS サーバーが認識するすべてのノードを表示します。
.sp
.LP
\fBlist-node\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm list-node [\fIoptions\fR] [\fIiscsi-node-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-node\fR には、次のオプションを指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--target\fR\fR
.ad
.sp .6
.RS 4n
リストをフィルタ処理して、iSCSI ターゲットノードだけを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR、\fB--initiator\fR\fR
.ad
.sp .6
.RS 4n
リストをフィルタ処理して、iSCSI イニシエータノードだけを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
ノードの詳細を表示します。このオプションを使用しない場合、名前、別名、およびタイプ情報だけが表示されます。
.RE

.SS "\fBmodify-dd\fR"
.sp
.LP
\fBmodify-dd\fR サブコマンドは、指定された発見ドメインの属性を変更します。
.sp
.LP
\fBmodify-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm modify-dd \fIoption\fR \fIdiscovery-domain-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
既存の発見ドメインに適用する新しい発見ドメイン名を指定します。
.RE

.SS "\fBmodify-dd-set\fR"
.sp
.LP
\fBmodify-dd-set\fR サブコマンドは、発見ドメインセットを変更します。
.sp
.LP
\fBmodify-dd-set\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm modify-dd-set \fIoption\fR \fIdiscovery-domain-set-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd-set\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
既存の発見ドメインセットに適用する新しい発見ドメインセット名を指定します。
.RE

.SS "\fBremove-dd\fR"
.sp
.LP
\fBremove-dd\fR サブコマンドは、指定された発見ドメインセットとの関連付けを削除します。
.sp
.LP
\fBremove-dd\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm remove-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-dd\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
発見ドメインを削除する発見ドメインセットを指定します。
.RE

.SS "\fBremove-node\fR"
.sp
.LP
\fBremove-node\fR サブコマンドはノードを削除します。
.sp
.LP
\fBremove-node\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm remove-node \fIoption\fR \fIiscsi-node-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-node\fR には、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
ノードを削除する発見ドメインを指定します。
.RE

.SS "\fBshow-config\fR"
.sp
.LP
\fBshow-config\fR サブコマンドは、iSNS サーバーの管理設定を表示します。設定は、サービス管理機能を使って変更できます (\fBsmf\fR(5) を参照)。\fBisns\fR(1M) を参照してください。
.sp
.LP
\fBshow-config\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBisnsadm show-config\fR
.fi
.in -2
.sp

.sp
.LP
\fBshow-config\fR にオプションはありません。
.SH 使用例
.LP
\fB例 1 \fRクライアントを表示する
.sp
.LP
次では、\fBlist-node\fR サブコマンドを使用してクライアントを表示します。

.sp
.in +2
.nf
# \fBisnsadm list-node -v\fR
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
        Alias: STK5320_NAS
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        Alias: 
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Alias: host-x2100
        Type: Initiator
        Network Entity: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Portal: 172.20.236.123:58530
                Portal Group: 1
        DD Name: Default
.fi
.in -2
.sp

.LP
\fB例 2 \fR発見ドメインを表示する
.sp
.LP
次では、\fBlist-dd\fR サブコマンドを使用して発見ドメインを表示します。

.sp
.in +2
.nf
# \fBisnsadm list-dd -v\fR
DD name: Default
        DD set(s): Default
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        iSCSI name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
DD name: acct-dd
DD name: engineering-dd
.fi
.in -2
.sp

.LP
\fB例 3 \fRノードを追加する
.sp
.LP
次では、\fBadd-node\fR サブコマンドを使用して発見ドメインにノードを追加することで、発見ドメインメンバーシップを作成します。

.sp
.in +2
.nf
# \fBisnsadm add-node -d engineering-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.engr\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRノードを削除する
.sp
.LP
次では、\fBremove-node\fR サブコマンドを使用して発見ドメインからノードを削除することにより、発見ドメインメンバーシップを削除します。

.sp
.in +2
.nf
# \fBisnsadm remove-node -d acct-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fR発見ドメインセットを作成する
.sp
.LP
次では、\fBcreate-dd-set\fR サブコマンドを使用して発見ドメインセットを作成します。

.sp
.in +2
.nf
# \fBisnsadm create-dd-set operation-dd-set\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fR発見ドメインセットを表示する
.sp
.LP
次では、\fBlist-dd-set\fR サブコマンドを使用して発見ドメインセットを表示します。

.sp
.in +2
.nf
# \fBisnsadm list-dd-set -v\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
.fi
.in -2
.sp

.LP
\fB例 7 \fR発見ドメインを追加する
.sp
.LP
次では、\fBadd-dd\fR サブコマンドを使用して発見ドメインセットに発見ドメインを追加します。

.sp
.in +2
.nf
# \fBisnsadm add-dd -s operation-dd-set engineering-dd\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fR発見ドメインセットを表示する
.sp
.LP
次では、\fBlist-dd-set\fR を使用して発見ドメインセットの属性を表示します。

.sp
.in +2
.nf
# \fBisnsadm list-dd-set\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
        DD Name: engineering-dd
.fi
.in -2
.sp

.LP
\fB例 9 \fR発見ドメインセットを有効にする
.sp
.LP
次では、\fBenable-dd-set\fR サブコマンドを使用して発見ドメインセットを有効にします。

.sp
.in +2
.nf
# \fBisnsadm enable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fB例 10 \fR発見ドメインセットを無効にする
.sp
.LP
次では、\fBdisable-dd-set\fR サブコマンドを使用して発見ドメインセットを無効にします。

.sp
.in +2
.nf
# \fBisnsadm disable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fB例 11 \fR管理設定を表示する
.sp
.LP
次では、\fBshow-config\fR サブコマンドを使用して現在の管理設定を表示します。

.sp
.in +2
.nf
# \fBisnsadm show-config\fR
        Data Store Location: /etc/isns/isnsdata.xml
        Entity Status Inquiry Non-Response Threshold: 3
        Management SCN Enabled: yes
        Authorized Control Node Names: -
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/storage/isns
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBiscsiadm\fR(1M), \fBisns\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
複数のオペランドを使ってサブコマンドが呼び出され、1 つ以上のオペランドが失敗したがすべてのオペランドが失敗したわけではない場合、\fBisnsadm\fR は部分障害の発生を示す一般的なメッセージおよび失敗したオペランドの一覧を表示します。特定のオペランドで発生したエラーを確認するには、失敗したオペランドを指定して同じサブコマンドを実行します。
