Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/labeld.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH labeld 1M "2007 年 6 月 26 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
labeld \- Trusted Extensions ラベルデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/labeld\fR 
.fi

.SH 機能説明
.sp
.LP
\fBlabel\fR デーモンは、Trusted Extensions が有効な場合に、ブート時に起動するシステムデーモンです。このデーモンは自動的に起動されるので、直接起動しないようにしてください。このデーモンは、プログラミングインタフェースの構成要素ではありません。
.sp
.LP
Trusted Extensions を有効にするには、次の内容をコマンド行に入力します。
.sp
.in +2
.nf
% svcadm enable svc:/system/labeld
.fi
.in -2
.sp

.sp
.LP
Trusted Extensions はゾーンの初期化および操作に影響を及ぼすため、Trusted Extensions を有効にする前にすべてのゾーンを削除する必要があります。有効にしたあと、Trusted Extensions が適切に初期化されるようにシステムをリブートしてください。
.sp
.LP
Trusted Extensions の有効化や無効化を行えるのは、\fBsolaris.smf.manage.labels\fR 承認を持つユーザーまたは役割だけです(例: Information Security または Object Label Management 権利プロファイルを保持するユーザーや役割、またはスーパーユーザー)。
.sp
.LP
Trusted Extensions の機能を使用する前に、ほかの構成手順を実行する必要があります。詳細は、『\fISolaris Trusted Extensions インストールと構成\fR』ガイドを参照してください。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性 不確実 
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fISolaris Trusted Extensions 管理者の手順\fR
.SH 注意事項
.sp
.LP
\fBlabels\fR(5) サービスは、サービス管理機能 \fBsmf\fR(5) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/system/labeld:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスのステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
