Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/modunload.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH modunload 1M "2001 年 11 月 19 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
modunload \- モジュールのアンロード
.SH 形式
.LP
.nf
\fBmodunload\fR \fB-i\fR \fImodule_id\fR [\fB-e\fR \fIexec_file\fR]
.fi

.SH 機能説明
.sp
.LP
\fBmodunload\fR は、稼動中のシステムからロード可能モジュールをアンロードします。\fImodule_id\fR はアンロードするモジュールの \fBID\fR で、これは \fB modinfo\fR(1M) の出力情報中に得られる値と同じです。\fBID\fR として \fB0\fR を指定した場合、自動ローディングされたモジュールのうちアンロード可能なものがすべてアンロードされます。\fBmodload\fR(1M) を使ってロードしたモジュールは対象とはなりません。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIexec_file\fR\fR
.ad
.RS 16n
.rt  
モジュールをアンロードする前に実行すべきシェルスクリプトまたは実行可能イメージの名前を指定します。第 1 引数はモジュール ID (10 進数) です。他の 2 つの引数は、モジュールの種類により異なります。ロード可能ドライバの場合は、ブロックメジャー番号が第 2 引数です。ロード可能システムコールの場合は、システムコール番号が第 2 引数です。ロード可能 exec クラスの場合は、\fBexecsw\fR テーブルへのインデックスが第 2 引数です。ロード可能ファイルシステムの場合は、\fBvfssw\fR テーブルへのインデックスが第 2 引数です。ロード可能ストリームモジュールの場合は、\fBfmodsw\fR テーブルへのインデックスが第 2 引数です。ロード可能スケジューリングクラスの場合は、クラス配列へのインデックスが第 2 引数です。該当しない引数の値としては、-1 が渡されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fImodule_id\fR\fR
.ad
.RS 16n
.rt  
アンロードすべきモジュールを指定します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBmodinfo\fR(1M), \fBmodload\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5)
.SH 注意事項
.sp
.LP
\fBmodunload\fR コマンドは、関連するドライバ構成ファイルをシステムに再度読み込ませるためにドライバモジュールでよく使用されます。これは現在の Solaris リリースで機能しますが、構成ファイルを再度読み込むために勧められている方法ではなく、将来のリリースで機能する保証はありません。ドライバ構成ファイルの再読み込みには、\fBupdate_drv\fR(1M) コマンドを使用することをお勧めします。
