Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/ndmpd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ndmpd 1M "2011 年 8 月 4 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ndmpd \- NDMP (Network Data Management Protocol) デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/ndmp/ndmpd\fR
.fi

.SH 機能説明
.sp
.LP
\fBndmpd\fR デーモンは、クライアント NDMP (Network Data Management Protocol) の要求を処理します。NDMP は、バックアップや復旧に使用される、オープンな企業規模のネットワークベースデータ管理プロトコルです。\fBndmpd\fR デーモンにより、ユーザーは DMA (Data Management Application) クライアントを使用してデータのバックアップと復旧を管理できるようになります。NDMP プロトコルを使って、データの移動を調整したり、DMA と NDMP サーバー間または 2 台の NDMP サーバー間を制御したりできます。
.sp
.LP
デフォルトでは、\fBndmpd\fR は無効になっています。
.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
プロセスのフォークや相互排他ロックの初期化に失敗するなどのエラーが発生したために、\fBndmpd\fR デーモンの初期化が妨げられました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
無効なコマンド行オプションが指定されました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ndmp/ndmpd\fR\fR
.ad
.sp .6
.RS 4n
ネットワークデータ管理プロトコルサーバーのバイナリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/ndmp.log\fR\fR
.ad
.sp .6
.RS 4n
ネットワークデータ管理プロトコルのログメッセージファイル。このファイルは、リブート時に削除されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/ndmp/dumpdates\fR\fR
.ad
.sp .6
.RS 4n
ダンプバックアップの日付とレベルに関する情報を格納するテキストファイル。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/storage/ndmp
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBndmpadm\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBndmpd\fR デーモンは、サービス管理機能 (\fBsmf\fR(5)) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/system/ndmpd:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスのステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
