Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/ndmpadm.1m
'\" te
.\" Copyright (c) 2007, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ndmpadm 1M "2010 年 5 月 25 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ndmpadm \- NDMP (Network Data Management Protocol) の動作の管理
.SH 形式
.LP
.nf
\fB/usr/sbin/ndmpadm\fR [\fB-?\fR ] \fIsubcommand\fR [\fIoptions\fR] [\fIdirect-object\fR]
.fi

.SH 機能説明
.sp
.LP
\fBndmpadm\fR コマンドを使用して \fBndmpd\fR(1M) デーモンへ照会を行い、アクティブなセッションのステータスの取得、セッションの終了、バックアップデバイスの照会、および現在の NDMP (Network Data Management Protocol) サービスの変数やプロパティーの設定と取得を行うことができます。\fBndmpadm\fR は、サブコマンドのセットとして実装されており、その多くは独自の直接オブジェクトを保持します。詳細については、各サブコマンドのセクションを参照してください。一部のサブコマンドでは、オプションをサポートしています。詳細については、該当するサブコマンドの説明を参照してください。
.sp
.LP
\fBndmpadm\fR コマンドは、次のサブコマンドをサポートします。
.sp
.ne 2
.mk
.na
\fB\fBdisable\fR\fR
.ad
.sp .6
.RS 4n
指定された認証パスワード処理を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBenable\fR\fR
.ad
.sp .6
.RS 4n
指定された認証パスワード処理を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBget\fR\fR
.ad
.sp .6
.RS 4n
NDMP 構成プロパティーの値を取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkill-sessions\fR\fR
.ad
.sp .6
.RS 4n
アクティブなセッションを終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR\fR
.ad
.sp .6
.RS 4n
NDMP 構成プロパティーの値を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-devices\fR\fR
.ad
.sp .6
.RS 4n
サーバーに接続されているテープデバイスの一覧を取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow-sessions\fR\fR
.ad
.sp .6
.RS 4n
アクティブな NDMP セッションの詳細を表示します。
.RE

.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.RS 6n
.rt  
すべてのサブコマンドとオプションの一覧を表示します。
.RE

.SH サブコマンド
.sp
.LP
\fBndmpadm\fR コマンドは、次のサブコマンドをサポートします。
.SS "\fBdisable\fR サブコマンド"
.sp
.LP
\fBdisable\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm disable -a \fIauth-type\fR\fR
.fi
.in -2
.sp

.sp
.LP
このサブコマンドは、NDMP クライアントのリモートアクセスに関して \fIauth-type\fR で指定された認証タイプを無効にします。\fIauth-type\fR の有効な値は、\fBcram-md5\fR または \fBcleartext\fR です。
.SS "\fBenable\fR サブコマンド"
.sp
.LP
\fBenable\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm enable -a \fIauth-type\fR -u \fIusername\fR\fR
.fi
.in -2
.sp

.sp
.LP
このサブコマンドは、確認のためにユーザーにパスワードの入力を 2 回求めます。その後、NDMP クライアントアクセス用に指定されたユーザー名とパスワードを使って、指定された認証タイプをアクティブにします。\fIauth-type\fR の有効な値は、\fBcram-md5\fR または \fBcleartext\fR です。
.SS "\fBget\fR サブコマンド"
.sp
.LP
\fBget\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm get [-p] [\fIproperty\fR] [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
プロパティー名は、\fBset\fR サブコマンドで使用されるものと同じです。これらについては後述します。プロパティーを指定しない場合は、\fBget\fR サブコマンドによりすべての構成プロパティーが返されます。
.SS "\fBkill-sessions\fR サブコマンド"
.sp
.LP
\fBkill-sessions\fR サブコマンドを使って、\fIID\fR に指定された番号のセッションを終了できます。
.sp
.LP
\fBkill-sessions\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm kill-sessions \fIID\fR\fR
.fi
.in -2
.sp

.SS "\fBset\fR サブコマンド"
.sp
.LP
\fBset\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm set [-p] \fIproperty\fR=\fIvalue\fR [[-p] \fIproperty\fR=\fIvalue\fR]...\fR
.fi
.in -2
.sp

.sp
.LP
\fBset\fR サブコマンドを使って設定可能なプロパティーについては、\fBndmp\fR(4) のマニュアルページを参照してください。
.SS "\fBshow-devices\fR サブコマンド"
.sp
.LP
\fBshow-devices\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.sp
.LP
このサブコマンドは、システムに現在接続されているテープドライブおよびライブラリの名前、製造元、シリアル番号、その他の情報を一覧表示します。
.SS "\fBshow-sessions\fR サブコマンド"
.sp
.LP
\fBshow-sessions\fR サブコマンドは、セッションの詳細を表示します。\fBshow-sessions\fR サブコマンドの構文は次のとおりです。
.sp
.in +2
.nf
# \fBndmpadm show-sessions [-i tape,scsi,data,mover] [\fIID\fR]\fR
.fi
.in -2
.sp

.sp
.LP
\fBshow-sessions\fR サブコマンドでは次の引数をサポートしています。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fBtape\fR,\fBscsi\fR,\fBdata\fR,\fBmover\fR\fR
.ad
.sp .6
.RS 4n
データを取得するインタフェースのタイプを特定します。インタフェースを指定しない場合、\fBshow-sessions\fR ではすべてのインタフェースタイプの情報が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIID\fR\fR
.ad
.sp .6
.RS 4n
データを表示する特定のセッションを指定します。\fIID\fR を指定しない場合は、\fBshow-sessions\fR ではすべてのセッションのデータが表示されます。
.RE

.SH 使用例
.LP
\fB例 1 \fRすべての NDMP 接続のステータスを取得する
.sp
.LP
次のコマンドは、すべての接続のステータスを取得します。

.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR特定の接続タイプのステータスを取得する
.sp
.LP
次のコマンドは、テープおよび SCSI インタフェースのステータスを取得します。

.sp
.in +2
.nf
# \fBndmpadm show-sessions -i scsi,tape\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRプロトコルのバージョンを制限する
.sp
.LP
次のコマンドは、使用する NDMP プロトコルをバージョン 3 に制限します。

.sp
.in +2
.nf
# \fBndmpadm set -p version=3\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fR現在のバージョン番号を取得する
.sp
.LP
次のコマンドは、現在実行中の NDMP のバージョン番号を取得します。

.sp
.in +2
.nf
# \fBndmpadm get -p version\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fR特定のセッションを接続解除する
.sp
.LP
次のコマンドはセッション 5 を接続解除します。セッション番号は、以前に \fBndmpadm show-sessions\fR コマンドから取得した番号です。

.sp
.in +2
.nf
# \fBndmpadm kill-session 5\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fRNDMP プロパティーの値をすべて取得する
.sp
.LP
次のコマンドは、NDMP プロパティーの値をすべて取得します。

.sp
.in +2
.nf
# \fBndmpadm get\fR
.fi
.in -2
.sp

.LP
\fB例 7 \fRCRAM-MD5 認証を有効にする
.sp
.LP
次のコマンドは、CRAM-MD5 認証を有効にします。

.sp
.in +2
.nf
# \fBndmpadm enable -a cram-md5 -u admin\fR
Enter new password:\fB*****\fR
Re-enter password:\fB*****\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fR平文パスワード認証を無効にする
.sp
.LP
次のコマンドは、平文パスワード認証を無効にします。

.sp
.in +2
.nf
# \fBndmpadm disable -a cleartext\fR
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
エラー (\fBndmpd\fR デーモンが実行されていないなど) が発生したため、\fBndmpadm\fR がデーモンと通信できませんでした。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
無効なコマンド行オプションが指定されました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/storage/ndmp
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdump\fR(1), \fBtar\fR(1), \fBndmpd\fR(1M), \fBndmpstat\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBndmp\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBndmpd\fR(1M) デーモンは、サービス管理機能 (\fBsmf\fR(5)) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/system/ndmpd
.fi
.in -2
.sp

.sp
.LP
プロパティーの設定や取得など、このサービスに関する管理操作は、\fBsvccfg\fR(1M) を使用しても実行できます。たとえば、次の方法で DAR (Direct Access Recovery) モードを有効にできます。
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBsetprop ndmpd/dar-support = yes\fR
.fi
.in -2
.sp

.sp
.LP
プロパティーの一覧を取得するには、次のようにします。
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBlistprop\fR
.fi
.in -2
.sp

