Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/netstat.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\" Copyright (c) 1983 Regents of the University of California. All rights reserved.The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.TH netstat 1M "2011 年 7 月 8 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
netstat \- ネットワークのステータスを表示
.SH 形式
.LP
.nf
\fBnetstat\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-g\fR [\fB-nv\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-p\fR [\fB-n\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-s\fR [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR] 
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-m\fR [\fB-T\fR u | d ] [\fB-v\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-i\fR [\fB-I\fR \fIinterface\fR] [\fB-an\fR] [\fB-f\fR \fIaddress_family\fR] 
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-r\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR | \fIfilter\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-M\fR [\fB-ns\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-D\fR [\fB-I\fR \fIinterface\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-d\fR [\fB-f\fR \fIaddress_family\fR]
.fi

.SH 機能説明
.sp
.LP
\fBnetstat\fR コマンドは、ネットワーク関連のデータ構造の内容を、指定されたオプションに従って、さまざまな形式で表示します。
.sp
.LP
\fBnetstat\fR コマンドの形式は上のセクションに示されていますが、次のようないくつかの形態があります。
.RS +4
.TP
.ie t \(bu
.el o
1つめの形式は、必ずしも引数を指定する必要がなく、それぞれのプロトコルについてアクティブなソケットを示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
2 番目、3 番目、4 番目の形式 (\fB-g\fR、\fB-p\fR、および \fB-s\fR オプション) は、さまざまなネットワークデータ構造から情報を取り出して表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
5 番目の形式は (\fB-m\fR オプション) STREAMS メモリーの統計情報を表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
6 番目の形式は (\fB-i\fR オプション) インタフェースの状態を表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
7 番目の形式 (\fB-r\fR オプション) はルーティングテーブルを表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
8 番目の形式は (\fB-M\fR オプション) マルチキャストルーティングテーブルを表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
9 番目の形式 (\fB-D\fR オプション) は 1 つまたはすべてのインタフェースの \fBDHCP\fR の状態を表示します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
10 番目の形式 (\fB-d\fR オプション) は、宛先キャッシュエントリのテーブルを表示します。
.RE
.sp
.LP
これらの形式について、以下により詳しく説明します。
.sp
.LP
引数を 1 つも指定しない場合 (最初の形式), \fBnetstat\fR は \fBf\fR オプションで設定を変更しないかぎり、\fBPF_INET\fR、 \fBPF_INET6\fR、 および \fB-PF_UNIX\fR の接続ソケットを表示します。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
すべてのソケット、 すべてのルーティングテーブルエントリ、すべての物理および論理インタフェースの状態を表示します。通常は、サーバープロセスに使用されるリスナーソケットは表示されません。ほとんどの場合、インタフェース、ホスト、ネットワーク、およびデフォルトルートだけが表示されます。また、インタフェースでステータスが表示されるのは、物理インタフェースのみです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
宛先キャッシュエントリテーブルを表示します。下の「\fB表示\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIaddress_family\fR\fR
.ad
.sp .6
.RS 4n
すべての表示を \fIaddress_family\fR で指定されたものだけに限定します。指定できる \fIaddress_family\fR の値は次のとおりです。 
.sp
.ne 2
.mk
.na
\fB\fBinet\fR\fR
.ad
.RS 9n
.rt  
IPv4 情報を表示する \fBAF_INET\fR アドレスファミリ用
.RE

.sp
.ne 2
.mk
.na
\fB\fBinet6\fR\fR
.ad
.RS 9n
.rt  
IPv6 情報を表示する \fBAF_INET6\fR アドレスファミリ用
.RE

.sp
.ne 2
.mk
.na
\fB\fBunix\fR\fR
.ad
.RS 9n
.rt  
\fBAF_UNIX\fR アドレスファミリ用
.RE

.sp
.ne 2
.mk
.na
\fB\fBsdp\fR\fR
.ad
.RS 9n
.rt  
Socket Description Protocol (SDP) プロトコルおよびアドレスファミリの場合、 SDP ソケットに関して表示されるアドレス状態を次に示します。各状態の意味のあとに、\fBnetstat\fR により表示されるフラグを示します。
.br
.in +2
\fBLST\fR Listen
.in -2
.br
.in +2
\fBEST\fR Established 
.in -2
.br
.in +2
\fBPL\fR Path Lookup
.in -2
.br
.in +2
\fBHS\fR Hello Request Sent
.in -2
.br
.in +2
\fBHR\fR Hello Request Received
.in -2
.br
.in +2
\fBHAR\fR Hello Ack Recvd
.in -2
.br
.in +2
\fBHAS\fR Hello Ack sent
.in -2
.br
.in +2
\fBDR\fR Fin received
.in -2
.br
.in +2
\fBDS\fR Fin sent
.in -2
.br
.in +2
\fBDSA\fR Fin Ack recvd
.in -2
.br
.in +2
\fBDRC\fR Simultaneous Disconnect
.in -2
.br
.in +2
\fBDSC\fR Disconnect sent (peer already closed)
.in -2
.br
.in +2
\fBTW1\fR Time Wait 1
.in -2
.br
.in +2
\fBTW2\fR Time Wait 2
.in -2
.br
.in +2
\fBCLD\fR Closed
.in -2
.br
.in +2
\fBERR\fR Error
.in -2
.br
.in +2
\fBINV\fR Invalid
.in -2
.br
.in +2
\fBUNK\fR Unknown
.in -2
SDP プロトコルおよびアドレスファミリの場合、\fBnetstat\fR は次の列ヘッダーを表示します。
.sp
.ne 2
.mk
.na
\fB\fBローカルアドレス\fR\fR
.ad
.RS 28n
.rt  
ローカル IP アドレス
.RE

.sp
.ne 2
.mk
.na
\fB\fBリモートアドレス\fR\fR
.ad
.RS 28n
.rt  
リモート IP アドレス
.RE

.sp
.ne 2
.mk
.na
\fB\fB状態\fR\fR
.ad
.RS 28n
.rt  
ソケットの現在の状態
.RE

.sp
.ne 2
.mk
.na
\fB\fBRxBPending\fR\fR
.ad
.RS 28n
.rt  
未読バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBTxBQueued\fR\fR
.ad
.RS 28n
.rt  
Tx (\fBTxBPosted\fR を含む) のキューに入っているバイト数
.RE

.sp
.ne 2
.mk
.na
\fB\fBTxBPosted\fR\fR
.ad
.RS 28n
.rt  
転送用に HW に送信済みのバイト数
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAdvtSz\fR\fR
.ad
.RS 28n
.rt  
ローカルの通知済みバッファーサイズ
.RE

.sp
.ne 2
.mk
.na
\fB\fBRAdvtSz\fR\fR
.ad
.RS 28n
.rt  
リモートの通知済みバッファーサイズ
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAdvtBuff\fR\fR
.ad
.RS 28n
.rt  
ローカルの通知済み Rx バッファー数
.RE

.sp
.ne 2
.mk
.na
\fB\fBRAdvtBuff\fR\fR
.ad
.RS 28n
.rt  
リモートの通知済み Rx バッファー数
.RE

.sp
.ne 2
.mk
.na
\fB\fBLPostBuff\fR\fR
.ad
.RS 28n
.rt  
現在の送信済み Rx バッファー数
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilter\fR\fR
.ad
.sp .6
.RS 4n
\fB-r\fR オプションとともに使用した場合のみ、経路の表示を指定されたフィルタにマッチするものに限定します。フィルタのルールは \fIkeyword\fR:\fIvalue\fR のペアで構成されます。既知の keyword と value の構文は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBaf:\fR{\fBinet\fR|\fBinet6\fR|\fBunix\fR|\fBsdp\fR|\fInumber\fR}\fR
.ad
.sp .6
.RS 4n
アドレスファミリを選択します。これは \fB-f\fR \fIaddress_family\fR と同じで、どちらの構文もサポートされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoutif\fR:{\fIname\fR|\fIifIndex\fR|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
出力インタフェースを選択します。名前 (\fBhme0\fR など) または \fBifIndex\fR 番号 (たとえば \fB2\fR) でインタフェースを指定することができます。\fBany\fR が指定された場合は、指定されたインタフェースを持つすべての経路がフィルタにマッチします (null 以外のすべて)。\fB\fR  が指定された場 合は、 null インタフェースを持つすべての経路がマッチします。インタフェースのインデックス番号 (\fIifIndex\fR) は \fBifconfig\fR(1M) の\fB-a\fR オプションで確認できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdst\fR:{\fIip-address\fR[/\fImask\fR]|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
着信先 IP アドレスを選択します。マスク長とともに指定した場合は、長さが同じか、またはより長い (より限定された) マスクにマッチする経路が選択されます。\fBany\fR が指定された場合は、0 以外のすべてのアドレスが選択されます。\fBnone\fR が指定された場合は、アドレス 0 が選択されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBflags:\fR[\fB+ -\fR]?[\fBABDGHLMSU\fR]\fB+\fR\fR
.ad
.sp .6
.RS 4n
指定されたフラグでタグ付けされた経路を選択します。デフォルトでは、フラグが指定されたとおりに設定されている場合にのみマッチします。先頭に \fB+\fR を付けることにより、指定されたフラグが設定されている場合にのみマッチするようになります。先頭に \fB-\fR を付けることにより、指定されたフラグが設定されていない場合にのみマッチするようになります。
.RE

\fB-f\fR オプションを複数使用することにより、複数のフィルタを指定することができます。例: 
.sp
.in +2
.nf
% netstat -nr -f outif:hme0 -f outif:hme1 -f dst:10.0.0.0/8
.fi
.in -2
.sp

上のコマンドでは、マスク長が8以上でネットワーク 10.0.0.0/8 に属する経路と、出力インタフェースが \fBhme0\fR または \fBhme1\fR である経路が表示され、それ以外の経路は全て除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
すべてのインタフェースのマルチキャストグループメンバーシップを表示します。\fB-v\fR オプションが含まれている場合は、ソースに特定のメンバーシップ情報も表示されます。下の「表示」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
\fBIP\fR トラフィック用に使用されるインタフェースの状態を表示し ま す。通常は、物理インタフェースの統計情報を表示します。\fB-a\fR オプションと組み合わせて使用された場合は、論理インタフェースの情報も報告されます。\fBifconfig\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
STREAMS メモリーの統計情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
ネットワークアドレスを数字で表示します。\fBnetstat\fR は、通常はアドレスをシンボルで表示します。このオプションは、どの表示形式でも使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
Net to Media テーブルを表示します。下の「表示」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
ルーティングテーブルを表示します。通常は、インタフェース、ホスト、ネットワーク、およびデフォルトルートだけが表示されますが、このオプションと \fB-a\fR オプションを組み合わせることにより、キャッシュを含むすべての経路が表示されます。マルチキャストルートを設定していない場合は、カーネルが必要に応じてこの種のエントリを取得しても、\fB-ra\fR によりマルチキャストルーティングエントリが表示されないことがあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
プロトコルごとに統計情報を表示します。\fB-M\fR オプションとともに使用した場合は、この代わりにマルチキャストルーティング統計情報を表示します。\fB-a\fR オプションとともに使用した場合は、システム全体の統計情報に加えて、インタフェースごとの統計情報が表示されます。下の「表示」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu\fR | \fBd\fR\fR
.ad
.sp .6
.RS 4n
タイムスタンプを表示します。
.sp
時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
冗長。ソケット、STREAMS メモリー統計情報、ルーティングテーブル、マルチキャストグループメンバーシップの追加情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIinterface\fR\fR
.ad
.sp .6
.RS 4n
特定のインタフェースの状態を表示します。\fIinterface\fR は \fBhme0\fR や \fBeri0\fR などの有効なインタフェース名です。通常は物理インタフェースのステータスと統計情報が表示されます。このオプションを \fB-a\fR オプションとともに使用した場合、論理インタフェースの統計情報も報告されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.sp .6
.RS 4n
マルチキャストルーティングテーブルを表示します。\fB-s\fR オプションとともに使用した場合、この代わりにマルチキャストルーティングの統計情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
表示するすべてのソケットの状態や統計情報を \fIprotocol\fR に関連するものに限定します。指定できるプロトコルは \fBip\fR, \fBipv6\fR, \fBicmp\fR, \fBicmpv6\fR, \fBicmp\fR, \fBicmpv6\fR, \fBigmp\fR, \fBudp\fR, \fBtcp\fR, \fBrawip\fR のいずれかです。\fBrawip\fR を \fBraw\fR として指定することもできます。コマンドはプロトコルオプションを小文字でのみ受け入れます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
\fBDHCP\fR で構成されたインタフェースのステータスを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
この修飾子を指定すると、ソケットとルーティングテーブルエントリの拡張セキュリティ属性が表示されます。\fB-R\fR 修飾子はシステムが Solaris Trusted Extensions 機能とともに構成されている場合にのみ利用可能です。
.sp
\fB-r\fR オプションのみの場合、このオプションはルーティングエントリのゲートウェイセキュリティ属性だけを表示します。 セキュリティ属性について詳しくは\fBroute\fR(1M) を参照してください。
.sp
最初の形式のコマンドを使用してソケット情報を表示する際に、このオプションはマルチレベルポート(MLP) ソケットの追加情報を表示します。これには次のようなものが含まれます。
.RS +4
.TP
.ie t \(bu
.el o
ソケットが接続されている場合、ピアのラベル。
.RE
.RS +4
.TP
.ie t \(bu
.el o
次のフラグがソケットの "State" 出力に追加されます。
.RS

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.RS 5n
.rt  
ソケットはゾーンプライベート IP アドレス上の MLP です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
ソケットはゾーン間で共有される IP アドレス上の MLP です。
.RE

.RE

.RE
.RE

.SH オペランド
.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
\fIinterval\fR 秒ごとに前回の表示から積算した統計情報を表示し、\fIcount\fR が指定されていない場合は永久に繰り返します。\fIinterval\fR とともにブートされた場合、netstat の出力の最初の行には、最後のリブートから積算された統計情報が表示されます。 
.sp
次のオプションは \fIinterval\fR をサポートします: \fB-i\fR, \fB-m\fR, \fB-s\fR および \fB-Ms\fR. いくつかの値は構成パラメータで、単にインターバルごとに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
\fIinterval\fR で間隔が指定されている際に \fIcount\fR で指定された回数だけ、インタフェースの統計情報の表示を繰り返します。
.RE

.SH 表示
.SS "アクティブなソケット (第 1 の形式)"
.sp
.LP
それぞれのアクティブなソケットの情報には、ローカルとリモートのアドレス、送信と受信の待ち行列サイズ (バイト数)、送信および受信ウィンドウ (バイト数) 、プロトコルの内部状態があります。
.sp
.LP
ソケットアドレスの表示に使用される記号形式は通常、次のどちらかです。
.sp
.in +2
.nf
\fBhostname\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
上記はソケットアドレスがホスト名を表す場合です。
.sp
.in +2
.nf
\fInetwork\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
上記はソケットアドレスが特定のホストではなくネットワークを表す場合です。
.sp
.LP
ソケットに関連する数値ホストアドレスやネットワーク番号を使って、それに対応する記号ホスト名やネットワーク名が \fIhosts\fR や \fInetworks\fR データベースから検索されます。
.sp
.LP
アドレスのネットワークやホスト名が不明な場合、または \fB-n\fR オプションが指定されている場合、ネットワークアドレスが数値で表示されます。無指定または「ワイルドカード」のアドレスやポートは 「\fB*\fR」 で表示されます。インターネットの命名規則については \fB inet\fR(7P) と \fB inet6\fR(7P) を参照してください。
.sp
.LP
SCTP ソケットについては、エンドポイントが複数のアドレスで表されることがあるため、冗長オプション (\fB-v\fR) はすべてのローカルとリモートのアドレスを表示します。
.SS "\fITCP ソケット\fR"
.sp
.LP
\fBTCP\fR ソケットの状態を表す値には、次のものがあります。
.sp
.ne 2
.mk
.na
\fB\fBBOUND\fR\fR
.ad
.RS 16n
.rt  
バインドされました。接続または待機の準備ができている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSED\fR\fR
.ad
.RS 16n
.rt  
クローズされました。ソケットは使用されていない。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSING\fR\fR
.ad
.RS 16n
.rt  
クローズされ、リモートシャットダウンが行われた。肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLOSE_WAIT\fR\fR
.ad
.RS 16n
.rt  
リモートシャットダウン。ソケットのクローズを待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESTABLISHED\fR\fR
.ad
.RS 16n
.rt  
接続が確立されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFIN_WAIT_1\fR\fR
.ad
.RS 16n
.rt  
ソケットがクローズされました。接続を停止している。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFIN_WAIT_2\fR\fR
.ad
.RS 16n
.rt  
ソケットがクローズされました。リモートからのシャットダウンを待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIDLE\fR\fR
.ad
.RS 16n
.rt  
アイドル。オープンされているが、バインドされていない。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLAST_ACK\fR\fR
.ad
.RS 16n
.rt  
リモートシャットダウンの後、クローズされました。肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLISTEN\fR\fR
.ad
.RS 16n
.rt  
着信する接続を待機している。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYN_RECEIVED\fR\fR
.ad
.RS 16n
.rt  
進行中の接続の最初の同期化をはかる。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYN_SENT\fR\fR
.ad
.RS 16n
.rt  
アクティブに接続を確立しようとしている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIME_WAIT\fR\fR
.ad
.RS 16n
.rt  
クローズの後、リモートシャットダウンの再送信を待っている。
.RE

.SS "\fISCTP ソケット\fR"
.sp
.LP
SCTP ソケットの状態を表す値には、次のものがあります。
.sp
.ne 2
.mk
.na
\fB\fBCLOSED\fR\fR
.ad
.RS 21n
.rt  
クローズされました。ソケットは使用されていない。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLISTEN\fR\fR
.ad
.RS 21n
.rt  
着信するアソシエーションを待機している。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESTABLISHED\fR\fR
.ad
.RS 21n
.rt  
アソシエーションが確立されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOOKIE_WAIT\fR\fR
.ad
.RS 21n
.rt  
ピアに \fBINIT\fR が送信されました。肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOOKIE_ECHOED\fR\fR
.ad
.RS 21n
.rt  
INIT-ACK からのクッキーがピアに送信されました。肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_PENDING\fR\fR
.ad
.RS 21n
.rt  
上位レイヤーから \fBSHUTDOWN\fR を受信しました。ピアからのすべての未処理 \fBDATA\fR の肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_SENT\fR\fR
.ad
.RS 21n
.rt  
すべての未処理データが \fBSHUTDOWN_SENT\fR 状態で肯定されました。ピアに \fBSHUTDOWN\fR が送信されました。肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_RECEIVED\fR\fR
.ad
.RS 21n
.rt  
ピアから \fBSHUTDOWN\fR を受信しました。すべての未処理の \fBDATA\fR の肯定応答を待っている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSHUTDOWN_ACK_SENT\fR\fR
.ad
.RS 21n
.rt  
すべての未処理データが \fBSHUTDOWN_RECEIVED\fR 状態で肯定されました。ピアに \fBSHUTDOWN_ACK\fR が送信されました。
.RE

.SS "ネットワークデータ構造 (第 2 - 第 5の形式)"
.sp
.LP
表示形式次は、 \fB-g\fR, \fB-m\fR, \fB-p\fR, \fB-s\fR オプションのどれを指定するかによって異なります。
.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
.rt  
マルチキャストグループメンバーシップのリストを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
メモリーの使用量を表示します (たとえば、STREAMS mblks) 。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
ネットワークとメディアのマッピングテーブルを表示します。IPv4  の場合は、アドレス解決テーブルが表示されます。\fBarp\fR(1M) を参照してください。IPv6 の場合は、近隣キャッシュが表示 されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
さまざまなプロトコルレイヤの統計を表示します。
.RE

.sp
.LP
統計では、MIB 指定変数が使用されます。\fBipForwarding\fR の値は次のように定義されています。
.sp
.ne 2
.mk
.na
\fB\fBforwarding(1)\fR\fR
.ad
.RS 21n
.rt  
ゲートウェイとして機能している。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnot-forwarding(2)\fR\fR
.ad
.RS 21n
.rt  
ゲートウェイとして機能していない。
.RE

.sp
.LP
IPv6 および ICMPv6 プロトコルレイヤはインタフェースごとの統計を保持します。\fB-a\fR オプションが \fB-s\fR オプションと共に指定された場合は、合計された値とともにインタフェースごとの統計が表示されます。そうでない場合は、合計の統計情報だけが表示されます。
.sp
.LP
第 2、第 3、第 4 の形式のコマンドでは、すくなくとも \fB-g\fR, \fB-p\fR, \fB-s\fR のいずれかを指定する必要があります。これらのオプションは、どのような組み合わせで指定することもできます。\fB-m\fR (第 5 の形式) オプションは \fB-g\fR, \fB-p\fR, \fB-s\fR オプションのいずれの組み合わせとも同時に指定することができます。これらのオプションを複数指定した場合、\fBnetstat\fR はそれぞれに対応した情報を表示します。
.SS "インタフェースステータス (第 6 の形式)"
.sp
.LP
インタフェースステータスでは、現在のすべてのインタフェースの情報が 1 行に 1 つずつ表示されます。\fB-I\fR オプションでインタフェースを指定すると、そのインタフェースの情報だけが表示されます。
.sp
.LP
この情報には、インタフェース名、\fBmtu\fR (最大伝送単位、または最大パケットサイズ) (\fBifconfig\fR(1M) を参照)、インタフェースが接続されているネットワーク、各インタフェースのアドレス、インタフェースに対応するカウンタが含まれます。カウンタの種類には、入力パケット数、入力エラー数、出力パケット数、出力エラー数、衝突数のカウンタがあります。二地点間インタフェースの場合、Net および Dest フィールドはリンクの相手の名前またはアドレスです。
.sp
.LP
\fB-a\fR オプションが \fB-i\fR オプションまたは \fB-I\fR オプションのいずれかと同時に指定された場合、出力に物理インタフェースの名前が含まれ、それぞれの論理インタフェースの入力パケット数と出力パケット数が追加の情報とともに表示されます。
.sp
.LP
\fB-n\fR オプションを指定すると、インタフェース名の代わりに IP アドレスが表示されます。
.sp
.LP
オプションの \fIinterval\fR を指定すると、出力は、ユーザーが中断するか、または \fIcount\fR に到達するまで \fIinterval\fR 秒ごとに表示されます。「オペランド」の節を参照のこと。
.sp
.LP
物理インタフェースを指定する場合は \fB-I\fR オプションを使用します。\fIinterval\fR オペランドとともに使用した場合は、\fB-I\fR オプションのための表示は次のような形式になります。
.sp
.in +2
.nf
input    eri0          output        input          (Total)   output
packets  errs  packets errs  colls   packets  errs  packets  errs   colls
227681   0     659471  1     502     261331   0     99597    1      502
10       0     0       0     0       10       0     0        0      0 
8        0     0       0     0       8        0     0        0      0 
10       0     2       0     0       10       0     2        0      0
.fi
.in -2
.sp

.sp
.LP
入力インタフェースが指定されていない場合は、アドレスファミリ \fBinet\fR または \fBinet6\fR の最初のインタフェースが表示されます。
.SS "ルーティングテーブル (第 7 の形式)"
.sp
.LP
ルーティングテーブルには、使用可能な経路とそれぞれのステータスが表示されます。各経路には、宛先のホストまたはネットワークと、パケットの転送で使用するゲートウェイが表示されます。\fIflags\fR 列には経路のステータスが表示されます。表示に使用されるフラグの意味は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
経路が \fBup\fR  (オン) である。
.RE

.sp
.ne 2
.mk
.na
\fB\fBG\fR\fR
.ad
.RS 5n
.rt  
経路がゲートウェイに向かっている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBH\fR\fR
.ad
.RS 5n
.rt  
経路がネットワークではなくホストに向かっている。
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
\fB-multirt\fR オプションによって確立された冗長経路である。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
\fB-setsrc\fR オプションによって確立された経路である。
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 5n
.rt  
リダイレクトによって動的に作成された経路である。
.RE

.sp
.ne 2
.mk
.na
\fB\fBB\fR\fR
.ad
.RS 5n
.rt  
パケットは通知なく削除される (\fBRTF_BLACKHOLE\fR が設定されている)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR\fR
.ad
.RS 5n
.rt  
パケットの削除時に ICMP エラーが送信される (\fBRTF_REJECT\fR が設定されている)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBI\fR\fR
.ad
.RS 5n
.rt  
\fB-indirect\fR オプションを使用して間接経路 (ゲートウェイへの直接到達は不可能) が確立されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZ\fR\fR
.ad
.RS 5n
.rt  
(非大域の排他的 IP ゾーンのみ) 大域ゾーン内で \fBzonecfg\fR(1M) を使用して構成された経路指定情報に基づき、ブート時に経路が静的に追加されました。
.RE

.sp
.LP
\fB-a\fR オプションが指定された場合は、次のフラグを持つルーティングエントリも表示されます。
.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 5n
.rt  
ブロードキャストアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR\fR
.ad
.RS 5n
.rt  
オンリンク宛先のインタフェースホスト経路エントリのクローンを作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.RS 5n
.rt  
ホストのローカルアドレス。
.RE

.sp
.LP
インタフェース経路は、ローカルホストの接続されているインタフェースごとに作成されます。このようなエントリのゲートウェイフィールドには、発信インタフェースのアドレスが表示されます。
.sp
.LP
\fBuse\fR 列には、その経路を使って送信または転送されたパケット数が表示されます。
.sp
.LP
\fIinterface\fR エントリは、その経路に使用されたネットワークインタフェースを示します。
.SS "マルチキャストルーティングテーブル (第 8 の形式)"
.sp
.LP
マルチキャストルーティングテーブルは、仮想インタフェーステーブルと実際のルーティングテーブルから構成されています。
.SS "インタフェース情報 (第 9 の形式)"
.sp
.LP
\fBDHCP\fR インタフェース情報は、インタフェース名、その現在の状態、リース情報、パケット数、フラグのリストからなります。 
.sp
.LP
表示の内容は \fIRFC 2131\fR で提唱された仕様に従います。
.sp
.LP
リース情報には次の内容が含まれます。
.RS +4
.TP
.ie t \(bu
.el o
リース開始日時
.RE
.RS +4
.TP
.ie t \(bu
.el o
リース更新の開始日時
.RE
.RS +4
.TP
.ie t \(bu
.el o
リース期限の日時
.RE
.sp
.LP
現在定義されているフラグには次のようなものがあります。
.sp
.ne 2
.mk
.na
\fB\fBBOOTP\fR\fR
.ad
.RS 11n
.rt  
インタフェースが \fBBOOTP\fR から取得したリースを保持している (IPv4 のみ)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBUSY\fR\fR
.ad
.RS 11n
.rt  
インタフェースは \fBDHCP\fR トランザクションのためにビジー状態である。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRIMARY\fR\fR
.ad
.RS 11n
.rt  
このインタフェースは主インタ フェースである。\fBdhcpinfo\fR(1) および \fBifconfig \fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFAILED\fR\fR
.ad
.RS 11n
.rt  
インタフェースはエラー状態であり、手動でリスタートする必要があります。
.RE

.sp
.LP
パケットカウントは、送信されたパケット、受信したパケット、\fBDHCP\fR クライアントによって拒否 (DECLINE) されたリース提案の数を保持します。3 つのカウンタは、リース取得時にすべて 0 に初期化され、その後インクリメントされます。そのインタフェースに対するリース更新期間の開始時にもカウンタはリセットされます。このように、カウンタの保持する送信、受信、拒否パケットの数は、現在のリースを取得する際、または、将来のリースを取得しようとしている場合のいずれかになります。
.SS "宛先キャッシュエントリテーブル (10 番目の形式)"
.sp
.LP
宛先キャッシュエントリには、記録されたパス MTU、エントリの経過時間 (秒)、およびフラグが表示されます。\fBP\fR フラグは、パス MTU が記録されることを示します。\fBS\fR フラグは、パス MTU が IP により許可される最小値よりも小さいことを示します。\fBU\fR フラグは、一部のトランスポート基準値 (往復時間など) が宛先キャッシュエントリにキャッシュされることを示します。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/default/inet_type\fR\fR
.ad
.RS 26n
.rt  
\fBDEFAULT_IP\fR 設定
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBarp\fR(1M), \fBdhcpinfo\fR(1), \fBdhcpagent\fR(1M), \fBifconfig\fR(1M), \fBiostat\fR(1M), \fBkstat\fR(1M), \fBmibiisa\fR(1M), \fBsavecore\fR(1M), \fBvmstat\fR(1M), \fBzonecfg\fR(1M), \fBhosts\fR(4), \fBinet_type\fR(4), \fBnetworks\fR(4), \fBprotocols\fR(4), \fBservices\fR(4), \fBattributes\fR(5), \fBdhcp\fR(5), \fBkstat\fR(7D), \fBinet\fR(7P), \fBinet6\fR(7P)
.sp
.LP
Droms, R., \fIRFC 2131, Dynamic Host Configuration Protocol\fR, Network Working Group, March 1997.
.sp
.LP
Droms, R. \fIRFC 3315, Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\fR. Cisco Systems. July 2003.
.SH 注意事項
.sp
.LP
インタフェースの情報を表示する際 に、\fBnetstat\fR は\fB/etc/default/inet_type\fR の \fBDEFAULT_IP\fR 設定を優先します。この設定が \fBIP_VERSION4\fR の場合、 \fBnetstat\fR netstat は IPv6 に関するインタフェース、統計情報、接続、経路などの情報を表示しません。
.sp
.LP
しかし、コマンド行で \fB/etc/default/inet_type\fR の\fBDEFAULT_IP\fR  設定をオーバーライドすることができます。たとえば、コマンド行で \fBinet6\fR アドレスファミリまたは  IPv6  プロトコルを使用することで、明示的に IPv6 情報を要求することができ、これは \fBDEFAULT_IP\fR の設定より優先されます。
.sp
.LP
 カーネルクラッシュの後でネットワークステータス情報を調べたい場 合は、m\fBmdb\fR(1) ユーティリティーを \fBsavecore\fR(1M) 出力に対して使用します。
.sp
.LP
\fBnetstat\fR ユーティリティーは \fB/dev/tcp\fR を開いてクエリを発行するこ とによって TCP 統計情報を取得します。このため、\fBnetstat\fR が接続ステータスを報告する際に、使用されていない接続が \fBIDLE\fR ステータスで表示されることがあります。
.sp
.LP
以前のバージョンの \fBnetstat\fR には \fBkstat\fR(7D) を使ってカーネル統計を報告する非公式の方法がありました。この機能は削除されています。\fB kstat\fR(1M) を使用してください。
.sp
.LP
\fBnetstat\fR の出力は \fBnetstat\fR が実行されているゾーンに関連する情報だけに制限されています。(これは、共有 IP と 占有 IP のどちらのゾーンにもあてはまります。)
