Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/nfsstat.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH nfsstat 1M "2011 年 4 月 6 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
nfsstat \- NFS 統計
.SH 形式
.LP
.nf
\fBnfsstat\fR [\fB-cnrsza\fR] [\fB-T\fR u | d ] [\fB-v\fR \fIversion\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnfsstat\fR \fB-m\fR [\fIpathname\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBnfsstat\fR は、カーネルへのインタフェースである \fBNFS\fR および \fBRPC\fR (遠隔手続き呼び出し) の統計情報を表示します。また、nfsstat を使ってこの情報を再初期化することもできます。オプションを指定しない場合、デフォルトは次のようになります。
.sp
.LP
\fBnfsstat\fR \fB-csnra\fR
.sp
.LP
デフォルトではすべての情報を表示し、再初期化は行いません。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS_ACL\fR 情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
クライアント情報を表示します。クライアント側の \fBNFS\fR、\fBRPC\fR、および \fBNFS_ACL\fR 情報だけが出力されます。\fB-n\fR、\fB-r\fR、および \fB-a\fR オプションとともに使用すると、クライアント側の \fBNFS\fR、\fB RPC\fR、および \fBNFS_ACL\fR 情報だけを出力できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR [\fIpathname...\fR]\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR マウントされた各ファイルシステムの統計を表示します。\fIpathname\fR が指定されていない場合、NFS マウントされたすべてのファイルシステムの統計を表示します。\fIpathname\fR が指定されている場合、\fIpathname\fR で示される NFS マウントされたファイルシステムの統計を表示します。
.sp
これには、サーバーの名前とアドレス、マウントフラグ、現在の読み取りと書き込みのサイズ、再転送カウント、属性キャッシュのタイムアウト値、フェイルオーバー情報、および動的再転送に使用されるタイマーが含まれています。動的再転送タイマーが表示されるのは、動的再転送が使用されている場合だけです。デフォルトでは、\fBNFS\fR は \fBTCP\fR プロトコルを介してマウントし、\fBNFS\fR バージョン 3 は \fBTCP\fR または \fBUDP\fR を介してマウントします。動的再転送は使用しません。
.sp
\fB-m\fR オプションを指定すると、\fBnfsstat\fR はこのオプションだけを使用します。その他のオプションを \fB-m\fR とともに指定した場合、\fB-m\fR フラグをほかのオプションとともに指定できないことを警告するエラーメッセージが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR 情報を表示します。クライアント側とサーバー側の \fBNFS\fR 情報が両方出力されます。\fB-c\fR および \fB-s\fR オプションとともに指定すると、クライアントまたはサーバーの \fBNFS\fR 情報のみを出力できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
サーバー情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBu\fR | \fBd\fR\fR
.ad
.sp .6
.RS 4n
タイムスタンプを表示します。
.sp
時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。 標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
統計を出力する NFS のバージョンを指定します。オプションの \fIversion\fR 引数 (\fB2\fR|\fB3\fR|\fB4\fR) を続けて指定すると、そのバージョンの統計が出力されます。デフォルトでは、すべてのバージョンの統計が出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.sp .6
.RS 4n
ゼロ (再初期化) 統計。このオプションはスーパーユーザーのみが使用するものであり、上記の任意のオプションとともに設定することにより、特定の統計セットを出力後にゼロに初期化できます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.sp .6
.RS 4n
count 回のみ報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
各 interval 秒ごとに報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.sp .6
.RS 4n
NFS マウントされたファイルシステム内の、統計を表示するファイルのパス名を指定します。 
.RE

.SH 表示
.sp
.LP
サーバー \fBRPC\fR の表示には、次のフィールドが含まれています。
.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR レイヤーにより拒否された呼び出しの総数 (\fBbadlen\fR と \fBxdrcall\fR の合計、詳細は後述)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadlen\fR\fR
.ad
.sp .6
.RS 4n
最小サイズの \fBRPC\fR 呼び出しよりも短い \fBRPC\fR 呼び出しの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.sp .6
.RS 4n
受信した \fBRPC\fR 呼び出しの総数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupchecks\fR\fR
.ad
.sp .6
.RS 4n
重複要求キャッシュ内を検索する \fBRPC\fR 呼び出しの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupreqs\fR\fR
.ad
.sp .6
.RS 4n
重複が見つかった \fBRPC\fR 呼び出しの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnullrecv\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 呼び出しを受信したと考えられるのに、利用できなかった回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxdrcall\fR\fR
.ad
.sp .6
.RS 4n
ヘッダーを \fBXDR\fR で復号化できなかった \fBRPC\fR 呼び出しの数。
.RE

.sp
.LP
サーバー \fBNFS\fR のディスプレイには、受信した \fBNFS\fR 呼び出しの数 (\fBcalls\fR) と拒否された NFS 呼び出しの数 (\fBbadcalls\fR)、および作成されたさまざまな呼び出しの数と割合 (パーセンテージ) が表示されます。
.sp
.LP
サーバー \fBNFS_ACL\fR のディスプレイには、作成されたさまざまな呼び出しの数と割合 (%) が表示されます。
.sp
.LP
クライアント \fBRPC\fR の表示には、次のフィールドが含まれています。
.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.sp .6
.RS 4n
作成された \fBRPC\fR 呼び出しの総数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR レイヤーにより拒否された呼び出しの総数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadverfs\fR\fR
.ad
.sp .6
.RS 4n
応答内のベリファイアが不正であるために呼び出しが失敗した回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadxids\fR\fR
.ad
.sp .6
.RS 4n
未処理の呼び出しに対応していない応答をサーバーから受信した回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantconn\fR\fR
.ad
.sp .6
.RS 4n
サーバーへの接続確立に失敗したために、呼び出しが失敗した回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantsend\fR\fR
.ad
.sp .6
.RS 4n
クライアントが非接続型トランスポートを介して \fBRPC\fR 要求の送信を試みたが、送信できなかった回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterrupts\fR\fR
.ad
.sp .6
.RS 4n
呼び出しが完了する前に、シグナルにより呼び出しが中断された回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnewcreds\fR\fR
.ad
.sp .6
.RS 4n
認証情報を書き換えなければならなかった回数
.RE

.sp
.ne 2
.mk
.na
\fB\fBnomem\fR\fR
.ad
.sp .6
.RS 4n
メモリーの割り当てに失敗したために、呼び出しが失敗した回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.sp .6
.RS 4n
サーバーからの応答を待機中にタイムアウトしたために、呼び出しを再転送しなければならなかった回数。非接続型トランスポートを介した \fBRPC\fR にのみ適用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeouts\fR\fR
.ad
.sp .6
.RS 4n
サーバーからの応答を待機中に呼び出しがタイムアウトした回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimers\fR\fR
.ad
.sp .6
.RS 4n
計算されたタイムアウト値が、呼び出しに対して指定された最小のタイムアウト値以上であった回数。
.RE

.sp
.LP
クライアント \fBNFS\fR のディスプレイには、送信されて拒否された呼び出しの数、\fBCLIENT\fR ハンドルを受信した回数 (\fBclgets\fR)、\fBCLIENT\fR ハンドルキャッシュに未使用のエントリが含まれていなかった回数 (\fBcltoomany \fR)、およびさまざまな呼び出しの数とその割合 (%) が表示されます。
.sp
.LP
クライアント \fBNFS_ACL\fR のディスプレイには、作成されたさまざまな呼び出しの数と割合 (%) が表示されます。
.sp
.LP
\fB-m\fR オプションには、マウントオプションで設定されたマウントフラグおよびシステム内部のマウントフラグに関する情報、およびその他のマウント情報が含まれています。\fBmount_nfs\fR(1M) を参照してください。
.sp
.LP
次のマウントフラグが、マウントオプションで設定されます。
.sp
.ne 2
.mk
.na
\fB\fBforcedirectio\fR\fR
.ad
.sp .6
.RS 4n
クライアントとサーバー間で直接転送される、クライアントでバッファリングされないデータ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgrpid\fR\fR
.ad
.sp .6
.RS 4n
BSD グループ ID の継承。\fBmount_nfs\fR(1M) の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhard\fR\fR
.ad
.sp .6
.RS 4n
ハードマウント。
.RE

.sp
.ne 2
.mk
.na
\fB\fBintr\fR\fR
.ad
.sp .6
.RS 4n
ハードマウントで割り込みが許可されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBllock\fR\fR
.ad
.sp .6
.RS 4n
ローカルロックを使用中です (ロックマネージャーなし)。これは非公開インタフェースであることに注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoac\fR\fR
.ad
.sp .6
.RS 4n
クライアントは属性をキャッシュしません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnointr\fR\fR
.ad
.sp .6
.RS 4n
ハードマウントで割り込みが許可されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnocto\fR\fR
.ad
.sp .6
.RS 4n
クローズからオープンへの整合性がありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR 再転送。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrpctimesync\fR\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR 時間同期。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsize\fR\fR
.ad
.sp .6
.RS 4n
読み取りバッファーのサイズ (バイト単位)
.RE

.sp
.ne 2
.mk
.na
\fB\fBsec\fR\fR
.ad
.sp .6
.RS 4n
\fBsec\fR には、次のいずれかの値を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fBdh\fR\fR
.ad
.sp .6
.RS 4n
\fBdes\fR - スタイルの認証 (タイムスタンプの暗号化)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR - スタイルの認証。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5i\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR - スタイルの認証 (整合性あり)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5p\fR\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR - スタイルの認証 (非公開)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnone\fR\fR
.ad
.sp .6
.RS 4n
認証なし。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshort\fR\fR
.ad
.sp .6
.RS 4n
UNIX スタイルの認証 (省略形)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys\fR\fR
.ad
.sp .6
.RS 4n
UNIX スタイルの認証 (UID、GID)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBsoft\fR\fR
.ad
.sp .6
.RS 4n
ソフトマウント。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeo\fR\fR
.ad
.sp .6
.RS 4n
初期 \fBNFS\fR タイムアウト (1/10 秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwsize\fR\fR
.ad
.sp .6
.RS 4n
書き込みバッファーのサイズ (バイト単位)
.RE

.sp
.LP
次のマウントフラグは、システム内部用です。
.sp
.ne 2
.mk
.na
\fB\fBacl\fR\fR
.ad
.sp .6
.RS 4n
サーバーは \fBNFS_ACL\fR をサポートします。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBdown\fR\fR
.ad
.sp .6
.RS 4n
サーバーがダウンしています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdynamic\fR\fR
.ad
.sp .6
.RS 4n
動的転送サイズ調整。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.sp .6
.RS 4n
サーバーはリンクをサポートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmirrormount\fR\fR
.ad
.sp .6
.RS 4n
\fBmirrormount\fR メカニズムにより自動的にマウントされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinted\fR\fR
.ad
.sp .6
.RS 4n
「Not responding」というメッセージを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreaddironly\fR\fR
.ad
.sp .6
.RS 4n
\fBreaddirplus\fR ではなく \fBreaddir\fR を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreferral\fR\fR
.ad
.sp .6
.RS 4n
リフェラルメカニズムにより自動的にマウントされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsymlink\fR\fR
.ad
.sp .6
.RS 4n
サーバーはシンボリックリンクをサポートします。
.RE

.sp
.LP
追加のマウント情報に関連したフラグを次に示します。
.sp
.ne 2
.mk
.na
\fB\fBproto\fR\fR
.ad
.sp .6
.RS 4n
プロトコル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvers\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR のバージョン。
.RE

.sp
.LP
\fB-m\fR オプションでも、属性キャッシュのタイムアウト値を指定できます。\fB-m\fR 出力の次のフィールドに、属性キャッシュのタイムアウト値が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBacdirmax\fR\fR
.ad
.sp .6
.RS 4n
キャッシュされたディレクトリ属性を保持する最大時間 (秒)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacdirmin\fR\fR
.ad
.sp .6
.RS 4n
キャッシュされたディレクトリ属性を保持する最小時間 (秒)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacregmax\fR\fR
.ad
.sp .6
.RS 4n
キャッシュされたファイル属性を保持する最大時間 (秒)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBacregmin\fR\fR
.ad
.sp .6
.RS 4n
キャッシュされたファイル属性を保持する最小時間 (秒)。
.RE

.sp
.LP
\fB-m\fR 出力の次のフィールドに、フェイルオーバー情報が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBcurrserver\fR\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR サービスを提供中のサーバー。詳細については、『\fI\fR』を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailover\fR\fR
.ad
.sp .6
.RS 4n
新規サーバーが選択された回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoresponse\fR\fR
.ad
.sp .6
.RS 4n
サーバーが応答に失敗した回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBremap\fR\fR
.ad
.sp .6
.RS 4n
ファイルが新規サーバーに対して再評価された回数。
.RE

.sp
.LP
\fB-m\fR 出力の次のフィールドに、動的再転送に関する情報が表示されます。これらの項目が表示されるのは、動的再転送を使用している場合だけです。
.sp
.ne 2
.mk
.na
\fB\fBcur\fR\fR
.ad
.sp .6
.RS 4n
現在のバックオフ再転送値 (ミリ秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.sp .6
.RS 4n
見積もられた偏差 (ミリ秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsrtt\fR\fR
.ad
.sp .6
.RS 4n
平滑化された往復時間値 (ミリ秒単位)。
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/nfs
.TE

.SH 関連項目
.sp
.LP
\fBmount_nfs\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fI『Oracle Solaris 11 システムのインストール』\fR
.sp
.LP
\fI『System Administration Guide: IP Services 』\fR
