Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/nscadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH nscadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
nscadm \- ネットワークストレージ制御ユーティリティー
.SH 形式
.LP
.nf
\fBnscadm\fR freeze \fIdevice\fR
.fi

.LP
.nf
\fBnscadm\fR unfreeze \fIdevice\fR
.fi

.LP
.nf
\fBnscadm\fR isfrozen \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBnscadm\fR コマンドは、いくつかのネットワークストレージ制御機能を実行します。
.sp
.LP
\fBnscadm\fR \fBfreeze\fR コマンドは、指定されたデバイスへの既存の参照を閉じて、以降のアクセスを遮断します。これにより、システムをシャットダウンせずに、仮想ボリュームデバイスドライバ (RAID 0、RAID 1、RAID 5 など) を管理することが可能になります。
.sp
.LP
\fBnscadm\fR \fBunfreeze\fR コマンドは、指定したデバイスに対して \fBnscadm\fR \fBfreeze\fR と逆の影響を及ぼします。
.sp
.LP
\fBnscadm\fR \fBisfrozen\fR コマンドは、指定されたデバイスの現在のステータスを返します。
.SH オプション
.sp
.LP
\fBnscadm\fR コマンドでは次のオプションをサポートしています。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 13n
.rt  
使用方法のメニューを表示します。
.RE

.SH オペランド
.sp
.LP
\fBnscadm\fR コマンド行では次のオプションをサポートしています。
.sp
.ne 2
.mk
.na
\fB\fIdevice\fR\fR
.ad
.sp .6
.RS 4n
\fBnscadm\fR の操作対象のストレージデバイスを指定します。
.RE

.SH 終了ステータス
.sp
.LP
\fBnscadm\fR とともに \fBfreeze\fR や \fBunfreeze\fR サブコマンドを使用すると、次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
成功
.RE

.sp
.ne 2
.mk
.na
\fB\fB255\fR\fR
.ad
.RS 13n
.rt  
エラー
.RE

.sp
.LP
\fBnscadm\fR とともに \fBisfrozen\fR サブコマンドを使用すると、次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
デバイスは現在凍結されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
デバイスは現在凍結されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB255\fR\fR
.ad
.RS 13n
.rt  
エラー
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-cache-management
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBscmadm\fR(1M), \fBattributes\fR(5)
