Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/polkit-is-privileged.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH polkit-is-privileged 1M "2011 年 3 月 10 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
polkit-is-privileged \- PolicyKit 特権の検査
.SH 形式
.LP
.nf
\fBpolkit-is-privileged\fR  [\fB-hvV\fR] \fB-u\fR \fIuser\fR \fB-p\fR \fIprivilege\fR [\fB-r\fR \fIresource\fR]
.fi

.SH 機能説明
.sp
.LP
\fBpolkit-is-privileged\fR コマンドは、システムポリシーに照会して、指定した特権およびリソースに対しユーザーが許可されているかどうかを判断します。リソース名は省略できます。Solaris オペレーティングシステムでは、特権名として RBAC 承認名を使用するようにしてください。
.sp
.LP
現在、PolicyKit の唯一のコンシューマは \fBhald\fR(1M) です。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR、\fB--help\fR\fR
.ad
.sp .6
.RS 4n
オプションの一覧を表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprivilege\fR、\fB--privilege\fR \fIprivilege\fR\fR
.ad
.sp .6
.RS 4n
ユーザーに関連付けられた特権の名前。コマンドはこの特権について検査します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIresource\fR、\fB--resource\fR \fIresource\fR\fR
.ad
.sp .6
.RS 4n
ユーザーおよび特権に関連付けられたリソースの名前。コマンドはこのリソースについて検査します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuser\fR、\fB--user\fR \fIuser\fR\fR
.ad
.sp .6
.RS 4n
検査する対象のユーザー名またはユーザー ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR、\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
冗長モード。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR、\fB--version\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号を表示します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/library/policykit
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBauths\fR(1), \fBprofiles\fR(1), \fBhald\fR(1M), \fBgetauthattr\fR(3C), \fBauth_attr\fR(4), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
