Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/pooladm.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH pooladm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
pooladm \- リソースプール機能の有効化および無効化
.SH 形式
.LP
.nf
\fB/usr/sbin/pooladm\fR [\fB-n\fR] [\fB-s\fR] [\fB-c\fR] [\fIfilename\fR] | \fB-x\fR
.fi

.LP
.nf
\fB/usr/sbin/pooladm\fR [\fB-d\fR | \fB-e\fR]
.fi

.SH 機能説明
.sp
.LP
\fBpooladm\fR コマンドは、プールやセットに対する管理操作を行います。\fBpooladm\fR は、指定された名前のファイルを読み取り、そこに含まれているプール構成を有効にします。
.sp
.LP
\fBpooladm\fR は、現在のプール実行時構成を更新する前に、その構成が正しいか検査します。 
.sp
.LP
オプションを指定しないで実行すると、\fBpooladm\fR は、現在実行中のプール構成を表示します。 
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
指定された場所にある構成をインスタンス化します。ファイル名が指定されなかった場合のデフォルトは、\fB/etc/pooladm.conf\fR になります。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
プール機能を無効にして、プールを操作できないようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 6n
.rt  
プール機能を有効にして、プールを操作できるようにします。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
現在のアクティブ構成を実際に更新することなく構成を検査します。構文エラーがないことと、現在のシステム上で構成をインスタンス化できることを検査します。アプリケーション固有のプロパティーの検査は実行されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
指定された場所を現在の動的構成の内容で更新します。
.sp
このオプションを指定した場合、更新する構成に対する更新権限が必要となります。このオプションを \fB-c\fR オプションと併用した場合、動的な構成が更新されてから、静的な場所が更新されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
現在アクティブになっているプール構成を削除します。定義されたすべてのリソースを破棄し、それまで区分化されていたすべてのコンポーネントを、それぞれのデフォルトリソースに戻します。 
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfilename\fR\fR
.ad
.RS 12n
.rt  
このファイル内に格納されている構成を使用します。 
.RE

.SH 使用例
.LP
\fB例 1 \fR構成をインスタンス化する
.sp
.LP
次のコマンドは、\fB/home/admin/newconfig\fR に保存されている構成をインスタンス化します。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-c\fR\fB /home/admin/newconfig\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRインスタンス化することなく構成を検査する
.sp
.LP
次のコマンドは、\fB/home/admin/newconfig\fR に保存されている構成をインスタンス化しようとします。発生したエラー条件はすべて表示しますが、アクティブ構成を実際に変更することはありません。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-n\fR\fB \fR\fB-c\fR\fB /home/admin/newconfig\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR現在の構成を削除する
.sp
.LP
次のコマンドは、現在のプール構成を削除します。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm \fR\fB-x\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRプール機能を有効にする
.sp
.LP
次のコマンドは、プール機能を有効にします。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm -e\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fRSMF を使ってプール機能を有効にする
.sp
.LP
次のコマンドは、サービス管理機能を使ってプール機能を有効にします。\fBsmf\fR(5) を参照してください。

.sp
.in +2
.nf
example# \fB/usr/sbin/svcadm enable svc:/system/pools:default\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fRアクティブ構成を指定された場所に保存する
.sp
.LP
次のコマンドは、アクティブ構成を \fB/tmp/state.backup\fR に保存します。

.sp
.in +2
.nf
example# \fB/usr/sbin/pooladm -s /tmp/state.backup\fR
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/pooladm.conf\fR\fR
.ad
.RS 21n
.rt  
\fBpooladm\fR の構成ファイル。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/resource-mgmt/resource-pools
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
呼び出しは「確実」です。出力は「不確実」です。 
.SH 関連項目
.sp
.LP
\fBpoolcfg\fR(1M), \fBpoolbind\fR(1M), \fBpsrset\fR(1M), \fBsvcadm\fR(1M), \fBpset_destroy\fR(2), \fBlibpool\fR(3LIB), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fI\fR
.SH 注意事項
.sp
.LP
スケジューリングクラスなど、区分化可能なリソースへのバインディングのかたちで存在していないリソースバインドは、\fBpooladm\fR \fB-x\fR 操作で必ずしも変更されるとは限りません。
.sp
.LP
デフォルトでは、プール機能は Solaris 起動時に有効になりません。\fBpooladm\fR \fB-e\fR は、プール機能を明示的に有効にします。プールが有効になると、プロセッサ区分化とプロセスバインドに関する特定の API の動作が変更されます。\fBlibpool\fR(3LIB) を参照してください。
.sp
.LP
プロセッサセットが作成されたシステム上でプール機能を有効にすることはできません。プール機能を有効にする前に、\fBpsrset\fR(1M) コマンドまたは \fBpset_destroy\fR(2) を使ってプロセッサセットを手動で破棄してください。
.sp
.LP
リソースプール機能は \fBsmf\fR(5) サービスであるため、その有効化および無効化を標準の SMF インタフェースを使って行うこともできます。
