Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/powertop.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH powertop 1M "2011 年 8 月 22 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
powertop \- 電源管理に影響するイベントの報告と分析
.SH 形式
.LP
.nf
\fBpowertop\fR [\fB-c\fR \fIprocessor_id\fR] [\fB-d\fR \fIcount\fR] [\fB-t\fR \fIinterval\fR] [\fB-v\fR] [\fB-h\fR]
.fi

.SH 機能説明
.sp
.LP
\fBPowerTOP\fR は、システムがどれだけ効果的に、CPU の電源管理機能を利用しているかを表示する可観測性ツールです。本来ならアイドル状態になっているシステムでツールを実行することによって、ユーザーは、別の電力状態で CPU が稼働している時間を調べられます。未使用 (アイドル) のシステムでは、そのすべての時間にわたって最低の電力ステータスで稼働することが理想的ですが、バックグラウンドのユーザーおよびカーネルアクティビティー (ステータスをポーリングするために定期的に起動するランダムなソフトウェア) のために、アイドルシステムでも必要以上に電力を消費する場合があります。
.sp
.LP
このツールは、システムアクティビティーを定期的に分析し、サポートしているそれぞれの電力状態でプロセッサが稼働している時間に関する要約を示します。また、CPU を起動させ、より多くの電力を消費させる原因となった上位アクティビティーも表示します。ユーザーはこのレポートを通じて、システムの問題領域を特定および診断し、その電力効率を最適化できます。
.sp
.LP
\fBPowerTOP\fR は、CPU が低い電力状態に移行することを妨げているアクティビティーの量を平均し、「Wakeups-from-idle per second」フィールドにその値を表示します。この値は、ウェイクアップの合計回数を現在の時間間隔で割ったものです。いつでもすべてのイベントが画面に表示されるわけではありません。
.sp
.LP
実行中に \fBR\fR キーを押すと、分析が強制的に更新されます。時間間隔は、デフォルトまたは指定した値に復元されます。アプリケーションを終了するには、\fBQ\fR キーを押す必要があります。
.sp
.LP
PowerTOP を使用すると、3 つのサブウィンドウをそれぞれフリーズすることができ、各サブウィンドウの内容をより良く分析できます。3 つの異なる DTrace スクリプトを同時に実行している場合、サブウィンドウをフリーズすると、CPU の消費電力が低下します。この機能は、ツールの実行中に \fBi\fR、\fBf\fR、または \fBe\fR キーを押すと有効になります。これらのキーのいずれかを押すと、アイドル、頻度、またはイベントレポートがそれぞれフリーズします。もう一度押すと、フリーズは解除されます。この機能は、分析されているアプリケーションの実行中に呼び出したときにもっとも有効です。
.sp
.LP
\fBPowerTOP\fR は、一部の仮想ドメインで動作します。ただし、アイドル状態遷移のレポートは、物理的 CPU を複数の仮想 CPU が共有する場合があるため、正確であることも、正確でないこともあります。ウェイクアップ回数とイベントレポートはどちらも、現在仮想化されている環境に関する情報を表示します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR [\fIprocessor_id\fR]\fR
.ad
.sp .6
.RS 4n
ツールが監視すべき CPU を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR [\fIcount\fR]\fR
.ad
.sp .6
.RS 4n
システムアクティビティーの \fIcount\fR 分析の結果を画面にダンプします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
コマンドの使用法を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR [\fIinterval\fR]\fR
.ad
.sp .6
.RS 4n
ツールがシステムを分析する間隔を秒単位で指定します。指定可能な値は、1 から 30 の範囲です。デフォルトは 5 秒です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
詳細モードに切り換えて、カーネル循環サブシステムの発動などをイベントレポートに記します。
.RE

.SH 使用例
.LP
\fB例 1 \fR間隔を設定する
.sp
.LP
次のコマンドは、間隔を 2 秒に設定します。

.sp
.in +2
.nf
% \fBpowertop -t 2\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRシステムアクティビティーを分析しダンプする
.sp
.LP
次のコマンドは、システムアクティビティーを分析し標準出力に 4 回ダンプします。

.sp
.in +2
.nf
% \fBpowertop -d 4\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR循環サブシステムアクティビティーを報告する
.sp
.LP
次のコマンドは、循環サブシステムアクティビティーを報告します。

.sp
.in +2
.nf
% \fBpowertop -v\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fR特定のプロセッサでのアクティビティーを分析する
.sp
.LP
次のコマンドは、PowerTOP を実行し、CPU 3 のデータのみを表示します。

.sp
.in +2
.nf
% \fBpowertop -c 3\fR
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
使用法が正しくありません。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
アーキテクチャx86、SPARC
_
使用条件diagnostic/powertop
_
インタフェースの安定性流動的
.TE

.SH 関連項目
.sp
.LP
\fBkstat\fR(1M), \fBpsrinfo\fR(1M), \fBuadmin\fR(2), \fBlibdevinfo\fR(3LIB), \fBattributes\fR(5), \fBcpr\fR(7), \fBpm\fR(7D), \fBpm-components\fR(9P), \fBremovable-media\fR(9P)
.sp
.LP
SunOS 以外のマニュアルページでの \fBxscreensaver(1)\fR および \fBdtpower(1M)\fR。
.SH 使用法
.sp
.LP
\fBPowerTOP\fR を実行するには \fBDTrace\fR 特権が必要であり、ツールがシステムに改善を提案するには、ルート (スーパーユーザー) 特権があるか、または Primary Administrator 役割を引き受けている必要があります。
