Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/prstat.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH prstat 1M "2010 年 12 月 14 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
prstat \- アクティブなプロセスの統計を報告する
.SH 形式
.LP
.nf
\fBprstat\fR [\fB-acHJLmRrtTv\fR] [\fB-d\fR u | d] [\fB-C\fR \fIpsrsetlist\fR] [\fB-h\fR \fIlgrplist\fR] 
     [\fB-j\fR \fIprojlist\fR] [\fB-k\fR \fItasklist\fR] [\fB-n\fR \fIntop\fR[,\fInbottom\fR]] 
     [\fB-p\fR \fIpidlist\fR] [\fB-P\fR \fIcpulist\fR] [\fB-s\fR \fIkey\fR | \fB-S\fR \fIkey\fR ] 
     [\fB-u\fR \fIeuidlist\fR] [\fB-U\fR \fIuidlist\fR] [\fB-z\fR \fIzoneidlist\fR] [\fB-Z\fR] 
     [\fIinterval\fR [\fIcount\fR]]
.fi

.SH 機能説明
.sp
.LP
\fBprstat\fR ユーティリティーは、システム上のアクティブなプロセスをすべて繰り返し検査し、選択した出力モードとソート順に基づいて統計を報告します。\fBprstat\fR には、指定した \fBPID\fR、\fBUID\fR、ゾーン \fBID\fR、\fBCPU\fR \fBID\fR、およびプロセッサセット \fBID\fR と一致するプロセスだけを検査するオプションが用意されています。
.sp
.LP
\fB-j\fR、\fB-k\fR、\fB-C\fR、\fB-p\fR、\fB-P\fR、\fB-u\fR、\fB-U\fR、および \fB-z\fR オプションには、引数としてリストを指定できます。リストの項目は、コンマで区切られるか、あるいは引用符で囲まれてコンマかスペースで区切られます。
.sp
.LP
オプションを指定しない場合、\fBprstat\fR はすべてのプロセスを検査し、\fBCPU\fR 使用状況の順に統計を報告します。 
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
プロセスとユーザーに関する情報を報告します。このモードでは、\fBprstat\fR はプロセスとユーザーに関する別個のレポートを同時に表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
前のレポートに重ねて出力するのではなく、前のレポートの下に新しいレポートを出力します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIpsrsetlist\fR\fR
.ad
.sp .6
.RS 4n
設定したリストのプロセッサセットにバインドされたプロセスまたは lwp のみを報告します。各プロセッサセットは、\fBpsrset\fR(1M) によって報告される整数で識別されます。表示される平均負荷率は、指定したプロセッサセットの平均負荷率の合計です (\fBpset_getloadavg\fR(3C) を参照)。\fB-L\fR オプションが使用されていない場合でも、設定したリストのプロセッサセットにバインドされた 1 つ以上の LWP を持つプロセスが報告されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBu | d\fR\fR
.ad
.sp .6
.RS 4n
時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。 標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIlgrplist\fR\fR
.ad
.sp .6
.RS 4n
指定した \fIlgroup\fR のリストにホーム \fIlgroup\fR があるプロセスまたは lwp だけを報告します。無効な \fIlgroup\fR に対しては、プロセスまたは lwp は一覧表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
ホーム \fIlgroup\fR に関する情報を報告します。このモードでは、\fBprstat\fR はプロセスまたは lwp のホーム \fIlgroup\fR を示す列を追加し、ヘッダーに LGRP と表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-j\fR \fIprojlist\fR\fR
.ad
.sp .6
.RS 4n
指定したリストにプロジェクト \fBID\fR があるプロセスまたは lwp だけを報告します。各プロジェクト \fBID\fR はプロジェクト名または数値のプロジェクト \fBID\fR のどちらでも指定できます。\fBproject\fR(4) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-J\fR\fR
.ad
.sp .6
.RS 4n
プロセスとプロジェクトに関する情報を報告します。このモードでは、\fBprstat\fR はプロセスとプロジェクトに関する別個のレポートを同時に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fItasklist\fR\fR
.ad
.sp .6
.RS 4n
\fItasklist\fR にタスク \fBID\fR があるプロセスまたは lwp だけを報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
軽量プロセス (\fBLWP\fR) ごとの統計を報告します。デフォルトでは、\fBprstat\fR は各プロセスの \fBLWP\fR の数だけを報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
マイクロステートプロセスアカウンティング情報を報告します。\fB-v\fR モードで表示されるすべてのフィールドに加え、このモードには、プロセスがシステムトラップ、テキストページフォルト、データページフォルトの処理に費やした時間、ユーザーロックの待機および \fBCPU\fR の待機 (待ち時間) に費やした時間の割合 (パーセント) も含まれています。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIntop\fR[\fI,nbottom\fR]\fR
.ad
.sp .6
.RS 4n
出力の行数を制限します。\fIntop\fR 引数は、プロセスまたは \fBlwp\fR 統計が報告される行数を決定し、\fInbottom\fR 引数は、\fB-a\fR、\fB-t\fR、\fB-T\fR、\fB-J\fR、または \fB-Z\fR オプションが指定されている場合に、ユーザー、タスク、またはプロジェクト統計が報告される行数を決定します。デフォルトでは、\fBprstat\fR は、ウィンドウまたは端末に合わせた出力の行数を表示します。\fB-c\fR オプションを指定した場合、またはファイルへの出力を指定した場合、\fBntop\fR および \fBnbottom\fR のデフォルト値は \fB15\fR および \fB5\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpidlist\fR\fR
.ad
.sp .6
.RS 4n
指定したリストにプロセス \fBID\fR があるプロセスだけを報告します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIcpulist\fR\fR
.ad
.sp .6
.RS 4n
指定したリストにある \fBCPU\fR で最後に実行されたプロセスまたは \fBlwp\fR だけを報告します。各 \fBCPU\fR は、\fBpsrinfo \fR(1M) によって報告される整数で識別されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
\fBprstat\fR をリアルタイムスケジューリングクラスに配置します。このオプションが使用される場合、\fBprstat\fR は、タイムシェアリングプロセスおよび対話型プロセスよりも優先されます。このオプションは、スーパーユーザーだけが使用できます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
ユーザー名およびプロジェクト名の検索を無効にします。(これは \fB-j\fR、\fB-u\fR、または \fB-U\fR オプションでの検索には適用されません)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIkey\fR\fR
.ad
.sp .6
.RS 4n
出力行 (つまり、プロセス、\fBlwp\fR、またはユーザー) を \fIkey\fR で降順にソートします。引数として使用できるのは 1 つの \fIkey\fR だけです。 
.sp
使用可能なキー値は 5 つあります。 
.sp
.ne 2
.mk
.na
\fBcpu\fR
.ad
.sp .6
.RS 4n
プロセスの \fBCPU\fR の使用状況順にソートします。これはデフォルトです。
.RE

.sp
.ne 2
.mk
.na
\fBpri\fR
.ad
.sp .6
.RS 4n
プロセスの優先度順にソートします。
.RE

.sp
.ne 2
.mk
.na
\fBrss\fR
.ad
.sp .6
.RS 4n
常駐の設定サイズ順にソートします。
.RE

.sp
.ne 2
.mk
.na
\fBsize\fR
.ad
.sp .6
.RS 4n
プロセスイメージのサイズ順にソートします。
.RE

.sp
.ne 2
.mk
.na
\fBtime\fR
.ad
.sp .6
.RS 4n
プロセスの実行時間順にソートします。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIkey\fR\fR
.ad
.sp .6
.RS 4n
出力行を \fIkey\fR で昇順にソートします。使用可能な \fIkey\fR 値は、\fB-s\fR オプションの場合と同じです。\fB-s\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
ユーザーごとの全体的な使用状況の要約を報告します。要約には、ユーザーが所有するプロセスまたは \fBLWP\fR の合計数、プロセスイメージの合計サイズ、常駐の合計設定サイズ、CPU の合計時間、および最近の CPU 時間とシステムメモリーの割合 (パーセント) が含まれます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.sp .6
.RS 4n
プロセスとタスクに関する情報を報告します。このモードでは、\fBprstat\fR はプロセスとタスクに関する別個のレポートを同時に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIeuidlist\fR\fR
.ad
.sp .6
.RS 4n
指定したリストに実効ユーザー \fBID\fR があるプロセスだけを報告します。各ユーザー \fBID\fR はログイン名または数値のユーザー \fBID\fR のどちらでも指定できます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR \fIuidlis\fRt\fR
.ad
.sp .6
.RS 4n
指定したリストに実ユーザー \fBID\fR があるプロセスだけを報告します。各ユーザー \fBID\fR はログイン名または数値のユーザー \fBID\fR のどちらでも指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
プロセスの詳細な使用状況を報告します。この出力形式には、プロセスがユーザーモード、システムモード、および休止状態で費やした時間の割合 (パーセント) が含まれます。また、コンテキストの自発的および強制的な切り替えの数、システムコール、および受信したシグナルの数も含まれます。報告されない統計は、\fB-\fR 記号でマークされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzoneidlist\fR\fR
.ad
.sp .6
.RS 4n
指定したリストにゾーン ID があるプロセスまたは LWP だけを報告します。各ゾーン ID は、ゾーン名または数値のゾーン ID のどちらでも指定できます。\fBzones\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
プロセスとゾーンに関する情報を報告します。このモードでは、\fBprstat\fR はプロセスとゾーンに関する別個のレポートを同時に表示します。
.RE

.SH 出力
.sp
.LP
次に、\fBprstat\fR レポートの列ヘッダーとその意味について説明します。
.sp
.ne 2
.mk
.na
\fBPID\fR
.ad
.sp .6
.RS 4n
プロセスのプロセス \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fBUSERNAME\fR
.ad
.sp .6
.RS 4n
実ユーザー (ログイン) 名または実ユーザー \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fBSWAP\fR
.ad
.sp .6
.RS 4n
各ユーザー、プロジェクト、タスク、またはゾーンに関連付けられているプロセスのスワップ予約の合計容量。これは、ユーザー、プロジェクト、タスク、またはゾーンごとに、共有メモリーを一度だけ加算します。スワップが予約されるのは、匿名メモリーが割り当てられた場合、またはファイルが非公開にマップされた場合です。スワップの値は、キロバイト (\fBK\fR)、メガバイト (\fBM\fR)、またはギガバイト (\fBG\fR) で表されます。
.RE

.sp
.ne 2
.mk
.na
\fBRSS\fR
.ad
.sp .6
.RS 4n
プロセスの常駐の設定サイズ (\fBRSS\fR) (単位: K バイト (\fBK\fR)、M バイト (\fBM\fR)、または G バイト (\fBG\fR))。RSS 値は、\fBproc\fR(4) によって提供される見積りですが、これは実際の常駐設定サイズより少なく見積もることがあります。容量を計画するためにより正確な使用状況の情報を取得するには、代わりに \fBpmap\fR(1) で \fB-x\fR オプションを使用してください。
.RE

.sp
.ne 2
.mk
.na
\fBSTATE\fR
.ad
.sp .6
.RS 4n
プロセスの状態
.sp
.ne 2
.mk
.na
\fBcpu\fIN\fR\fR
.ad
.sp .6
.RS 4n
プロセスは、\fBCPU\fR \fIN\fR 上で実行されています。
.RE

.sp
.ne 2
.mk
.na
\fBsleep\fR
.ad
.sp .6
.RS 4n
休止状態。 プロセスは、イベントが完了するのを待っている
.RE

.sp
.ne 2
.mk
.na
\fBwait\fR
.ad
.sp .6
.RS 4n
待機状態。プロセスは、CPU 使用率が CPU キャップの強制された制限値まで下がるのを待っている。\fBresource_controls\fR(5) の \fBCPU-caps\fR の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBrun\fR
.ad
.sp .6
.RS 4n
実行可能状態。プロセスは、実行待ち行列上にあります。
.RE

.sp
.ne 2
.mk
.na
\fBzombie\fR
.ad
.sp .6
.RS 4n
ゾンビ状態。 プロセスは終了していて、親プロセスは待っていない
.RE

.sp
.ne 2
.mk
.na
\fBstop\fR
.ad
.sp .6
.RS 4n
プロセスは停止されています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fBPRI\fR
.ad
.sp .6
.RS 4n
プロセスの優先順位。数値が大きいほど優先順位が高くなります。
.RE

.sp
.ne 2
.mk
.na
\fBNICE\fR
.ad
.sp .6
.RS 4n
優先順位の計算に使用される nice 値。特定のスケージューリングクラスのプロセスのみが nice 値を持ちます。
.RE

.sp
.ne 2
.mk
.na
\fBTIME\fR
.ad
.sp .6
.RS 4n
プロセスの累積実行時間。
.RE

.sp
.ne 2
.mk
.na
\fBCPU\fR
.ad
.sp .6
.RS 4n
プロセスによって使用された最近の \fBCPU\fR 時間の割合 (パーセント)。非大域ゾーンで実行中で、プール機能がアクティブな場合、割合は、ゾーンがバインドされたプールによって使用中のプロセッサセット内にあるプロセッサの割合になります。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fBPROCESS\fR
.ad
.sp .6
.RS 4n
プロセスの名前 (実行されたファイルの名前)。
.RE

.sp
.ne 2
.mk
.na
\fBLWPID\fR
.ad
.sp .6
.RS 4n
報告される \fBlwp\fR の \fBlwp\fR \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fBNLWP\fR
.ad
.sp .6
.RS 4n
プロセス内の \fBlwp\fR の数。
.RE

.sp
.LP
一部のオプションを使用すると、前述のいくつかの列ヘッダーに加えて、次の列ヘッダーが表示されます。
.sp
.ne 2
.mk
.na
\fBNPROC\fR
.ad
.sp .6
.RS 4n
指定したコレクションにあるプロセスの数。
.RE

.sp
.ne 2
.mk
.na
\fBMEMORY\fR
.ad
.sp .6
.RS 4n
指定したプロセスコレクションで使用されるメモリーの割合 (パーセント)。
.RE

.sp
.LP
\fB-v\fR または \fB-m\fR オプションを指定すると、次の列が表示されます。
.sp
.ne 2
.mk
.na
\fBUSR\fR
.ad
.sp .6
.RS 4n
プロセスがユーザーモードで費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBSYS\fR
.ad
.sp .6
.RS 4n
プロセスがシステムモードで費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBTRP\fR
.ad
.sp .6
.RS 4n
プロセスがシステムトラップの処理に費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBTFL\fR
.ad
.sp .6
.RS 4n
プロセスがテキストページフォルトの処理に費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBDFL\fR
.ad
.sp .6
.RS 4n
プロセスがデータページフォルトの処理に費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBLCK\fR
.ad
.sp .6
.RS 4n
プロセスがユーザーロックの待機に費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBSLP\fR
.ad
.sp .6
.RS 4n
プロセスが休止状態で費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBLAT\fR
.ad
.sp .6
.RS 4n
プロセスが CPU の待機に費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fBVCX\fR
.ad
.sp .6
.RS 4n
コンテキストの自主的な切り替え数。
.RE

.sp
.ne 2
.mk
.na
\fBICX\fR
.ad
.sp .6
.RS 4n
コンテキストの強制的な切り替え数。
.RE

.sp
.ne 2
.mk
.na
\fBSCL\fR
.ad
.sp .6
.RS 4n
システムコールの数。
.RE

.sp
.ne 2
.mk
.na
\fBSIG\fR
.ad
.sp .6
.RS 4n
受信されたシグナルの数。
.RE

.sp
.LP
\fB-L\fR オプションを指定すると、プロセス中の \fBlwp\fR ごとに 1 行ずつ出力され、一部のレポートフィールドにはプロセスではなく \fBlwp\fR の値が表示されます。
.sp
.LP
\fB-H\fR オプションを指定すると、次の列が表示されます。
.sp
.ne 2
.mk
.na
\fBLGRP\fR
.ad
.sp .6
.RS 4n
プロセスまたは lwp のホーム \fIlgroup\fR。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.sp .6
.RS 4n
統計を繰り返す回数を指定します。デフォルトでは、\fBprstat\fR は終了シグナルが受信されるまで統計を報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
サンプリング間隔を秒単位で指定します。デフォルトの間隔は \fB5\fR 秒です。
.RE

.SH 使用例
.LP
\fB例 1 \fRもっともアクティブな 5 つのスーパーユーザープロセスの報告
.sp
.LP
次のコマンドは、\fBCPU1\fR および \fBCPU2\fR で実行中のもっともアクティブな 5 つのスーパーユーザープロセスを報告します。 

.sp
.in +2
.nf
example% prstat -u root -n 5 -P 1,2 1 1

PID   USERNAME  SWAP   RSS STATE  PRI  NICE      TIME  CPU PROCESS/LWP
 306   root     3024K 1448K sleep   58    0   0:00.00 0.3% sendmail/1
 102   root     1600K  592K sleep   59    0   0:00.00 0.1% in.rdisc/1
 250   root     1000K  552K sleep   58    0   0:00.00 0.0% utmpd/1
 288   root     1720K 1032K sleep   58    0   0:00.00 0.0% sac/1
   1   root      744K  168K sleep   58    0   0:00.00 0.0% init/1
TOTAL:       25, load averages:  0.05, 0.08, 0.12
.fi
.in -2
.sp

.LP
\fB例 2 \fRプロセス使用状況の詳細情報の表示
.sp
.LP
次のコマンドは、ユーザー \fBroot\fR および \fBjohn\fR が所有する最小の常駐設定サイズのプロセスに関するプロセス使用状況の詳細情報を表示します。

.sp
.in +2
.nf
example% prstat -S rss -n 5 -vc -u root,john

 PID USERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROCESS/LWP
   1 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 init/1
 102 root     0.0 0.0  -   -   -   -  100  -    0   0   3   0 in.rdisc/1
 250 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 utmpd/1
1185 john    0.0 0.0  -   -   -   -  100  -    0   0   0   0 csh/1
 240 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 switchd/4
 TOTAL:       71, load averages:  0.02, 0.04, 0.08
 
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBdate\fR(1), \fBlgrpinfo\fR(1), \fBplgrp\fR(1), \fBproc\fR(1), \fBps\fR(1), \fBtime\fR(2), \fBpsrinfo\fR(1M), \fBpsrset\fR(1M), \fBsar\fR(1M), \fBpset_getloadavg\fR(3C), \fBproc\fR(4), \fBproject\fR(4), \fBattributes\fR(5), \fBresource_controls\fR(5), \fBzones\fR(5)
.SH 注意事項
.sp
.LP
\fBprstat\fR によって表示されるシステム使用状況のスナップショットは、ある瞬間だけに当てはまるものであり、表示された時点では正確でない場合があります。\fB-m\fR オプションが指定された場合、\fBprstat\fR はプロセスごとにマイクロステートアカウンティングをオンに設定しようとします。\fBprstat\fR が終了すると、元の状態が復元されます。マイクロステートアカウンティング機能については、\fBproc\fR(4) を参照してください。
.sp
.LP
プロセスのグループの SWAP および RSS 列に報告される合計メモリーサイズは、共有メモリーセグメントを持つプロセスが使用する実際のメモリーサイズより多く見積もられる場合があります。
