Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/prtfru.1m
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved
.TH prtfru 1M "2002 年 5 月 30 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
prtfru \- システムまたはドメイン上の FRU に関する FRUID 固有の情報の出力
.SH 形式
.LP
.nf
\fB/usr/sbin/prtfru\fR [\fB-d\fR] | [\fB-clx\fR] [\fIcontainer\fR]
.fi

.SH 機能説明
.sp
.LP
\fBprtfru\fR ユーティリティーは、システムまたはドメインから \fBFRUID\fR データを取得する場合に使用します。その出力は、各コンテナに対する \fBFRU\fR (現場交換可能ユニット) ツリー内のパスを反映したツリー構造です。コンテナが見つかった場合、そのコンテナからのデータもツリー状の構造で出力されます。
.sp
.LP
引数を付けずに \fBprtfru\fR を使用すると、\fBFRU\fR 階層とすべての \fBFRUID\fR コンテナデータが出力されます。\fBprtfru\fR は、ファイルにリダイレクトできる標準出力に出力されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fR
.ad
.RS 7n
.rt  
コンテナとそのデータ\fIのみ\fRを出力します。このオプションでは、\fBFRU\fR ツリー階層は出力されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fR
.ad
.RS 7n
.rt  
現在のレジストリの \fBDTD\fR を標準出力に出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fR
.ad
.RS 7n
.rt  
\fBFRU\fR ツリー階層\fIのみ\fRを出力します。このオプションでは、コンテナデータは出力されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fR
.ad
.RS 7n
.rt  
\fBprtfrureg.dtd\fR のシステム識別子 (SYSTEM) を使用した \fBXML\fR 形式で出力します。
.RE

.sp
.LP
オプション \fB-c\fR および \fB-l\fR を一緒に使用すると、コンテナのすべてのリストを取得できます。
.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIcontainer\fR\fR
.ad
.RS 13n
.rt  
\fBFRU\fR 階層での特定のコンテナの名前。つまり、\fB-l\fR オプションで表示されるコンテナの名前またはパス/名前のどちらかです。
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
すべての情報が見つかり、正常に出力されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/fru-id
.TE

.SH 関連項目
.sp
.LP
\fBfruadm\fR(1M), \fBattributes\fR(5)
