Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/prtvtoc.1m
'\" te
.\"  Copyright 1989 AT&T All Rights Reserved.
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.TH prtvtoc 1M "2010 年 12 月 23 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
prtvtoc \- ディスクジオメトリおよびパーティション分割に関する情報の報告
.SH 形式
.LP
.nf
\fBprtvtoc\fR [\fB-fhs\fR] [\fB-t\fR \fIvfstab\fR] [\fB-m\fR \fImnttab\fR] \fIdevice\fR
.fi

.SH 機能説明
.sp
.LP
\fBprtvtoc\fR コマンドを使用すれば、ラベルの内容を表示できます。このコマンドは、スーパーユーザーのみが使用できます。
.sp
.LP
\fIdevice\fR 名は、\fB/dev/rdsk/c?t?d?s2\fR の形式で raw デバイスのファイル名にすることも、\fB/dev/dsk/c?t?d?s2\fR の形式でブロック型デバイスのファイル名にすることもできます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 13n
.rt  
空き領域の開始ブロックアドレス、ブロック数、未使用パーティションなど、ディスク空き領域の情報を報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 13n
.rt  
通常の出力からヘッダーを省略します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImnttab\fR\fR
.ad
.RS 13n
.rt  
マウントされているファイルシステムのリストとして、\fB/etc/mnttab\fR の代わりに \fImnttab\fR を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 13n
.rt  
通常の出力から列ヘッダーを除くすべてのヘッダーを省略します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIvfstab\fR\fR
.ad
.RS 13n
.rt  
ファイルシステムデフォルトのリストとして、\fB/etc/vfstab\fR の代わりに \fIvfstab\fR を使用します。
.RE

.SH 使用例
.LP
\fB例 1 \fR\fBprtvtoc\fR コマンドを使用する
.sp
.LP
次の例では、424 M バイトのハードディスクで \fBprtvtoc\fR コマンドを使用します。

.sp
.in +2
.nf
example# prtvtoc /dev/rdsk/c0t3d0s2
* /dev/rdsk/c0t3d0s2 partition map
*
* Dimension:
*     512 bytes/sector
*      80 sectors/track
*       9 tracks/cylinder
*     720 sectors/cylinder
*    2500 cylinders
*    1151 accessible cylinders
*
* Flags:
*   1: unmountable
*  10: read-only
* *                           First    Sector   Last
* Partition   Tag   Flags   Sector   Count    Sector   Mount Directory
     0         2     00          0    76320    76319   /
     1         3     01      76320   132480   208799
     2         5     00          0   828720   828719
     5         6     00     208800   131760   340559   /opt
     6         4     00     340560   447120   787679   /usr
     7         8     00     787680    41040   828719   /export/home
example#
.fi
.in -2
.sp

.sp
.LP
上記の \fBTag\fR 列内のデータは、次のようなパーティションのタイプを示します。

.sp

.sp
.TS
tab();
cw(2.5i) cw(3i) 
lw(2.5i) lw(3i) 
.
\fI名前\fR\fI数値\fR
UNASSIGNED0x00
BOOT0x01
ROOT0x02
SWAP0x03
USR0x04
BACKUP0x05
STAND0x06
VAR0x07
HOME0x08
ALTSCTR 0x09
CACHE0x0a
RESERVED0x0b
SYSTEM0x0c
BOOT0x18
.TE

.sp
.LP
上記の \fBFlags\fR 列内のデータは、次のように、パーティションをマウントする方法を示します。

.sp

.sp
.TS
tab();
lw(2.5i) lw(3i) 
lw(2.5i) lw(3i) 
.
\fI名前\fR\fI数値\fR
MOUNTABLE, READ AND WRITE0x00
NOT MOUNTABLE0x01
MOUNTABLE, READ ONLY0x10
.TE

.LP
\fB例 2 \fR\fB-f\fR オプションを付けて \fBprtvtoc\fR コマンドを使用する
.sp
.LP
次の例では、424M バイトのハードディスクで、\fB-f\fR オプションを付けて \fBprtvtoc\fR コマンドを使用します。

.sp
.in +2
.nf
example# prtvtoc \fB-f\fR /dev/rdsk/c0t3d0s2
FREE_START=0 FREE_SIZE=0 FREE_COUNT=0 FREE_PART=34
.fi
.in -2
.sp

.LP
\fB例 3 \fR1T バイトを超えるディスクで \fBprtvtoc\fR コマンドを使用する
.sp
.LP
次の例では、1T バイトを超えるディスクで \fBprtvtoc\fR コマンドを使用します。

.sp
.in +2
.nf
example# prtvtoc /dev/rdsk/c1t1d0s2
* /dev/rdsk/c1t1d0s2 partition map
*
* Dimensions:
*     512 bytes/sector
* 3187630080 sectors
* 3187630013 accessible sectors
*
* Flags:
*   1: unmountable
*  10: read-only
*
*                          First     Sector    Last
* Partition  Tag  Flags    Sector     Count    Sector  Mount Directory
0      2    00         34    262144    262177
1      3    01     262178    262144    524321
6      4    00     524322 3187089340 3187613661
8     11    00  3187613662     16384 318763004
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBdevinfo\fR(1M), \fBfmthard\fR(1M), \fBformat\fR(1M), \fBmount\fR(1M), \fBattributes\fR(5)
.SH 警告
.sp
.LP
\fBmount\fR コマンドでは、「マウント不可」のビットは検査されません。
