Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/rem_drv.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rem_drv 1M "2010 年 10 月 4 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
rem_drv \- システムからのデバイスドライバの削除
.SH 形式
.LP
.nf
\fBrem_drv\fR [\fB-b\fR \fIbasedir\fR] [\fB-C\fR] [\fB-n\fR] \fIdevice_driver\fR
.fi

.SH 機能説明
.sp
.LP
\fBrem_drv\fR コマンドは、システムにデバイスドライバ \fIdevice_driver\fR が有効でなくなったことを通知します。可能な場合、\fBrem_drv\fR はメモリーから \fIdevice_driver\fR を読み込み解除します。\fBrem_drv\fR はまた、システムのドライバ構成ファイルを更新します。
.sp
.LP
\fBrem_drv\fR は、実行されると、次回のシステムリブート時に再構成ブートを自動的に実行します (\fBkernel\fR(1M) を参照)。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIbasedir\fR\fR
.ad
.sp .6
.RS 4n
ディスクレスクライアントのルートディレクトリへのパスを設定します。クライアントに対して \fBrem_drv\fR を実行するためにサーバー上で使用されます。ドライバを読み込み解除するには、クライアントマシンをリブートする必要があります。
.LP
注 - 
.sp
.RS 2
\fB-b\fR オプションを使って、非大域ゾーンのルートファイルシステムを参照しないでください。この操作によって、大域ゾーンのファイルシステムを損傷したり、大域ゾーンのセキュリティを損ねたり、非大域ゾーンのファイルシステムを損傷する可能性があります。\fBzones\fR(5) を参照してください。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
削除されるドライバにバインドされた、ぶら下がるデバイス属性ノードを削除します。これにより、ノードに対して行われたデバイスの所有権やアクセス権のカスタマイズが、ドライバが再度追加される場合に保持されなくなります。ある構成からマシンを再プロビジョニングする場合に使用するか、これまでの管理上のカスタマイズが必要とされない構成に対して使用することをお勧めします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fIdevice_driver\fR の切り離しや読み込み解除を試みず、そのドライバのシステム構成ファイルの変更だけを行います。
.RE

.SH 使用例
.LP
\fB例 1 \fR\fBsd\fR ドライバの削除
.sp
.LP
次の例は、\fBsd\fR ドライバを削除して使用できないようにします。

.sp
.in +2
.nf
example% rem_drv sd
.fi
.in -2
.sp

.LP
\fB例 2 \fRディスクレスクライアントの削除
.sp
.LP
次の例は、\fBsun1\fR ディスクレスクライアントからドライバを削除します。ドライバは、このクライアントマシンがリブートされるまで、アンインストールまたは読み込み解除されません。

.sp
.in +2
.nf
example% rem_drv \fB-b\fR /export/root/sun1 sd
.fi
.in -2
.sp

.sp
.LP
\fB-b\fR オプションの使い方については、前述されているこのオプションへの注意事項に留意してください。

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBadd_drv\fR(1M), \fBkernel\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5), \fBzones\fR(5), \fBdevfs\fR(7FS)
