Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/remove_allocatable.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH remove_allocatable 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
remove_allocatable \- 割り当てデータベースからのエントリの削除
.SH 形式
.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] \fB-n\fR \fIname\fR
.fi

.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] [\fB-d\fR] \fB-t\fR \fIdev-type\fR
.fi

.SH 機能説明
.sp
.LP
\fBremove_allocatable\fR は、デバイス割り当てメカニズムからユーザーが割り当て可能なデバイスのエントリを削除します。\fBremove_allocatable\fR は、このメカニズムによりラベル範囲が管理される、一部の割り当て不可能なデバイス (プリンタなど) のエントリも削除します。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
\fB-t\fR で指定されたデバイスタイプの、システム提供のデフォルト属性を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 15n
.rt  
エントリを強制的に削除します。このオプションを指定しない場合、指定したデバイス名を持つエントリがもはや存在しないと、\fBremove_allocatable\fR はエラーを出力して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIname\fR\fR
.ad
.RS 15n
.rt  
デバイス \fIname\fR のエントリを削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdev-type\fR\fR
.ad
.RS 15n
.rt  
デバイスタイプが \fIdev-type\fR であるデバイスを削除します。
.RE

.SH 終了ステータス
.sp
.LP
成功した場合、\fBremove_allocatable\fR は終了ステータス \fB0\fR (真) を返します。エラーが発生した場合、\fBremove_allocatable\fR は、0 以外の終了ステータスを返します。終了コードとその意味を次に示します。
.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
呼び出し時の構文エラー
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
原因不明のシステムエラー
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
デバイス \fIname\fR または \fIdev-type\fR が見つからない。このエラーは、\fB-f\fR オプションが指定されていない場合にのみ発生します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 5n
.rt  
アクセス権が与えられていません。ユーザーは、データベースに対する DAC または MAC アクセス権を持っていない。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.82i) |cw(2.68i) 
lw(2.82i) |lw(2.68i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
呼び出しは不確実です。オプションは不確実です。出力は非インタフェースです。
.SH 関連項目
.sp
.LP
\fBallocate\fR(1), \fBdeallocate\fR(1), \fBadd_allocatable\fR(1M), \fBattributes\fR(5), \fBdevice_clean\fR(5)
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
