Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/rsh.1m
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T.
.TH rsh 1M "1993 年 11 月 1 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
rsh, restricted_shell \- 制限付きシェルのコマンドインタプリタ
.SH 形式
.LP
.nf
\fB/usr/lib/rsh\fR [\fB-acefhiknprstuvx\fR] [\fIargument\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBrsh\fR は、標準のコマンドインタプリタである \fBsh\fR と比べて機能の一部が制限されており、ログインが許される実行環境も、\fBsh\fR の環境と比べて制限されています。機能の詳細や使用方法に関しては、\fBsh\fR(1) の説明を参照してください。
.sp
.LP
シェルは、呼び出されると環境変数 \fBSHELL\fR を調べます。この環境変数が存在していて、その値のファイル名部分が \fBrsh\fR であれば、シェルは制限付きシェルとなります。
.sp
.LP
\fBrsh\fR の機能は、以下の動作ができない点を除き \fBsh\fR と同一です。
.RS +4
.TP
.ie t \(bu
.el o
ディレクトリの変更 (\fBcd\fR(1) を参照)
.RE
.RS +4
.TP
.ie t \(bu
.el o
$\fBPATH\fR の値の設定
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/\fR を含むパスまたはコマンド名の指定
.RE
.RS +4
.TP
.ie t \(bu
.el o
出力先のリダイレクト (\fB>\fR および \fB>>\fR) 
.RE
.sp
.LP
これらの制限は、\fI\&.profile\fR の解釈後に有効となります。
.sp
.LP
制限付きシェルは、次のいずれかの方法で呼び出せます。
.RS +4
.TP
1.
\fB/etc/passwd\fR ファイルの最後のエントリのファイル名部分を \fBrsh\fR と記述する (\fB passwd\fR(4) を参照)
.RE
.RS +4
.TP
2.
環境変数 \fBSHELL\fR が存在していて、その値のファイル名の部分が \fBrsh\fR である。環境変数 \fBSHELL\fR は、 \fB\&.login\fR ファイル内に設定されている必要がある
.RE
.RS +4
.TP
3.
シェルの呼び出し時に、 引数 0 のファイル名の部分が \fBrsh\fR である
.RE
.RS +4
.TP
4.
シェルを \fB-r\fR オプション付きで呼び出す
.RE
.sp
.LP
実行するコマンドがシェル手続きである場合は、\fBrsh\fR は \fBsh\fR を呼び出して、コマンドを実行します。したがって、利用できるコマンドの種類には制限はありますが、一般ユーザーは標準シェルの全機能を利用できるシェル手続きを使用することができます。このスキーマは、一般ユーザーが 同じディレクトリにおいて書き込み権と実行権を持っていないことを想定しています。
.sp
.LP
\fI\&.profile\fR の作成者 (\fBprofile\fR(4) を参照) が、確実な設定処理を実行して ユーザーを適切なディレクトリ (おそらく、ログインディレクトリではない) に置くことにより、ユーザーの動作を完全に制御できるという点が、これらの規約の実際の効果となります。\fI\fR
.sp
.LP
システム管理者は、制限付きシェルで安全に起動できるコマンドのディレクトリ (つまり \fB/usr/rbin\fR) を設定することがよくあります。 システムによっては、制限付きエディタ \fBred\fR を提供するものもあります。
.SH 終了ステータス
.sp
.LP
構文エラーなどのエラーを検出すると、シェルは 0 以外の終了ステータスを返します。シェルを非対話型で使用している場合、シェルファイルの実行は中止されます。それ以外の場合は、シェルは最後に実行されたコマンドの 終了ステータスを返します。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBintro\fR(1), \fBcd\fR(1), \fBlogin\fR(1), \fBrsh\fR(1), \fBsh\fR(1), \fB exec\fR(2), \fBpasswd\fR(4), \fBprofile\fR(4), \fB attributes\fR(5)
.SH 注意事項
.sp
.LP
制限付きシェル \fB/usr/lib/rsh\fR を、リモートシェル \fB/usr/bin/rsh\fR と混同しないように注意してください。リモートシェルに関しては \fBrsh\fR(1) を参照してください。
