Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/sbdadm.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sbdadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
sbdadm \- SCSI ブロックディスクコマンド行インタフェース
.SH 形式
.LP
.nf
\fBsbdadm\fR \fBcreate-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBdelete-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBimport-lu\fR \fIfilename\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBlist-lu\fR
.fi

.LP
.nf
\fBsbdadm\fR \fBmodify-lu\fR [\fB-s\fR, \fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR
.fi

.SH 機能説明
.sp
.LP
\fBsbdadm\fR コマンドは、SCSI Target Mode Framework (STMF) に登録された、SCSI ブロックデバイスベースの論理ユニットを作成し、管理します。
.SH サブコマンド
.sp
.LP
\fBsbdadm\fR コマンドは、次のサブコマンドをサポートします。コマンドへの引数として疑問符を入力した場合 (\fBsbdadm ?\fR)、\fBsbdadm\fR はヘルプを表示して応答します。
.sp
.ne 2
.mk
.na
\fB\fBcreate-lu\fR [\fB-s\fR、\fB--size\fR \fIsize\fR] \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
STFM に登録できる論理ユニットを作成します。\fB-s\fR オプションでは、\fIsize\fR として、整数のあとにサイズの単位を示す次のいずれかの文字を指定します。
.sp
.ne 2
.mk
.na
\fB\fBk\fR\fR
.ad
.RS 5n
.rt  
K バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
M バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBg\fR\fR
.ad
.RS 5n
.rt  
G バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
T バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.RS 5n
.rt  
P バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBe\fR\fR
.ad
.RS 5n
.rt  
E バイト
.RE

\fIsize\fR を指定しない場合、デフォルトで \fIfilename\fR のサイズに設定されます。
.sp
ファイルまたはデバイスのサイズを超えるサイズを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
\fBsbdadm create-lu\fR を使用して作成された既存の論理ユニットを削除します。これにより、事実上、その論理ユニットが STMF フレームワークから読み込み解除されます。その論理ユニット上の既存のデータは、すべてそのまま維持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBimport-lu\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
\fBsbdadm create-lu\fR を使用して以前に作成されたあとで \fBsbdadm delete-lu\fR を使用して、STMF から削除された論理ユニットを STMF にインポートおよびロードします。成功した場合、その論理ユニットは STMF から再度使用できるようになります。\fIfilename\fR は、この論理ユニットに対する \fBsbdadm create-lu\fR コマンドで使用されるファイル名です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-lu\fR\fR
.ad
.sp .6
.RS 4n
\fBsbdadm create-lu\fR コマンドを使用して作成されたすべての論理ユニットを一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-lu\fR [\fB-s\fR、\fB--size\fR \fIsize\fR] \fIlu_name\fR | \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
\fBsbdadm create-lu\fR コマンドを使用して作成された論理ユニットの属性を変更します。\fB-s\fR オプションの場合、\fIsize\fR は整数値で、数値のあとに単位指定子が続きます。単位指定子については、前述の \fBcreate-lu\fR の下で説明しています。このオプションが指定された場合、論理ユニットの既存のサイズは新しいサイズに変更されます。
.sp
\fIlu_name\fR で表されるファイルまたはデバイスのサイズを超えるサイズを指定できます。
.RE

.SH オペランド
.sp
.LP
\fBsbdadm\fR は次のオペランドを使用します。
.sp
.ne 2
.mk
.na
\fB\fIfilename\fR\fR
.ad
.sp .6
.RS 4n
既存のファイルの名前または raw ブロックデバイスへの完全指定パス。
.RE

.sp
.ne 2
.mk
.na
\fB\fIlu_name\fR\fR
.ad
.sp .6
.RS 4n
論理ユニットの 32 バイトの 16 進数表現。
.RE

.SH 使用例
.LP
\fB例 1 \fR論理ユニットを作成する
.sp
.LP
次の一連のコマンドは、10G バイトの論理ユニットを作成します。

.sp
.in +2
.nf
# \fBtouch /export/lun/0\fR
# \fBsbdadm create-lu -s 10g /export/lun/0\fR
# \fBsbdadm create-lu /dev/rdsk/c1t1d0s0\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR論理ユニットを一覧表示する
.sp
.LP
次のコマンドはすべての論理ユニットを一覧表示します。

.sp
.in +2
.nf
# \fBsbdadm list-lu\fR
Found 2 LU(s) 

              	GUID           	   DATA SIZE    SOURCE 
--------------------------------  -----------  ------ 
6000ae4000144f21d92c47b0dd650002  10737352704  /export/lun/0
6000ae4000144f21d92c47b0de300032  134283264    /dev/rdsk/c1t1d0s0
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB0 以外\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件T{
system/storage/scsi-target-mode-framework
T}
_
インタフェースの安定性廃止確実
.TE

.SH 関連項目
.sp
.LP
\fBstmfadm\fR(1M), \fBattributes\fR(5)
