Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/scadm.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH scadm 1M "2005 年 12 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
scadm \- システムコントローラ (SC) の管理
.SH 形式
.LP
.nf
\fB/usr/platform/\fIplatform-name\fR/sbin/scadm\fR \fIsubcommand\fR [\fIoption\fR] 
     [\fIargument\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBscadm\fR ユーティリティーは、システムコントローラ (\fBSC\fR) を管理します。このユーティリティーを使用すると、ホストサーバーが \fBSC\fR と対話できるようになります。
.sp
.LP
\fBscadm\fR ユーティリティーは、ルートとして実行しなければ\fBなりません\fR。
.sp
.LP
\fBscadm\fR のインタフェース、出力、およびディレクトリ階層内の位置は確定したものではなく、変更されることがあります。
.sp
.LP
\fIplatform-name\fR はプラットフォームの実装名です。\fBuname\fR \fB-i\fR コマンドを使用して、プラットフォーム実装を識別します。\fBuname\fR( 1) を参照してください。
.sp
.LP
\fBscadm\fR ユーティリティーにはいくつかのサブコマンドがあります。一部のサブコマンドには、そのサブコマンドに関連付けられている特定のオプションと引数があります。「サブコマンド」、「オプション」、「オペランド」、および「使用法」を参照してください。\fB\fR\fB\fR\fB\fR\fB\fR
.SS "サブコマンド"
.sp
.LP
コマンド行の \fBscadm\fR コマンドの後に SPACE を入力し、その後にサブコマンドを指定します。 
.sp
.LP
次のサブコマンドがサポートされています。
.sp
.ne 2
.mk
.na
\fBconsolehistory\fR
.ad
.sp .6
.RS 4n
\fBSC\fR のコンソールログを表示します。\fBSC\fR は、すべてのコンソール出力を捕捉する動的なログを維持管理します。このログは FIFO (first-in, first-out) バッファーとして管理されます。 バッファーがいっぱいになると、新しいコンソール出力が古いコンソール出力に取って代わります。デフォルトでは、コンソールログファイルの最後の 8K バイトのみが表示されます。
.sp
省略可能な \fB-a\fR 引数は、コンソールログファイルの全体が表示されることを表します。
.sp
\fBconsolehistory\fR サブコマンドの読み取り速度を超えるスピードで、\fBSC\fR がこのログに情報を記録する可能性があります。したがって、ログデータの一部が、表示される前に失われてしまう可能性があります。そのようなことが起こった場合、\fBconsolehistory\fR サブコマンドは、「scadm: lost <数> bytes of console log data」とログ出力内に表示し、データの一部が失われたことを通知します。
.sp
\fBconsolehistory\fR サブコマンドの書式を次に示します。
.sp
.in +2
.nf
scadm consolehistory [-a]
.fi
.in -2
.sp

\fBconsolehistory\fR サブコマンドは、すべてのプラットフォーム上で使えるわけではありません。このコマンドをサポートしないプラットフォーム上でこのコマンドが使用された場合、\fBscadm\fR は次のメッセージを出力します。
.sp
.in +2
.nf
scadm: command/option not supported
.fi
.in -2
.sp

そして、0 以外のステータスで終了します。
.RE

.sp
.ne 2
.mk
.na
\fBdate\fR
.ad
.sp .6
.RS 4n
\fBSC\fR の日付と時刻を表示します。
.sp
\fBdate\fR サブコマンドの書式を次に示します。 
.sp
.in +2
.nf
scadm date
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBダウンロード\fR
.ad
.sp .6
.RS 4n
\fBSC\fR のファームウェアをプログラムします。 
.sp
ファームウェアについては、ブートモニターとメインイメージの 2 つの部分があります。 
.sp
デフォルトでは、\fBscadm\fR コマンドのダウンロードを実行すれば、メインファームウェアイメージがプログラムされます。\fBboot\fR 引数を指定すると、ブートモニターのプログラミングが選択されます。
.sp
\fBdownload\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm download [boot] \fIfile\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBfruhistory\fR
.ad
.sp .6
.RS 4n
\fBSC\fR によって維持管理される「fru (field replacable unit)」ログの内容を表示します。デフォルトでは、fru 履歴ログファイルの最後の 8K バイトのみが表示されます。このログには、\fBSC\fR の「showfru」コマンドのスナップショットが格納されます。このスナップショットは、システムがリセットされるか \fBSC\fR によってホットプラグイベントが検出されるたびに取得されます。
.sp
省略可能な \fB-a\fR 引数は、fru ログファイルの全体が表示されることを表します。
.sp
\fBfruhistory\fR サブコマンドの読み取り速度を超えるスピードで、\fBSC\fR がこのログに情報を記録する可能性があります。したがって、ログデータの一部が、表示される前に失われてしまう可能性があります。そのようなことが起こった場合、\fBfruhistory\fR サブコマンドは、「scadm: lost <数> bytes of fru log data」とログ出力内に表示し、データの一部が失われたことを通知します。
.sp
fruhistory サブコマンドの書式を次に示します。
.sp
.in +2
.nf
scadm fruhistory [-a]
.fi
.in -2
.sp

\fBfruhistory\fR サブコマンドは、すべてのプラットフォーム上で使えるわけではありません。このコマンドをサポートしないプラットフォーム上でこのコマンドが使用された場合、\fBscadm\fR は次のメッセージを出力します。
.sp
.in +2
.nf
scadm: command/option not supported
.fi
.in -2
.sp

そして、0 以外のステータスで終了します。
.RE

.sp
.ne 2
.mk
.na
\fBhelp\fR
.ad
.sp .6
.RS 4n
コマンドの一覧を表示します。
.sp
\fBhelp\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm help
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBloghistory\fR
.ad
.sp .6
.RS 4n
\fBSC\fR イベントログの最新のエントリを表示します。省略可能な \fB-a\fR 引数を指定すると、イベントログ履歴の全体が表示されます。\fB-a\fR 引数は、大規模ログファイルをサポートするプラットフォーム上でのみ使用できます。大規模ログファイルをサポートしないプラットフォーム上では、このフラグは何の効果も持ちません。
.sp
\fBloghistory\fR サブコマンドの読み取り速度を超えるスピードで、\fBSC\fR がこのログに情報を記録する可能性があります。したがって、ログデータの一部が、表示される前に失われてしまう可能性があります。そのようなことが起こった場合、\fBloghistory\fR サブコマンドは、「scadm: lost <数> events」とログ出力内に表示し、データの一部が失われたことを通知します。
.sp
\fBloghistory\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm loghistory [-a]
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBresetrsc\fR
.ad
.sp .6
.RS 4n
\fBSC\fR をリセットします。実行できるリセットには、\fBハード\fRリセットと\fBソフト\fRリセットの 2 種類があります。デフォルトで実行されるのが\fBハード\fR リセットです。\fBソフト\fRリセットを選択する場合は \fB-s\fR オプションを指定します。
.sp
\fBresetrsc\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm resetrsc [\fB-s\fR]
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBsend_event\fR
.ad
.sp .6
.RS 4n
テキストベースのイベントを手動で送信します。\fBSC\fR は、イベントを \fBSC\fR イベントログに転送できます。\fB-c\fR オプションを構成して、重要な警告を電子メール、ログイン中の SC ユーザー、および \fBsyslog\fR に送信できます。重要なイベントは \fBsyslog\fR(3C) に記録されます。関連テキストメッセージの文字数は \fB80\fR 文字以内です。
.sp
\fBsend_event\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm send_event [\fB-c\fR] "\fImessage\fR"
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBset\fR
.ad
.sp .6
.RS 4n
SC 構成変数の値を設定します。
.sp
SC 構成変数には、次のものが含まれます。 SC IP アドレス \fBnetsc_ipaddr\fR や、SC カスタマ情報 \fBsc_customerinfo\fR などです。SC 構成変数の完全なリストについては、\fBscadm help\fR コマンドの出力結果を参照してください。
.sp
\fBset\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm set \fIvariable value\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBshow\fR
.ad
.sp .6
.RS 4n
SC 構成変数の現在の設定を表示します。変数を指定しないで \fBscadm\fR を実行すると、すべての変数設定が表示されます。
.sp
\fBshow\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm show [\fIvariable\fR]
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBshownetwork\fR
.ad
.sp .6
.RS 4n
SC の現在のネットワーク構成パラメータを表示します。
.sp
\fBshownetwork\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm shownetwork 
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBuseradd\fR
.ad
.sp .6
.RS 4n
\fBSC\fR にユーザーアカウントを追加します。\fBSC\fR では 16 名までの個別ユーザーがサポートされます。
.sp
\fBuseradd\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm useradd \fIusername\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBuserdel\fR
.ad
.sp .6
.RS 4n
\fBSC\fR からユーザーアカウントを削除します。
.sp
\fBuserdel\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm userdel \fIusername\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBuserpassword\fR
.ad
.sp .6
.RS 4n
指定したユーザーアカウントのパスワードを設定します。このパスワードは、現在設定されている既存のパスワードがあった場合にはそれより優先されます。新しいパスワードを設定する前に、古いパスワードは検証されません。
.sp
\fBuserpassword\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm userpassword \fIusername\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBuserperm\fR
.ad
.sp .6
.RS 4n
ユーザーのアクセス権のレベルを設定します。
.sp
\fBuserperm\fR サブコマンドの書式を以下に示します。 
.sp
.in +2
.nf
scadm userperm \fIusername\fR [aucr]
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBusershow\fR
.ad
.sp .6
.RS 4n
指定したユーザーアカウントの詳細を表示します。ユーザー名を指定しないと、すべてのユーザーアカウントの詳細が表示されます。
.sp
\fBusershow\fR サブコマンドの書式を次に示します。 
.sp
.in +2
.nf
scadm usershow \fIusername\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBversion\fR
.ad
.sp .6
.RS 4n
\fBSC\fR のバージョン番号とそのコンポーネントを表示します。
.sp
\fBversion\fR サブコマンドの書式を次に示します。 
.sp
.in +2
.nf
scadm version [\fB-v\fR]
.fi
.in -2
.sp

.RE

.SH オプション
.sp
.LP
\fBresetrsc\fR、\fBsend_event\fR、および \fBversion\fR サブコマンドには、関連するオプションがあります。コマンド行のサブコマンドの後に SPACE を入力し、その後にオプションを指定します。 
.sp
.LP
\fBresetrsc\fR サブコマンドでは次のオプションを指定できます。 
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
ハードリセットの代わりにソフトリセットを実行します。ハードリセットは SC ハードウェアを物理的にリセットします。ソフトリセットの場合は、SC ソフトウェアがブートファームウェアにジャンプして、リセットをシミュレーションします。
.RE

.sp
.LP
\fBsend_event\fR サブコマンドでは次のオプションを指定できます。 
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
重要なイベントを送信します。\fB-c\fR を指定しないで \fB-send_event\fR を実行すると、警告が送信されます。
.RE

.sp
.LP
\fBversion\fR サブコマンドでは次のオプションを指定できます。 
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
バージョン番号と関連情報の詳細な内容が表示されます。 
.RE

.sp
.LP
\fBconsolehistory\fR、\fBfruhistory\fR、および \fBloghistory\fR サブコマンドは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
ログの全体を表示します。これらのサブコマンドは通常、最新のログデータだけを表示します。このフラグを指定すると、ログの全体が表示されるようになります。
.RE

.SH オペランド
.sp
.LP
\fBdownload\fR, \fBsend_event\fR, \fBset\fR, \fBshow\fR, \fBuseradd\fR, \fBuserdel\fR, \fBuserperm\fR, \fBusershow\fR, \fBuserpassword\fR, \fBuserperm\fR の各サブコマンドには関連する引数 (オペランド) があります。 
.sp
.LP
サブコマンドにオプションを指定する場合は、コマンド行のオプションの後に SPACE を入力し、その後に引数を指定します。サブコマンドにオプションを指定しない場合は、コマンド行のサブコマンドの後に SPACE を入力し、その後に引数を指定します。引数を 2 つ以上指定する場合は、それぞれの引数の後に SPACE を入力して区切ります。
.sp
.LP
\fBdownload\fR サブコマンドでは次の引数を指定できます。
.sp
.ne 2
.mk
.na
\fBブート\fR
.ad
.sp .6
.RS 4n
フラッシュのブートモニター部分をプログラムします。フラッシュのメイン部分は、引数ファイルを使用せずにプログラムされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.sp .6
.RS 4n
ダウンロード用のブートまたはメインファームウェアイメージの格納場所へのパスを \fIfile\fR で指定します。 
.sp
\fIfile\fR の例は、次のとおりです。 
.sp
.in +2
.nf
\fB/usr/platform/\fIplatform_type\fR/lib/image/alommainfw\fR
.fi
.in -2
.sp

または
.sp
.in +2
.nf
/usr/platform/\fIplatform_type\fR/lib/image/alombootfw
.fi
.in -2
.sp

.RE

.sp
.LP
\fBsend_event\fR サブコマンドでは次の引数を指定できます。
.sp
.ne 2
.mk
.na
\fB"\fImessage\fR"\fR
.ad
.sp .6
.RS 4n
\fImessage\fR に指定されているテキストを使用して、イベントを記述します。\fImessage\fR は引用符で囲みます。
.RE

.sp
.LP
\fBset\fR サブコマンドでは次の引数を設定できます。 
.sp
.ne 2
.mk
.na
\fB\fIvariable\fR\fR
.ad
.sp .6
.RS 4n
SC 構成 \fIvariable\fR を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
SC 構成変数の \fIvalue\fR を設定します。
.RE

.sp
.LP
\fBshow\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIvariable\fR\fR
.ad
.sp .6
.RS 4n
指定した特定の変数の値を表示します。 
.RE

.sp
.LP
\fBuseradd\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
新しい SC アカウント \fIusername\fR を追加します。
.RE

.sp
.LP
\fBuserdel\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
SC アカウント \fIusername\fR を削除します。
.RE

.sp
.LP
\fBuserperm\fR サブコマンドでは次の引数を指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-aucr\fR\fR
.ad
.sp .6
.RS 4n
SC ユーザーアカウントのアクセス権を設定します。アクセス権を指定しない場合、4 つのアクセス権はすべて無効になり、読み取り専用アクセス権が割り当てられます。 
.sp
アクセス権の定義を次に示します。 
.sp
.ne 2
.mk
.na
\fBa\fR
.ad
.sp .6
.RS 4n
ユーザーは SC 構成変数を管理または変更できます。
.RE

.sp
.ne 2
.mk
.na
\fBu\fR
.ad
.sp .6
.RS 4n
ユーザーは、ユーザーコマンドを使用して SC アカウントを変更できます。
.RE

.sp
.ne 2
.mk
.na
\fBc\fR
.ad
.sp .6
.RS 4n
ユーザーはコンソールに接続できます。
.RE

.sp
.ne 2
.mk
.na
\fBr\fR
.ad
.sp .6
.RS 4n
ユーザーは SC のリセットと、ホストの電源投入および切断ができます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
SC アカウント \fIusername\fR に対するアクセス権を変更します。
.RE

.sp
.LP
\fB-usershow\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
SC アカウント \fIusername\fR に関する情報を表示します。\fIusername\fR を指定しないと、すべてのアカウントの情報が表示されます。
.RE

.sp
.LP
\fBuserpassword\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
\fIusername\fR に対する SC パスワードを設定します。
.RE

.sp
.LP
\fBuserperm\fR サブコマンドでは次の引数を指定できます。 
.sp
.ne 2
.mk
.na
\fB\fIusername\fR\fR
.ad
.sp .6
.RS 4n
\fIusername\fR に対する SC アクセス権を変更します。
.RE

.SH 使用例
.LP
\fB例 1 \fRSC の日付と時刻を表示する
.sp
.LP
次のコマンドは、SC の日付と時刻を表示します。

.sp
.in +2
.nf
scadm date
.fi
.in -2
.sp

.LP
\fB例 2 \fRSC の構成変数を設定する
.sp
.LP
次のコマンドは、SC の構成変数 \fBnetsc_ipaddr\fR を \fB192.168.1.2\fR に設定します。

.sp
.in +2
.nf
scadm set netsc_ipaddr 192.168.1.2
.fi
.in -2
.sp

.LP
\fB例 3 \fRSC の現在の構成設定を表示する
.sp
.LP
次のコマンドは、SC の現在の構成設定を表示します。 

.sp
.in +2
.nf
scadm show
.fi
.in -2
.sp

.LP
\fB例 4 \fR変数の現在の設定を表示する
.sp
.LP
次のコマンドは、\fBsys_hostname\fR という変数の現在の設定を表示します。

.sp
.in +2
.nf
scadm show sys_hostname
.fi
.in -2
.sp

.LP
\fB例 5 \fRテキストベースの重要なイベントを送信する
.sp
.LP
次のコマンドは、重要なイベントを SC イベントログに送信し、現在の SC ユーザーに警告するとともに、イベントを \fBsyslog\fR(3C) に送信します。

.sp
.in +2
.nf
scadm send_event \fB-c\fR "The UPS signaled a loss in power"
.fi
.in -2
.sp

.LP
\fB例 6 \fR参照用のテキストベースのイベントを送信する
.sp
.LP
次のコマンドは、重要ではない参照用のテキストベースのイベントを SC イベントログに送信します。

.sp
.in +2
.nf
scadm send_event "The disk is close to full capacity"
.fi
.in -2
.sp

.LP
\fB例 7 \fRユーザーを SC に追加する
.sp
.LP
次のコマンドは、ユーザー \fBrscroot\fR を SC に追加します。

.sp
.in +2
.nf
scadm useradd rscroot
.fi
.in -2
.sp

.LP
\fB例 8 \fRSC からユーザーを削除する
.sp
.LP
次のコマンドは、ユーザー \fBolduser\fR を SC から削除します。

.sp
.in +2
.nf
scadm userdel olduser
.fi
.in -2
.sp

.LP
\fB例 9 \fRユーザーの詳細を表示する
.sp
.LP
次のコマンドは、すべてのユーザーアカウントの詳細を表示します。

.sp
.in +2
.nf
scadm usershow
.fi
.in -2
.sp

.LP
\fB例 10 \fR特定のユーザーの詳細を表示する
.sp
.LP
次のコマンドは、ユーザーアカウント \fBrscroot\fR の詳細を表示します。

.sp
.in +2
.nf
scadm usershow rscroot
.fi
.in -2
.sp

.LP
\fB例 11 \fRユーザーのアクセス権のレベルを設定する
.sp
.LP
次のコマンドは、ユーザー \fBrscroot\fR に全アクセス権 \fBaucr\fR を設定します。 

.sp
.in +2
.nf
scadm userperm rscroot aucr
.fi
.in -2
.sp

.LP
\fB例 12 \fRユーザーのアクセス権のレベルを設定する
.sp
.LP
次のコマンドは、ユーザー \fBnewuser\fR にコンソールアクセス権 \fBc\fR だけを設定します。

.sp
.in +2
.nf
scadm userperm newuser c
.fi
.in -2
.sp

.LP
\fB例 13 \fRユーザーのアクセス権のレベルを設定する
.sp
.LP
次のコマンドは、ユーザー \fBnewuser\fR のアクセス権を読み取り専用に設定します。 

.sp
.in +2
.nf
scadm userperm newuser
.fi
.in -2
.sp

.LP
\fB例 14 \fR現在のネットワークパラメータを表示する
.sp
.LP
次のコマンドは、SC の現在のネットワーク構成パラメータを表示します。

.sp
.in +2
.nf
scadm shownetwork
.fi
.in -2
.sp

.LP
\fB例 15 \fRコンソール履歴を表示する
.sp
.LP
次のコマンドは、\fBSC\fR イベントログのコンソールの内容を表示します。 

.sp
.in +2
.nf
scadm consolehistory [-a]
.fi
.in -2
.sp

.LP
\fB例 16 \fRfru 履歴を表示する
.sp
.LP
次のコマンドは、\fBSC\fR イベントログの「fru (field replacable unit)」の内容を表示します。

.sp
.in +2
.nf
scadm fruhistory [-a]
.fi
.in -2
.sp

.LP
\fB例 17 \fRログ履歴を表示する
.sp
.LP
次のコマンドは、SC イベントログの最新のエントリを表示します。

.sp
.in +2
.nf
scadm loghistory [-a]
.fi
.in -2
.sp

.LP
\fB例 18 \fR詳細情報を表示する
.sp
.LP
次のコマンドは、SC とそのコンポーネントの詳細なバージョン情報を表示します。

.sp
.in +2
.nf
scadm version \fB-v\fR
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB0 以外\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/library/platform
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBuname\fR(1), \fBsyslog\fR(3C), \fBattributes\fR(5)
