Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/scmadm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH scmadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
scmadm \- ストレージキャッシュマネージャーの管理ユーティリティー
.SH 形式
.LP
.nf
\fBscmadm\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-h\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-e\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-d\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-v\fR
.fi

.LP
.nf
\fBscmadm\fR \fB-C\fR [\fIparameter\fR [= [\fIvalue\fR]]...]
.fi

.LP
.nf
\fBscmadm\fR \fB-o\fR {system | \fIcd\fR | \fIdevice\fR} [\fIoption\fR]
.fi

.LP
.nf
\fBscmadm\fR \fB-m\fR {\fIcd\fR |  \fIdiskname\fR |  all}
.fi

.SH 機能説明
.sp
.LP
\fBscmadm\fR コマンドには、ストレージデバイスキャッシュに関する情報を制御および収集するためのさまざまなオプションが用意されています。 
.SH オプション
.sp
.LP
オプションが指定されていない場合、\fBscmadm\fR は、ディスク名、オプション、および汎用オプションとともに構成済みキャッシュ記述子のリストを表示します。\fBscmadm\fR コマンドでは次のオプションをサポートしています。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBscmadm\fR コマンドの使用法に関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
構成を読み込み、これらのパラメータでストレージデバイスキャッシュを有効にします。\fBdscfg\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
ストレージデバイスキャッシュをシャットダウンします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
キャッシュバージョン番号を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR [\fIparameter\fR[=[\fIvalue\fR]] ...]\fR
.ad
.sp .6
.RS 4n
構成パラメータを設定または表示します。引数を付けずに \fB-C\fR オプションを指定した場合、現在のキャッシュ構成パラメータが表示されます。\fIparameter\fR が指定されている場合、\fIparameter\fR の現在の値が表示されます。\fIparameter=value\fR が指定されている場合、\fIparameter\fR の現在の値が表示され、パラメータは \fIvalue\fR に変更されます。\fIvalue\fR が省略されている場合、または \fIvalue\fR が NULL 文字列、「 」、または「-」として指定されている場合は、パラメータは構成から削除され、システムはデフォルト値を使用します。\fBscmadm\fR コマンドの 1 回の呼び出しで、複数のパラメータを指定できます。構成パラメータの変更は、キャッシュを次回再起動したときにはじめて有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR { \fBsystem\fR | \fBcd\fR | \fIdiskname\fR } [\fIoption\fR]\fR
.ad
.sp .6
.RS 4n
システムのオプションや、\fBcd\fR または \fIdiskname\fR で指定されたキャッシュデバイスのオプションを設定または表示します。\fIoption\fR \fBrdcache\fR または \fBnordcache\fR が指定されている場合、システムまたは指定されたキャッシュデバイスは、このオプションに設定されます。オプションは構成の一部として保存され、持続します。\fBdscfg\fR(1M) を参照してください。保存したオプションを「忘れる」ようにシステムに指示するには、\fBforget\fR オプションを使用します。これはオプションを変更しません。保存した構成からオプションを削除するだけです。オプションをすべて省略すると、現在のオプションが表示されます。\fBrdcache\fR オプションがデフォルトとして設定されています。\fIoption\fR は次のように定義します。
.sp
.ne 2
.mk
.na
\fB\fBrdcache\fR\fR
.ad
.sp .6
.RS 4n
データブロックは、再度参照される可能性があるため、キャッシュに残すようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnordcache\fR\fR
.ad
.sp .6
.RS 4n
データブロックは再度参照される可能性はなく、使用頻度がもっとも低いものとして扱うようにします。その結果、ほかのブロックをキャッシュに長い間残すことができます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR { \fBcd\fR | \fIdiskname\fR | \fBall\fR }\fR
.ad
.sp .6
.RS 4n
\fBcd\fR または \fIdiskname\fR で指定されたデバイスのキャッシュ記述子とディスク名のマップを表示します。または、\fBall\fR を指定した場合は、システム上のすべてのストレージデバイスのキャッシュ記述子とディスク名のマップを表示します。
.RE

.SH 終了ステータス
.sp
.LP
\fBscmadm\fR コマンドは成功した場合に 0 を、エラーの場合に 0 以外を返します。
.SH ファイル
.sp
.LP
\fB/dev/sdbc\fR
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-cache-management
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfg\fR(1M), \fBattributes\fR(5)
.SH 診断
.sp
.LP
連続したメモリーが不十分な場合、\fBscmadm\fR は失敗します。
