Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/smbios.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbios 1M "2005 年 8 月 31 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
smbios \- System Management BIOS イメージの内容の表示
.SH 形式
.LP
.nf
\fBsmbios\fR [\fB-BeOsx\fR] [\fB-i\fR \fIid\fR] [\fB-t\fR \fItype\fR] [\fB-w\fR \fIfile\fR] [\fIfile\fR]
.fi

.SH 機能説明
.sp
.LP
\fBsmbios\fR ユーティリティーは、現在のシステムによってエクスポートされたか、またはファイルに格納されている SMBIOS (System Management BIOS) イメージの内容を表示します。SMBIOS は、低レベルのシステムソフトウェアがハードウェア構成情報をより高レベルのシステム管理ソフトウェアにエクスポートするための、業界標準のメカニズムです。SMBIOS のデータ形式自体は、DMTF (Distributed Management Task Force) によって定義されます。SMBIOS の詳細、および SMBIOS の仕様や実装ガイドラインのコピーを入手する方法については、http://www.dmtf.org を参照してください。 
.sp
.LP
SMBIOS イメージは構造体のテーブルで構成されており、各テーブルにはシステムソフトウェアまたはハードウェアの構成の一部が記述されています。デフォルトでは、\fBsmbios\fR は、現在の SMBIOS イメージの内容全体を表示します。\fB-s\fR オプションが指定されている場合、\fBsmbios\fR は、このイメージ内に存在する構造体の要約を表示します。\fB-w\fR オプションが指定されている場合、\fBsmbios\fR は、SMBIOS イメージのコピーを指定されたファイルに書き込みます。その後、生成されたファイルに \fBsmbios\fR を適用すると、その内容を表示できます。 
.sp
.LP
\fBsmbios\fR は、各構造体とその内容を、人間が読める形式で表示しようとします。\fBsmbios\fR が構造体のタイプまたは内容を認識できない場合は、その構造体の 16 進数の生データが表示されます。 
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.RS 11n
.rt  
壊れた BIOS に対するヘッダー検証を無効にします。 
.sp
デフォルトでは、\fBsmbios\fR は、アンカー文字列、ヘッダーチェックサム、およびバージョン番号を確認することによって SMBIOS ヘッダーを検証しようとします。このオプションは、BIOS に非準拠のヘッダーが含まれている場合に必要になることがあります。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 11n
.rt  
 SMBIOS 構造体テーブルの内容ではなく、SMBIOS エントリポイントの内容を表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIid\fR\fR
.ad
.RS 11n
.rt  
整数の ID で指定された特定の構造体のみを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR\fR
.ad
.RS 11n
.rt  
 廃止された構造体タイプを表示します。 
.sp
デフォルトでは、\fBsmbios\fR は、そのタイプが DMTF SMBIOS 仕様で廃止としてマークされた構造体の出力を省略します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 11n
.rt  
選択された各構造体の内容の代わりに、構造体の識別子とタイプの要約リストのみを表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR\fR
.ad
.RS 11n
.rt  
DMTF SMBIOS 仕様で定義されている指定の整数型にタイプが一致する構造体のみを表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIfile\fR\fR
.ad
.RS 11n
.rt  
SMBIOS イメージのコピーを指定されたファイルに書き込み、終了します。 
.sp
SMBIOS エントリポイントがファイルの先頭に書き込まれ、その構造体テーブルのアドレスが構造体テーブルのファイルオフセットに設定されます。また、新しいエントリポイントチェックサムが計算されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 11n
.rt  
選択された構造体について、人間が読める形式の出力に加えて、16 進数の生データを表示します。 
.sp
デフォルトでは、16 進数データは、選択された構造体について人間が読める形式の出力を \fBsmbios\fR が表示できない場合にのみ表示されます。 
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
現在のシステムの SMBIOS イメージの代わりに表示する代替 SMBIOS イメージを指定します。 
.RE

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
正常終了。SMBIOS イメージ内のすべての構造体が検査され、問題がありませんでした。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
指定されたファイルまたはデバイスを開けなかったり、イメージが壊れていたりするなど、致命的なエラーが発生しました。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
無効なコマンド行オプションが指定されました。 
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/dev/smbios\fR \fR
.ad
.RS 16n
.rt  
カーネルの SMBIOS イメージデバイス。このデバイス特殊ファイルは、現在のシステム SMBIOS イメージのスナップショットをエクスポートするために使用されます。 
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照。 
.TE

.sp
.LP
コマンド行オプションは「確実」です。人間が読める形式の出力は「不確実」です。 
.SH 関連項目
.sp
.LP
\fBprtdiag\fR(1M), \fBattributes\fR(5), \fBsmbios\fR(7D)
.sp
.LP
『\fISystem Management BIOS Reference Specification\fR』(http://www.dmtf.org を参照)
.SH 注意事項
.sp
.LP
System Management BIOS イメージの実装は、システムベンダーおよび BIOS ベンダーの判断で行われます。すべてのシステムが SMBIOS をエクスポートするわけではありません。SMBIOS 構造体の内容はシステムベンダーおよび BIOS ベンダーによって大きく異なり、その仕様に含まれているガイドラインに準拠していないことがよくあります。構造体フィールドによっては、BIOS による入力が行われなかったり、準拠しない値が入力されたりする場合があります。 
