Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/smbiod.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbiod 1M "2011 年 4 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
smbiod, smbiod-svc \- SMB クライアント I/O デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/smbfs/smbiod\fR
.fi

.LP
.nf
/usr/lib/smbfs/smbiod-svc
.fi

.SH 機能説明
.sp
.LP
\fBsmbiod\fR と \fBsmbiod-svc\fR は、SMB クライアントの内部コンポーネントです。ユーザーからアクセスできる外部インタフェースはありません。SMB クライアントの詳細については、\fBmount_smbfs \fR(1M) のマニュアルページを参照してください。
.sp
.LP
\fBsmbiod-svc\fR は、SMF サービス \fBsvc:/network/smb/client:default\fR によって実行され、SMB クライアントに必要な \fBsmbiod\fR プロセスを起動および管理します。
.sp
.LP
\fBsmbiod\fR は、SMB クライアント接続を要求するユーザーごとの個別のプロセスとして実行される \fBsmbiod-svc\fR によって起動されます。これらの \fBsmbiod\fR プロセスは、所有しているユーザーが SMB クライアント接続を使用しなくなるまで実行を継続します。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/smbfs/smbiod\fR\fR
.ad
.sp .6
.RS 4n
SMB I/O デーモン。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/smbfs/smbiod-svc\fR\fR
.ad
.sp .6
.RS 4n
SMF サービスプログラム。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/smbiod/.svc\fR\fR
.ad
.sp .6
.RS 4n
\fBsmbiod-svc\fR が door をインスタンス化する対象のファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/smbiod/$\fIUID\fR\fR\fR
.ad
.sp .6
.RS 4n
ユーザーの \fBsmbiod\fR プロセスが door をインスタンス化する対象のファイル。\fB$\fR\fIUID\fR は、所有者のユーザー ID の数値表現です。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/smb
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBps\fR(1), \fBmount_smbfs\fR(1M), \fBattributes\fR(5), \fBsmbfs\fR(7FS)
