Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/smbstat.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbstat 1M "2011 年 4 月 26 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
smbstat \- Solaris SMB ファイルサーバーの統計情報の表示
.SH 形式
.LP
.nf
\fBsmbstat\fR [\fB-r\fR [\fB-n\fR [\fB-a\fR | \fB-z\fR]] [\fB-t\fR] [\fB-u\fR] [\fB-c\fR] \fIinterval\fR
.fi

.SH 機能説明
.sp
.LP
\fBsmbstat\fR コマンドは、\fBsmbd\fR(1M) サーバーの統計情報を表示します。\fBsmbstat\fR には、後述するいくつかのオプションと、1 つのオペランド \fIinterval\fR があります。\fIinterval\fR が指定されている場合、最初の表示では、サーバーが起動されてからこのコマンドが入力されるまでの統計情報が取得されます。以降の表示では、最後の \fIinterval\fR の統計情報が取得されます。
.sp
.LP
デフォルトでは、\fBsmbstat\fR コマンドはすべての統計情報を表示します。
.SH オプション
.sp
.LP
\fBsmbstat\fR コマンドに含まれているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
カウンタを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
要求の統計情報を表示します。\fB-r\fR は次のオプションと組み合わせることができます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
有効かどうかにかかわらず、すべてのタイプのサーバー要求の統計情報を表示します。サーバー要求には 256 のタイプがあります。\fB-a\fR オプションと \fB-z\fR オプションを同時に指定することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
アルファベット順に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.sp .6
.RS 4n
実際に受信された要求の統計情報を表示します。\fB-a\fR オプションと \fB-z\fR オプションを同時に指定することはできません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
SMB サーバーのスループットを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
SMB サーバーの使用率を表示します。
.RE

.SH 拡張機能説明
.sp
.LP
\fBsmbstat\fR コマンドは、下に示す見出しを表示します。あるコマンドで表示される見出しは、どのオプションが指定されたかによって異なります。これらの見出しには、統計情報のカテゴリに対応して、カウンタ、スループット、使用率、および (サーバー) 要求の 4 つのカテゴリがあります。
.SS "カウンタ"
.sp
.ne 2
.mk
.na
\fB\fBnbt\fR\fR
.ad
.sp .6
.RS 4n
SMB NBT (NetBIOS-over-TCP) セッションの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtcp\fR\fR
.ad
.sp .6
.RS 4n
SMB TCP セッションの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusers\fR\fR
.ad
.sp .6
.RS 4n
ログインしているユーザーの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtrees\fR\fR
.ad
.sp .6
.RS 4n
接続されているツリーの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfiles\fR\fR
.ad
.sp .6
.RS 4n
開かれているファイルの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpipes\fR\fR
.ad
.sp .6
.RS 4n
開かれているパイプの数。
.RE

.SS "スループット"
.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに受信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに送信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreqs/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに処理された要求の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreads/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりの読み取り要求の数。これは、\fBSMB_COM_READ\fR、\fBSMB_COM_LOCK_AND_READ\fR、\fBSMB_COM_READ_RAW\fR、および \fBSMB_COM_READ_ANDX\fR の各要求を合わせた数になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwrites/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりの書き込み要求の数。これは、\fBSMB_COM_WRITE\fR、\fBSMB_COM_WRITE_AND_UNLOCK\fR、\fBSMB_COM_WRITE_RAW\fR、および \fBSMB_COM_WRITE_AND_CLOSE\fR の各要求を合わせた数になります。
.RE

.SS "使用率"
.sp
.ne 2
.mk
.na
\fB\fBwcnt\fR\fR
.ad
.sp .6
.RS 4n
受信されたものの、SMB ワーカースレッドによって実行されるまで待機している要求の平均数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcnt\fR\fR
.ad
.sp .6
.RS 4n
SMB ワーカースレッドによって同時に実行されている要求の平均数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwtime\fR\fR
.ad
.sp .6
.RS 4n
要求が SMB ワーカースレッドによって実行されるまで待機している平均時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrtime\fR\fR
.ad
.sp .6
.RS 4n
要求の平均実行時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBw%\fR\fR
.ad
.sp .6
.RS 4n
少なくとも 1 つの要求が待機していた時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr%\fR\fR
.ad
.sp .6
.RS 4n
少なくとも 1 つの要求が実行されていた時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBu%\fR\fR
.ad
.sp .6
.RS 4n
SMB サーバーの使用率の割合 (パーセント)。この数値は、\fBrcnt\fR / (\fImax_worker_threads\fR) として定義されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsat\fR\fR
.ad
.sp .6
.RS 4n
サーバーが以前に飽和状態になっていたかどうかを示すフラグ。飽和は、\fBu%\fR == 100% として定義されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusr%\fR\fR
.ad
.sp .6
.RS 4n
1 つまたは複数のプロセッサがユーザー空間内で費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys%\fR\fR
.ad
.sp .6
.RS 4n
1 つまたは複数のプロセッサがカーネル空間内で費やした時間の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBidle%\fR\fR
.ad
.sp .6
.RS 4n
1 つまたは複数のプロセッサがアイドル状態であった時間の割合 (パーセント)。
.RE

.SS "要求"
.sp
.LP
要求のタイプごとに、次の見出しが表示されます。
.sp
.ne 2
.mk
.na
\fB\fBcode\fR\fR
.ad
.sp .6
.RS 4n
要求のコード (16 進数)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%\fR\fR
.ad
.sp .6
.RS 4n
特定のタイプの要求の割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcount\fR\fR
.ad
.sp .6
.RS 4n
受信された要求の数。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに受信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに送信されたバイト数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreq/s\fR\fR
.ad
.sp .6
.RS 4n
1 秒あたりに処理された要求の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-mean\fR\fR
.ad
.sp .6
.RS 4n
秒数での平均応答時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-stddev\fR\fR
.ad
.sp .6
.RS 4n
応答時間の標準偏差。
.RE

.SH 使用例
.LP
\fB例 1 \fRオプションの組み合わせ
.sp
.LP
次のコマンドでは、\fB-c\fR、\fB-t\fR、および \fB-u\fR オプションを組み合わせています。

.sp
.in +2
.nf
% \fBsmbstat -ctu\fR
nbt   tcp users trees files pipes
0     1     1     2    20     0

rbytes/s   tbytes/s    reqs/s     reads/s   writes/s
1.036e+02  1.298e+00  0.000e+00  0.000e+00  0.000e+00

wcnt       rcnt       wtime      rtime       w%   r%  u% sat usr% sys% idle%
4.317e-01  7.410e+00  2.461e-05  4.224e-04   31  100  0  no  0    76   24
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 13n
.rt  
エラーが発生しました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/file-system/smb
_
インタフェースの安定性不確実
_
ユーティリティーの出力形式インタフェースではない
.TE

.SH 関連項目
.sp
.LP
\fBsharectl\fR(1M), \fBsmbadm\fR(1M), \fBsmbd\fR(1M), \fBattributes\fR(5)
