Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/sndrd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sndrd 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
sndrd \- 遠隔ミラーデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/sndrd\fR [\fB-c\fR \fImax_connections\fR] [\fB-l\fR \fIlisten_backlog\fR]
.fi

.SH 機能説明
.sp
.LP
\fBsndrd\fR デーモンは、クライアントの遠隔ミラー要求を処理します。このデーモンを実行できるのは、root ユーザーまたは同等の特権を持つユーザーだけです。このデーモンは、実行レベル 2 で自動的に起動されます。\fBsndrd\fR は TCP トランスポートレイヤーを再起動します。
.sp
.LP
\fBsndrd\fR の起動パラメータを変更する管理者は、root または同等のユーザーとして、\fB/lib/svc/method/svc-rdcsyncd\fR ファイルを編集するのではなく \fB/etc/default/sndr\fR ファイルを変更するようにしてください。\fBsndr\fR(4) を参照してください。
.SH オプション
.sp
.LP
\fBsndrd\fR デーモンは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fImax_connections\fR\fR
.ad
.sp .6
.RS 4n
接続型トランスポートを介してサーバーに許可される接続の最大数を設定します。デフォルトでは、この接続数は 16 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlisten_backlog\fR\fR
.ad
.sp .6
.RS 4n
接続型トランスポートを介した RDC TCP の接続キューの長さを設定します。デフォルト値は 10 エントリです。
.RE

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
デーモンが正常に起動されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
デーモンの起動に失敗しました。
.RE

.sp
.LP
エラー情報は、レベル \fBLOG_ERR\fR で \fBsyslog\fR に報告されます。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
\fBsndrd\fR を起動するためのシェルスクリプト。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
\fBsndrd\fR を停止するためのシェルスクリプト。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-remote-mirror
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBds.log\fR(4), \fBattributes\fR(5)
.SH 注意事項
.sp
.LP
sndrd デーモンは手動で停止しないでください。sndrd を手動で停止する必要がある場合は、次の手順を実行します。これにより、\fBsndrd\fR デーモンと \fBsndrsyncd\fR デーモンの両方が停止されます。
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
sndrd デーモンは手動で起動および再起動しないでください。sndrd を手動で起動する必要がある場合は、次の手順を実行します。これにより、sndrd デーモンと sndrsyncd デーモンの両方が起動されます。
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
詳細については、\fBsvcadm\fR(1M) を参照してください。
