Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/sndradm.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sndradm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
sndradm \- Sun StorageTek Availability Suite 遠隔ミラーの操作の制御
.SH 形式
.LP
.nf
\fBsndradm\fR \fB-I\fR a \fImaster\fR \fIshadow\fR \fIbitmap\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-I\fR d \fImaster\fR \fIshadow\fR \fIbitmap\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-h\fR \fIusage message\fR
.fi

.LP
.nf
\fBsndradm\fR \fB-v\fR \fIversion information\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-e\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-E\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-d\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-D\fR block [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-D\fR noblock [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-l\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-m\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-m\fR \fB-r\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-u\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-u\fR \fB-r\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-w\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-H\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-p\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-P\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR a \fIvolume\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR d [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-q\fR r \fIvolume\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-i\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-a\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-A\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-F\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-W\fR \fIvalue\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR b p \fIbitmap\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR b s \fIbitmap\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR C \fItag\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR g \fIio_groupname\fR [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR m sync [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR m async [\fIsndr_set\fR]
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR \fB-f\fR \fIvolset-file\fR
.fi

.LP
.nf
\fBsndradm\fR [\fIoptions\fR] \fB-R\fR r [\fIsndr_set\fR] *
.fi

.SH 機能説明
.sp
.LP
\fB/usr/sbin/sndradm\fR コマンドは、Sun StorageTek Availability Suite 遠隔ミラーソフトウェアのための管理用コマンド行インタフェースです。遠隔ミラーを使用すると、物理的に別個の異なる Sun サーバー間でディスクをリアルタイムに複製できます。遠隔ミラーは、概念的には RAID 1 のローカルディスクのミラー化方式に似ていますが、より離れた距離で複製操作を実行します。
.sp
.LP
コマンド行で遠隔ミラーセット (\fIsndr_set\fR) を指定しない場合、\fBsndradm\fR は、構成されているすべての遠隔ミラーセットに対して動作します。
.sp
.LP
\fBsndradm\fR コマンドは、出力 (\fB-p\fR、\fB-P\fR、\fB-i\fR)、ヘルプ (\fB-h\fR)、およびバージョン (\fB-v\fR) を除くすべての操作に対して、Availability Suite ログファイル \fB/var/adm/ds.log\fR (\fBds.log\fR(4) を参照) 内にエントリを生成します。
.SH オプション
.sp
.LP
\fBsndradm\fR ユーティリティーは、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIvolset-file\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上の遠隔ミラーセットの \fIsndr_set\fR 情報を含むファイルを、後述する完全に指定されたコマンド行の \fIsndr_set\fR と同じ形式で指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIio_groupname\fR\fR
.ad
.sp .6
.RS 4n
\fIio_groupname\fR に属する遠隔ミラーセットのみに操作を制限します。 
.sp
特定のセットの \fIio_groupname\fR は、一次ホストと二次ホストの両方で一貫性を持っている必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
クラスタ化されたノードでは、\fItag\fR で指定されたクラスタリソースグループまたはディスクグループ名に属する遠隔ミラーセットのみに操作を制限します。このオプションは、クラスタ化されていないシステム上では無効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fBsndradm\fR を使用して遠隔ミラー操作を開始したあとに、ユーザーに応答を求めません。出力、ヘルプ、およびバージョンを除くすべてのオプションでは、デフォルトの動作で応答を求めます。たとえば、一次ボリュームから二次ボリュームへの完全な同期を開始したあと、遠隔ミラーから「\fBOverwrite secondary with primary? (Y/N) [N]\fR」というメッセージが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsndr_set\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットを指定します。すでに有効になっているセットの場合は、\fIshost\fR:\fIsdev\fR の形式で \fBset_name\fR を設定できます。次に示すように、完全に指定された遠隔ミラーセットを構成ファイルと同じ形式で指定できます。
.sp
.in +2
.nf
\fIphost  pdev  pbitmap  shost  sdev  sbitmap\fR \fBip\fR {\fBsync | async\fR} \e
[g \fIio_groupname\fR] [C \fItag\fR]
.fi
.in -2

これらのパラメータについて、次に説明します。
.sp
.ne 2
.mk
.na
\fB\fIphost\fR\fR
.ad
.sp .6
.RS 4n
一次ボリュームが存在するサーバーを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpdev\fR\fR
.ad
.sp .6
.RS 4n
複製される一次ボリュームパーティションを指定します。フルパス名のみ (たとえば、\fB/dev/rdsk/c0t1d0s2\fR) を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpbitmap\fR\fR
.ad
.sp .6
.RS 4n
一次パーティションのビットマップ (スコアボードログ) が格納されているボリュームパーティションを指定します。フルパス名のみ (たとえば、\fB/dev/rdsk/c0t1d0s3\fR) を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIshost\fR\fR
.ad
.sp .6
.RS 4n
二次ボリュームが存在するサーバーを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsdev\fR\fR
.ad
.sp .6
.RS 4n
二次ボリュームパーティションを指定します。フルパス名のみ (たとえば、\fB/dev/rdsk/c0t1d0s4\fR) を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsbitmap\fR\fR
.ad
.sp .6
.RS 4n
二次パーティションのビットマップ (スコアボードログ) が格納されているボリュームパーティションを指定します。フルパス名のみ (たとえば、\fB/dev/rdsk/c0t1d0s5\fR) を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBip\fR\fR
.ad
.sp .6
.RS 4n
ネットワーク転送プロトコルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsync | async\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーの動作モードを指定します。\fBsync\fR は、リモートボリュームが更新されるまで I/O 操作が完了したと見なされない遠隔ミラーモードです。\fBasync\fR は、リモートボリュームが更新される前に一次ホストの I/O 操作が完了したと見なされる遠隔ミラーモードです。
.RE

.sp
.ne 2
.mk
.na
\fB\fIio_groupname\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットが属する遠隔ミラー整合グループの名前を指定します。非同期モードでは、書き込み順序が、遠隔ミラー整合グループ内のすべての複製ボリュームに保持される必要があります。これにより、このグループに属する二次ボリューム内に、対応する一次ボリュームの有効なポイントインタイムコピーが含まれるようになります。 
.sp
既存のセットを整合グループに追加する場合や、あるセットをグループに追加できるようにする場合は、一次ホストと二次ホストの両方で同じグループ名を使用してこのセットを構成する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fItag\fR\fR
.ad
.sp .6
.RS 4n
クラスタ内の操作に対して、ローカルデータやビットマップボリュームのディスクグループ名またはリソースタグがボリューム名によって暗黙的に示されていない場合に、そのグループ名またはタグを指定します (たとえば、\fB/dev/rdsk/md/dg/vol\fR と \fB/dev/vx/rdsk/dg/vol\fR は、どちらもディスクグループ名 \fBdg\fR を示します)。遠隔ミラーに指定されたクラスタタグが適切なクラスタリソースグループタグに一致するようにこと、およびクラスタリソースグループが再構成された場合にすべての Availability Suite サービスを最新の状態に維持することは、ユーザーの責任です。クラスタ化されていないシステム上ではクラスタリソースタグを指定できません。
.RE

.RE

.SH パラメータ
.sp
.LP
有効な \fBsndradm\fR コマンドでは、次に示すパラメータのいずれかを指定する必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fBa\fR \fImaster\fR \fIshadow\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
指定されたマスター、シャドウ、およびビットマップを持つ \fBndr_ii\fR エントリを Availability Suite 構成ファイルに追加します。\fBsndrsyncd\fR(1M) を参照してください。対応するポイントインタイムコピーセットが存在しない場合は、関連するボリュームに対して次の \fBsync\fR コマンドが発行されたときに、そのポイントインタイムコピーセットが有効になります。このポイントインタイムコピーセットが必要なくなった場合は、\fBiiadm\fR \fB-d\fR で無効にできます。\fBiiadm\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fBd\fR \fImaster\fR \fB\fIshadow\fR\fR \fB\fIbitmap\fR\fR\fR
.ad
.sp .6
.RS 4n
指定されたマスター、シャドウ、およびビットマップを持つ \fBndr_ii\fR エントリを Availability Suite 構成ファイルから削除します。\fBndr_ii\fR 構成エントリを一覧表示するには、\fBdscfg\fR コマンドを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
このセットの自動同期変数の値 (on または off) を指定します。あるセットに対して \fBautosync\fR が要求されると、この機能は、同期操作が要求された時点からこのセットが手動でロギングモードに設定されるまでアクティブになります。このセットが手動でロギングモードに設定されると、\fBautosync\fR 機能はアクティブでなくなり、次に \fBsync\fR が要求されるまで非アクティブのままになります。\fBautosync\fR がアクティブかどうかを確認するには、\fBsndradm\fR \fB-P\fR を使用します。あるセットに対して自動同期が要求されたかどうかを確認するには、\fBdscfg\fR \fB-l\fR の出力内でこのセットに対する「\fBauto=on;\fR」タグを探します。\fBsndrsyncd\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
あるセットが非同期モードで複製されているときに非同期キューを処理するために作成できるスレッドの最大数を指定します。デフォルト値は \fB2\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-W\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
非同期モードで複製されているセットについて、キューに入れることができる書き込みの最大数を指定します。デフォルト値は \fB4096\fR です。たとえば、二次ボリュームの書き込み操作が一次ボリュームから 1 回分しか遅れないようにするには、この値を 1 に設定します。
.sp
書き込みの最大数の調整は、メモリーベースの非同期 I/O キューを使用しているセットに対してのみ有効です。この値は、ディスクベースの I/O キューが使用されている場合には無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fB{block\fR \fB|\fR \fBnoblock}\fR\fR
.ad
.sp .6
.RS 4n
ディスクベースのキューの \fBblock\fR|\fBnoblock\fR 属性を切り替えます。デフォルト設定は \fBblock\fR です。I/O のフィル速度がドレイン速度よりも大きく、キューがいっぱいになるまでの時間が十分にある場合、受信 I/O はキュー上にそのための十分な領域が確保されるまでブロックされます。これは、1 つのボリュームであるか同じ整合グループ内の複数のボリュームであるかどうかにかかわらず、書き込み順序を保持するために行われます。\fBnoblock\fR が設定されている場合は、受信 I/O でキューがいっぱいになっても I/O はブロックされません。代わりに、このセットがロギングモードに設定され、ディスクキューの内容は無視されます。あとに続く更新同期によって、最新のデータが二次サイトに同期されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
非同期モードで複製されているセットについて、カーネルメモリー内のキューに入れることができる 512 バイト FBA の最大数を指定します。デフォルト値は \fB16384\fR です。
.sp
FBA の最大数の調整は、メモリーベースの非同期 I/O キューを使用しているセットに対してのみ有効です。この値は、ディスクベースの I/O キューが使用されている場合は無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBsndradm\fR の使用法の要約を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーのバージョン番号を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
このセットに対する遠隔ミラーを有効にして、スコアボードロギングを有効にします。完全な同期が必要なことを示すために、スコアボードが設定されます。このセットの詳細が現在の構成内に保存されます。\fBdscfg\fR(1M) を参照してください。ストレージボリュームドライバに対して、ローカルボリュームとビットマップボリュームが有効になります (\fBsv\fR(7D) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.sp .6
.RS 4n
このセットに対する遠隔ミラーを有効にして、スコアボードロギングを有効にします。一次ボリュームと二次ボリュームの完全な同期がすでに保証されていることを示すために、スコアボードがクリアーされます。このセットの詳細が現在の構成内に保存されます。\fBdscfg\fR(1M) を参照してください。ストレージボリュームドライバに対して、ローカルボリュームとビットマップボリュームが有効になります (\fBsv\fR(7D) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
このセットに対する遠隔ミラーを無効にして、現在の同期操作をすべて停止します。\fBsndradm\fR \fB-d\fR では、一次ボリュームと二次ボリューム間の一時的な違いを追跡するアクティブなスコアボードもすべて破棄されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
一次ボリュームと二次ボリューム間の遠隔ミラー複製操作とコピー操作を停止し、これらのボリュームに対して独立した遠隔ミラースコアボードロギングを開始します。整合グループ内のすべてのセットが複製中である場合は、二次ボリューム内に、対応する一次ボリュームの有効なポイントインタイムコピーが含まれていることを示します。この条件の下では、ある遠隔ミラーセットがロギングモードに入るとすぐに、\fBrdc\fR カーネルモジュールによって、そのグループ内のほかのすべてのセットが自動的にロギングモードに入ります。これにより、二次ボリューム内に、有効なポイントインタイムコピーが引き続き含まれるようになります。\fB-l\fR パラメータを使用したあとに遠隔ミラーを再開するには、\fB-m\fR パラメータを使用して完全な再同期を実行するか、または \fB-u\fR パラメータを使用して (スコアボードに基づいた) 更新の再同期を実行します。
.sp
このオプションは、現在同期が行われている任意のボリュームの二次ボリュームに対しては機能しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.sp .6
.RS 4n
同期コピーが完了するか、または異常終了するまで待機します。二次システム上で呼び出された場合はただちに復帰します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
指定されたボリュームセットによって使用されるネットワークリンクの健全性について報告します。リンクの健全性は、アクティブまたは非アクティブと報告されます。アクティブは、ネットワークリンクがデータの複製または再同期にアクティブに使用されており、したがって健全な状態にあることを意味します。非アクティブは、ネットワークリンクがデータの複製または再同期にアクティブに使用されておらず、リンクに関する問題を示している可能性があることを意味します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
構成されている遠隔ミラーボリュームまたはセットの一覧を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
構成されている遠隔ミラーボリュームまたはセットの一覧を、詳細情報とともに表示します。(後述の状態の説明を参照してください。)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBa\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
セットまたはグループにディスクキューを追加します。この操作は、そのセットまたはグループがロギングモードの場合に有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBd\fR\fR
.ad
.sp .6
.RS 4n
セットまたはグループからディスクキューを削除します。この操作は、そのセットまたはグループがロギングモードの場合に有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR \fBr\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
グループまたはセットのディスクキューを置き換えます。キューを無効にする操作と同様にセットまたはグループからキューが削除され、キューを追加する操作と同様に新しいディスクキューが追加されます。この操作は、そのセットまたはグループがロギングモードの場合に有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
構成されている遠隔ミラーボリュームまたはセットの一覧を、\fIvolset-file\fR と同じ形式で表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
失敗したビットマップなど遠隔ミラーセットのエラー状態のリセットを試みます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBb\fR \fBp\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットの一次ビットマップを再構成します。このコマンドは、主サーバーと副サーバーの両方で入力するようにしてください。一次ビットマップの再構成は、一度に 1 つのセットに対してのみ実行できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBb\fR \fBs\fR \fIbitmap\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットの二次ビットマップを再構成します。このコマンドは、主サーバーと副サーバーの両方で入力するようにしてください。二次ビットマップの再構成は、一度に 1 つのセットに対してのみ実行できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBC\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットのローカルボリュームのクラスタタグまたはディスクグループ名がパス名で示されていない場合に、そのタグまたはグループ名を再構成します。この動作がリモートボリュームに影響を及ぼすことはありません。このパラメータは、クラスタ化されていないシステム上では使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBm\fR \fB{sync\fR \fB|\fR \fBasync}\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットの複製モードを再構成します。整合グループに属するセットは、すべて同期またはすべて非同期のどちらかである必要があります。1 つのグループ内でモードを混在させることはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fBg\fR \fIgroup\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーセットの整合グループを再構成します。このコマンドは、主サーバーと副サーバーの両方で同じグループ名を使用して入力するようにしてください。
.sp
整合グループからセットを削除するには、整合グループを再構成するときに NULL 文字列 (" ") を指定します。
.RE

.sp
.LP
次のパラメータは、主サーバーからのみ発行できます。
.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
一次ボリュームから二次ボリュームへのフルボリュームコピーを開始すると同時に、一次ボリュームから二次ボリュームへの新しい更新の遠隔ミラー複製を有効にします。このパラメータは、一次ボリュームと二次ボリュームが異なる可能性があり、これらのボリュームを増分再同期するためのロギング情報が存在しない場合に使用します。「終了ステータス」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
同期を逆方向にして、一次ボリュームが二次ボリュームから同期されるようにします。このパラメータは、\fB-m\fR または \fB-u\fR パラメータとともに使用します。\fB-m\fR \fB-r\fR が設定されると、二次 (ソース) ボリュームから一次 (ターゲット) ボリュームへのフルボリュームコピーを開始しますが、同時に一次 (ソース) ボリュームから二次 (ターゲット) ボリュームへの新しい更新の遠隔ミラー複製を有効にして、ボリュームセットの同期状態が保持されるようにします。\fB-m\fR \fB-r\fR は、一次ボリュームと二次ボリュームの内容が異なる可能性があり、二次ボリュームに目的の内容があるものの、これらのボリュームを (\fB-u\fR を使用して) 増分再同期するためのロギング情報が存在しない場合に使用します。\fB-u\fR \fB-r\fR が指定されると、複製の中断中に保持されていた遠隔ミラーのスコアボードログを使用して、二次 (ソース) ボリュームから一次 (ターゲット) ボリュームを再同期します。次に、一次ボリュームから二次ボリュームへの新しい更新の遠隔ミラー複製を再開して、ボリュームセットの同期状態が保持されるようにします。復元または更新操作中のボリュームセットに対する作業は中止します。これにより、新しい更新の複製が再開される前に一次ボリュームと二次ボリュームが一致するようになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
遠隔ミラーボリュームセットを更新します。このパラメータにより、遠隔ミラーボリュームセットが再同期されます。遠隔ミラーのスコアボードに変更済みとして記録されているブロックのみが更新されます。一次ボリュームの遠隔ミラー複製を有効にすると同時に、遠隔ミラーのスコアボードログを使用して再同期プロセスを開始し、対応する二次ボリュームが一次ボリュームに一致するようにします。
.RE

.SS "\fBsndradm\fR \fB-P\fR から返される状態"
.sp
.LP
\fBsndradm\fR \fB-P\fR から返される可能性のある状態を次に示します。
.sp
.ne 2
.mk
.na
\fB\fBvolume\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
ローカルデータボリュームに対する I/O 操作が失敗しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbitmap\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
ローカルビットマップボリュームに対する I/O 操作が失敗しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisk\fR \fBqueue\fR \fBfailed\fR\fR
.ad
.sp .6
.RS 4n
ディスクキューボリュームに対する I/O 操作が失敗しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBneed\fR \fBsync\fR\fR
.ad
.sp .6
.RS 4n
このボリュームへの同期が中断されました。この同期を完了する (またはポイントインタイムコピーを使用して復元する) 必要があります。どちらかが完了するまで、データフローの方向を変更してはいけません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBneed\fR \fBreverse\fR \fBsync\fR\fR
.ad
.sp .6
.RS 4n
このボリュームへの逆同期が中断されました。この同期を完了する (またはポイントインタイムコピーを使用して復元する) 必要があります。どちらかが完了するまで、データフローの方向を変更してはいけません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlogging\fR\fR
.ad
.sp .6
.RS 4n
受信した書き込みはビットマップにのみ記録されます。データはリモートサイトに複製されません。\fBneed sync\fR、\fBneed reverse sync\fR、および \fBqueuing\fR はすべてロギングのサブ状態で、書き込みはビットマップに記録されるものの、複製されません。キューイングモード (後述) では、書き込みをビットマップに記録し、非同期フラッシュによる以降の複製のために要求をキューに入れます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreverse\fR \fBsyncing\fR\fR
.ad
.sp .6
.RS 4n
二次から一次へのコピーが進行中です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsyncing\fR\fR
.ad
.sp .6
.RS 4n
一次から二次へのコピーが進行中です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBqueuing\fR\fR
.ad
.sp .6
.RS 4n
ディスクキューを使用した通常の非同期複製中、I/O は、非同期フラッシュスレッドによる複製を待機するディスクキューに入れられます。一時的なリンク障害が発生した場合、セットはキューイングモードに移行します。このキューはメモリーベースのキューで使用されるため、破棄されません。代わりに、データがビットマップに記録され、キューに入れられます。リンクが復旧し、\fBsndradm\fR \fB-u\fR が発行されると、(このセットの自動同期を有効にすることによって自動化され、) フラッシュが再開されます。これにより、一時的なリンク停止が発生しても書き込み順序が保持されます。書き込み順序は必要なく、最新のデータのみが必要な場合は、セットを手動でロギングモードに設定して (\fBsndradm\fR \fB-l\fR)、更新同期を発行できます (\fBsndradm\fR \fB-u\fR)。これにより、キュー上のデータが破棄され、ビットマップを使用して高速再同期が実行されます。リンクが復旧する前にキューがいっぱいになった状態で更新同期が発行された場合、キューは破棄され、アプリケーションのハングアップを回避するためにセットがロギングモードに設定されます。
.RE

.SH 使用例
.LP
\fB例 1 \fR遠隔ミラーセットの有効化
.sp
.LP
次のコマンドは、ホスト \fBexample\fR 上で遠隔ミラーの非同期セットを有効にします。ここで、\fBexample\fR は一次ホスト、\fBexample-remote\fR は二次ホストです。

.sp
.in +2
.nf
example% \fBsndradm -e example /dev/rdsk/c1t0d0s1 /dev/rdsk/c1t1d0s3 \e
example-remote /dev/rdsk/c2t3d0s5 /dev/rdsk/c2t4d0s5 ip async\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR非同期セットへのディスクキューの追加
.sp
.LP
次のコマンドは、ディスクキューボリュームを非同期セットに追加します。

.sp
.in +2
.nf
example% \fBsndradm -q a /dev/rdsk/c1t2d0s3 \e
example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR非同期セットからのディスクキューの削除
.sp
.LP
次のコマンドは、ディスクキューボリュームが接続されているセットからディスクキューボリュームを削除します。

.sp
.in +2
.nf
example% \fBsndradm -q d example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fR遠隔ミラーセットの無効化
.sp
.LP
次のコマンドは、ホスト \fBexample\fR 上で有効になっている遠隔ミラーセットを無効にします。

.sp
.in +2
.nf
example% \fBsndradm -d example-remote:/dev/rdsk/c2t3d0s5\fR
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
コマンドが正常に完了しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
エラーが発生しました。
.RE

.sp
.LP
\fB-m\fR または \fB-u\fR オプションがスクリプト内で実行された場合、これらのいずれかのオプションに続く終了ステータスは、遠隔ミラーセットの現在のステータスには関係なく常に正常終了を返します。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-remote-mirror
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfg\fR(1M), \fBsndrd\fR(1M), \fBsndrsyncd\fR(1M), \fBds.log\fR(4), \fBrdc.cf\fR(4), \fBattributes\fR(5), \fBsv\fR(7D)
