Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/sndrsyncd.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sndrsyncd 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
sndrsyncd \- Availability Suite 遠隔ミラー更新再同期デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/sndrsyncd\fR 
.fi

.SH 機能説明
.sp
.LP
\fBsndrsyncd\fR デーモンは、ネットワークまたはマシン障害のあとの更新再同期を自動化し、再同期中に更新されているデータボリュームを保護する必要がある場合にポイントインタイムコピーのコピーを起動します。
.sp
.LP
このデーモンがカーネルによって通知されるのは、遠隔ミラーによって使用されているネットワークリンクがダウンしたあと、自動同期が有効でそのネットワークリンクを使用しているすべての遠隔ミラーセットを再同期するために、そのネットワークリングが \fB-u\fR オプションを設定して \fBsndradm\fR(1M) コマンドを呼び出したときです。遠隔ミラーセットの自動同期を構成する方法の詳細については、\fBsndradm\fR(1M) を参照してください。
.sp
.LP
このデーモンは、いずれかの遠隔ミラー再同期が開始または完了したときにも通知されます。Availability Suite 構成ファイルで構成されている場合、このデーモンはポイントインタイムコピーのスナップショットを作成します。副サーバー上では、このデーモンは、ファイルシステムが二次ボリュームに現在マウントされているかどうかをチェックし、そのファイルシステムが現在マウントされている場合は同期の開始を許可しないようカーネルに通知します。
.SH 終了ステータス
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
デーモンが正常に起動されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
デーモンの起動に失敗しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
\fBsndrsyncd\fR を起動するためのシェルスクリプト。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
\fBsndrsyncd\fR を停止するためのシェルスクリプト。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件storage/avs/avs-remote-mirror
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBiiadm\fR(1M), \fBsndradm\fR(1M), \fBsndrd\fR(1M), \fBsvcadm\fR(1M), \fBds.log\fR(4), \fBrdc.cf\fR(4), \fBattributes\fR(5)
.SH 注意事項
.sp
.LP
sndrsyncd デーモンは手動で停止しないでください。sndrsyncd を手動で停止する必要がある場合は、次の手順を実行します。これにより、\fBsndrd\fR デーモンと \fBsndrsyncd\fR デーモンの両方が停止されます。
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
\fBsndrsyncd\fR デーモンは手動で起動および再起動しないでください。\fBsndrsyncd\fR を手動で起動する必要がある場合は、次の手順を実行します。これにより、\fBsndrd\fR デーモンと \fBsndrsyncd\fR デーモンの両方が起動されます。
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
詳細については、\fBsvcadm\fR(1M) を参照してください。
