Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/snmp-notify.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH snmp-notify 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
snmp-notify \- ソフトウェアイベントの SNMP 通知デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/fm/notify/snmp-notify\fR
.fi

.SH 機能説明
.sp
.LP
\fBsnmp-notify\fR は、ソフトウェアイベントや FMA 診断および修復イベントに登録するデーモンで、SMF サービス構成リポジトリに格納されている一連の通知設定に基づいて SNMP トラップ通知を生成します。
.sp
.LP
SNMP 通知設定は、\fBsvccfg\fR(1M) を使用して設定されます。
.sp
.LP
\fBsnmp-notify\fR は、サービス FMRI の下でサービス管理機能 \fBsmf\fR(5) によって管理されます。
.sp
.in +2
.nf
svc:/system/fm/snmp-notify:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスのステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
.SS "プロパティー"
.sp
.LP
次のサービスプロパティーを設定できます。
.sp
.ne 2
.mk
.na
\fB\fBconfig/rootdir\fR\fR
.ad
.sp .6
.RS 4n
これは \fBastring\fR プロパティーで、デフォルトは \fB/\fR です。設定されている場合は、指定されたルートディレクトリが、\fBsnmp-notify\fR によって評価されるすべてのパス名に使用されます。
.RE

.SH 使用例
.LP
\fB例 1 \fR通知設定の構成
.sp
.LP
次のコマンドは、SMF サービス状態移行イベントの通知設定を構成します。

.sp
.in +2
.nf
# \fBsvccfg setnotify -g from-online,to-maintenance snmp:active\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRSNMP 通知の有効化
.sp
.LP
次のコマンドは、障害管理診断イベントの通知を有効にします。

.sp
.in +2
.nf
# \fBsvccfg setnotify problem-diagnosed snmp:active\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR通知設定の一覧表示
.sp
.LP
次のコマンドは、障害管理診断イベントのすべての通知設定を一覧表示します。

.sp
.in +2
.nf
# \fBsvccfg listnotify fma-diagnosis\fR
.fi
.in -2
.sp

.sp
.LP
SNMP 通知設定の構成の詳細については、\fBsvccfg\fR(1M) を参照してください。

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/fault-management/snmp-notify
_
インタフェースの安定性変更の可能性あり
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
