Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/srptadm.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH srptadm 1M "2011 年 8 月 16 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
srptadm \- SRP ターゲットの管理
.SH 形式
.LP
.nf
\fBsrptadm modify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
     [\fB-r\fR, \fB--reset\fR] \fIhca_guid\fR
.fi

.LP
.nf
\fBsrptadm list-target\fR [\fIhca_guid\fR]
.fi

.LP
.nf
\fBsrptadm modify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]
.fi

.LP
.nf
\fBsrptadm list-defaults\fR
.fi

.SH 機能説明
.sp
.LP
\fBsrptadm\fR コマンドは、\fBstmfadm\fR(1M) と \fBlibstmf\fR(3LIB) で説明されている SCSI ターゲットモードフレームワーク (SCSI Target Mode Framework、STMF) 内部の SRP (SCSI RDMA Protocol) ターゲットポートを管理します。これにより、SRP イニシエータが SRP プロトコルを使用して SCSI ターゲットモードフレームワーク (STMF) 論理ユニットにアクセスすることが可能になります。
.sp
.LP
\fBsrptadm\fR は、独自のオプションとオペランドを備えたサブコマンドのセットとして実装されます。これらのサブコマンドについては、以降の節でサブコマンドごとに説明します。
.SH サブコマンド
.sp
.ne 2
.mk
.na
\fB\fBlist-defaults\fR\fR
.ad
.sp .6
.RS 4n
デフォルトプロパティーの情報を一覧表示します。このサブコマンドにオプションはありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-target\fR [\fIhca_guid\fR]\fR
.ad
.sp .6
.RS 4n
\fIhca_guid\fR が指定されている場合は、ターゲット HCA のプロパティーを一覧表示します。そうでない場合は、すべての HCA のプロパティーが一覧表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-defaults\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR]\fR
.ad
.sp .6
.RS 4n
デフォルトのパラメータを変更します。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR, \fB--enable\fR\fR
.ad
.sp .6
.RS 4n
\fBmodify-target\fR で明示的に無効にされていないすべての HCA に対して SRP ターゲットの作成を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--disable\fR\fR
.ad
.sp .6
.RS 4n
\fBmodify-target\fR で明示的に有効にされていないすべての HCA に対して SRP ターゲットの作成を無効にします。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify-target\fR [\fB-e\fR, \fB--enable\fR] [\fB-d\fR, \fB--disable\fR] [\fB-r\fR, \fB--reset\fR \fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
指定された HCA の SRP ターゲットプロパティーを設定します。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR, \fB--enable\fR\fR
.ad
.sp .6
.RS 4n
この HCA での SRP ターゲットの作成を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR, \fB--disable\fR\fR
.ad
.sp .6
.RS 4n
この HCA での SRP ターゲットの作成を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR, \fB--reset\fR\fR
.ad
.sp .6
.RS 4n
HCA 固有の情報をクリアーし、デフォルトにリセットします。この HCA に SRP ターゲットが関連付けられている場合、その SRP ターゲットは、SRP ターゲットの SMF サービスが再起動されるまで変更されません。
.RE

.RE

.SH オペランド
.sp
.LP
list-target サブコマンドと modify-target サブコマンドには、次のオペランドがあります。
.sp
.ne 2
.mk
.na
\fB\fIhca_guid\fR\fR
.ad
.sp .6
.RS 4n
SRP ターゲットサービスを提供できる、このシステム上の InfiniBand ホストチャネルアダプタ (HCA) の GUID。この GUID は、次のいずれかの形式である必要があります。
.sp
.ne 2
.mk
.na
\fB\fB3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
基本の 16 進数形式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
先頭にゼロが付けられた基本の 16 進数形式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhca:3BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
\fBcfgadm\fR(1M) の形式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeui.0003BA000100CD18\fR\fR
.ad
.RS 24n
.rt  
EUI の形式。
.RE

.RE

.SH 使用法
.sp
.LP
SRP サービスが \fBonline\fR のときにデフォルトの状態が変更されても、既存のターゲットの状態は、そのサービスが再起動されるまで変更されません。
.sp
.LP
SRP ターゲットサービスが \fBonline\fR の場合、ターゲットの状態の変更はただちに有効になります。\fBdisabled\fR に設定されたターゲットは、オフライン状態になって削除されます。\fBenabled\fR に設定されたターゲットは、ただちに作成されます。
.SH 使用例
.LP
\fB例 1 \fRデフォルトプロパティーの一覧表示
.sp
.LP
次のコマンドは、デフォルトの SRP ターゲットサービスプロパティーを一覧表示します。

.sp
.in +2
.nf
# \fBsrptadm list-defaults\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRデフォルトの動作の変更
.sp
.LP
次のコマンドは、SRP ターゲットサービスのデフォルトの動作を変更し、そのサービスが有効になったときに SRP ターゲットが作成されないようにします。

.sp
.in +2
.nf
# \fBsrptadm modify-defaults -d\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR特定の HCA のプロパティーの一覧表示
.sp
.LP
次のコマンドは、特定の HCA の SRP ターゲットプロパティーを一覧表示します。

.sp
.in +2
.nf
# \fBcfgadm | grep hca\fR
hca:3BA000100CD18              IB-HCA       connected    configured   ok
hca:3BA000100D030              IB-HCA       connected    configured   ok

# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online
.fi
.in -2
.sp

.LP
\fB例 4 \fR特定の HCA のサービスの無効化
.sp
.LP
次のコマンドは、特定の HCA の SRP ターゲットサービスを無効にします。

.sp
.in +2
.nf
# \fBsrptadm modify-target -d 3BA000100CD18\fR
.fi
.in -2
.sp

.sp
.LP
その変更を確認するには、\fBlist-target\fR コマンドを使用します。

.sp
.in +2
.nf
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : false
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : -
.fi
.in -2
.sp

.LP
\fB例 5 \fRターゲットサービスの再有効化
.sp
.LP
次のコマンドシーケンスは SRP ターゲットサービスを再度有効にし、SRP と STMF のターゲットプロパティーを表示します。

.sp
.in +2
.nf
# \fBsrptadm modify-target -e 3BA000100CD18\fR
# \fBsrptadm list-target hca:3BA000100CD18\fR
Target HCA 3BA000100CD18:
    Enabled             : true
    SRP Target Name     : eui.0003BA000100CD18
    Operational Status  : online

# \fBstmfadm list-target -v eui.0003BA000100CD18\fR
Target: eui.0003BA000100CD18
    Operational Status: Online
    Provider Name     : srpt
    Alias             : -
    Protocol          : SRP
    Sessions          : 0
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件T{
system/storage/scsi-rdma/scsi-rdma-target
T}
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBcfgadm\fR(1M), \fBstmfadm\fR(1M), \fBlibsrpt\fR(3LIB), \fBlibstmf\fR(3LIB), \fBattributes\fR(5), \fBsrpt\fR(7D)
