Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/svadm.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All rights reserved.
.TH svadm 1M "2007 年 10 月 2 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
svadm \- Availability Suite ストレージボリュームの操作を制御するためのコマンド行インタフェース
.SH 形式
.LP
.nf
\fBsvadm\fR \fB-h\fR
.fi

.LP
.nf
\fBsvadm\fR \fB-v\fR
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR]
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-i\fR
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-e\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-d\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.LP
.nf
\fBsvadm\fR [\fB-C\fR \fItag\fR] \fB-r\fR {\fB-f\fR \fIconfig_file\fR | volume}
.fi

.SH 機能説明
.sp
.LP
\fBsvadm\fR コマンドは、指定されたボリュームのストレージボリューム (SV) ドライバを有効または無効にしたり、システムを動的に再構成したりする機能を提供することによって SV ドライバを制御します。
.SH オプション
.sp
.LP
\fBsvadm\fR コマンドの引数を指定しない場合、このユーティリティーは、現在 SV の制御下にあるボリュームの一覧を表示します。\fBsvadm\fR は、次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fItag\fR\fR
.ad
.sp .6
.RS 4n
クラスタ化されたノードでは、tag で指定されたクラスタリソースグループまたはディスクグループ名に属するボリュームのみに操作を制限します。このオプションは、クラスタ化されていないシステム上では使用できません。特殊な \fBlocal\fR を使用すると、クラスタ内のほかのノードに切り替えることのできないボリュームのみに操作を制限できます。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
コマンド行または構成ファイルで指定された SV デバイスを無効にします。このオプションで \fB-C\fR タグが指定されている場合は、ボリュームがこのクラスタディスクグループ内に存在する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
コマンド行または構成ファイルで指定された SV デバイスを有効にします。このボリュームの詳細が現在の構成内に保存されます。\fBdscfg\fR(1M) を参照してください。このオプションで \fB-C\fR タグが指定されている場合は、ボリュームがこのクラスタディスクグループ内に存在する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
ボリュームの一覧を含む構成ファイルを指定します。コマンドは、このボリュームの一覧を読み取ってから操作を実行します。\fIconfig_file\fR は、ボリュームのパス名を 1 行に 1 つずつ記載した単純なリスト形式になります。空白の行、およびコメント文字 (#) で始まる行は無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
\fBsvadm\fR の使用法の要約を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
現在 SV の制御下にあるボリュームの詳細なステータスを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
\fIconfig_file\fR が指定されている場合は、実行中のシステムを \fIconfig_file\fR で指定された構成に一致するように再構成します。\fB-C\fR オプションが指定されている場合は、各ボリュームのクラスタタグを比較し、それを \fIcluster_tag\fR に変更します。このオプションでボリュームが指定されている場合、このオプションは、そのボリュームに関連付けられたクラスタタグを再構成する場合にのみ有効になります。\fB-e\fR または \fB-d\fR オプションは、1 つのボリュームを有効または無効にする場合に使用するようにしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
SV のバージョン番号を表示します。
.RE

.SH 使用法
.sp
.LP
SV ボリュームが有効になっている場合、デバイスへの通常のシステムコールアクセス (\fBintro\fR(2) を参照) は StoreEdge アーキテクチャーソフトウェアにリダイレクトされます。これにより、標準アプリケーションで Sun StorageTek ポイントインタイムコピーや遠隔ミラーソフトウェアなどの StorageTek 機能を使用できるようになります。
.sp
.LP
\fBsvadm\fR コマンドは、有効化 (\fB-e\fR) 操作と無効化 (\fB-d\fR) 操作を実行するときに、Availability Suite ログファイル \fB/var/adm/ds.log\fR (\fBds.log\fR(4) を参照) 内にエントリを生成します。 
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件driver/storage/sv、driver/storage/sv
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBdscfg\fR(1M), \fBds.log\fR(4), \fBattributes\fR(5), \fBsv\fR(7D)
