Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/tnchkdb.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tnchkdb 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
tnchkdb \- トラステッドネットワークデータベースのファイル構文の検査
.SH 形式
.LP
.nf
\fB/usr/sbin/tnchkdb\fR  [\fB-h\fR \fIpath\fR] [\fB-t\fR \fIpath\fR] [\fB-z\fR \fIpath\fR]
.fi

.SH 機能説明
.sp
.LP
\fBtnchkdb\fR は、\fBtnrhtp\fR、\fBtnrhdb\fR、および \fBtnzonecfg\fR データベースの構文を検査します。デフォルトでは、各ファイルのパスは次のとおりです。\fI\fR 
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnrhtp\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnrhdb\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnzonecfg\fR
.RE
.sp
.LP
コマンド行で \fB-h\fR (\fBtnrhdb\fR)、\fB-t\fR (\fBtnrhtp\fR)、および \fB-z\fR (\fBtnzonecfg\fR) オプションとともにパスを指定することで、一部またはすべてのファイルの代替パスを指定できます。このオプションは、変更したファイルセットを新規システムデータベースとしてインストールする前にテストする場合に便利です。
.sp
.LP
3 つのデータベースファイルすべての整合性が検査されます。すべてのファイルが構文的に正しく、かつ可能な範囲内で意味的に正しい場合、\fBtnchkdb\fR は終了ステータス \fB0\fR を返します。1 つ以上のファイルにエラーが存在する場合、終了ステータス \fB1\fR が返されます。ファイルを読み込むことができないなど、コマンド行の指定に問題がある場合は、終了ステータス \fB2\fR が返されます。エラーは、標準エラーに書き込まれます。
.sp
.LP
\fBtnrhtp\fR 内にエラーが存在する場合、エラーが階層的に発生することを防ぐために、\fBtnrhdb\fR 内のテンプレート名は検査されません。
.sp
.LP
\fBtnchkdb\fR は任意のラベルで実行できますが、標準の \fB/etc/security/tsol\fR ファイルを表示できるのは大域ゾーンだけです。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-h\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
.rt  
\fIpath\fR を検査して、\fBtnrhdb\fR の構文が適切かどうかを調べます。\fIpath\fR が指定されない場合は、\fB/etc/security/tsol/tnrhdb\fR を検査します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
.rt  
\fIpath\fR を検査して、\fBtnrhtp\fR の構文が適切かどうかを調べます。\fIpath\fR が指定されない場合は、\fB/etc/security/tsol/tnrhtp\fR を検査します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
.rt  
\fIpath\fR を検査して、\fBtnzonecfg\fR の構文が適切かどうかを調べます。\fIpath\fR が指定されない場合は、\fB/etc/security/tsol/tnzonecfg\fR を検査します。
.RE

.SH 使用例
.LP
\fB例 1 \fRエラーメッセージの例
.sp
.LP
\fBtnchkdb\fR コマンドは、CIPSO エラーを検査します。この例では、\fBadmin_low\fR テンプレートのデフォルトラベルが、不正な値 \fBADMIN_HIGH\fR です。

.sp
.in +2
.nf
# \fBtnchkdb\fR
checking /etc/security/tsol/tnrhtp ...
tnchkdb: def_label classification 7fff is invalid for cipso labels:
line 14 entry admin_low
tnchkdb: def_label compartments 241-256 must be zero for cipso labels:
line 14 entry admin_low
checking /etc/security/tsol/tnrhdb ...
checking /etc/security/tsol/tnzonecfg ...
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
トラステッドネットワーク遠隔ホストデータベース
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
トラステッドネットワーク遠隔ホストテンプレート
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
トラステッドゾーン構成データベース
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
このコマンド行は「確実」です。出力は「不確実」です。
.SH 関連項目
.sp
.LP
\fBtnd\fR(1M), \fBtnctl\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures \fR
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
.sp
.LP
\fBLDAP\fR を使って欠落したテンプレートを提供する場合、\fBtnrhtp\fR および \fBtnrhdb\fR の構成が一貫してはいなくても有効であることがあります。
