Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/tninfo.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH tninfo 1M "2007 年 7 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
tninfo \- カーネルレベルのネットワークに関する情報と統計の出力
.SH 形式
.LP
.nf
\fB/usr/sbin/tninfo\fR [\fB-h\fR \fIhostname\fR] [\fB-m\fR \fIzone-name\fR] [\fB-t\fR \fItemplate\fR]
.fi

.SH 機能説明
.sp
.LP
\fBtninfo\fR は、カーネルレベルのネットワーク情報と統計を取得して表示するためのインタフェースを提供します。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhostname\fR\fR
.ad
.RS 16n
.rt  
遠隔ホストキャッシュ内にある、指定されたホストのセキュリティー構造を表示します。出力には、\fBtnrhdb\fR データベース内で指定された内容が反映されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIzone-name\fR\fR
.ad
.RS 16n
.rt  
指定したゾーンに関連付けられた MLP 構成を表示します。出力には、\fBtnzonecfg\fR データベース内で指定された内容が反映されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItemplate\fR\fR
.ad
.RS 16n
.rt  
指定した \fItemplate\fR に関連付けられている構造を表示します。出力には、\fBtnrhtp\fR データベース内で指定された内容が反映されます。
.RE

.SH 使用例
.LP
\fB例 1 \fRカーネル内にキャッシュされた遠隔ホスト構造を表示する
.sp
.LP
この例では、カーネル内にキャッシュされた遠隔ホスト構造を表示します。出力には、\fBtnrhdb\fR データベース内の定義が反映されます。

.sp
.in +2
.nf
# \fBtninfo -h machine1\fR
   IP address= 192.168.8.61
   Template = cipso
.fi
.in -2
.sp

.LP
\fB例 2 \fR大域ゾーンのマルチレベルポートを表示する
.sp
.LP
この例では、カーネルでキャッシュされた大域ゾーンの MLP を表示します。出力には、\fBtnzonecfg\fR データベース内の定義、および動的に割り当てられたすべての MLP が反映されます。\fBprivate\fR は、ゾーン固有の MLP を示します。

.sp
.in +2
.nf
# \fBtninfo -m global\fR
private:23/tcp;111/tcp;111/udp;515/tcp;2049/tcp;6000-6003/tcp;
        32812/tcp;36698/ip;38634/tcp;64365/ip
shared: 6000-6003/tcp
.fi
.in -2
.sp

.LP
\fB例 3 \fR\fBcipso\fR テンプレート定義を表示する
.sp
.LP
この例では、カーネルでキャッシュされた \fBcipso\fR テンプレート定義を表示します。出力には、\fBtnrhtp\fR データベース内の定義が反映されます。

.sp
.in +2
.nf
# \fBtninfo -t cipso\fR
=====================================
   Remote Host Template Table Entries:
   __________________________
   template: cipso
   host_type: CIPSO
   doi: 1
   min_sl: ADMIN_LOW
   hex: ADMIN_LOW
   max_sl: ADMIN_HIGH
   hex: ADMIN_HIGH
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
トラステッドネットワーク遠隔ホストデータベース
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
トラステッドネットワーク遠隔ホストテンプレート
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
トラステッドゾーン構成データベース
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/trusted
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
このコマンド行は「確実」です。出力は「不確実」です。
.SH 関連項目
.sp
.LP
\fBtnd\fR(1M), \fBtnctl\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator\&'s Procedures \fR
.SH 注意事項
.sp
.LP
このマニュアルページに記載されている機能を利用できるのは、システムが Trusted Extensions を使用して構成されている場合だけです。
