Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/txzonemgr.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH txzonemgr 1M "2011 年 5 月 12 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
txzonemgr \- Trusted Extensions Zone Manager 構成ユーティリティー
.SH 形式
.LP
.nf
\fB/usr/sbin/txzonemgr\fR [\fB-c\fR | \fB-d[f]\fR | \fB-Z\fR \fIfile\fR]
.fi

.SH 機能説明
.sp
.LP
\fBtxzonemgr\fR シェルスクリプトは、Trusted Extensions が有効になっているシステムのラベル付きゾーンを作成、インストール、初期化、および起動するための、メニューベースの簡易 \fBGUI\fR ウィザードを提供します。また、このスクリプトはネットワークオプションやネームサービスオプションのメニュー項目、および大域ゾーンを既存の LDAP サーバーのクライアントにするためのメニュー項目も提供します。デフォルトではどのゾーンも、大域ゾーンと同じネームサービスと IP アドレスを使用するように構成されます。
.sp
.LP
\fBtxzonemgr\fR は、後述する適切なオプションを使用することで、GUI モードで動作する代わりに、コマンド行モードで限られた数のコマンドを実行することもできます。
.sp
.LP
\fBtxzonemgr\fR は、Zone Management 権利プロファイルで付与された役割、または大域ゾーン内のルートのいずれかによって実行されます。
.SH オプション
.sp
.LP
オプションが指定されなかった場合、\fBtxzonemgr\fR はメニューベースの GUI として動作します。オプションのいずれかを使用した場合、必ずコマンド行での動作になります。後述する場合を除き、複数のオプションを組み合わせることはできません。
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのゾーンを作成します。ゾーンがまだ 1 つも存在していない必要があります。作成されるゾーンの数、名前、および属性は変更される可能性があります。ただし通常は、「public」ゾーンが作成されるほか、別のゾーンが少なくとも 1 つ作成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
すべてのゾーンを破棄します。すべてのゾーンが停止、アンインストール、および削除されます。\fB-f\fR オプションが一緒に指定されない場合に、確認プロンプトを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
強制実行。\fB-d\fR と組み合わせて使用すると、確認プロンプトを無効化できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
ファイルに指定された一覧を使用して、ゾーンセットを作成します。ファイル内の各行には、ゾーン名と対応するラベルを空白で区切って指定する必要があります。 ラベルに空白が含まれる場合でも、引用符で囲まないでください。 「スナップショット」という名前の既存のゾーンが存在する場合は、そのゾーンから指定されたすべてのゾーンのクローンが作成されます。それ以外の場合は、一覧の最初のゾーンがインストールされ、そのゾーンからスナップショットゾーンのクローンが作成されます。その後、スナップショットから残りのゾーンのクローンが作成されます。 ゾーンは手動ブートが必須となるように構成されています。 ただし、承認ユーザーが有効なラベルを GNOME 作業スペースに割り当てると、対応するゾーンが自動的にブートされます。
.RE

.SH 終了ステータス
.sp
.LP
GUI モードでは値は返されません。コマンド行動作のときに返される終了値を、次に示します。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
無効な使用法。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
T{
コマンドインタフェースの安定性 
T}確実 
_
対話型ダイアログインタフェースではない
.TE

.SH 関連項目
.sp
.LP
\fBzenity\fR(1) (not a SunOS man page), \fBipadm\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBrbac\fR(5), \fBzones\fR(5)
.sp
.LP
\fISolaris Trusted Extensions 管理者の手順\fR
.SH 注意事項
.sp
.LP
\fBJDS\fR からゾーンを管理する場合は、\fBCDE\fR アクションの代わりに \fBtxzonemgr\fR を使用してください。
.sp
.LP
\fBtxzonemgr\fR は \fBzenity\fR コマンドを使用します。詳細は、SunOS コレクションに含まれていない \fBzenity\fR(1) のマニュアルページを参照してください。
