Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/unshare.1m
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH unshare 1M "2011 年 3 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
unshare \- ローカルシステムをリモートシステムからマウント不可能にする設定
.SH 形式
.LP
.nf
\fBunshare\fR [\fB-F\fR \fIprotocol\fR] [\fB-a\fR | [\fB-t\fR] [\fIpathname\fR | \fIsharename\fR]]
.fi

.SH 機能説明
.sp
.LP
\fBunshare\fR コマンドは、ファイルシステムの共有を非公開にします。これにより、共有されているローカルのファイルシステムがファイル共有のための \fIprotocol\fR で使用できなくなります。\fB-F\fR \fIprotocol\fR オプションが省略された場合、\fB/etc/dfs/fstypes\fR ファイルで 1 番目にリストされているファイル共有プロトコルがデフォルトの共有プロトコルとして使用されます。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
ファイル共有プロトコルを識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
アクティブな共有をすべて非公開にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
一時的に共有を非公開にします。デフォルトでは、すべての共有は永続的に非公開にされています。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.sp .6
.RS 4n
ファイル共有プロトコルのリスト。デフォルトのファイル共有プロトコルは NFS です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/sharetab\fR\fR
.ad
.sp .6
.RS 4n
\fBshare\fR コマンドによって公開されたローカルリソースのテーブルが含まれています。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件SUNWcs
.TE

.SH 関連項目
.sp
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBattributes\fR(5)
.SH 注意事項
.sp
.LP
共有の情報で \fIpathname\fR または \fIresourcename\fR のいずれかが見つからない場合、標準エラー出力にエラーメッセージが送られます。
.sp
.LP
\fBunshare\fR コマンドが正常に終了すると、\fBunshare\fR コマンドに指定されたファイルシステムをマウントしているクライアントは、そのファイルシステムにアクセスできなくなります。
