Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/update_drv.1m
'\" te
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.TH update_drv 1M "2009 年 2 月 10 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
update_drv \- デバイスドライバ属性の変更
.SH 形式
.LP
.nf
\fBupdate_drv\fR [\fB-f\fR | \fB-v\fR] [\fB-n\fR] \fIdriver_module\fR
.fi

.LP
.nf
\fBupdate_drv\fR [\fB-b\fR \fIbasedir\fR] [\fB-f\fR | \fB-v\fR] [\fB-n\fR] \fB-a\fR [\fB-m\fR '\fIpermission\fR'] 
     [\fB-i\fR '\fIidentify-name\fR'] [\fB-P\fR '\fIprivilege\fR'] [\fB-p\fR '\fIpolicy\fR'] \fIdriver_module\fR
.fi

.LP
.nf
\fBupdate_drv\fR [\fB-b\fR \fIbasedir\fR] [\fB-f\fR | \fB-v\fR] [\fB-n\fR] \fB-d\fR [\fB-m\fR '\fIpermission\fR'] 
     [\fB-i\fR '\fIidentify-name\fR'] [\fB-P\fR '\fIprivilege\fR'] [\fB-p\fR '\fIpolicy\fR'] \fIdriver_module\fR
.fi

.SH 機能説明
.sp
.LP
\fBupdate_drv\fR コマンドは、インストールされているデバイスドライバへの属性変更に関する情報をシステムに通知します。このコマンドを使用すると、\fBdriver.conf\fR(4) ファイルを再読み込みしたり、ドライバマイナーノードのアクセス権や別名を追加、変更、または削除したりすることができます。
.sp
.LP
オプションを指定しないと、\fBupdate_drv\fR は \fBdriver.conf\fR ファイルを再読み込みします。 
.sp
.LP
別名が正常に更新された場合、ドライバのバインドは、再構成ブートまたはデバイスのホットプラグで有効になります。
.sp
.LP
アクセス権が正常に更新された場合は、新しいドライバマイナーノードのみが、変更された一連のファイルアクセス権を使用して作成されます。 既存のドライバマイナーノードは変更されません。 
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
アクセス権、別名、特権、またはポリシーのエントリを追加します。\fI\fR\fI\fR\fI\fR\fI\fR
.sp
\fB-a\fR オプションを指定した場合は、アクセス権エントリ (\fB-m\fR オプションを使用)、ドライバの別名エントリ (\fB-i\fR オプションを使用)、デバイス特権 (\fB-P\fR オプションを使用)、またはデバイスポリシー (\fB-p\fR オプションを使用) を追加または更新できます。一致する (同じドライバ名とマイナーノードを持つ) マイナーノードアクセス権エントリが検出された場合は、置き換えられます。一致する (異なるドライバ名と同じ別名を持つ) 別名エントリが検出された場合は、エラーが報告されます。
.sp
\fB-a\fR オプションと \fB-d\fR オプションは相互に排他的です。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIbasedir\fR\fR
.ad
.sp .6
.RS 4n
ドライバを、\fBupdate_drv\fR を実行しているシステムにインストールするのではなく、basedir というルートディレクトリを持つシステムでインストールまたは変更します。
.LP
注 - 
.sp
.RS 2
\fB-b\fR オプションを使って、非大域ゾーンのルートファイルシステムを参照しないでください。この操作によって、大域ゾーンのファイルシステムを損傷したり、大域ゾーンのセキュリティを損ねたり、非大域ゾーンのファイルシステムを損傷する可能性があります。\fBzones\fR(5) を参照してください。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
アクセス権、別名、特権、またはポリシーのエントリを削除します。\fI\fR\fI\fR\fI\fR\fI\fR
.sp
\fB-d\fR オプションでは、\fB-m\fR \fIpermission\fR、\fB-i\fR \fIidentify-name\fR、\fB-P\fR \fIprivilege\fR、または \fB-p\fR \fIpolicy\fR オプションを指定する必要があります。
.sp
\fB-d\fR オプションと \fB-a\fR オプションは相互に排他的です。 
.sp
エントリが存在しない場合、\fBupdate_drv\fR はエラーを返します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
ドライバモジュールを読み込み解除できない場合でも、システムで強制的に \fBdriver.conf\fR ファイルを再読み込みするようにします。詳細は、「注意事項」の節を参照してください。\fB\fR
.sp
このオプションを指定\fBしない\fRで、ドライバの別名を削除した場合、\fBupdate_drv\fR は、次回のブート時にバインドファイルを更新します。ただし、このドライバの別名のバインドを参照しているデバイスが 1 つ以上残っている場合はエラーを返します。\fB-f\fR オプションを\fB指定した\fR場合、\fBupdate_drv\fR はそのようなデバイスが残っていてもエラーを返しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR '\fIidentify-name\fR'\fR
.ad
.sp .6
.RS 4n
ドライバの別名をスペースで区切ったリスト。\fB-a\fR または \fB-d\fR オプションが指定されていない場合、このオプションは無視されます。\fIidentify-name\fR 文字列は必須です。すべての別名を削除する必要がある場合は、\fBrem_drv\fR(1M) をお勧めします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR '\fIpermission\fR'\fR
.ad
.sp .6
.RS 4n
デバイスドライバのデバイスノードに対するファイルシステムアクセス権のスペースで区切られたリストを指定します。\fB-a\fR または \fB-d\fR オプションが指定されていない場合、このオプションは無視されます。permission 文字列は必須です。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fIdevice_driver\fR のロードや接続を試みず、そのドライバのシステム構成ファイルの変更だけを行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR '\fIpolicy\fR'\fR
.ad
.sp .6
.RS 4n
\fB-a\fR オプションを指定した場合、policy は、完全なデバイスポリシーのスペースで区切られたリストです。 \fB-d\fR オプションの場合、ポリシーは、マイナーデバイス指定のスペースで区切られたリストです。マイナーデバイス指定は、\fB/etc/security/device_policy\fR 内のエントリに対して正確に照合されます。つまり、ワイルドカードの照合は実行されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR '\fIprivilege\fR'\fR
.ad
.sp .6
.RS 4n
\fB-a\fR オプションを指定した場合、privilege は、追加のドライバ特権のコンマで区切られたリストです。\fB-d\fR オプションの場合、privilege は 1 つの特権です。これらの特権は \fB/etc/security/extra_privs\fR ファイルに追加されるか、またはこのファイルから削除されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
冗長。
.RE

.SH 使用例
.LP
\fB例 1 \fR既存のマイナーアクセス権エントリの追加または変更
.sp
.LP
次のコマンドは、\fBclone\fR ドライバの既存のマイナーアクセス権エントリを追加または変更します。

.sp
.in +2
.nf
example# update_drv -a -m 'llc1 777 joe staff' clone
.fi
.in -2
.sp

.LP
\fB例 2 \fRすべてのマイナーアクセス権エントリの削除
.sp
.LP
次のコマンドは、USB プリンタドライバである \fBusbprn\fR ドライバのすべてのマイナーアクセス権エントリを削除します。

.sp
.in +2
.nf
example# update_drv -d -m '* 0666 root sys' usbprn
.fi
.in -2
.sp

.LP
\fB例 3 \fRドライバ別名エントリの追加
.sp
.LP
次のコマンドは、\fBugen\fR ドライバのドライバ別名エントリを \fBusb459,20\fR の識別文字列を使用して追加します。

.sp
.in +2
.nf
example# update_drv -a -i '"usb459,20"' ugen
.fi
.in -2
.sp

.LP
\fB例 4 \fR\fBohci\fR ドライバのための \fBdriver.conf\fR ファイルの再読み込み
.sp
.LP
次のコマンドは、\fBdriver.conf\fR(4) ファイルを再読み込みします。

.sp
.in +2
.nf
 example# update_drv ohci
.fi
.in -2
.sp

.LP
\fB例 5 \fRtcp ソケットを開くために自己定義の特権を必要にする
.sp
.LP
次のコマンドは、tcp ソケットを開くために自己定義の特権を必要にします。

.sp
.in +2
.nf
example#   update_drv -a -P net_tcp -p \e
     'write_priv_set=net_tcp read_priv_set=net_tcp' tcp
.fi
.in -2
.sp

.LP
\fB例 6 \fRパス指向の別名の確立
.sp
.LP
次のコマンドは、パス指向の別名を確立して、特定のドライバ \fBqlt\fR が強制的に特定のデバイスパスに使用されるようにします。

.sp
.in +2
.nf
example#   update_drv -a -i '"/pci@8,600000/SUNW,qlc@4"' qlt
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBadd_drv\fR(1M), \fBmodunload\fR(1M), \fBrem_drv\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBprivileges\fR(5)
.SH 注意事項
.sp
.LP
\fB-a\fR または \fB-d\fR オプションが指定されている場合、\fBupdate_drv\fR は \fBdriver.conf\fR ファイルを再読み込みしません。
.sp
.LP
\fBdriver.conf\fR ファイルを強制的に更新すると、ドライババイナリモジュールを再読み込みすることなく、\fBdriver.conf\fR ファイルが再読み込みされます。この場合は、切り離せないデバイスが古い \fBdriver.conf\fR ファイルのドライバ大域プロパティーを参照するのに対して、残りのドライバインスタンスは新しい \fBdriver.conf\fR ファイル内の大域プロパティーを参照します。
.sp
.LP
別名を追加することができます。これにより、すでに別のドライバによって管理されているデバイスのドライバのバインドが変更されます。\fB-a\fR オプションを使用して強制的に更新すると、新しいドライバにバインドしようとし、それができない場合はエラーを報告します。\fB-m\fR、\fB-i\fR、\fB-P\fR、または \fB-p\fR オプションのうちの複数を指定した場合は、強制フラグによって別名またはアクセス権の変更が試みられます。これはほかの操作が失敗した場合でも実行され、その逆も同じです。
