Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/vtdaemon.1m
'\" te
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.TH vtdaemon 1M "2010 年 9 月 2 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
vtdaemon \- テキスト仮想コンソール間の切り替え機能
.SH 形式
.LP
.nf
\fB/usr/lib/vtdaemon\fR
.fi

.SH 機能説明
.sp
.LP
\fBvtdaemon\fR は、複数のテキスト仮想コンソール間のセキュリティー保護された切り替え機能をホットキー経由で提供します。これは完全な特権を使用して実行されます。
.sp
.LP
このサービスは、Device Security 権利プロファイルに含まれるアクション承認 \fBsolaris.smf.manage.vt\fR を使用して管理されます。このサービスの対象はローカルのみであり、インバウンドネットワークポートは用意されていません。このサービスは、非大域ゾーン内で無効化されるほか、仮想コンソール機能が使用できない場合にも無効化されます。
.sp
.LP
\fBvtdaemon\fR では認証時に PAM が使用されます。
.sp
.LP
\fBvtdaemon\fR はテキストコンソールのロックやロック解除を行うだけです。グラフィカルな X セッションの場合、認証や監査を処理する対応するロックプログラム (\fBxscreensaver\fR など) が呼び出されます。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性非公開
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBvtdaemon\fR サービスは、サービス管理機能 \fBsmf\fR(5) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/system/vtdaemon:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスのステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
.sp
.LP
\fBvtdaemon\fR サービスの SMF 構成プロパティーは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBhotkeys\fR (ブール (論理) 型)\fR
.ad
.sp .6
.RS 4n
承認ユーザーがホットキー経由の VT 切り替えを動的に有効化または無効化できるようにします。そのデフォルト値は \fBTRUE\fR (有効) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecure\fR (ブール型)\fR
.ad
.sp .6
.RS 4n
承認ユーザーがホットキーのセキュリティーを動的に有効化または無効化できるようにします。無効化されると、ユーザーは任意のセッションへの切り替えを認証なしに自由に行えるようになります。そのデフォルト値は TRUE (有効) です。
.RE

