Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/wall.1m
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH wall 1M "1994 年 7 月 13 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
wall \- すべてのユーザーへの通知
.SH 形式
.LP
.nf
\fB/usr/sbin/wall\fR [\fB-a\fR] [\fB-g\fR \fIgrpname\fR] [\fIfilename\fR]
.fi

.SH 機能説明
.sp
.LP
\fBwall\fR はファイルの終わりまで標準入力を読み取ります。その後、現在ログインしているすべてのユーザーに以下の文字で始まるメッセージを送信します。
.sp
.in +2
.nf
Broadcast Message from .\|.\|.
.fi
.in -2

.sp
.LP
\fIfilename\fR が指定されていれば、メッセージはこのファイルから読み込まれます。通常、リモートログインセッションに対応していない仮想端末は無視されます。したがって、ウィンドウシステムを使用しているときは、メッセージはコンソールウィンドウにだけに表示されます。ただし、\fB-a\fR オプションを指定すると、メッセージを仮想端末などにも送信します。
.sp
.LP
一般的には、システムをシャットダウンする前に、すべてのユーザーに警告を与える場合に、このメッセージを用います。
.sp
.LP
ユーザーが起動させた保護を無効にする場合、送信側はスーパーユーザーである必要があります (\fBmesg\fR(1) 参照)。
.sp
.LP
\fBwall\fR は、他のユーザーの端末上で書き込み権を持つために、グループ \fBID\fR \fBtty\fR に対して \fBsetgid()\fR を実行します。 (\fBsetuid\fR(2) 参照)。
.sp
.LP
\fBwall\fR は、ユーザーの端末に送信する前に非表示可能文字を検出します。制御文字は、適切な \fBASCII\fR 文字が後に続く \fB^\fR として表示されます。すなわち、高位ビットが設定された文字は meta 表記法で表示されます。たとえば、`\fB\e003\fR\&' は `\fB^C\fR' と表示され、`\fB\e372\fR\&' は `\fBM-z\fR' と表示されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 14n
.rt  
コンソールと仮想端末にメッセージを送ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fBg\fR \fIgrpname\fR\fR
.ad
.RS 14n
.rt  
グループデータベース (\fBgroup\fR(4) を参照) ごとに、grpname で指定されたグループのユーザーだけにメッセージを送ります。
.RE

.SH 環境
.sp
.LP
\fBLC_*\fR 変数 (\fBLC_CTYPE\fR、\fBLC_TIME\fR、\fBLC_COLLATE\fR、\fBLC_NUMERIC\fR、\fBLC_MONETARY\fR) が環境に設定されていなければ、それぞれ対応する ロケール のカテゴリにおける \fBwall\fR の動作は、環境変数 \fBLANG\fR によって決定されます。 (\fBenviron\fR(5) 参照)。もし、\fBLC_ALL\fR が設定されていれば、その内容が \fBLANG\fR 変数やその他の \fBLC_*\fR 変数より優先されます。前述の変数が環境にまったく設定されていなければ、 C ロケール (米国スタイル) が \fBwall\fR の動作を決定します。
.SH ファイル
.sp
.LP
\fB/dev/tty*\fR
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fB属性タイプ\fR\fB属性値\fR
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBmesg\fR(1), \fBwrite\fR(1), \fBsetuid\fR(2), \fBattributes\fR(5), \fBenviron\fR(5)
.SH 注意事項
.sp
.LP
\fBwall\fR は、ユーザーの tty ファイルでオープンが失敗すると、``Cannot send to \|\|.\|.'' \fB\fR と表示します。
