Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/wpad.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH wpad 1M "2008 年 3 月 11 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
wpad \- WPA および WPA2 プロトコルデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/inet/wpad\fR [\fB-i\fR \fIinterface\fR] [\fB-k\fR \fIpre_shared_key_name\fR]
.fi

.SH 機能説明
.sp
.LP
\fBwpad\fR デーモンは、IEEE802.11i 標準で規定されている WiFi Protected Access (WPA) Version 1 および 2 の共通クライアント機能を提供します。WPA は、業界団体の WiFi Alliance によって作成されました。WPA は IEEE 802.11i 標準の大部分を実装しており、802.11i の準備が整うまでの間、WEP (Wired Equivalent Privacy) の代わりに使用するために過渡的な手段として用意されたものです。WPA2 は標準を完全に実装したものです。
.sp
.LP
\fBwpad\fR が提供する WPA/IEEE 802.11i 機能は、次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
WPA-PSK (「WPA-Personal」)
.RE
.RS +4
.TP
.ie t \(bu
.el o
CCMP、TKIP、WEP104、WEP40 の鍵管理
.RE
.sp
.LP
\fBwpad\fR デーモンの停止や開始を行うには、\fBdladm\fR(1M) を使用します。次を使用すると、
.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\fBwpad\fR デーモンが開始されます。次を使用すると、
.sp
.in +2
.nf
# \fBdladm disconnect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
デーモンが停止されます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterface\fR\fR
.ad
.sp .6
.RS 4n
\fBwpad\fR デーモンを開始する WiFi リンクインタフェースを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIpre_shared_key_name\fR\fR
.ad
.sp .6
.RS 4n
WiFi リンクで使用される事前共有鍵を指定します。
.RE

.SH 使用例
.LP
\fB例 1 \fR特定の WiFi リンクでの \fBwpad\fR デーモンの開始
.sp
.LP
WPA 鍵 \fBpsk\fR を作成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
鍵 \fBpsk\fR を使用してリンク \fBath0\fR の ESSID \fBwlan\fR に接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fR特定の WiFi リンクでの \fBwpad\fR デーモンの停止
.sp
.LP
リンク \fBath0\fR のデーモンを停止するには、次のように入力します。

.sp
.in +2
.nf
# \fBdladm disconnect-wifi ath0\fR
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/network/wpa
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBdladm\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBwpad\fR サービスは、サービス管理機能 \fBsmf\fR(5) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/network/wpa:\fI<link>\fR
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスのステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
