Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/zfs.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH zfs 1M "2011 年 8 月 24 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
zfs \- ZFS ファイルシステムの構成
.SH 形式
.LP
.nf
\fBzfs\fR [\fB-?\fR]
.fi

.LP
.nf
\fBzfs\fR \fBhelp\fR \fIsubcommand\fR | help | \fIproperty\fR \fIproperty-name\fR | \fIpermission\fR
.fi

.LP
.nf
\fBzfs\fR \fBcreate\fR [\fB-p\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBcreate\fR [\fB-ps\fR] [\fB-b\fR \fIblocksize\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fB-V\fR \fIsize\fR \fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBdestroy\fR [\fB-rRf\fR] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBdestroy\fR [\fB-rRd\fR] \fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBsnapshot\fR [\fB-r\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR]... 
      \fIfilesystem@snapname\fR|\fIvolume@snapname\fR
.fi

.LP
.nf
\fBzfs\fR \fBrollback\fR [\fB-rRf\fR] \fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBclone\fR [\fB-p\fR] [\fB-K\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fIsnapshot\fR \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBpromote\fR \fIclone-filesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBrename\fR \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR 
     \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBrename\fR [\fB-p\fR] \fIfilesystem\fR|\fIvolume\fR \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBrename\fR \fB-r\fR \fIsnapshot\fR \fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBlist\fR [\fB-rH\fR|\fB-d\fR \fIdepth\fR][\fB-o\fR \fIproperty\fR[,...]] [\fB-t\fR \fItype\fR[,...]]
     [\fB-s\fR \fIproperty\fR] ... [\fB-S\fR \fIproperty\fR] ...
     [\fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR|\fIpath\fR] ...
.fi

.LP
.nf
\fBzfs\fR \fBset\fR [\fB-r\fR] \fIproperty\fR=\fIvalue\fR \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR ...
.fi

.LP
.nf
\fBzfs\fR \fBget\fR [\fB-rHp\fR|\fB-d\fR \fIdepth\fR][\fB-o\fR all | \fIfield\fR[,...]] [\fB-s\fR \fIsource\fR[,...]]
     all | \fIproperty\fR[,...] \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR ...
.fi

.LP
.nf
\fBzfs\fR \fBset\fR share=\fIname\fR=\fIsharename\fR,path=\fIpathname\fR,[desc=\fIdescription\fR],
     prot=\fIsmb\fR | nfs[,\fIproperty\fR=\fIvalue\fR[,...]] \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBset\fR \fB-c\fR share=\fIname\fR=\fIsharename\fR \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBget\fR share [\fIfilesystem\fR]
.fi

.LP
.nf
\fBzfs\fR \fBinherit\fR [\fB-rS\fR] \fIproperty\fR \fIfilesystem\fR|\fIvolume|snapshot\fR ...
.fi

.LP
.nf
\fBzfs\fR \fBupgrade\fR
.fi

.LP
.nf
\fBzfs\fR \fBupgrade\fR [\fB-v\fR]
.fi

.LP
.nf
\fBzfs\fR \fBupgrade\fR [\fB-r\fR] [\fB-V\fR \fIversion\fR] \fB-a\fR | \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBuserspace\fR [\fB-hniHp\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-sS\fR \fIfield\fR] ...
     [\fB-t\fR \fItype\fR [,...]] \fIfilesystem\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBgroupspace\fR [\fB-hniHpU\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-sS\fR \fIfield\fR] ...
     [\fB-t\fR \fItype\fR [,...]] \fIfilesystem\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBmount\fR 
.fi

.LP
.nf
\fBzfs\fR \fBmount\fR [\fB-vOS\fR] [\fB-o \fIoptions\fR\fR] \fB-a\fR | \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBunmount\fR [\fB-f\fR] \fB-a\fR | \fIfilesystem\fR|\fImountpoint\fR
.fi

.LP
.nf
\fBzfs\fR \fBshare\fR \fB-a\fR | \fIdataset\fR
.fi

.LP
.nf
\fBzfs\fR \fBunshare\fR \fB-a\fR \fIdataset\fR|\fImountpoint\fR
.fi

.LP
.nf
\fBzfs\fR \fBsend\fR [\fB-DvRbp\fR] [\fB-\fR[\fBiI\fR] \fIsnapshot\fR] \fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBsend\fR \fB-r\fR [\fB-Dvbcp\fR] [\fB-i\fR \fIsnapshot\fR] \fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBreceive\fR [\fB-vnFu\fR] [[\fB-o\fR \fIproperty\fR=\fIvalue\fR] | [\fB-x\fR \fIproperty\fR]] ...
     \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR
.fi

.LP
.nf
\fBzfs\fR \fBreceive\fR [\fB-vnFu\fR] [[\fB-o\fR \fIproperty\fR=\fIvalue\fR] | [\fB-x\fR \fIproperty\fR]] ...
     [\fB-d\fR | \fB-e\fR] \fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBallow\fR \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBallow\fR [\fB-ldug\fR] \fBeveryone\fR|\fIuser\fR|\fIgroup\fR[,...] \fIperm\fR|\fI@setname\fR[,...] 
     \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBallow\fR [\fB-ld\fR] \fB-e\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBallow\fR \fB-c\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBallow\fR \fB-s\fR @\fIsetname\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBunallow\fR [\fB-rldug\fR] \fBeveryone\fR|\fIuser\fR|\fIgroup\fR[,...] [\fIperm\fR|@\fIsetname\fR[,... ]] 
     \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBunallow\fR [\fB-rld\fR] \fB-e\fR [\fIperm\fR|@\fIsetname\fR[,... ]] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBunallow\fR [\fB-r\fR] \fB-c\fR [\fIperm\fR|@\fIsetname\fR[ ... ]] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBunallow\fR [\fB-r\fR] \fB-s\fR @\fIsetname\fR [\fIperm\fR|@\fIsetname\fR[,... ]] \fIfilesystem\fR|\fIvolume\fR
.fi

.LP
.nf
\fBzfs\fR \fBhold\fR [\fB-r\fR] \fItag\fR \fIsnapshot\fR...
.fi

.LP
.nf
\fBzfs\fR \fBholds\fR [\fB-r\fR] \fIsnapshot\fR...
.fi

.LP
.nf
\fBzfs\fR \fBrelease\fR [\fB-r\fR] \fItag\fR \fIsnapshot\fR...
.fi

.LP
.nf
\fBzfs\fR \fBdiff\fR [\fB-FHte\fR] [\fB-o\fR \fIfield\fR] ... \fIsnapshot\fR [\fIsnapshot\fR|\fIfilesystem\fR]
.fi

.LP
.nf
\fBzfs\fR \fBdiff\fR \fB-E\fR [\fB-FHt\fR] [\fB-o\fR \fIfield\fR] ... \fIsnapshot\fR|\fIfilesystem\fR
.fi

.LP
.nf
\fBzfs\fR \fBkey\fR \fB-l\fR {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}
.fi

.LP
.nf
\fBzfs\fR \fBkey\fR \fB-u\fR [\fB-f\fR] {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}
.fi

.LP
.nf
\fBzfs\fR \fBkey\fR \fB-c\fR [\fB-o\fR \fIkeysource\fR=\fIvalue\fR] {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}
.fi

.LP
.nf
\fBzfs\fR \fBkey\fR \fB-K\fR {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}
.fi

.SH 機能説明
.sp
.LP
\fBzfs\fR コマンドは、\fBZFS\fR ストレージプール内の \fBZFS\fR データセットを構成します。詳細は、\fBzpool\fR(1M) を参照してください。データセットの識別には、\fBZFS\fR 名前空間内部の一意のパスが使用されます。例: 
.sp
.in +2
.nf
pool/{\fIfilesystem\fR,\fIvolume\fR,\fIsnapshot\fR}
.fi
.in -2
.sp

.sp
.LP
この場合、データセット名の最大長は \fBMAXNAMELEN\fR (256 バイト) です。
.sp
.LP
使用できるデータセットは、次のうちのいずれかです。
.sp
.ne 2
.mk
.na
\fB\fIfile system\fR\fR
.ad
.sp .6
.RS 4n
標準のシステム名前空間内にマウントでき、別のファイルシステムのように動作する、\fBfilesystem\fR タイプの \fBZFS\fR データセット。\fBZFS\fR は \fBPOSIX\fR 準拠のファイルシステムとして設計されていますが、既知の問題により、準拠の要件が満たされない場合がいくつかあります。標準準拠に依存しているアプリケーションでは、ファイルシステムの空き領域を調べるときに、標準でない動作のために障害が発生する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
raw デバイスまたはブロック型デバイスとしてエクスポートされた論理ボリューム。このタイプのデータセットは特殊な状況でのみ使用するようにしてください。通常は、ほとんどの環境でファイルシステムが使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
特定の時点におけるファイルシステムまたはボリュームの読み取り専用バージョン。これは、\fIfilesystem@name\fR または \fIvolume@name\fR として指定されます。
.RE

.SS "ZFS ファイルシステム階層"
.sp
.LP
\fBZFS\fR ストレージプールは、データセット用の領域を提供するデバイスの論理コレクションです。ストレージプールは、\fBZFS\fR ファイルシステム階層のルートでもあります。
.sp
.LP
プールのルートにはファイルシステムとしてアクセスできるため、マウントやマウント解除、スナップショットの作成、およびプロパティーの設定などの操作を実行できます。ただし、物理ストレージ特性の管理には、\fBzpool\fR(1M) コマンドを使用します。
.sp
.LP
プールの作成および管理の詳細は、\fBzpool\fR(1M) を参照してください。
.SS "スナップショット"
.sp
.LP
スナップショットは、ファイルシステムまたはボリュームの読み取り専用コピーです。スナップショットはきわめてすばやく作成することができ、最初はプール内で追加の領域を消費しません。アクティブなデータセット内のデータが変更されると、スナップショット用のデータが増加します。これは、本来ならアクティブなデータセットと共有されていたデータです。
.sp
.LP
スナップショットには、任意の名前を付けることができます。ボリュームのスナップショットは、クローンやロールバックを作成することは可能ですが、個別にアクセスすることはできません。
.sp
.LP
ファイルシステムのスナップショットは、ファイルシステムのルートの \fB\&.zfs/snapshot\fR ディレクトリに置かれます。スナップショットは、要求に応じて自動的にマウントされます。また、一定の時間が経過するとスナップショットをマウント解除することもできます。\fB\&.zfs\fR ディレクトリの可視設定は、\fBsnapdir\fR プロパティーで制御できます。
.SS "クローン"
.sp
.LP
クローンとは、別のデータセットと同一の初期内容を持つ書き込み可能なボリュームまたはファイルシステムです。スナップショットの場合と同様に、クローンは瞬間的に作成され、最初は追加の領域を消費しません。
.sp
.LP
クローンは、スナップショットからのみ作成できます。スナップショットのクローンを作成すると、親子間に暗黙の依存関係が作成されます。クローンをデータセット階層内の別の場所に作成した場合でも、クローンが存在するかぎり、元のスナップショットを破棄することはできません。この依存関係は、\fBorigin\fR プロパティーからわかります。それらが存在する場合には、\fB destroy\fR コマンドを実行すると表示されます。
.sp
.LP
\fBpromote\fR サブコマンドを使えば、クローンの親子依存関係を逆転させることができます。これを行うと、「元」のファイルシステムが、指定されたファイルシステムのクローンになります。このため、クローンの作成元のファイルシステムを破棄できるようになります。
.SS "マウントポイント"
.sp
.LP
\fBZFS\fR ファイルシステムは簡単な操作で作成できるため、システムごとのファイルシステムの数はかなり多くなる可能性があります。この状況に対応するため、\fB/etc/vfstab\fR ファイルを編集しなくても、\fBZFS\fR はファイルシステムのマウントおよびマウント解除を自動的に管理します。自動管理されるすべてのファイルシステムは、ブート時に \fBZFS\fR によりマウントされます。
.sp
.LP
デフォルトでは、ファイルシステムは \fB/\fIpath\fR\fR 以下にマウントされます。ここで、\fIpath\fR は \fBZFS\fR 名前空間内のファイルシステムの名前です。ディレクトリが、必要に応じて作成および破棄されます。
.sp
.LP
また、\fBmountpoint\fR プロパティーにファイルシステムのマウントポイントを設定することも可能です。このディレクトリは必要に応じて作成され、\fBzfs mount -a\fR コマンドの呼び出し時に \fBZFS\fR によりファイルシステムが自動的にマウントされます (\fB/etc/vfstab\fR の編集は不要)。この \fBmountpoint\fR プロパティーは継承可能です。このため、\fBpool/home\fR が \fB/export/stuff\fR のマウントポイントを保持する場合、\fBpool/home/user\fR は自動的に \fB/export/stuff/user\fR のマウントポイントを継承します。
.sp
.LP
\fBzfs mount\fR コマンドに \fB-o\fR \fBmountpoint=\fR\fIvalue\fR オプションを指定すると、ファイルシステムの永続的なマウントポイント以外の場所に、ファイルシステムを一時的にマウントできます。これは、レガシーマウントポイントを持つファイルシステムで可能です。
.sp
.LP
ファイルシステムの \fBmountpoint\fR プロパティーが \fBnone\fR の場合、ファイルシステムはマウントされません。
.sp
.LP
必要に応じ、従来のツール (\fBmount\fR、\fBumount\fR、\fB/etc/vfstab\fR) を使って \fBZFS\fR ファイルシステムを管理することもできます。ファイルシステムのマウントポイントが \fBlegacy\fR に設定されている場合、\fBZFS\fR はファイルシステムの管理を試みません。管理者が、ファイルシステムのマウントおよびマウント解除を担当します。
.SS "ゾーン"
.sp
.LP
追加したファイルシステムの物理プロパティーの制御は、大域管理者が行います。ただし、ゾーン管理者は、追加したファイルシステム内部のファイルを、ファイルシステムのマウント方法に対応した方法で作成、変更、または破棄できます。
.sp
.LP
データセットを非大域ゾーンに委任する場合は、\fBzonecfg\fR \fBadd dataset\fR サブコマンドを使用します。データセットをあるゾーンに委任し、同じデータセットの子を別のゾーンに委任することはできません。ゾーン管理者は、データセットおよびそのすべての子のプロパティーを変更できます。ただし、\fBquota\fR プロパティーの制御は、大域管理者が行います。
.sp
.LP
\fBZFS\fR ボリュームをデバイスとして非大域ゾーンに追加するには、\fBzonecfg\fR \fBadd device\fR サブコマンドを使用します。ただし、その物理プロパティーを変更できるのは大域管理者だけです。
.sp
.LP
\fBzonecfg\fR の構文の詳細は、\fBzonecfg\fR(1M) を参照してください。
.sp
.LP
データセットが非大域ゾーンに委任されると、\fBzoned\fR プロパティーが自動的に設定されます。ゾーン設定したファイルシステムは、一時的な \fBmountpoint\fR プロパティー (「一時的なマウントポイントプロパティー」を参照) を使用することによってのみ、大域ゾーンでマウントできます。
.sp
.LP
大域管理者は \fBzoned\fR プロパティーを強制的にクリアできます。ただし、この操作は特に慎重に行うようにしてください。大域管理者は、このプロパティーをクリアする前に、すべてのマウントポイントが受け入れられるものであることを確認してください。
.SS "複製解除"
.sp
.LP
複製解除とは、冗長なデータをブロックレベルで削除することにより、格納されているデータの合計容量を減らすプロセスです。複製解除はプール全体に及びますが、データセットごとにそれぞれの \fBdedup\fR プロパティーを使用すると、適用するかしないかを選択できます。ファイルシステムで \fBdedup\fR プロパティーが有効になっている場合、重複しているデータブロックは書き込み時に一斉に削除されます。この結果、ただ 1 つの一意のデータが格納され、共通するコンポーネントが、プール内の \fBdedup\fR が有効になっているすべてのデータセットのファイル間で共有されます。
.SS "暗号化"
.sp
.LP
ZFS 暗号化および ZFS 暗号化構文についての完全な説明は、\fBzfs_encrypt\fR(1M) を参照してください。
.SS "ネイティブプロパティー"
.sp
.LP
プロパティーは、ネイティブプロパティーとユーザー定義 (ユーザー) プロパティーの 2 種類に分けられます。ネイティブプロパティーは、内部統計情報を提供するか、\fBZFS\fR の動作を制御します。また、ネイティブプロパティーは編集可能であるか、読み取り専用です。ユーザープロパティーは \fBZFS\fR の動作には影響を及ぼしませんが、ユーザーの環境で意味のある方法でデータセットに注釈を付けるのに利用できます。ユーザープロパティーの詳細は、後述の「ユーザープロパティー」の節を参照してください。
.sp
.LP
すべてのデータセットは、データセットに関する統計情報を提供したり、さまざまな動作を制御したりするプロパティーセットを持っています。プロパティーは、子により上書きされないかぎり、親から継承されます。一部のプロパティーは、特定のタイプのデータセット (ファイルシステム、ボリューム、またはスナップショット) にのみ適用されます。
.sp
.LP
数値プロパティーの値は、人間が読み取ることのできるサフィックス (\fBk\fR、\fBKB\fR、\fBM\fR、\fBGb\fR など) を使用すると指定できます。使用可能な最大サフィックスは \fBZ\fR (z バイト) です。次の指定はすべて有効 (および等価) です。 
.sp
.in +2
.nf
1536M, 1.5g, 1.50GB
.fi
.in -2
.sp

.sp
.LP
数値以外のプロパティーの値は、大文字と小文字が区別されるため、\fBmountpoint\fR プロパティーを除いて小文字にする必要があります。
.sp
.LP
次のネイティブプロパティーは、データセットに関する統計データを表示するものです。これらのプロパティーは、設定することも継承することもできません。ネイティブプロパティーは、特に注記がないかぎり、すべてのデータセットタイプに適用されます。
.sp
.ne 2
.mk
.na
\fB\fBavailable\fR\fR
.ad
.sp .6
.RS 4n
データセットおよびその子すべてが使用可能な容量。プール内にその他のアクティビティーが存在しないものとして計算されます。容量はプール内で共有されるため、プールの物理サイズ、割り当て、予約、プール内のほかのデータセットなどのさまざまな要因によって、利用できる容量が制限されることがあります。
.sp
このプロパティーは、列の短縮名 \fBavail\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcompressratio\fR\fR
.ad
.sp .6
.RS 4n
このデータセットに対して達成された圧縮比。乗数で表記されます。\fBzfs set compression=on \fIdataset\fR\fR を実行すると、圧縮を有効にできます。デフォルト値は \fBoff\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcreation\fR\fR
.ad
.sp .6
.RS 4n
このデータセットが作成された時刻。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefer_destroy\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs destroy\fR \fB-d\fR コマンドを使ってスナップショットの遅延破棄が予約されている場合、プロパティーがオンになります。\fB\fRそれ以外の場合、このプロパティーはオフです。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBkeystatus\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmounted\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムの場合は、ファイルシステムが現在マウントされているかどうかを示します。このプロパティーは、\fByes\fR または \fBno\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBorigin\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムまたはボリュームのクローンを作成した場合は、クローンの作成元のスナップショット。クローンが存在するかぎり、\fB-r\fR や \fB-f\fR オプションを使用しても、作成元は破棄できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreferenced\fR\fR
.ad
.sp .6
.RS 4n
このデータセットでアクセス可能なデータ量。これは、プール内のほかのデータセットと共有される場合も、共有されない場合もあります。スナップショットまたはクローンを作成したときには、それらの作成元のファイルシステムまたはスナップショットと同じ領域を最初は参照しています。内容が同じであるためです。
.sp
このプロパティーは、列の短縮名 \fBrefer\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrekeydate\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtype\fR\fR
.ad
.sp .6
.RS 4n
データセットのタイプ。\fBfilesystem\fR、\fBvolume\fR、\fBsnapshot\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBused\fR\fR
.ad
.sp .6
.RS 4n
このデータセットおよびそのすべての子孫が消費する容量を調べます。この値は、このデータセットの割り当ておよび予約に基づいて計算されます。使用されている容量には、このデータセットの予約は含まれませんが、(\fBusedbyrefreservation\fR による) \fBrefreservation\fR 、および (\fBusedbychildren\fR による) 子孫データセットの予約が考慮されます。データセットがその親から継承して使用する容量、およびこのデータセットが再帰的に破棄されるときに解放される容量は、使用済み領域と予約のどちらか大きい方になります。
.sp
スナップショット (「スナップショット」の節を参照) を作成したときは、それらの領域は最初はスナップショットとファイルシステムの間で共有されます。それまでに作成したスナップショットと領域が共有されることもあります。ファイルシステムが変化していくにつれて、それまで共有されていた領域がスナップショット固有になり、スナップショットが使用する領域に計上されます。また、スナップショットを削除すると、ほかのスナップショットに固有の (および使用される) 容量を増やすことができます。
.sp
使用している容量、使用できる容量、または参照する容量では、保留状態の変更は考慮されません。保留状態の変更は通常、数秒以内に計上されます。\fBfsync\fR(3c) や \fBO_SYNC\fR を使用してディスクへの変更をコミットしても、領域の使用状況の情報がすぐに更新されることが保証されているわけではありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusedby*\fR\fR
.ad
.sp .6
.RS 4n
\fBusedby*\fR プロパティーは、\fBused\fR プロパティーをその領域のさまざまな使用理由に分解します。具体的には、\fBused\fR = \fBusedbychildren\fR + \fBusedbydataset\fR + \fBusedbyrefreservation\fR + \fB usedbysnapshots\fR となります。これらのプロパティーは、「version 13」またはそれ以上のプールで作成されたデータセットでのみ使用可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusedbychildren\fR\fR
.ad
.sp .6
.RS 4n
このデータセットの子によって使用される容量。この容量は、データセットのすべての子が破棄された場合に解放されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusedbydataset\fR\fR
.ad
.sp .6
.RS 4n
このデータセット自体によって使用される容量。この容量は、データセットが破棄された場合に解放されます (まず \fBrefreservation\fR をすべて削除し、必要に応じてスナップショットや子孫を破棄したあと)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusedbyrefreservation\fR\fR
.ad
.sp .6
.RS 4n
このデータセットの \fBrefreservation\fR セットによって使用される容量。この容量は、\fBrefreservation\fR が削除された場合に解放されます。
.sp
このプロパティーで計上される容量は、将来の書き込みによって見込まれる消費量を表しており、このデータセット内での書き込み割り当ての失敗を防止するためにあらかじめ予約されています。これには、未書き込みデータ、現在スナップショットと共有されている容量、および (圧縮率の低いデータと置き換えると失われる可能性がある) ボリュームの圧縮保存が含まれます。将来の書き込み用に容量を割り当てると、\fBusedbydataset\fR または \fBusedbysnapshots\fR が増え、それに応じて \fBusedbyrefreservation\fR が減ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusedbysnapshots\fR\fR
.ad
.sp .6
.RS 4n
このデータセットのスナップショットによって消費される容量。具体的には、これはデータセットのスナップショットがすべて破棄された場合に解放される容量です。ただし、これは、スナップショットの \fBused\fR プロパティーの単なる合計ではありません。なぜならば、領域は、複数のスナップショットによって共有されることがあるからです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBuserused@\fR\fIuser\fR\fR
.ad
.sp .6
.RS 4n
指定されたユーザーによって消費される、このデータセットの容量。容量は、\fBls\fR \fB-l\fR で表示される各ファイルの所有者にチャージされます。チャージされた容量は \fBdu\fR および \fBls\fR \fB-s\fR で表示されます。詳細は、\fBzfs userspace\fR サブコマンドを参照してください。
.sp
非特権ユーザーは、自身の領域使用状況のみを確認できます。root ユーザー、または \fBzfs allow\fR で \fBuserused\fR 特権を付与されているユーザーは、あらゆるユーザーの使用状況にアクセスできます。
.sp
\fBuserused@\fR... プロパティーは \fBzfs get all\fR では表示されません。\fB@\fR 記号のあとに、次のいずれかの形式でユーザーの名前を付加する必要があります。
.RS +4
.TP
.ie t \(bu
.el o
\fIPOSIX 名\fR (例: \fBjoe\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIPOSIX 数値 ID\fR (例: \fB789\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fISID 名\fR (例: \fBjoe.smith@mydomain\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fISID 数値 ID\fR (例: \fBS-1-123-456-789\fR)
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBuserrefs\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、このスナップショットでユーザーを保持する数に設定されます。ユーザーの保持は、\fBzfs hold\fR コマンドを使用して設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroupused@\fR\fIgroup\fR\fR
.ad
.sp .6
.RS 4n
指定されたグループによって消費される、このデータセットの容量。容量は、\fBls\fR \fB-l\fR で表示される各ファイルのグループにチャージされます。詳細は、\fBuserused@\fR\fIuser\fR プロパティーを参照してください。
.sp
非特権ユーザーは、自身のグループの領域使用状況のみを確認できます。root ユーザー、または \fBzfs allow\fR で \fBgroupuse\fR 特権を付与されているユーザーは、あらゆるグループの使用状況にアクセスできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvolblocksize\fR=\fIblocksize\fR\fR
.ad
.sp .6
.RS 4n
ボリュームの場合に、ボリュームのブロックサイズを指定します。ボリュームが書き込まれたあとで、\fBblocksize\fR を変更することはできません。このため、このプロパティーはボリュームの作成時に設定してください。ボリュームのデフォルトの \fBblocksize\fR は 8K バイトです。512 バイト - 1M バイトの範囲で、任意の 2 の累乗を指定できます。
.sp
このプロパティーは、列の短縮名 \fB volblock\fR を使用して参照することもできます。
.RE

.sp
.LP
次のネイティブプロパティーを使用すると、\fBZFS\fR データセットの動作を変更できます。
.sp
.ne 2
.mk
.na
\fB\fBaclmode\fR=\fBdiscard\fR | \fBmask\fR | \fBpassthrough\fR\fR
.ad
.sp .6
.RS 4n
\fBchmod\fR(2) の実行時の ACL の変更方法を制御します。「\fBaclmode\fR」プロパティーが「\fBdiscard\fR」(デフォルト) であるファイルシステムでは、ファイルのモードを表さない ACL エントリがすべて削除されます。「\fBaclmode\fR」プロパティーが「\fBmask\fR」の場合、ユーザーまたはグループアクセス権を削減します。アクセス権は、グループアクセス権ビットと同程度にまで削減されます。ただし、アクセス権がファイルまたはディレクトリの所有者と同じ UID を持つユーザーエントリである場合を除きます。この場合、ACL アクセス権は、所有者のアクセス権ビットと同程度にまで削減されます。\fBmask\fR はモード変更の前後で ACL を保持し、次のモード変更があるまでの間 (\fBchmod\fR(1) によって) ACL を明示的に設定しません。\fBaclmode\fR プロパティーが \fBpassthrough\fR であるファイルシステムでは、ファイルまたはディレクトリの新規モードを表す必須の ACL エントリを生成する以外、ACL に変更は加えられません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBaclinherit\fR=\fBdiscard\fR | \fBnoallow\fR | \fBrestricted\fR | \fBpassthrough\fR | \fBpassthrough-x\fR\fR
.ad
.sp .6
.RS 4n
ファイルとディレクトリが作成されるときに \fBACL\fR エントリをどのように継承するかを制御します。\fBaclinherit\fR プロパティーが \fBdiscard\fR であるファイルシステムは、\fBACL\fR エントリを一切継承しません。\fBaclinherit\fR プロパティーが \fBnoallow\fR であるファイルシステムは、「deny」アクセス権を指定する、継承可能な \fBACL\fR エントリのみを継承します。プロパティー値 \fBrestricted\fR (デフォルト) は、\fBACL\fR エントリの継承時に \fBwrite_acl\fR および \fBwrite_owner\fR アクセス権を削除します。\fBaclinherit\fR プロパティー値が \fBpassthrough\fR であるファイルシステムは、継承時に \fBACL\fR エントリに加えられた変更を除く、継承可能なすべての \fBACL\fR エントリを継承します。\fBaclinherit\fR プロパティー値が \fBpassthrough-x\fR であるファイルシステムは、\fBpassthrough\fR と同じ意味ですが、ファイル作成モードでも実行ビットが必要とされる場合のみすべての \fBACE\fR が実行権を継承する点が異なります。
.sp
プロパティー値が \fBpassthrough\fR に設定されている場合は、継承可能な \fBACE\fR によって決定されるモードでファイルが作成されます。モードに影響を与える継承可能な \fBACE\fR が存在しない場合は、アプリケーションから要求されたモードに従ってモードが設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBatime\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
ファイルを読み取るときにファイルのアクセス時刻を更新するかどうかを制御します。このプロパティーをオフに設定すると、ファイルを読み取るときに書き込みトラフィックが生成されなくなるため、パフォーマンスが大幅に向上する可能性があります。ただし、メールプログラムなどのユーティリティーが予期しない動作をすることがあります。デフォルト値は \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcanmount\fR=\fBon\fR | \fBoff\fR | \fBnoauto\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーが \fBoff\fR に設定されている場合、ファイルシステムはマウントできず、\fBzfs mount -a\fR を実行しても無視されます。このプロパティーを \fBoff\fR に設定することは、\fBmountpoint\fR プロパティーを \fBnone\fR に設定することに似ていますが、継承可能な通常の \fBmountpoint\fR プロパティーをデータセットが引き続き保持する点が異なります。このプロパティーを \fBoff\fR に設定することによって、データセットをプロパティー継承のメカニズムとしてのみ使用できるようになります。\fBcanmount=\fR\fBoff\fR を設定する 1 つの例として、2 つのデータセットが同じ \fBmountpoint\fR を保持するようにできます。これにより、両方のデータセットの子が同じディレクトリ内に表示されますが、継承する特性は異なります。
.sp
\fBnoauto\fR オプションを設定すると、データセットのマウントおよびマウント解除は明示的に実行することが必要になります。データセットの作成時やインポート時に、データセットが自動的にマウントされることはありません。また、\fBzfs mount -a\fR コマンドでマウントされることや、\fBzfs unmount -a\fR コマンドでマウント解除されることもありません。
.sp
このプロパティーは継承されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBchecksum\fR=\fBon\fR | \fBoff\fR | \fBfletcher2,\fR| \fBfletcher4\fR | \fBsha256\fR | \fBsha256+mac\fR\fR
.ad
.sp .6
.RS 4n
データの整合性を検証するために使用するチェックサムを制御します。デフォルト値 \fBon\fR では、適切なアルゴリズムが自動的に選択されます。現在、アルゴリズムは \fBfletcher4\fR ですが、将来のリリースで変更される可能性があります。値が \fBoff\fR の場合、ユーザーデータの整合性チェックが無効になります。チェックサムの無効化は、推奨されていない操作です。\fB\fR
.sp
このプロパティーを変更した場合、影響を受けるのは新しく書き込まれるデータのみです。
.sp
\fBsha256+mac\fR の値は、暗号化が有効な場合にのみ使用できます。暗号化が有効な場合、チェックサムプロパティーは \fBreadonly\fR になり、常に \fBsha256+mac\fR に設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcompression\fR=\fBon\fR | \fBoff\fR | \fBlzjb\fR | \fBgzip\fR | \fBgzip-\fR\fIN\fR | \fBzle\fR\fR
.ad
.sp .6
.RS 4n
このデータセットで使用される圧縮アルゴリズムを制御します。\fBlzjb\fR 圧縮アルゴリズムは、優れたデータ圧縮と同時に最適なパフォーマンスを提供します。圧縮を \fBon\fR に設定すると、\fBlzjb\fR 圧縮アルゴリズムが使用されます。\fBgzip\fR 圧縮アルゴリズムは、\fBgzip\fR(1) コマンドと同じ圧縮を使用します。\fBgzip\fR のレベルは、値 \fBgzip-\fR\fIN\fR を使用すると指定できます。この \fIN\fR は、1 (最速) - 9 (最大圧縮率) の整数です。現在、\fBgzip\fR は \fBgzip-6\fR に相当します (これは \fBgzip\fR(1) のデフォルトでもある)。
.sp
このプロパティーは、列の短縮名 \fBcompress\fR を使用して参照することもできます。このプロパティーを変更した場合、影響を受けるのは新しく書き込まれるデータのみです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcopies\fR=\fB1\fR | \fB2\fR | \fB3\fR\fR
.ad
.sp .6
.RS 4n
このデータセットに関して保存されるデータのコピー数を制御します。これらのコピーは、ミラーリングや RAID-Z など、プールがもたらす冗長性を補うものです。コピーは、可能であれば別のディスクに格納されます。複数のコピーによって使用される容量は、関連するファイルとデータセットにチャージされます。したがって、\fBused\fR プロパティーが変更され、割り当てと予約が減らされます。
.sp
このプロパティーを変更した場合、影響を受けるのは新しく書き込まれるデータのみです。したがって、このオプションは、ファイルシステムの作成時に \fB-o\fR \fBcopies=\fR\fIN\fR オプションを使用して設定してください。
.sp
データセットで暗号化が有効な場合、コピーは最大値の \fB2\fR に設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdedup\fR=\fBon\fR | \fBoff\fR | \fBverify\fR | \fBsha256\fR[,\fBverify\fR]\fR
.ad
.sp .6
.RS 4n
データセットに対して複製解除を適用するかどうかを制御します。デフォルト値は \fBoff\fR です。複製解除に使用されるデフォルトのチェックサムは \fBsha256\fR です (変更される可能性があります)。\fBdedup\fR が有効な場合、\fBdedup\fR チェックサムアルゴリズムによって \fBchecksum\fR プロパティーが上書きされます。値を \fBverify\fR に設定することは、\fBsha256,verify\fR を指定することと同等です。
.sp
プロパティーが \fBverify\fR に設定されている場合、ZFS は、2 つのブロックに同じ署名があるときはいつでも既存のブロックとバイト単位の比較を行なって、内容が同一であることを確認します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdevices\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
このファイルシステムでデバイスノードを開くことができるかどうかを制御します。デフォルト値は \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBexec\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
このファイルシステム内部からプロセスを実行可能かどうかを制御します。デフォルト値は \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlogbias\fR = \fBlatency\fR | \fBthroughput\fR\fR
.ad
.sp .6
.RS 4n
このデータセットに対する同期要求を ZFS で最適化する方法を制御します。\fBlogbias\fR が \fBlatency\fR に設定されている場合、ZFS はプールに別個のログデバイスが存在すればそれを使用して、短い待ち時間で要求を処理します。\fBlogbias\fR が \fBthroughput\fR に設定されている場合、ZFS はプールの別個のログデバイスを使用しません。その代わりに、ZFS は大域プールのスループットとリソースの使用効率を優先して同時操作を最適化します。デフォルト値は \fBlatency\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmlslabel\fR=\fIlabel\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
\fBmlslabel\fR プロパティーは、Trusted Extensions が有効なシステムでデータセットをゾーンにマウントできるかどうかを指定する機密ラベルです。ラベル付きのデータセットがラベル付きのゾーンに一致する場合、データセットは、そのラベル付きのゾーンからマウントしてアクセスできます。
.sp
\fBmlslabel\fR プロパティーが設定されていない場合、デフォルト値は \fBnone\fR です。\fBmlslabel\fR プロパティーを \fBnone\fR に設定することは、このプロパティーを削除することと同等です。
.sp
Trusted Extensions が有効になっていて、適切な特権がある場合にのみ、\fBmlslabel\fR プロパティーを変更できます。このプロパティーを変更する権利は委任できません。ラベルを上位のラベルに変更したり、初期データセットラベルを設定したりするときには、\fB{PRIV_FILE_UPGRADE_SL}\fR 特権が必要です。ラベルを下位のラベルまたはデフォルト (\fBnone\fR) に変更するときには、\fB{PRIV_FILE_DOWNGRADE_SL}\fR 特権が必要です。デフォルト以外のラベルへのデータセットの変更は、データセットがマウントされていない場合にのみ実行できます。デフォルトのラベルのデータセットがラベル付きのゾーンにマウントされると、マウント操作によって、\fBmlslabel\fR プロパティーがそのゾーンのラベルに自動的に設定されます。
.sp
Trusted Extensions が有効になって\fBいない\fR場合、デフォルトラベル (\fBnone\fR) のデータセットだけをマウントできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmountpoint\fR=\fIpath\fR | \fBnone\fR | \fBlegacy\fR\fR
.ad
.sp .6
.RS 4n
このファイルシステムで使用されるマウントポイントを制御します。このプロパティーの使用方法の詳細は、「マウントポイント」の節を参照してください。 
.sp
ファイルシステムの \fBmountpoint\fR プロパティーを変更すると、そのマウントポイントを継承するファイルシステムおよびそのすべての子がマウント解除されます。新しい値が \fBlegacy\fR の場合は、マウントが解除されたままになります。それ以外のときは、プロパティーの古い値が \fBlegacy\fR または \fBnone\fR だった場合、またはプロパティーが変更される前にマウントされていた場合は、自動的に再マウントされます。また、共有されていたすべてのファイルシステムは、共有が解除されてから新しい場所で共有されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnbmand\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprimarycache\fR=\fBall\fR | \fBnone\fR | \fBmetadata\fR\fR
.ad
.sp .6
.RS 4n
一次キャッシュ (ARC) にキャッシュされる内容を制御します。このプロパティーを \fBall\fR に設定すると、ユーザーデータとメタデータの両方がキャッシュされます。このプロパティーを \fBnone\fR に設定すると、ユーザーデータもメタデータもキャッシュされません。このプロパティーを \fBmetadata\fR に設定すると、メタデータのみがキャッシュされます。デフォルト値は \fBall\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBquota\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
データセットおよびその子孫が消費できる容量を制限します。このプロパティーにより、使用される容量に対して強い制限値が設定されます。これには、子孫の消費する容量すべて (ファイルシステムとスナップショットを含む) が含まれます。割り当て制限がすでに設定されているデータセットの子孫に割り当て制限を設定した場合は、祖先の割り当て制限は上書きされずに、制限が追加されます。
.sp
ボリュームには割り当て制限を設定できません。\fBvolsize\fR プロパティーが暗黙的な割り当て制限として機能します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsync=standard\fR | \fBalways\fR | \fBdisabled\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムトランザクションを同期する程度を指定します。このプロパティーは、データセットの作成時に設定することも動的に設定することもでき、ただちに有効になります。このプロパティーは、次の設定のうちの 1 つを持つことができます。
.sp
.ne 2
.mk
.na
\fB\fBstandard\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのオプション。同期するファイルシステムトランザクションがインテントログに書き込まれてから、書き込まれたすべてのデバイスがフラッシュされ、データが安定した状態になるように (つまり、デバイスコントローラによってキャッシュされないように) します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBalways\fR\fR
.ad
.sp .6
.RS 4n
各ファイルシステムトランザクションが書き込まれ、安定した記憶領域にフラッシュされます。この値はパフォーマンスに非常に不利な状況をもたらしますが、同期するフィルシステムトランザクションのトラブルシューティングには適切な場合があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisabled\fR\fR
.ad
.sp .6
.RS 4n
同期要求は無効になります。ファイルシステムトランザクションは、次の DMU トランザクショングループの確定時にのみ安定した記憶領域に確定されるため、処理が行われるまで数秒かかる場合があります。この設定はパフォーマンスにとって最適です。ただし、データベースや NFS などのアプリケーションの同期トランザクション要求を ZFS が無視するため、これは非常に危険な設定です。さらに、現在アクティブなルートまたは \fB/var\fR ファイルシステムに対してこの設定を有効にした場合、仕様外の動作、アプリケーションデータの損失、およびリプレイ攻撃に対する脆弱性の増大が生じる可能性があります。管理者は、これらのリスクを理解した上でこのオプションを使用するようにしてください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBuserquota@\fR\fIuser\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
指定されたユーザーによって消費される容量を制限します。\fBuserquota\fR の容量計算では、\fBrefquota\fR プロパティーと同様に、スナップショットやクローンなど、子孫データセットによって使用される容量は含まれません。ユーザーの容量消費は \fBuserspace@\fR\fIuser\fR プロパティーで特定されます。
.sp
ユーザーの割り当て制限が適用されるまでに数秒かかることがあります。この遅延のために、ユーザーが自分の割り当て量を超えてから、システムがそのユーザーの割り当て超過を認識することがあります。この場合、システムは追加の書き込みを拒否するようになり、\fBEDQUOT\fR エラーメッセージを表示します。詳細は、\fBzfs userspace\fR サブコマンドを参照してください。
.sp
非特権ユーザーは、自身のグループの領域使用状況のみを確認できます。root ユーザー、または \fBzfs allow\fR で \fBuserquota\fR 特権を付与されているユーザーは、あらゆるユーザーの割り当てを取得および設定できます。
.sp
このプロパティーは、ボリューム、バージョン 4 よりも古いファイルシステム、またはバージョン 15 よりも古いプールでは使用できません。\fBuserquota@\fR... プロパティーは \fBzfs get all\fR では表示されません。\fB@\fR 記号のあとに、次のいずれかの形式でユーザーの名前を付加する必要があります。
.RS +4
.TP
.ie t \(bu
.el o
\fIPOSIX 名\fR (例: \fBjoe\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIPOSIX 数値 ID\fR (例: \fB789\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fISID 名\fR (例: \fBjoe.smith@mydomain\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fISID 数値 ID\fR (例: \fBS-1-123-456-789\fR)
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroupquota@\fR\fIgroup\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
指定されたグループによって消費される容量を制限します。グループの容量消費は \fBuserquota@\fR\fIuser\fR プロパティーで特定されます。
.sp
非特権ユーザーは、自身のグループの領域使用状況のみを確認できます。root ユーザー、または \fBzfs allow\fR で \fBgroupquota\fR 特権を付与されているユーザーは、あらゆるグループの割り当てを取得および設定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
このデータを変更できるかどうかを制御します。デフォルト値は \fBoff\fR です。
.sp
このプロパティーは、列の短縮名 \fBrdonly\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrecordsize\fR=\fIsize\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムに格納するファイルの推奨ブロックサイズを指定します。このプロパティーは、レコードサイズが固定されているファイルにアクセスするデータベースワークロードだけで使用するように設計されています。\fBZFS\fR では、標準的なアクセスパターンに最適化された内部アルゴリズムに従って、ブロックサイズが自動的に調整されます。 
.sp
作成されるファイルのサイズが非常に大きく、それらのファイルにさまざまなパターンの小さなブロック単位でアクセスするデータベースの場合には、このようなアルゴリズムが最適でないことがあります。\fBrecordsize\fR にデータベースのレコードサイズ以上の値を設定すると、パフォーマンスが大きく向上することがあります。このプロパティーを汎用目的のファイルシステムに使用することは、パフォーマンスが低下する可能性があるため、できるだけ避けてください。
.sp
デフォルトのレコードサイズは 128K バイトです。指定するサイズは、512 バイト - 1M バイトの 2 の累乗にしてください。
.sp
ファイルシステムの \fBrecordsize\fR の変更は、その後に作成したファイルにのみ適用され、既存のファイルと受信データには影響しません。
.sp
このプロパティーは、列の短縮名 \fBrecsize\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrefquota\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
1 つのデータセットが消費できる容量を制限します。このプロパティーにより、使用される容量に対して強い制限値が設定されます。この強い制限値には、ファイルシステムやスナップショットなどの子孫で使用される容量は含まれません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrefreservation\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
データセットに保証される最小容量。子孫で使用される容量は含まれません。\fBusedbydataset\fR の容量がこの値を下回っているデータセットは、\fBrefreservation\fR で指定された容量を使用していると見なされます。\fBusedbyrefreservation\fR の数値は、この追加の容量を表します。この値はデータセットにチャージされる \fBused\fR の合計容量に加算され、さらに親データセットの使用状況、割り当て、および予約のために消費されます。これにより、将来の書き込み用の容量があらかじめ予約されるようにして、プールリソースの過剰な割り当てからデータセットを保護します。
.sp
スナップショットと共有される容量は、あとで新しいデータに置き換えることが可能で、そのスナップショットは、両方のコピーが確実に保持されることを表します。\fBrefreservation\fR が設定されている場合、新しいスナップショットを取得するときに \fBusedbyrefreservation\fR を \fBrefreservation\fR と同じサイズにまで増やして、コピーが確実に保持されるようにする必要があります。この増加に使用できる十分な容量がデータセットにない場合、スナップショットの作成は拒否されます。
.sp
このプロパティーは、列の短縮名 \fBrefreserv\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreservation\fR=\fIsize\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
データセットおよびその子孫に保証される最小容量。使用している容量がこの値を下回っているデータセットは、予約に指定された容量を使用していると見なされます。予約は、親データセットが使用する容量に計上されるので、親データセットの割り当てと予約を減らすことになります。
.sp
このプロパティーは、列の短縮名 \fB reserv\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrstchown\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
ユーザーが \fBchown\fR(1) または \fBchown\fR(2) システムコールでファイルの所有権を与えることをファイルシステムで制限するかどうかを指定します。デフォルトでは \fBchown\fR を制限します。\fBrstchown\fR が \fBoff\fR になっている場合、\fBchown\fR はユーザーが \fBPRIV_FILE_CHOWN_SELF\fR 特権を持っている場合と同様に動作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecondarycache\fR=\fBall\fR | \fBnone\fR | \fBmetadata\fR\fR
.ad
.sp .6
.RS 4n
二次キャッシュ (L2ARC) にキャッシュされる内容を制御します。このプロパティーを \fBall\fR に設定すると、ユーザーデータとメタデータの両方がキャッシュされます。このプロパティーを \fBnone\fR に設定すると、ユーザーデータもメタデータもキャッシュされません。このプロパティーを \fBmetadata\fR に設定すると、メタデータのみがキャッシュされます。デフォルト値は \fBall\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsetuid\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
設定された \fBUID\fR ビットが、このシステムで順守されるかどうかを制御します。デフォルト値は \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshadow\fR=\fIURI\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
ZFS ファイルシステムを、\fIURI\fR によって記述されたファイルシステムの「シャドウ」として識別します。 データは、\fIURI\fR によって識別されるファイルシステムから、このプロパティーが設定されたシャドウファイルシステムに移行します。移行するファイルシステムは、完全に移行するために読み取り専用にする必要があります。
.sp
まだ移行されていないシャドウファイルシステム内のディレクトリへのアクセスは、ディレクトリ全体が移行されるまでブロックされます。まだ移行されていないシャドウファイルシステム内のファイルにアクセスすると、アクセスしたファイルの一部のみが移行されます。複数のプロセスによって、ファイルの異なる部分を同時に移行できます。
.sp
2 つの形式の URI を使用できます。1 つは同じ物理システム上でローカルファイルシステムから別のファイルシステムへの移行用で、もう 1 つは NFS サーバーからのリモートでのファイルシステムの移行用です。形式は次のとおりです。
.sp
.in +2
.nf
file:///\fIpath\fR
nfs://\fIhost\fR/\fIpath\fR
.fi
.in -2
.sp

移行が完了したとき \fBshadowd\fR(1M) がまだ実行中の場合、ファイルシステムは自動的に再マウントされ、シャドウプロパティーは \fBnone\fR に設定されます。または、移行が完了したとき、シャドウプロパティーを手動で \fBnone\fR に設定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsharenfs\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsharesmb\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsnapdir\fR=\fBhidden\fR | \fBvisible\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムのルートで、\fB\&.zfs\fR ディレクトリを非表示にするか、表示するかを制御します。詳細は、「スナップショット」の節を参照してください。デフォルト値は \fBhidden\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBversion\fR=\fB1\fR|\fB2\fR|\fBcurrent\fR\fR
.ad
.sp .6
.RS 4n
このファイルシステムのディスク上バージョン。プールのバージョンとは無関係です。このプロパティーに設定できるのは、より新しい、サポートされているバージョンのみです。\fBzfs upgrade\fR コマンドを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvolsize\fR=\fIsize\fR\fR
.ad
.sp .6
.RS 4n
ボリュームの論理サイズを指定します。デフォルトでは、ボリュームを作成するときに確立される \fBrefreservation\fR は、ZFS メタデータのオーバーヘッドを考慮に入れるため、実際の論理ボリュームサイズよりもいくらか大きくなります。\fBvolsize\fR への変更があった場合には、\fBrefreservation\fR にも同様の変更が反映されます。\fBvolsize\fR に設定可能な値は、\fBvolblocksize\fR の倍数だけです。この値をゼロにすることはできません。
.sp
\fBrefreservation\fR は、利用者の予期しない動作を避けるためにボリュームに設定されます。予約を使用しない場合、ボリュームの使用方法によっては、ボリュームの容量が不足して未定義の動作またはデータ破壊が発生する可能性があります。このような影響は、ボリュームの使用中にボリュームサイズを変更した場合にも発生することがあります。特に、サイズを縮小した場合にはその可能性が高くなります。 ボリュームサイズを調整するときは、特に注意するようにしてください。
.sp
推奨されませんが、\fBzfs create -V\fR に \fB-s\fR オプションを指定して「疎ボリューム」(シンプロビジョニングとしても知られる) を作成できます。「疎ボリューム」とは、予約がボリュームサイズよりも小さいボリュームのことです。このため、領域上のプールが小さい場合、疎ボリュームへの書き込みが \fBENOSPC\fR で失敗する可能性があります。疎ボリュームの場合、\fBvolsize\fR を変更しても予約には反映されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvscan\fR=\fBon\fR|\fBoff\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxattr\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
このファイルシステムで拡張属性が有効かどうかを制御します。デフォルト値は \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzoned\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
データセットを非大域ゾーンから管理するかどうかを制御します。詳細は、「ゾーン」の節を参照してください。デフォルト値は \fBoff\fR です。
.RE

.sp
.LP
次のプロパティーは、ファイルシステムの作成後には変更できないため、ファイルシステムの作成時に設定するようにしてください。\fBzfs create\fR または \fBzpool create\fR コマンドで設定されていない場合、これらのプロパティーは親データセットから継承されます。これらの機能がサポートされる前に親データセットが作成されたため、親データセットにこれらのプロパティーが存在しない場合、新しいファイルシステムではこれらのプロパティーにデフォルト値が設定されます。
.sp
.ne 2
.mk
.na
\fB\fBcasesensitivity\fR = \fBsensitive\fR | \fBinsensitive\fR | \fBmixed\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnormalization\fR = \fBnone\fR | \fBformC\fR | \fBformD\fR | \fBformKC\fR | \fBformKD\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fButf8only\fR =\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBencryption\fR=\fBoff\fR | \fBon\fR | \fBaes-128-ccm\fR | \fBaes-192-ccm\fR | \fBaes-256-ccm\fR | \fBaes-128-gcm\fR | \fBaes-192-gcm\fR | \fBaes-256-gcm\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.sp
.LP
次のプロパティーは、作成時に指定する必要があり、特殊コマンドを使用すると変更できます。
.sp
.ne 2
.mk
.na
\fB\fBkeysource\fR=\fIraw\fR | \fIhex\fR | \fIpassphrase\fR,\fIprompt\fR | \fIfile\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.SS "一時的なマウントポイントプロパティー"
.sp
.LP
ファイルシステムのマウント時に、従来の \fBmount\fR(1M) コマンドまたは \fBzfs mount\fR コマンドを使用して、プロパティーに応じたマウントオプションが設定されます。プロパティーとマウントオプションは、次のような関係になっています。
.sp
.in +2
.nf
    PROPERTY                MOUNT OPTION
     devices                 devices/nodevices
     exec                    exec/noexec
     readonly                ro/rw
     setuid                  setuid/nosetuid
     xattr                   xattr/noxattr
     rstchown                rstchown/norstchown
.fi
.in -2
.sp

.sp
.LP
さらに、\fB-o\fR オプションを使って、ディスクに格納されたプロパティーに影響を及ぼすことなく、これらのオプションをマウントごとに設定できます。コマンド行に指定した値により、データセットに格納された値が上書きされます。\fB-nosuid\fR オプションは、\fBnodevices,nosetuid\fR の別名です。これらのプロパティーは、\fBzfs get\fR コマンドにより、「temporary」と報告されます。\fBmountpoint\fR 以外のプロパティーの場合、データセットのマウント時にプロパティーが変更されると、新規設定により一時設定がすべて上書きされます。\fBmountpoint\fR プロパティーは、一時的な mountpoint プロパティーが有効である間 (つまり、データセットが一時的な場所にマウントされている間) は変更できません。
.SS "ユーザープロパティー"
.sp
.LP
\fBZFS\fR は、標準のネイティブプロパティーに加えて、任意のユーザープロパティーもサポートします。ユーザープロパティーは \fBZFS\fR の動作には影響を与えませんが、アプリケーションや管理者が使用して、データセット (ファイルシステム、ボリューム、およびスナップショット) に注釈を付けることができます。
.sp
.LP
ユーザープロパティー名には、ネイティブプロパティーと区別するためにコロン (\fB:\fR) 文字を含める必要があります。ユーザープロパティーに含めることができるのは、小文字の英字、数字、および句読文字のコロン (\fB:\fR)、ダッシュ (\fB-\fR)、ピリオド (\fB\&.\fR)、および下線 (\fB_\fR) です。想定されている規則では、プロパティー名は 2 つの部分に分割します (例: \fImodule\fR\fB: \fR\fIproperty\fR)。ただし、この名前空間は \fBZFS\fR によって強制されているものではありません。ユーザープロパティー名には、最大 256 文字を使用できます。名前の先頭をダッシュ (\fB-\fR) で始めることはできません。
.sp
.LP
ユーザープロパティーをプログラムで使用する場合、プロパティー名の \fImodule\fR コンポーネントには、逆順にした \fBDNS\fR ドメイン名を使用することを強くお勧めします。これは、それぞれ単独で開発された 2 つのパッケージが、異なる目的で同じプロパティー名を使用する可能性を減らすためです。Oracle Solaris リリースでは、\fBcom.oracle\fR ユーザープロパティーが \fBbeadm\fR コマンドおよびライブラリ用に予約されています。
.sp
.LP
ユーザープロパティーの値は任意の文字列であり、常に継承されます。また、決して検証されることがありません。プロパティーを処理するコマンド (\fBzfs list\fR、\fBzfs get\fR、\fBzfs set\fR など) はすべて、ネイティブプロパティーとユーザープロパティーの両方の操作に使用できます。ユーザープロパティーをクリアするには、\fBzfs inherit\fR コマンドを使用します。プロパティーがどの親のデータセットにも定義されていない場合は、完全に削除されます。プロパティー値は、1024 文字以内に制限されています。
.SS "スワップまたはダンプデバイスとしての ZFS ボリュームの使用"
.sp
.LP
初期インストール中に、\fBZFS\fR ルートプールの \fBZFS\fR ボリューム上にスワップデバイスおよびダンプデバイスが作成されます。スワップ領域とダンプデバイスには別個の \fBZFS\fR ボリュームを使用する必要があります。\fBZFS\fR ファイルシステム上のファイルには、スワップを作成しないでください。\fBZFS\fR のスワップファイル設定は、サポートされていません。
.sp
.LP
スワップデバイスとして使用される ZFS ボリュームは、そのデバイスの \fBencryption\fR プロパティーを指定して、\fBvfstab\fR(4) の \fBencrypted\fR オプションを指定することによって暗号化できます。暗号化プロパティーの詳細は、zfs_encrypt.1m を参照してください。
.sp
.LP
システムのインストール後またはアップグレード後にスワップ領域やダンプデバイスを変更する必要がある場合は、\fBswap\fR(1M) コマンドと \fBdumpadm \fR(1M) コマンドを使用します。スワップ領域またはダンプデバイスのサイズを変更する必要がある場合は、『\fI『Solaris ZFS 管理ガイド』\fR』を参照してください。
.SH サブコマンド
.sp
.LP
状態を変更するサブコマンドはすべて、元の形式でプールに永続的に記録されます。
.sp
.ne 2
.mk
.na
\fB\fBzfs ?\fR\fR
.ad
.sp .6
.RS 4n
ヘルプメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs help\fR \fIcommand\fR | help | \fIproperty\fR \fIproperty-name\fR | \fIpermission\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs\fR コマンドの使用法情報を表示します。特定のコマンド、プロパティー、または委任アクセス権のヘルプを表示できます。特定のコマンドまたはプロパティーのヘルプを表示した場合、コマンド構文またはプロパティー値が表示されます。引数を何も付けずに \fBzfs help\fR を使用すると、\fBzfs\fR コマンドの完全なリストが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs create\fR [\fB-p\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
新しい \fBZFS\fR ファイルシステムを作成します。ファイルシステムは、親から継承した \fBmountpoint\fR プロパティーに従って自動的にマウントされます。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
存在しない親データセットをすべて作成します。この方法で作成されたデータセットは、それぞれの親から継承した \fBmountpoint\fR プロパティーに従って自動的にマウントされます。コマンド行で \fB-o\fR オプションを使用して指定したプロパティーはすべて無視されます。ターゲットのファイルシステムがすでに存在する場合、処理は正常に完了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
データセットの作成時にコマンド \fBzfs set\fR \fIproperty\fR=\fIvalue\fR が呼び出された場合と同様に、指定されたプロパティーを設定します。編集可能なすべての \fBZFS\fR プロパティーは、作成時にも設定可能です。複数の \fB-o\fR オプションを指定できます。複数の \fB-o\fR オプション内で同じプロパティーを指定した場合は、エラーが発生します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs create\fR [\fB-ps\fR] [\fB-b\fR \fIblocksize\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fB-V\fR \fIsize\fR \fIvolume\fR\fR
.ad
.sp .6
.RS 4n
指定したサイズのボリュームを作成します。ボリュームは、\fB/dev/zvol/{dsk,rdsk}/\fR\fIpath\fR 内にブロックデバイスとしてエクスポートされます。ここで、\fIpath\fR は \fBZFS\fR 名前空間内のボリュームの名前です。このサイズは、デバイスによりエクスポートされる論理サイズを表します。デフォルトでは、同サイズの予約が作成されます。
.sp
\fIsize\fR は、ボリュームが \fIblocksize\fR に関係なく整数のブロックを持つように、もっとも近い 128 K バイトに自動的に切り上げられます。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
存在しない親データセットをすべて作成します。この方法で作成されたデータセットは、それぞれの親から継承した \fBmountpoint\fR プロパティーに従って自動的にマウントされます。コマンド行で \fB-o\fR オプションを使用して指定したプロパティーはすべて無視されます。ターゲットのファイルシステムがすでに存在する場合、処理は正常に完了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
予約なしで疎ボリュームを作成します。疎ボリュームの詳細は、「ネイティブプロパティー」の節の \fBvolsize\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
データセットの作成時に \fBzfs set\fR \fIproperty\fR=\fIvalue\fR コマンドが呼び出された場合と同様に、指定されたプロパティーを設定します。編集可能なすべての \fBZFS\fR プロパティーは、作成時にも設定可能です。複数の \fB-o\fR オプションを指定できます。複数の \fB-o\fR オプション内で同じプロパティーを指定した場合は、エラーが発生します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fIblocksize\fR\fR
.ad
.sp .6
.RS 4n
\fB-o\fR \fBvolblocksize\fR=\fIblocksize\fR と同等です。このオプションを \fB-o\fR \fBvolblocksize\fR と組み合わせて指定した場合の動作は、定義されていません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs destroy\fR [\fB-rRf\fR] \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
指定されたデータセットを破棄します。デフォルトでは、このコマンドは共有中のファイルシステムすべての共有を解除し、マウント中のファイルシステムすべてをマウント解除し、アクティブな依存関係 (子またはクローン) を持つデータセットの破棄を拒否します。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
すべての子を再帰的に破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
ターゲット階層外にあるクローンファイルシステムを含む、すべての依存関係を再帰的に破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
\fBunmount -f\fR コマンドを使用してすべてのファイルシステムを強制的にマウント解除します。非ファイルシステムやマウント解除されたファイルシステムは、このオプションの影響を受けません。
.RE

\fB-r\fR や \fB-f\fR オプションを適用すると、プールのかなりの部分を破棄することが可能で、使用中のマウントされたファイルシステムで予期しない動作が発生する場合があるため、これらのオプションは特に注意深く使用するようにしてください。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs destroy\fR [\fB-rRd\fR] \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
指定されたスナップショットが \fB-d\fR オプションを付けない \fBzfs destroy\fR コマンドで破棄される場合にかぎり、そのスナップショットがすぐに破棄されます。このように破棄がただちに実行されるのは、たとえば、スナップショットにクローンがない場合や、ユーザーによる参照数がゼロだった場合です。
.sp
すぐに破棄される条件を満たしていないスナップショットには、削除が遅延されるようにマークが付けられます。この状態では、そのスナップショットは使用および表示が可能なスナップショットとして存在し、前述の両方の前提条件が満たされると、その時点で破棄されます。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
スナップショットの削除を延期します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
子孫ファイルシステムでこの名前を持つすべてのスナップショットを破棄します (または削除が遅延されるようにマークが付けられます)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
すべての依存関係を再帰的に破棄します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs snapshot\fR [\fB-r\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fIfilesystem@snapname\fR|\fIvolume@snapname\fR\fR
.ad
.sp .6
.RS 4n
指定した名前のスナップショットを作成します。正常終了したシステムコールによってファイルシステムに加えられていた変更は、すべてスナップショットに含まれます。\fBzfs snapshot\fR の別名として、\fBzfs snap\fR を使用できます。詳細は、「スナップショット」の節を参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
すべての子孫データセットのスナップショットを再帰的に作成します。スナップショットは原子的に取得されるため、再帰的スナップショットはすべて同じ時点のものになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定されたプロパティーを設定します。詳細は、\fBzfs create\fR を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs rollback\fR [\fB-rRf\fR] \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
指定したデータセットを以前のスナップショットにロールバックします。データセットをロールバックすると、スナップショット作成時から変更されたすべてのデータは破棄され、データセットがスナップショット作成時の状態に戻ります。デフォルトでは、このコマンドを使って、最新のスナップショット以外のスナップショットにロールバックすることはできません。最新でないスナップショットにロールバックする場合は、\fB-r\fR オプションを使って中間スナップショットをすべて破棄する必要があります。
.sp
\fB-rR\fR オプションは、再帰的スナップショットの子スナップショットを再帰的に破棄しません。これらのオプションはどちらも、最上位の再帰的スナップショットだけを破棄します。再帰的スナップショットを完全にロールバックするには、個々の子スナップショットをロールバックする必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
指定したスナップショット以降のスナップショットをすべて再帰的に破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
指定したスナップショット以降のスナップショットを再帰的に破棄すると共に、これらのスナップショットのクローンもすべて破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
\fB-R\fR オプションとともに使用すると、破棄するクローンファイルシステムをすべて強制的にマウント解除します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs clone\fR [\fB-p\fR] [\fB-K\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] ... \fIsnapshot\fR \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
指定したスナップショットのクローンを作成します。詳細は、「クローン」の節を参照してください。ターゲットのデータセットは、\fBZFS\fR 階層内の任意の場所に配置できます。作成されたデータセットは元のデータセットと同タイプになります。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
存在しない親データセットをすべて作成します。この方法で作成されたデータセットは、それぞれの親から継承した \fBmountpoint\fR プロパティーに従って自動的にマウントされます。ターゲットのファイルシステムまたはボリュームがすでに存在する場合、処理は正常に完了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
指定されたプロパティーを設定します。詳細は、\fBzfs create\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR\fR
.ad
.sp .6
.RS 4n
詳細は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs promote\fR \fIclone-filesystem\fR\fR
.ad
.sp .6
.RS 4n
特定のクローンファイルシステムへの移行を促し、そのファイルシステムが「元」のスナップショットに依存しないようにします。これにより、そのクローンの作成元のファイルシステムを破棄できるようになります。クローンの親子依存関係が逆転し、元のファイルシステムが、指定されたファイルシステムのクローンになります。 
.sp
クローンされたスナップショットと、そのスナップショットより前のすべてのスナップショットは、移行を促されたクローンによって所有されるようになります。それらが使用する領域は、元のファイルシステムから移行を促されたクローンに移されます。したがって、それらのスナップショットを収容するための十分な領域が必要です。この操作を行なっても新しい領域は消費されませんが、領域のアカウンティングは調整されます。移行を促されたクローンは、自身の相反するスナップショット名を持ってはいけません。\fBrename\fR サブコマンドを使えば、競合するスナップショット名を変更できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs rename\fR \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR\fR
.ad
.br
.na
\fB\fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR\fR
.ad
.br
.na
\fB\fBzfs rename\fR [\fB-p\fR] \fIfilesystem\fR|\fIvolume\fR \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
指定したデータセットの名前を変更します。スナップショットを除き、新規ターゲットは \fBZFS\fR 階層内の任意の場所に配置できます。スナップショットの名前を変更できるのは、親のファイルシステムまたはボリューム内だけです。スナップショットの名前を変更する場合、スナップショットの親ファイルシステムを 2 番目の引数として指定する必要はありません。名前の変更されたファイルシステムは、新しいマウントポイントを継承できます。この場合、ファイルシステムは、マウント解除されてから新しいマウントポイントで再マウントされます。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
存在しない親データセットをすべて作成します。この方法で作成されたデータセットは、それぞれの親から継承した \fBmountpoint\fR プロパティーに従って自動的にマウントされます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs rename\fR \fB-r\fR \fIsnapshot\fR \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
すべての子孫データセットのスナップショットの名前を再帰的に変更します。スナップショットは、再帰的に名前を変更できるデータセットにすぎません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs\fR \fBlist\fR [\fB-rH\fR|\fB-d\fR \fIdepth\fR] [\fB-o\fR \fIproperty\fR[,\fI\&...\fR]] [ \fB-t\fR \fItype\fR[,\fI ...\fR]] [ \fB-s\fR \fIproperty\fR ] ... [ \fB-S\fR \fIproperty\fR ] ... [\fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR|\fIpath\fR] ...\fR
.ad
.sp .6
.RS 4n
指定したデータセットのプロパティー情報を、表形式で表示します。指定した場合、プロパティー情報を絶対パス名または相対パス名で表示できます。デフォルトでは、すべてのファイルシステムとボリュームが表示されます。スナップショットは、\fBlistsnaps\fR プロパティーが \fBon\fR の場合に表示されます (デフォルトは \fBoff\fR)。\fBname\fR、\fBused\fR、\fBavailable\fR、\fBreferenced\fR、および \fBmountpoint\fR の各フィールドが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
スクリプティングモードで使用します。ヘッダーを出力せず、フィールドを任意のスペース文字ではなく単一のタブで区切ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
データセットのすべての子をコマンド行に再帰的に表示します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdepth\fR\fR
.ad
.sp .6
.RS 4n
データセットのすべての子を再帰的に表示します。再帰は最大 \fIdepth\fR に制限されます。深さ \fB1\fR の場合は、データセットとその直接の子だけが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
表示するプロパティーのコンマ区切りのリスト。次のプロパティーを指定する必要があります。
.RS +4
.TP
.ie t \(bu
.el o
「ネイティブプロパティー」の節で示したプロパティーのいずれか
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザープロパティー
.RE
.RS +4
.TP
.ie t \(bu
.el o
データセット名を表示する値 \fBname\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステムとボリュームの領域使用状況プロパティーを表示する値 \fBspace\fR。これは、\fB-o name,avail,used,usedsnap,usedds,usedrefreserv,usedchild\fR\fB-t filesystem,volume\fR 構文のショートカットです。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
プロパティーの値に基づいて、出力を列で昇順にソートするためのプロパティー。プロパティーは、「プロパティー」の節で示したプロパティーのいずれか、またはデータセット名をソートする特殊な値 \fBname\fR にする必要があります。複数の \fB-s\fR プロパティーオプションを使用することで、一度に複数のプロパティーを指定できます。複数の \fB-s\fR オプションは、左から右の順で、重要度の高さが判断されます。
.sp
次に、ソート基準の一覧を示します。
.RS +4
.TP
.ie t \(bu
.el o
数値型は、数値順にソートされます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
文字列型は、アルファベット順にソートされます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
行に適さない型は、指定したソート順に関係なく、その行がリテラルソート順のいちばん下になります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ソートオプションを指定しない場合は、\fBzfs list\fR の既存の動作が維持されます。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
\fB-s\fR オプションと同じですが、プロパティーで降順にソートされる点が異なります。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR\fR
.ad
.sp .6
.RS 4n
表示するタイプのコンマ区切りのリスト。ここで、\fItype\fR は、\fBfilesystem\fR、\fBsnapshot\fR、\fBvolume\fR、または \fBall\fR のいずれかになります。たとえば、\fB-t snapshot\fR を指定すると、スナップショットのみが表示されます。タイプ指定子の代わりに、\fBfs\fR (ファイルシステム)、\fBsnap\fR (スナップショット)、および \fBvol\fR (ボリューム) の各別名を使用できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs set\fR [\fB-r\fR] \fIproperty\fR=\fIvalue\fR \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR ...\fR
.ad
.sp .6
.RS 4n
プロパティーを、各データセット用に指定した値に設定します。一部のプロパティーのみ、編集可能です。設定可能なプロパティーおよび有効な値については、「プロパティー」の節を参照してください。数値は、正確な値を指定することも、\fBB\fR、\fBK\fR、\fBM\fR、\fBG\fR、\fBT\fR、\fBP\fR、\fBE\fR、または \fBZ\fR (それぞれ、バイト、K バイト、M バイト、G バイト、T バイト、P バイト、E バイト、または Z バイトを表す) のサフィックスを使って人間の読み取り可能な形式で指定することもできます。スナップショットでユーザープロパティーを設定できます。詳細は、「ユーザープロパティー」の節を参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
子データセットのサブツリー全体に対して、設定の有効な値を再帰的に適用します。有効な値は、プロパティーに応じて設定または継承できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs get\fR [\fB-rHp\fR|\fB-d\fR \fIdepth\fR] [\fB-o\fR \fBall\fR | \fIfield\fR[,...] [\fB-s\fR \fIsource\fR[,...]] \fBall\fR | \fI property\fR[,...] \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR ...\fR
.ad
.sp .6
.RS 4n
指定したデータセットのプロパティーを表示します。データセットが指定されていない場合、このコマンドはシステムのすべてのデータセットのプロパティーを表示します。プロパティーごとに、次の列が表示されます。
.sp
.in +2
.nf
     name      Dataset name
     property  Property name
     value     Property value
     source    Property source. Can either be local, default,
               temporary, inherited, or none (-).
.fi
.in -2
.sp

デフォルトでは、\fBRECEIVED\fR 列を除くすべての列が表示されます。特定の列またはすべての列を指定するには、\fB-o\fR オプションを使用します。このコマンドには、「ネイティブプロパティー」および「ユーザープロパティー」で説明されているコンマ区切りのプロパティーリストを指定できます。
.sp
特殊な値 \fBall\fR を使って、指定したデータセットのタイプ (ファイルシステム、ボリューム、またはスナップショット) に適用されるプロパティーをすべて表示できます。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
任意の子のプロパティーを再帰的に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdepth\fR\fR
.ad
.sp .6
.RS 4n
データセットのすべての子を再帰的に表示しますが、再帰の深さは \fIdepth\fR に制限されます。深さ \fB1\fR の場合は、データセットとその直接の子だけが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
スクリプトによる解析がより容易な形式で、出力を表示します。ヘッダーがすべて省略され、フィールドが任意の数のスペースではなく、タブ 1 つで明示的に区切られます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示するフィールドのセット。次の 1 つ以上のフィールドを指定します。
.sp
.in +2
.nf
name,property,value,received,source
.fi
.in -2
.sp

複数のフィールドをコンマ区切りリストで表します。デフォルト値は次のとおりです。
.sp
.in +2
.nf
name,property,value,source
.fi
.in -2
.sp

キーワード \fBall\fR はすべてのソースを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsource\fR\fR
.ad
.sp .6
.RS 4n
表示するソースのコンマ区切りのリスト。このリストにないソースからのプロパティーは、無視されます。各ソースは、
.sp
.in +2
.nf
local,default,inherited,temporary,received,none
.fi
.in -2
.sp

デフォルト値はすべてのソースです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
解析可能な (絶対) 値で数を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs set share\fR=\fIname\fR=\fIsharename\fR,\fBpath\fR=\fIpathname\fR,[\fBdesc\fR=\fIdescription\fR],\fBprot\fR=\fBsmb\fR | \fB nfs\fR[,\fIproperty\fR=\fIvalue\fR[,...]] \fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs set share\fR の構文についての完全な説明は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs inherit\fR [\fB-rS\fR] \fIproperty\fR \fIfilesystem\fR|\fIvolume\fR|\fIsnapshot\fR ...\fR
.ad
.sp .6
.RS 4n
指定したプロパティーをクリアして、そのプロパティーが祖先から継承されるようにします。祖先にプロパティーが設定されていない場合は、デフォルト値が使用されます。デフォルト値のリスト、および継承可能なプロパティーの詳細については、「プロパティー」の節を参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
すべての子で指定したプロパティーを再帰的に継承します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
受信したプロパティー値があれば、その値に戻します。プロパティーに受信値がない場合、\fBzfs inherit\fR \fB-S\fR の動作は、\fB-S\fR を指定しない \fBzfs inherit\fR と同じです。プロパティーに受信値が存在する場合、\fBzfs inherit\fR は、\fBzfs inherit\fR \fB-S\fR によって継承値が受信値に戻されるまで、受信値を継承値でマスクします。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs upgrade\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムバージョンを指定します。このバージョンによって、現在実行中のソフトウェアリリースで使用可能なファイルシステム機能が決まります。古いファイルシステムバージョンを使用し続けることはできますが、一部の機能が使用できなくなる可能性があります。ファイルシステムは、\fBzfs upgrade\fR \fB- a\fR コマンドを使用するとアップグレードできます。以前のソフトウェアバージョンを実行しているシステムで、以降のバージョンのファイルシステムにアクセスすることはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs upgrade\fR [\fB-v\fR]\fR
.ad
.sp .6
.RS 4n
現在のソフトウェアでサポートされている ZFS ファイルシステムのバージョンを表示します。現在の ZFS ファイルシステムのバージョンおよびサポートされる以前のバージョンすべてが、各バージョンで提供される機能に関する説明とともに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs upgrade\fR [\fB-r\fR] [\fB-V\fR \fIversion\fR] [\fB-a\fR | \fIfilesystem\fR]\fR
.ad
.sp .6
.RS 4n
ファイルシステムを新しいディスク上バージョンにアップグレードします。ファイルシステムをアップグレードすると、古いソフトウェアバージョンを実行しているシステムではアクセスできなくなります。新しいファイルシステムのスナップショットから生成された \fBzfs send\fR ストリームは、古いソフトウェアバージョンを実行しているシステムではアクセスできません。
.sp
一般に、ファイルシステムのバージョンはプールのバージョンとは無関係です。\fBzpool upgrade\fR コマンドの詳細は、\fBzpool\fR(1M) を参照してください。 
.sp
場合によっては、ファイルシステムのバージョンとプールのバージョンが相互に関連しており、ファイルシステムのバージョンをアップグレードする前にプールのバージョンをアップグレードする必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
インポートされたすべてのプールのファイルシステムをすべてアップグレードします。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムをアップグレードします。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムおよびすべての子孫ファイルシステムをアップグレードします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIversion\fR にアップグレードします。\fB-V\fR フラグが指定されていない場合、このコマンドは最新のバージョンにアップグレードします。このオプションは、バージョン番号を増やす場合にのみ使用できます。また、指定できるのは、このソフトウェアでサポートされている最新のバージョンまでです。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs userspace\fR [\fB-hniHp\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-sS\fR \fIfield\fR]... [\fB-t\fR \fItype\fR [,...]] \fIfilesystem\fR | \fI snapshot\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムまたはスナップショットでの、各ユーザーの消費容量および割り当てを表示します。これは、\fBuserused@\fR\fIuser\fR プロパティーと \fBuserquota@\fR\fIuser\fR プロパティーに対応します。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
構文のヘルプメッセージを表示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
ユーザー名やグループ名の代わりに数値 ID を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
ヘッダーを出力せず、タブ区切りの出力を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
正確な (解析可能な) 数値出力を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
次のセットから、指定されたフィールドのみを表示します。\fBtype,name,used,quota\fR。デフォルトでは、すべてのフィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIfield\fR\fR
.ad
.sp .6
.RS 4n
出力をこのフィールドでソートします。\fIs\fR フラグと \fIS\fR フラグは複数回指定できます。その場合、まず 1 つのフィールドでソートしてから、順次別のフィールドでソートできます。デフォルトは \fB-s type\fR \fB-s name\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIfield\fR\fR
.ad
.sp .6
.RS 4n
このフィールドで逆順にソートします。\fB-s\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItype\fR[,...]\fR
.ad
.sp .6
.RS 4n
次のセットから、指定されたタイプのみを出力します。\fBall,posixuser,smbuser,posixgroup,smbgroup\fR.
.sp
デフォルトは \fB-t posixuser,smbuser\fR です。
.sp
デフォルトを変更してグループタイプを含めることもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
SID を POSIX ID に変換します。マッピングが存在しない場合、POSIX ID は一時的なものになることがあります。通常の POSIX インタフェース (\fBstat\fR(2)、\fBls\fR \fB- l\fR など) はこの変換を実行するため、\fB-i\fR オプションを使用すると、\fBzfs userspace\fR からの出力をこれらのユーティリティーと直接比較できます。ただし、SMB から POSIX への名前のマッピングが確立される前に SMB ユーザーによって作成されたファイルがある場合は、\fB-i\fR を使用すると混乱が生じることがあります。そのような場合は、SMB エンティティーが所有するファイルと、POSIX エンティティーが所有するファイルが混在します。しかし、\fB-i\fR オプションでは、どちらについてもすべて POSIX エンティティーの使用量および割り当てとして報告されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs groupspace\fR [\fB-hniHp\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-sS\fR \fIfield\fR]... [\fB-t\fR \fItype\fR [,...]] \fIfilesystem\fR | \fI snapshot\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムまたはスナップショットでの、各グループの消費容量および割り当てを表示します。このサブコマンドは \fBzfs userspace\fR と同じですが、デフォルトで表示されるタイプは \fB-t posixgroup,smbgroup\fR です。
.sp
.in +2
.nf
-
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs mount\fR\fR
.ad
.sp .6
.RS 4n
現在マウントされているすべての \fBZFS\fR ファイルシステムを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs mount\fR [\fB-vOS\fR] [\fB-o\fR \fIoptions\fR] \fB-a\fR | \fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
\fBZFS\fR ファイルシステムをマウントします。これは、ブートプロセスの一部として自動的に呼び出されます。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIoptions\fR\fR
.ad
.sp .6
.RS 4n
マウント時に一時的に使用する、コンマ区切りのマウントオプションリスト (省略可能)。詳細は、「一時的なマウントポイントプロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR\fR
.ad
.sp .6
.RS 4n
オーバーレイマウントを実行します。詳細は、\fBmount\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
マウントの進行状況を報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべての \fBZFS\fR ファイルシステムをマウントします。これは、ブートプロセスの一部として自動的に呼び出されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムをマウントします。
.sp
暗号化されたデータセットの \fBzfs mount\fR 操作では、\fBkeysource\fR プロパティー値によっては鍵の入力が求められる場合があります。これは、たとえば \fBkeysource\fR ロケータが \fBprompt\fR に設定されている場合に起こることがあります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs unmount\fR [\fB-f\fR] \fB-a\fR | \fIfilesystem\fR|\fImountpoint\fR\fR
.ad
.sp .6
.RS 4n
現在マウントされている \fBZFS\fR ファイルシステムをマウント解除します。これは、シャットダウンプロセスの一部として自動的に呼び出されます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムを、使用中であっても強制的にマウント解除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべての \fBZFS\fR ファイルシステムをマウント解除します。これは、ブートプロセスの一部として自動的に呼び出されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fIfilesystem\fR|\fImountpoint\fR\fR
.ad
.sp .6
.RS 4n
指定されたファイルシステムをマウント解除します。このコマンドには、システム上の \fBZFS\fR ファイルシステムのマウントポイントのパスを指定することもできます。
.RE

暗号化されたデータセットの場合、ファイルシステムがマウント解除されているときには、鍵の読み込みは解除されません。鍵を読み込み解除するには、\fBzfs key\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs share\fR \fB-a\fR | \fIdataset\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs share\fR の構文および例についての完全な説明は、\fBzfs_share\fR(1M) を参照してください。
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs unshare\fR \fB-a\fR | \fIdataset\fR|\fImountpoint\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs unshare\fR の構文および例についての完全な説明は、\fBzfs_share\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs send\fR [\fB-DvRbp\fR] [\fB-\fR[\fBiI\fR] \fIsnapshot\fR] \fIsnapshot\fR\fR
.ad
.br
.na
\fB\fBzfs send\fR \fB-r\fR [\fB-Dvbcp\fR] [\fB-i\fR \fI snapshot\fR] \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
2 番目の \fIsnapshot\fR のストリーム表現を作成します。これは、標準出力に書き込まれます。出力は、\fBssh\fR(1) などを使用して、ファイルまたは別のシステムにリダイレクトできます。デフォルトでは、完全なストリームが生成されます。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
データセットが受信された場合にのみ、ローカル設定によって上書きされているかどうかに関係なく、受信したプロパティー値だけを送信します。\fBzfs receive\fR で、送信されたデータセット上でバックアップされた受信プロパティーを復元し、かつソースデータセットそのものではなくデータのバックアップ方法にのみ関係する可能性があるローカル設定を送信しないようにする場合に、このオプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
自己完結型ストリームを作成します。自己完結型ストリームとは、ストリームパッケージに含まれていないデータセットに依存しないストリームのことです。\fB-r\fR オプションでのみ有効です。\fB-i\fR オプションで使用した場合、ストリームは、そのオプションの引数として指定したスナップショットに依存します。
.sp
詳細は、『\fIZFS 管理ガイド\fR』の ZFS ストリームに関する節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
ストリームで \fBdedup\fR 処理を実行します。複製解除されたストリームは、ストリームの複製解除機能をサポートしていないシステム上では受信できません。
.sp
複製ストリームパッケージと再帰的ストリームパッケージの違いについて理解するには『\fIZFS 管理ガイド\fR』の ZFS ストリームに関する節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
最初の \fIsnapshot\fR から 2 番目の \fIsnapshot\fR への増分ストリームを生成します。増分ソース (最初の \fIsnapshot\fR) は、スナップショット名の最後のコンポーネント (たとえば、\fB@\fR のあとの部分) として指定できます。これは、2 番目の \fIsnapshot\fR と同じファイルシステムに由来すると見なされます。
.sp
宛先がクローンの場合、ソースとして元のスナップショットを指定できますが、完全な形式で指定する必要があります (たとえば、単に \fB@origin\fR と指定するのではなく、\fBpool/fs@origin\fR とする)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIsnapshot\fR\fR
.ad
.sp .6
.RS 4n
最初のスナップショットから 2 番目のスナップショットにすべての中間スナップショットを送信するストリームパッケージを生成します。たとえば、\fB-I @a fs@d\fR は \fB-i @a fs@b; -i @b fs@c; -i @c fs@d\fR に似ています。増分ソーススナップショットは、\fB-i\fR オプションと同様に指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
複製ストリームパッケージを生成します。これにより、指定されたファイルシステム、および指定されたスナップショットまでのすべての子孫ファイルシステムが複製されます。受信時には、すべてのプロパティー、スナップショット、下位ファイルシステム、およびクローンが維持されます。
.sp
\fB-i\fR または \fB-I\fR フラグを \fB-R\fR フラグと組み合わせて使用すると、増分複製ストリームが生成されます。プロパティーの現在の値、および現在のスナップショット名とファイルシステム名は、ストリームの受信時に設定されます。このストリームの受信時に \fB-F\fR フラグを指定すると、送信側に存在しないスナップショットとファイルシステムは破棄されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
再帰的ストリームパッケージを生成します。再帰的ストリームパッケージには、一連の完全ストリームまたは増分ストリームあるいはその両方が含まれています。受信時に、すべてのプロパティーおよび子孫ファイルシステムが保持されます。\fB-R\fR フラグで生成される複製ストリームパッケージとは異なり、中間スナップショットは、それがストリームに含まれる複製元でないかぎり保持されません。
.sp
\fB-i\fR オプションと \fB-r\fR オプションを組み合わせて使用すると、再帰的増分ストリームが生成されます。プロパティーの現在の値、および現在のスナップショット名とファイルシステム名は、ストリームの受信時に設定されます。このストリームの受信時に \fB-F\fR オプションを指定すると、送信側に存在しないスナップショットとファイルシステムは破棄されます。\fB-I\fR オプションは \fB-r\fR オプションと組み合わせて使用できません。
.sp
\fB-c\fR オプションと組み合わせると、自己完結型の再帰的ストリームパッケージが作成されます。\fB-c\fR と \fB-i\fR の両方のオプションを使用した場合、\fB-i\fR オプションで指定したスナップショットを持たないファイルシステムおよびボリュームは、自己完結型ストリームとして送信されます。
.sp
再帰的ストリームパッケージと複製ストリームパッケージの違いについて理解するには『\fIZFS 管理ガイド\fR』の ZFS ストリームに関する節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
プロパティーを送信します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
生成されたストリームパッケージに関する詳細な情報を出力します。
.RE

ストリームの形式が確定されました。\fBZFS\fR の将来のバージョンで、使用しているストリームを受信できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs receive\fR [\fB-vnFu\fR] [[\fB-o\fR \fIproperty\fR=\fIvalue\fR] | [\fB-x\fR \fIproperty\fR]] ... \fIfilesystem\fR|\fIvolume\fR|\fI snapshot\fR\fR
.ad
.br
.na
\fB\fBzfs receive\fR [\fB-vnFu\fR] [[\fB-o\fR \fIproperty\fR=\fIvalue\fR] | [\fB-x\fR \fIproperty\fR]] ... [\fB-d\fR | \fB-e\fR] \fIfilesystem \fR\fR
.ad
.sp .6
.RS 4n
スナップショットを作成します。内容は、標準入力から受信したストリームの指定に基づきます。ストリーム全体を受信する場合、新しいファイルシステムも作成されます。ストリームは \fBzfs send\fR サブコマンドによって作成されます。このサブコマンドはデフォルトで、完全なストリームを作成します。\fBzfs receive\fR の別名として、\fBzfs recv\fR を使用できます。
.sp
増分ストリームが受信された場合、対象となるファイルシステムがすでに存在しており、かつその最新のスナップショットがその増分ストリームのソースに一致する必要があります。ZFS ボリュームの場合、宛先のデバイスリンクが破棄されて再作成されます。つまり、\fBreceive\fR 操作中はボリュームにアクセスできません。
.sp
\fBzfs send\fR \fB-R\fR コマンドによって生成されたスナップショット複製パッケージストリームが受信される場合、送信場所に存在していないスナップショットは、\fBzfs destroy\fR \fB-d\fR コマンドを使用することによって破棄されます。\fB-o\fR \fIproperty\fR=\fIvalue\fR または \fB-x\fR プロパティーが指定された場合、その指定は、複製されたデータセットのサブツリー全体にわたって、プロパティーの有効な値に適用されます。有効なプロパティー値は、そのプロパティー、および複製されたサブツリーのいちばん上にデータセットがあるかどうかに応じて、設定または継承できます。受信されたプロパティーは上書きされるものの保持され、\fBzfs inherit\fR \fB-rS\fR または \fBzfs send\fR \fB-Rb\fR で復元できます。
.sp
このサブコマンドが作成するスナップショット (ストリーム全体を受信する場合はファイルシステムも) の名前は、引数タイプと \fB-d\fR または \fB-e\fR オプションによって決まります。
.sp
引数がスナップショット名の場合には、指定した \fIsnapshot\fR が作成されます。引数がファイルシステム名またはボリューム名の場合には、送信されたスナップショットと同名のスナップショットが、指定した \fIfilesystem\fR または \fIvolume\fR 内部で作成されます。\fB-d\fR または \fB-e\fR オプションを指定すると、指定した filesystem に送信したスナップショットの名前を追加してスナップショット名が決定されます。\fB-d\fR オプションが指定された場合、送信されたスナップショットパスのプール名を除くすべてが付加され (たとえば、送信されたスナップショット \fBa/b/c@1\fR の \fBb/c@1\fR が付加)、\fB-e\fR オプションが指定された場合は、送信されたスナップショットパスの末尾だけが付加されます (たとえば、送信されたスナップショット \fBa/b/c@1\fR の \fBc@1\fR が付加)。\fB-d\fR の場合、送信されたスナップショットのパスを複製するために必要なファイルシステムは、指定されたファイルシステム内で作成されます。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
前の段落で説明したように、送信されたスナップショットパスの最初の要素を除くすべて (プール名を除くすべて) を使用して、新しいスナップショットの名前が決定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
前の段落で説明したように、送信したスナップショットパスの最後の要素を使用して、新しいスナップショットの名前が決定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
受信操作を実行する前に、ファイルシステムを最新のスナップショットに強制的にロールバックします。増分複製ストリーム (\fBzfs send -R -[iI]\fR で生成されたものなど) を受信する場合は、送信側に存在しないスナップショットとファイルシステムを破棄します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
ストリームを実際には受信しません。これを \fB-v\fR オプションと組み合わせて使用すると、受信操作で使用する名前を確認するのに役に立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
非増分 \fBsend\fR ストリームからの受信データセットの作成時または増分 \fBsend\fR ストリームからの受信データセットの更新時にコマンド \fBzfs set\fR \fIproperty\fR=\fIvalue\fR が呼び出された場合と同様に、指定されたプロパティーを設定します。編集可能なすべての ZFS プロパティーは、受信時にも設定可能です。\fBnormalization\fR や \fBcasesensitivity\fR など受信データにバインドされるプロパティーは一度だけ設定可能で、データセットが \fBzfs receive\fR によって新しく作成された場合でも、受信時には設定できません。複数の \fB-o\fR オプションを指定できます。複数の \fB-o\fR オプションまたは \fB-x\fR オプション内で同じプロパティーを指定した場合は、エラーが発生します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
受信したストリームに関連付けられているファイルシステムをマウントしません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
ストリームおよび受信操作の所要時間に関する詳細な情報を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fIproperty\fR\fR
.ad
.sp .6
.RS 4n
\fBreceive\fR のあとにある指定されたプロパティーの有効な値が、そのプロパティーが \fBsend\fR ストリームから除外されている場合と同様に、\fBsend\fR ストリーム内のそのプロパティー (もしあれば) の値に影響されないようにします。指定されたプロパティーが \fBsend\fR ストリームに存在しない場合、このオプションは何も行いません。受信されたプロパティーを上書きする必要がある場合、有効な値をそのプロパティーに応じて設定または継承できます。増分更新の場合、\fB-x\fR は、既存のローカル設定または明示的な継承を変更せずに残します (受信したプロパティーがすでに上書きされているため)。すべての \fB-o\fR 制限は、\fB-x\fR にも同様に適用されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs allow\fR \fIfilesystem\fR | \fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs allow\fR [\fB-ldug\fR] \fBeveryone\fR|\fIuser\fR|\fIgroup\fR[,...] \fIperm \fR|@\fIsetname\fR[,...] \fIfilesystem\fR| \fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs allow\fR [\fB-ld\fR] \fB-e\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem \fR | \fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs allow\fR \fB-c\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs allow\fR \fB- s\fR @\fIsetname\fR \fIperm\fR|@\fIsetname\fR[,...] \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs allow\fR の構文および例についての完全な説明は、\fBzfs_allow\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs unallow\fR [\fB-rldug\fR] \fBeveryone\fR|\fIuser\fR|\fIgroup\fR[,...] [\fIperm\fR|@\fIsetname\fR[, ...]] \fIfilesystem\fR|\fI volume\fR\fR
.ad
.br
.na
\fB\fBzfs unallow\fR [\fB-rld\fR] \fB-e\fR [\fIperm\fR|@\fIsetname\fR [,...]] \fIfilesystem\fR|\fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs unallow\fR [\fB- r\fR] \fB-c\fR [\fIperm\fR|@\fIsetname\fR[,...]]\fR
.ad
.br
.na
\fB\fIfilesystem\fR|\fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs unallow\fR [\fB-r\fR] \fB-s\fR @\fIsetname\fR [\fI perm\fR|@\fIsetname\fR[,...]]\fR
.ad
.br
.na
\fB\fIfilesystem\fR|\fIvolume\fR\fR
.ad
.sp .6
.RS 4n
\fBzfs unallow\fR の構文および例についての完全な説明は、\fBzfs_allow\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs hold\fR [\fB-r\fR] \fItag\fR \fIsnapshot\fR...\fR
.ad
.sp .6
.RS 4n
\fItag\fR 引数で指定された単一の参照を、指定された 1 つ以上のスナップショットに追加します。個々のスナップショットには独自のタグ名前空間があり、その空間内でタグが一意である必要があります。
.sp
スナップショットに保持が設定されている場合、保持されたそのスナップショットを \fBzfs destroy\fR コマンドを使用して破棄しようすると、\fBEBUSY\fR が返されます。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
指定されたタグを持つ保持をすべての子孫ファイルシステムのスナップショットに再帰的に適用することを指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs holds\fR [\fB-r\fR] \fIsnapshot\fR...\fR
.ad
.sp .6
.RS 4n
指定された 1 つ以上のスナップショットについて、既存のユーザー参照をすべて一覧表示します。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
指定されたスナップショットでの保持を一覧表示するだけでなく、指定された子孫スナップショットで設定されている保持を一覧表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs release\fR [\fB-r\fR] \fItag\fR \fIsnapshot\fR...\fR
.ad
.sp .6
.RS 4n
\fItag\fR 引数で指定された単一の参照を、指定された 1 つ以上のスナップショットから削除します。各スナップショットに対して、タグがすでに存在している必要があります。
.sp
スナップショットに保持が設定されている場合、保持されたそのスナップショットを \fBzfs destroy\fR コマンドを使用して破棄しようすると、\fBEBUSY\fR が返されます。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
指定されたタグを持つ保持をすべての子孫ファイルシステムのスナップショット上で再帰的に解除します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs diff\fR [\fB-FHte\fR] [\fB-o\fR \fIfield\fR] ... \fIsnapshot\fR [\fIsnapshot\fR | \fIfilesystem\fR]\fR
.ad
.br
.na
\fB\fBzfs diff\fR \fB-E\fR [\fB- FHt\fR] [\fB-o\fR \fIfield\fR] ... \fIsnapshot\fR | \fIfilesystem\fR\fR
.ad
.sp .6
.RS 4n
スナップショットと子孫データセットとの差異に関する概要を表示します。子孫は、データセットのスナップショットか現在のデータセットのいずれかになります。
.sp
単一のスナップショットが指定された場合、そのスナップショットと現在のデータセットとの差異が表示されます。
.sp
元のスナップショットと子孫の間で変更があったファイルごとに、変更のタイプがファイルの名前とともに記述されます。名前の変更の場合、古い名前と新しい名前の両方が表示されます。ファイル名に含まれるスペース文字、バックスラッシュ文字、およびそのほかの非印字文字または非 7 ビット ASCII 文字は、バックスラッシュ文字のあとにそのバイト値を表す 3 桁の 8 進数が追加された形式で表示されます。
.sp
\fB-t\fR オプションが指定された場合、コマンドからの出力の最初の列はファイルの \fBst_ctim\fR 値になります。削除したファイルの場合、これは以前のスナップショットの最後の \fBst_ctim\fR になります。
.sp
変更のタイプはタイムスタンプのあとに表示され、単一の文字で記述されます。
.sp
.ne 2
.mk
.na
\fB\fB+\fR\fR
.ad
.RS 5n
.rt  
以降のデータセットでファイルが追加されたことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.RS 5n
.rt  
以降のデータセットでファイルが削除されたことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
以降のデータセットでファイルが変更されたことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR\fR
.ad
.RS 5n
.rt  
以降のデータセットでファイルの名前が変更されたことを示します。
.RE

\fB-F\fR オプションが指定された場合、出力の次の列に、ファイルのタイプを示す単一の文字が表示されます。マッピングは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBF\fR\fR
.ad
.RS 5n
.rt  
通常ファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.RS 5n
.rt  
ディレクトリ
.RE

.sp
.ne 2
.mk
.na
\fB\fBB\fR\fR
.ad
.RS 5n
.rt  
ブロック型デバイス
.RE

.sp
.ne 2
.mk
.na
\fB\fB>\fR\fR
.ad
.RS 5n
.rt  
door
.RE

.sp
.ne 2
.mk
.na
\fB\fB|\fR\fR
.ad
.RS 5n
.rt  
FIFO
.RE

.sp
.ne 2
.mk
.na
\fB\fB@\fR\fR
.ad
.RS 5n
.rt  
シンボリックリンク
.RE

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.RS 5n
.rt  
イベントポータル
.RE

.sp
.ne 2
.mk
.na
\fB\fB=\fR\fR
.ad
.RS 5n
.rt  
socket
.RE

変更箇所に非ディレクトリファイルのリンク数の変更が含まれる場合、その変更は差分が括弧に囲まれた形式で変更行に表示されます。ファイル名が変更された場合、古いファイル名は文字列「\fB->\fR」を使用して新しいファイル名と分離されます。
.sp
\fB-H\fR オプションを選択すると、解析しやすい出力が生成されます。フィールドは単一のタブで区切られ、名前変更されたファイルの古い名前と新しい名前の間には矢印文字列 (\fB->\fR) は挿入されません。\fB-H\fR が選択されていない場合の出力では、フィールド間に空白が挿入されるとは限りません。
.sp
\fB-e\fR オプションが選択された場合、2 つのスナップショットの間で追加または変更されたすべてのファイルが列挙され、削除されたファイルは表示されません。変更タイプは修正の種類にかかわらず、常に「\fB+\fR」と報告されます。
.sp
\fB-E\fR オプションが選択された場合、空のスナップショットと指定されたスナップショットまたはデータセットとの差異として表示されます。
.sp
\fB-o\fR フィールドオプションが選択された場合、選択されたフィールドのみが表示されます。各行は、\fB-F\fR および \fB-t\fR オプションで要求された標準のフィールドで開始され、後続の \fB-o\fR オプションで要求されたフィールドが後に続きます。\fB-H\fR オプションの場合、すべてのフィールドが単一のタブで区切られます。次のフィールド名が許可されます。
.sp
.ne 2
.mk
.na
\fB\fBobject\fR\fR
.ad
.RS 15n
.rt  
ファイルについて \fBls\fR \fB-i\fR によって出力される数値
.RE

.sp
.ne 2
.mk
.na
\fB\fBparent\fR\fR
.ad
.RS 15n
.rt  
ファイルを含んでいるディレクトリについて \fBls\fR \fB-i\fR によって出力される数値
.RE

.sp
.ne 2
.mk
.na
\fB\fBsize\fR\fR
.ad
.RS 15n
.rt  
\fBls\fR \fB-s\fR によって表示されるファイルサイズ
.RE

.sp
.ne 2
.mk
.na
\fB\fBlinks\fR\fR
.ad
.RS 15n
.rt  
ファイルへのリンク数
.RE

.sp
.ne 2
.mk
.na
\fB\fBlinkschange\fR\fR
.ad
.RS 15n
.rt  
ファイルへのリンク数の変更
.RE

.sp
.ne 2
.mk
.na
\fB\fBname\fR \fR
.ad
.RS 15n
.rt  
ファイルの名前
.RE

.sp
.ne 2
.mk
.na
\fB\fBoldname\fR\fR
.ad
.RS 15n
.rt  
名前を変更する前のファイルの名前。ファイルの名前が変更されていない場合は \fB\(em\fR (ハイフン)
.RE

.sp
.ne 2
.mk
.na
\fB\fBuser\fR\fR
.ad
.RS 15n
.rt  
\fBls\fR によって表示されるファイルの所有者のユーザー名
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroup\fR \fR
.ad
.RS 15n
.rt  
\fBls\fR によって表示されるファイルのグループ名
.RE

.sp
.ne 2
.mk
.na
\fB\fBctime\fR\fR
.ad
.RS 15n
.rt  
ファイルのメタデータが最後に変更されたときのタイムスタンプ
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtime\fR\fR
.ad
.RS 15n
.rt  
ファイルが最後に変更されたときのタイムスタンプ
.RE

.sp
.ne 2
.mk
.na
\fB\fBatime\fR\fR
.ad
.RS 15n
.rt  
ファイルが最後にアクセスされたときのタイムスタンプ
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtime\fR\fR
.ad
.RS 15n
.rt  
ファイルが作成されたときのタイムスタンプ
.RE

\fB{PRIV_SYS_CONFIG}\fR または \fB{PRIV_SYS_MOUNT}\fR 特権がないユーザーがこのサブコマンドを使用するには、\fBzfs allow\fR で \fBdiff\fR アクセス権を与えられる必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzfs key\fR \fB-l\fR | {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}\fR
.ad
.br
.na
\fB\fBzfs key\fR \fB-u\fR [\fB-f\fR] | {\fB-a\fR | [\fB-r\fR] \fI filesystem\fR|\fIvolume\fR\fR
.ad
.br
.na
\fB\fBzfs key\fR \fB-c\fR [\fB-o\fR \fIkeysource\fR=\fIvalue\fR] {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fI volume\fR}\fR
.ad
.br
.na
\fB\fBzfs key\fR \fB-K\fR {\fB-a\fR | [\fB-r\fR] \fIfilesystem\fR|\fIvolume\fR}\fR
.ad
.sp .6
.RS 4n
\fBzfs key\fR の構文および例についての完全な説明は、\fBzfs_encrypt\fR(1M) を参照してください。
.RE

.SH 使用例
.LP
\fB例 1 \fRZFS ファイルシステム階層を作成する
.sp
.LP
次のコマンドは、\fBpool/home\fR という名前のファイルシステムと、\fBpool/home/bob\fR という名前のファイルシステムを作成します。マウントポイント \fB/export/home\fR が、親のファイルシステムに対して設定され、子のファイルシステムがそれを自動的に継承します。

.sp
.in +2
.nf
# \fBzfs create pool/home\fR
# \fBzfs set mountpoint=/export/home pool/home\fR
# \fBzfs create pool/home/bob\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRZFS スナップショットを作成する
.sp
.LP
次のコマンドは、\fByesterday\fR という名前のスナップショットを作成します。このスナップショットは、要求に応じて、\fBpool/home/bob\fR ファイルシステムのルートにある \fB\&.zfs/snapshot\fR ディレクトリにマウントされます。

.sp
.in +2
.nf
# \fBzfs snapshot pool/home/bob@yesterday\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR複数のスナップショットを作成および破棄する
.sp
.LP
次のコマンドは、\fBpool/home\fR とその子孫ファイルシステムの、\fByesterday\fR という名前のスナップショットを作成します。各スナップショットは必要に応じて、そのファイルシステムのルートの \fB\&.zfs/snapshot\fR ディレクトリにマウントされます。2 つ目のコマンドは、新しく作成されたスナップショットを破棄します。

.sp
.in +2
.nf
# \fBzfs snapshot -r pool/home@yesterday\fR
# \fBzfs destroy -r pool/home@yesterday\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRファイルシステムの圧縮を無効化および有効化する
.sp
.LP
次のコマンドは、\fBpool/home\fR 次のすべてのファイルシステムで \fBcompression\fR プロパティーを無効にします。次のコマンドは、\fBpool/home/anne\fR に対して \fBcompression\fR を明示的に有効にします。

.sp
.in +2
.nf
# \fBzfs set compression=off pool/home\fR
# \fBzfs set compression=on pool/home/anne\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fRZFS データセットを一覧表示する
.sp
.LP
次のコマンドは、システム内のアクティブなファイルシステムをすべて一覧表示します。スナップショットは、\fBlistsnaps\fR プロパティーが \fBon\fR の場合に表示されます。デフォルトは \fBoff\fR です。プールのプロパティーの詳細については、\fBzpool \fR(1M) を参照してください。

.sp
.in +2
.nf
# \fBzfs list\fR
   NAME                      USED  AVAIL  REFER  MOUNTPOINT
   pool                      450K   457G    18K  /pool
   pool/home                 315K   457G    21K  /export/home
   pool/home/anne             18K   457G    18K  /export/home/anne
   pool/home/bob             276K   457G   276K  /export/home/bob
.fi
.in -2
.sp

.LP
\fB例 6 \fRZFS ファイルシステムに割り当てを設定する
.sp
.LP
次のコマンドは、\fBpool/home/bob\fR に 30GB の割り当てを設定します。

.sp
.in +2
.nf
# \fBzfs set quota=30G pool/home/bob\fR
.fi
.in -2
.sp

.LP
\fB例 7 \fRZFS プロパティーを一覧表示する
.sp
.LP
次のコマンドは、\fBpool/home/bob\fR のプロパティーをすべて一覧表示します。

.sp
.in +2
.nf
# \fBzfs get all pool/home/bob\fR
NAME           PROPERTY              VALUE                  SOURCE
pool/home/bob  type                  filesystem             -
pool/home/bob  creation              Fri Jul 15 11:53 2011  -
pool/home/bob  used                  31K                    -
pool/home/bob  available             30.0G                  -
pool/home/bob  referenced            31K                    -
pool/home/bob  compressratio         1.00x                  -
pool/home/bob  mounted               yes                    -
pool/home/bob  quota                 30G                    local
pool/home/bob  reservation           none                   default
pool/home/bob  recordsize            128K                   default
pool/home/bob  mountpoint            /pool/home/bob         default
pool/home/bob  sharenfs              off                    default
pool/home/bob  checksum              on                     default
pool/home/bob  compression           on                     default
pool/home/bob  atime                 on                     default
pool/home/bob  devices               on                     default
pool/home/bob  exec                  on                     default
pool/home/bob  setuid                on                     default
pool/home/bob  readonly              off                    default
pool/home/bob  zoned                 off                    default
pool/home/bob  snapdir               hidden                 default
pool/home/bob  aclmode               discard                default
pool/home/bob  aclinherit            restricted             default
pool/home/bob  canmount              on                     default
pool/home/bob  xattr                 on                     default
pool/home/bob  copies                1                      default
pool/home/bob  version               5                      -
pool/home/bob  utf8only              off                    -
pool/home/bob  normalization         none                   -
pool/home/bob  casesensitivity       mixed                  -
pool/home/bob  vscan                 off                    default
pool/home/bob  nbmand                off                    default
pool/home/bob  sharesmb              off                    default
pool/home/bob  refquota              none                   default
pool/home/bob  refreservation        none                   default
pool/home/bob  primarycache          all                    default
pool/home/bob  secondarycache        all                    default
pool/home/bob  usedbysnapshots       0                      -
pool/home/bob  usedbydataset         31K                    -
pool/home/bob  usedbychildren        0                      -
pool/home/bob  usedbyrefreservation  0                      -
pool/home/bob  logbias               latency                default
pool/home/bob  dedup                 off                    default
pool/home/bob  mlslabel              none                   default
pool/home/bob  sync                  standard               default
pool/home/bob  encryption            off                    -
pool/home/bob  keysource             none                   default
pool/home/bob  keystatus             none                   -
pool/home/bob  rekeydate             -                      default
pool/home/bob  rstchown              on                     default
pool/home/bob  shadow                none                   -
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、プロパティー値を 1 つ取得します。

.sp
.in +2
.nf
# \fBzfs get -H -o value compression pool/home/bob\fR
on
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、\fBpool/home/bob\fR のローカル設定を持つプロパティーをすべて一覧表示します。

.sp
.in +2
.nf
# \fBzfs get -r -s local -o name,property,value all pool/home/bob\fR
NAME           PROPERTY              VALUE
pool/home/bob  quota                 30G
pool/home/bob  compression           on
.fi
.in -2
.sp

.LP
\fB例 8 \fRZFS ファイルシステムをロールバックする
.sp
.LP
次のコマンドは、\fBpool/home/anne\fR の内容を \fByesterday\fR という名前のスナップショットに戻し、中間のスナップショットをすべて削除します。

.sp
.in +2
.nf
# \fBzfs rollback -r pool/home/anne@yesterday\fR
.fi
.in -2
.sp

.LP
\fB例 9 \fRZFS クローンを作成する
.sp
.LP
次のコマンドは、初期内容が \fBpool/home/bob@yesterday\fR と同一の書き込み可能なファイルシステムを作成します。

.sp
.in +2
.nf
# \fBzfs clone pool/home/bob@yesterday pool/clone\fR
.fi
.in -2
.sp

.LP
\fB例 10 \fRZFS クローンの移行を促す
.sp
.LP
次の各コマンドは、クローン、クローンの移行の促進、および名前変更を実行することで、あるファイルシステムに対する変更内容をテストしたあと、その変更後のファイルシステムで元のファイルシステムを置き換える方法を示しています。

.sp
.in +2
.nf
# \fBzfs create pool/project/production\fR
  populate /pool/project/production with data
# \fBzfs snapshot pool/project/production@today\fR
# \fBzfs clone pool/project/production@today pool/project/beta\fR
make changes to /pool/project/beta and test them
# \fBzfs promote pool/project/beta\fR
# \fBzfs rename pool/project/production pool/project/legacy\fR
# \fBzfs rename pool/project/beta pool/project/production\fR
once the legacy version is no longer needed, it can be destroyed
# \fBzfs destroy pool/project/legacy\fR
.fi
.in -2
.sp

.LP
\fB例 11 \fRZFS プロパティーを継承する
.sp
.LP
次のコマンドにより、\fBpool/home/bob\fR および \fB pool/home/anne\fR は \fBchecksum\fR プロパティーを親から継承します。

.sp
.in +2
.nf
# \fBzfs inherit checksum pool/home/bob pool/home/anne\fR
.fi
.in -2
.sp

.LP
\fB例 12 \fRZFS データをリモートで複製する
.sp
.LP
次のコマンドは、リモートマシンにストリーム全体を送信してから、増分ストリームを送信して、\fBpoolB/received/fs@a\fR および \fBpoolB/received/fs@b\fR 内にそれぞれ復元します。\fBpoolB\fR には、ファイルシステム \fBpoolB/received\fR を含める必要があります。また、初期状態で \fBpoolB/received/fs\fR を含んでいてはいけません。

.sp
.in +2
.nf
# \fBzfs send pool/fs@a | \e\fR
   \fBssh host zfs receive poolB/received/fs@a\fR
# \fBzfs send -i a pool/fs@b | ssh host \e\fR
   \fBzfs receive poolB/received/fs\fR
.fi
.in -2
.sp

.LP
\fB例 13 \fR\fBzfs receive\fR \fB-d\fR オプションを使用する
.sp
.LP
次のコマンドは、\fBpoolA/fsA/fsB@snap\fR のストリーム全体をリモートマシンに送信し、\fBpoolB/received/fsA/fsB@snap\fR 内に受信します。受信するスナップショット名の \fBfsA/fsB@snap\fR 部分は、送信するスナップショットの名前に基づいて決定されます。\fBpoolB\fR には、ファイルシステム \fBpoolB/received\fR を含める必要があります。\fBpoolB/received/fsA\fR が存在しない場合、空のファイルシステムとして作成されます。

.sp
.in +2
.nf
# \fBzfs send poolA/fsA/fsB@snap | \e
   ssh host zfs receive -d poolB/received\fR
.fi
.in -2
.sp

.LP
\fB例 14 \fRユーザープロパティーを設定する
.sp
.LP
次の例では、データセットのユーザー定義プロパティー \fBcom.example:department\fR を設定します。

.sp
.in +2
.nf
# \fBzfs set com.example:department=12345 tank/accounting\fR
.fi
.in -2
.sp

.LP
\fB例 15 \fRローリングスナップショットを実行する
.sp
.LP
次の例は、一貫性のある命名方式でスナップショットの履歴を維持する方法を示しています。1 週間分のスナップショットを保持するために、ユーザーは次のように、もっとも古いスナップショットを破棄し、残りのスナップショットの名前を変更してから、新しいスナップショットを作成します。

.sp
.in +2
.nf
# \fBzfs destroy -r pool/users@7daysago\fR
# \fBzfs rename -r pool/users@6daysago @7daysago\fR
# \fBzfs rename -r pool/users@5daysago @6daysago\fR
# \fBzfs rename -r pool/users@4daysago @5daysago\fR
# \fBzfs rename -r pool/users@3daysago @4daysago\fR
# \fBzfs rename -r pool/users@2daysago @3daysago\fR
# \fBzfs rename -r pool/users@yesterday @2daysago\fR
# \fBzfs rename -r pool/users@today @yesterday\fR
# \fBzfs snapshot -r pool/users@today\fR
.fi
.in -2
.sp

.LP
\fB例 16 \fRZFS スナップショットの差異を表示する
.sp
.LP
次の例は、\fBzfs diff\fR \fB-F\fR および \fB-t\fR オプションを指定した場合の出力です。

.sp
.in +2
.nf
# \fBzfs diff -Ft myfiles@snap1\fR
1269962501.206726811   M   /   /myfiles/
1269962444.207369955   M   F   /myfiles/link_to_me      (+1)
1269962499.207519034   R       /myfiles/rename_me -> /myfiles/renamed
1269962431.813566720   -   F   /myfiles/delete_me
1269962518.666905544   +   F   /myfiles/new_file
1269962501.393099817   +   |   /myfiles/new_pipe
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
無効なコマンド行オプションが指定されました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/zfs
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBchmod\fR(1), \fBchown\fR(1), \fBpktool\fR(1), \fBssh\fR(1), \fBmount\fR(1M), \fBshadowd\fR(1M), \fBshare\fR(1M), \fBshare_nfs\fR(1M), \fBshare_smb\fR(1M), \fBunshare\fR(1M), \fBzonecfg\fR(1M), \fBzpool\fR(1M), \fBchmod\fR(2), \fBchown\fR(2), \fBstat\fR(2), \fBwrite\fR(2), \fBfsync\fR(3C), \fBdfstab\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5)
.sp
.LP
\fBgzip\fR(1) のマニュアルページを参照してください。これは SunOS マニュアルページコレクションには含まれていません。
.sp
.LP
その他の \fBZFS\fR 機能の詳細は、\fBzfs_allow\fR(1M)、\fBzfs_encrypt\fR(1M)、\fBzfs_share\fR(1M)、および\fI『『Oracle Solaris ZFS 管理ガイド』』\fRを参照してください。
.SH 注意事項
.sp
.LP
\fBdiff\fR サブコマンドによって変更されたことが示されているファイルは、複数の方法で変更された可能性があります。変更箇所の報告は、\fBst_ctim\fR の変更の原因となったあらゆるアクション (\fBstat\fR(2) を参照) に基づいて行われます。
