Arquivotheca/solaris11/usr/man/man/usr/share/man/ja_JP.UTF-8/man1m/zpool.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH zpool 1M "2011 年 5 月 31 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
zpool \- ZFS ストレージプールの構成
.SH 形式
.LP
.nf
\fBzpool\fR [\fB-?\fR]
.fi

.LP
.nf
\fBzpool help\fR \fIcommand\fR | help | \fIproperty\fR \fIproperty-name\fR
.fi

.LP
.nf
\fBzpool add\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] \fIpool\fR \fIvdev\fR ...
.fi

.LP
.nf
\fBzpool attach\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR \fInew_device\fR
.fi

.LP
.nf
\fBzpool clear\fR [\fB-F\fR [\fB-n\fR]] \fIpool\fR [\fIdevice\fR]
.fi

.LP
.nf
\fBzpool create\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] [\fB-o\fR \fIproperty=value\fR] ...
     [\fB-O\fR \fIfile-system-property=value\fR] ... [\fB-m\fR \fImountpoint\fR]
     [\fB-R\fR \fIroot\fR] \fIpool\fR \fIvdev\fR ...
.fi

.LP
.nf
\fBzpool destroy\fR [\fB-f\fR] \fIpool\fR
.fi

.LP
.nf
\fBzpool detach\fR \fIpool\fR \fIdevice\fR
.fi

.LP
.nf
\fBzpool export\fR [\fB-f\fR] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool get\fR "\fIall\fR" | \fIproperty\fR[,...] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool history\fR [\fB-il\fR] [\fIpool\fR] ...
.fi

.LP
.nf
\fBzpool import\fR [\fB-d\fR \fIpath\fR ...] [\fB-D\fR]
.fi

.LP
.nf
\fBzpool import\fR [\fB-o \fImntopts\fR\fR] [\fB-o\fR \fIproperty=value\fR] ... [\fB-d\fR \fIpath\fR ... |
     \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]] \fB-a\fR
.fi

.LP
.nf
\fBzpool import\fR [\fB-o \fImntopts\fR\fR] [\fB-o\fR \fIproperty=value\fR] ... [\fB-d\fR \fIpath\fR ... |
     \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]]
     \fIpool\fR | \fIid\fR [\fInewpool\fR]
.fi

.LP
.nf
\fBzpool iostat\fR [\fB-T\fR d|u ] [\fB-v\fR [\fB-l\fR]] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool list\fR [\fB-H\fR] [\fB-o\fR \fIproperty\fR[,...]] [\fB-T\fR d|u ] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool offline\fR [\fB-t\fR] \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool online\fR [\fB-e\fR] \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool remove\fR \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool replace\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR [\fInew_device\fR]
.fi

.LP
.nf
\fBzpool scrub\fR [\fB-s\fR] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool set\fR \fIproperty\fR=\fIvalue\fR \fIpool\fR
.fi

.LP
.nf
\fBzpool split\fR [\fB-R\fR \fIaltroot\fR] [\fB-n\fR [\fB-l\fR]] [\fB-o\fR \fImntopts\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] \fIpool\fR
     \fInewpool\fR [\fIdevice\fR ...]
.fi

.LP
.nf
\fBzpool status\fR [\fB-l\fR] [\fB-v\fR] [\fB-x\fR] [\fB-T\fR d|u ] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool upgrade\fR 
.fi

.LP
.nf
\fBzpool upgrade\fR \fB-v\fR
.fi

.LP
.nf
\fBzpool upgrade\fR [\fB-V\fR \fIversion\fR] \fB-a\fR | \fIpool\fR ...
.fi

.SH 機能説明
.sp
.LP
\fBzpool\fR コマンドは、\fBZFS\fR ストレージプールを構成します。ストレージプールは、\fBZFS\fR データセット用の物理ストレージおよびデータ複製を提供するデバイスの集合体です。
.sp
.LP
ストレージプール内部のすべてのデータセットは、同一の領域を共有します。データセットの管理については、\fBzfs\fR(1M) を参照してください。
.SS "仮想デバイス (\fBvdev\fR)"
.sp
.LP
「仮想デバイス」とは、特定のパフォーマンスおよび障害特性に従って編成された単一のデバイスまたはデバイスの集合体を指します。次の仮想デバイスがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBdisk\fR\fR
.ad
.sp .6
.RS 4n
ブロックデバイス。通常は \fB/dev/dsk\fR 内に存在します。\fBZFS\fR では、個別のスライスまたはパーティションを使用することが可能です。ただし、推奨されているのは、ディスク全体を使用する操作モードです。ディスクは、フルパスで指定することも、短縮名 (「/dev/dsk」以下のパスの相対部分) を使用することもできます。スライスやパーティションの指定を省略すると、ディスク全体を指定できます。また、ディスクの現在の場所を指定する \fB/dev/chassis/.../disk\fR パスを使って、ディスク全体を指定することもできます。ディスク全体を指定すると、\fBZFS\fR によりディスクのラベルが必要に応じて自動的に設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfile\fR\fR
.ad
.sp .6
.RS 4n
通常のファイル。ファイルをバッキングストアとして使用することは決してお勧めできません。ファイルのフォルトトレランスは、それが存在するファイルシステムと同程度に過ぎません。これは、主に実験用途を念頭に置いて設計されています。ファイルは、フルパスで指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmirror\fR\fR
.ad
.sp .6
.RS 4n
2 つ以上のデバイスのミラー。データの複製方法は、ミラーのすべてのコンポーネントで同じです。サイズ \fIX\fR のディスク \fIN\fR 台で構成されるミラーは、\fIX\fR バイトの格納が可能であり、(\fIN-1\fR) 台のデバイスで障害が発生してもデータの整合性が保たれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBraidz\fR\fR
.ad
.br
.na
\fB\fBraidz1\fR\fR
.ad
.br
.na
\fB\fBraidz2\fR\fR
.ad
.br
.na
\fB\fBraidz3\fR\fR
.ad
.sp .6
.RS 4n
\fBRAID-5\fR の一種。これを使用すると、パリティー分配の向上、および「\fBRAID-5\fR 書き込みホール」(電力喪失によりデータおよびパリティーに矛盾が発生する) の除去が可能になります。データおよびパリティーは、\fBraidz\fR グループ内の全ディスク間でストライプ化されます。
.sp
\fBraidz\fR グループは、シングルパリティー、ダブルパリティー、トリプルパリティーのいずれかを持つことができます。これはそれぞれ、\fBraidz\fR グループがデータを一切失うことなく、1 つ、2 つ、または 3 つの障害に耐えられることを意味します。\fBraidz1\fR \fBvdev\fR タイプはシングルパリティー \fBraidz\fR グループを、\fBraidz2\fR \fBvdev\fR タイプはダブルパリティー \fBraidz\fR グループを、\fBraidz3\fR \fBvdev\fR タイプはトリプルパリティー \fBraidz\fR グループを指定します。\fBraidz\fR \fBvdev\fR タイプは \fBraidz1\fR の別名です。
.sp
サイズ \fIX\fR のディスク \fIN\fR 台 (パリティーディスク \fIP\fR 台を含む) で構成される \fBraidz\fR グループには、約 (\fIN-P\fR)*\fIX\fR バイトを格納可能です。また、\fIP\fR 台のデバイスに障害が発生してもデータの整合性は損なわれません。\fBraidz\fR グループ内のデバイスの最小数は、パリティーディスクの数に 1 を加えたものです。パフォーマンス向上のために推奨される数は、3 から 9 までです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspare\fR\fR
.ad
.sp .6
.RS 4n
特定のプールで使用可能なホットスペアを追跡する特殊な擬似 \fBvdev\fR。詳細は、「ホットスペア」節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlog\fR\fR
.ad
.sp .6
.RS 4n
別個のインテントログデバイス。複数のログデバイスを指定すると、書き込みの負荷がデバイス間で分散されます。ログデバイスはミラー化できます。ただし、インテントログで \fBraidz\fR \fBvdev\fR タイプはサポートされていません。詳細は、「インテントログ」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcache\fR\fR
.ad
.sp .6
.RS 4n
ストレージプールのデータをキャッシュするために使用するデバイス。キャッシュデバイスをミラーまたは \fBraidz\fR グループとして構成することはできません。詳細は、「キャッシュデバイス」の節を参照してください。
.RE

.sp
.LP
仮想デバイスを入れ子にすることはできません。このため、ミラーまたは \fBraidz\fR 仮想デバイスに含めることができるのは、ファイルまたはディスクだけです。ミラーをミラー (またはその他の組み合わせを使用) することはできません。
.sp
.LP
プールでは、構成の最上位に任意の数の仮想デバイス (「ルート vdevs」と呼ばれる) を含めることができます。最上位の全デバイス間でデータが動的に配分されることで、デバイス間のデータ均衡が保たれます。新しい仮想デバイスが追加されると、\fBZFS\fR は使用可能になった新規デバイスにデータを自動的に格納します。
.sp
.LP
コマンド行で、複数の仮想デバイスを 1 つずつスペースで区切って指定できます。キーワード「mirror」や「raidz」は、グループが終了し、別のグループが開始することを示す場合に使用します。たとえば、次のコマンドは、それぞれが 2 台のディスクのミラーである 2 つのルート vdevs を作成します。
.sp
.in +2
.nf
# \fBzpool create mypool mirror c0t0d0 c0t1d0 mirror c1t0d0 c1t1d0\fR
.fi
.in -2
.sp

.sp
.LP
また、次のコマンドも使用可能です。 
.sp
.in +2
.nf
# \fBzpool create tank \e
mirror \e
    /dev/chassis/RACK29.U01-04/DISK_00/disk \e
    /dev/chassis/RACK29.U05-08/DISK_00/disk \e
mirror \e
    /dev/chassis/RACK29.U01-04/DISK_01/disk \e
    /dev/chassis/RACK29.U05-08/DISK_01/disk\fR
.fi
.in -2
.sp

.SS "デバイスの障害と復旧"
.sp
.LP
\fBZFS\fR では、デバイス障害およびデータ破壊を処理するための豊富なメカニズムがサポートされています。すべてのメタデータおよびデータのチェックサムが実行され、破壊が検出されると、\fBZFS\fR により不正なデータが正常なコピーを使って自動的に修復されます。
.sp
.LP
これらの機能を活用するため、プールでミラー化グループまたは \fBraidz\fR グループを使って、なんらかの形式の冗長性を利用する必要があります。\fBZFS\fR では、非冗長構成 (各ルート vdev は単なるディスクまたはファイル) での実行がサポートされていますが、この方法は決してお勧めできません。ビット破壊が 1 回発生するだけで、データの一部またはすべてが使用不可になる可能性があるためです。
.sp
.LP
プールの健全性ステータスは、次の 3 つのステータスのいずれかで表されます。 オンライン、機能低下、または障害ステータスです。オンラインプールでは、すべてのデバイスが正常に動作しています。機能低下プールでは、1 つ以上のデバイスで障害が発生していますが、冗長性構成のためにデータを引き続き使用できます。障害が発生したプールでは、メタデータが壊れているか、1 つ以上のデバイスで障害が発生しており、動作を継続するための複製が不足しています。 
.sp
.LP
ミラーや \fBraidz\fR デバイスなどの最上位 vdev の健全性は、それに関連付けられた vdev (コンポーネントデバイス) の状態に影響される可能性があります。最上位 vdev とコンポーネントデバイスの状態は、次のいずれかになります。
.sp
.ne 2
.mk
.na
\fB\fBDEGRADED\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上のコンポーネントデバイスがオフラインであるため、1 つ以上の最上位 vdev が機能低下状態になっています。動作を継続するための十分な複製が存在します。
.sp
1 つ以上のコンポーネントデバイスが機能低下または障害状態になっていますが、動作を継続するための十分な複製が存在します。その元となる条件は次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
チェックサムエラーの数が許容レベルを超え、デバイスの機能低下が発生してなんらかの障害の可能性を示しています。必要に応じて、\fBZFS\fR はそのデバイスを引き続き使用します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
入出力エラーの数が許容レベルを超えています。動作を継続するための複製が不足しているため、デバイスを障害状態としてマークできませんでした。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBFAULTED\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上のコンポーネントデバイスがオフラインであるため、1 つ以上の最上位 vdev が障害状態になっています。動作を継続するための複製が不足しています。 
.sp
1 つ以上のコンポーネントデバイスが障害状態になっており、動作を継続するための複製が不足しています。その元となる条件は次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
デバイスを開くことはできましたが、内容が期待された値と一致しませんでした。 
.RE
.RS +4
.TP
.ie t \(bu
.el o
入出力エラーの数が許容レベルを超え、デバイスは障害発生のため、今後使用できなくなりました。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBOFFLINE\fR\fR
.ad
.sp .6
.RS 4n
デバイスは「\fBzpool offline\fR」コマンドによって明示的にオフラインになりました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBONLINE\fR\fR
.ad
.sp .6
.RS 4n
デバイスはオンライン状態で動作しています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREMOVED\fR\fR
.ad
.sp .6
.RS 4n
システムの稼働中にデバイスが物理的に取り外されました。デバイスの取り外しの検出はハードウェアに依存しており、一部のプラットフォームではサポートされていない場合があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNAVAIL\fR\fR
.ad
.sp .6
.RS 4n
デバイスがオープンできないデバイスが使用不可状態のときにプールをインポートすると、デバイスのパスは最初から間違っているため、デバイスはパスの代わりに一意の識別子によって識別されます。
.RE

.sp
.LP
デバイスを削除したあとでシステムに再度接続すると、\fBZFS\fR は自動的にデバイスをオンラインにしようと試みます。デバイスの接続の検出はハードウェアに依存しており、一部のプラットフォームではサポートされていない場合があります。
.SS "ホットスペア"
.sp
.LP
\fBZFS\fR では、デバイスを「ホットスペア」としてプールに関連付けることができます。これらのデバイスはプール内でアクティブには使用されませんが、特定のアクティブデバイスで障害が発生すると、そのデバイスは特定のホットスペアで自動的に置き換えられます。ホットスペアを含むプールを作成するには、「spare」\fB vdev\fR と任意の数のデバイスを指定します。たとえば、次のように指定します。 
.sp
.in +2
.nf
# \fBzpool create pool mirror c0d0 c1d0 spare c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
スペアは \fBzpool add\fR コマンドで追加し、\fBzpool remove\fR コマンドで削除することができます。スペア置換が開始されると新しい「spare」\fBvdev\fR が構成内に作成されますが、元のデバイスが交換されるとそのスペアは削除されます。この時点で、別のデバイスで障害が発生すると、そのホットスペアは再度使用可能となります。
.sp
.LP
処理中のスペア置換を取り消すには、そのホットスペアを切り離します。障害の発生した元のデバイスが切り離されると、そのデバイスが構成内で占めていた位置にホットスペアが配置され、そのホットスペアがすべてのアクティブプールのスペアリストから削除されます。
.sp
.LP
障害が発生した元のデバイスが物理的に置き換えられてオンラインに戻るか、またはエラーが FMA イベントを通して、あるいは \fBzpool online\fR コマンドまたは \fBzpool clear\fR コマンドを使用してクリアーされ、かつ元のデバイスの状態が正常になった場合は、\fBINUSE\fR スペアデバイスが再度 \fBAVAIL\fR になります。
.sp
.LP
ログデバイスをスペアで置き換えることはできません。
.SS "インテントログ"
.sp
.LP
\fBZFS\fR インテントログ (\fBZIL\fR) は、同期トランザクションの \fBPOSIX\fR 要件を満たしています。たとえば、多くの場合、データベースがシステムコールから戻るときは、そのトランザクションが安定したストレージデバイス上に置かれている必要があります。\fBNFS\fR やその他のアプリケーションでは、データの安定性を確保するために \fBfsync\fR() も使用できます。デフォルトでは、インテントログはメインプール内のブロックから割り当てられます。ただし、\fBNVRAM\fR や専用ディスクなどの別個のインテントログデバイスを使用することにより、パフォーマンスを向上できる可能性があります。例: 
.sp
.in +2
.nf
# \fBzpool create pool c0d0 c1d0 log c2d0\fR
.fi
.in -2
.sp

.sp
.LP
複数のログデバイスを指定することもでき、それらをミラー化することもできます。複数のログデバイスをミラー化する例については、「使用例」の節を参照してください。
.sp
.LP
ログデバイスは、より大規模なプールの一部として、追加、置き換え、接続、切り離し、インポート、およびエクスポートできます。ミラー化されたログデバイスは、ログの最上位レベルのミラーを指定することによって削除できます。
.SS "キャッシュデバイス"
.sp
.LP
ストレージプールに「キャッシュデバイス」としてデバイスを追加できます。これらのデバイスにより、メインメモリーとディスクの間にキャッシュレイヤーが追加されます。集中的に読み取りを行う作業負荷の場合、作業セットのサイズがメインメモリーにキャッシュできるサイズを大きく超えますが、キャッシュデバイスを使用すると、この作業セットの大部分を低遅延メディアから提供できるようになります。キャッシュデバイスを使用すると、ほぼ静的なコンテンツをランダムに読み込む作業負荷のパフォーマンスが大幅に向上します。
.sp
.LP
キャッシュデバイスを含むプールを作成するには、「cache」\fBvdev\fR と任意の数のデバイスを指定します。例: 
.sp
.in +2
.nf
# \fBzpool create pool c0d0 c1d0 cache c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
キャッシュデバイスは、ミラー化することも、\fBraidz\fR 構成に含めることもできません。キャッシュデバイスで読み取りエラーが検出されると、ミラー化構成または \fBraidz\fR 構成に含まれている可能性があるオリジナルのストレージプールデバイスに対して、その読み取り \fBI/O\fR が再発行されます。
.sp
.LP
キャッシュデバイスの内容は、他のシステムキャッシュによるキャッシュと同様、揮発性であるとみなされます。
.SS "プロセス数"
.sp
.LP
インポートされたそれぞれのプールには、\fBzpool-\fR\fIpoolname\fR という名の関連プロセスがあります。このプロセスのスレッドはプールの入出力処理スレッドで、プールに関連付けられたすべての入出力に対して、圧縮、チェックサム、およびそのほかのタスクを処理します。このプロセスは、システムのストレージプールの CPU 使用状況を確認するために用意されています。このプロセスがあるため、インタフェースは不安定になっています。
.SS "プロパティー"
.sp
.LP
各プールには、いくつかのプロパティーが関連付けられています。一部のプロパティーは読み取り専用の統計ですが、その他はプールの動作を変更する構成可能なプロパティーです。次のプロパティーは読み取り専用です。
.sp
.ne 2
.mk
.na
\fB\fBallocated\fR\fR
.ad
.sp .6
.RS 4n
物理的に割り当てられているプール内の記憶容量。このプロパティーは、列の短縮名 \fBalloc\fR で参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcapacity\fR\fR
.ad
.sp .6
.RS 4n
プール内で使用されている領域の割合。このプロパティーは、列名の短縮形「cap」を使用しても参照できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdedupratio\fR\fR
.ad
.sp .6
.RS 4n
プールに対して指定された複製解除率。乗数で表記されます。この値は単一の 10 進数として表記されます。たとえば、\fBdedupratio\fR 値が \fB1.76\fR の場合、1.76 単位のデータが格納されていたものの、実際には 1 単位のディスク容量だけが消費されていたことを示します。このプロパティーは、列の短縮名 \fBdedup\fR を使用して参照することもできます。
.sp
複製解除を有効にするには、次のように指定します。
.sp
.in +2
.nf
# \fBzfs set dedup=on \fIpool\fR/\fIdataset\fR\fR
.fi
.in -2
.sp

デフォルト値は \fBoff\fR です。
.sp
複製解除機能についての詳細は、\fBzfs\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfree\fR\fR
.ad
.sp .6
.RS 4n
プール内の割り当てられないブロック数。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBguid\fR\fR
.ad
.sp .6
.RS 4n
プールの一意の識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhealth\fR\fR
.ad
.sp .6
.RS 4n
プールの現在の健全性。健全性は、「\fBONLINE\fR」、「\fBDEGRADED\fR」、「\fBFAULTED\fR」のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsize\fR\fR
.ad
.sp .6
.RS 4n
ストレージプールの合計サイズ。
.RE

.sp
.LP
これらの領域使用状況プロパティーでは、ストレージプールで使用可能な実際の物理容量が報告されます。物理容量は、内部の全データセットが実際に使用可能な総容量とは異なる場合があります。\fBraidz\fR 構成で使用される容量は、書き込まれるデータの特性により異なります。また、\fBZFS\fR は、\fBzfs\fR(1M) コマンドが考慮に入れる内部アカウンティングのための容量を確保します。しかし、\fBzpool\fR コマンドでは内部アカウンティングを考慮しません。容量に余裕のある適切なサイズのプールの場合、これらの影響は見えません。小さなプールまたは容量全体がほぼ使用されているプールの場合、これらの相違はより目立つようになります。
.sp
.LP
次のプロパティーは、作成時およびインポート時に設定できます。
.sp
.ne 2
.mk
.na
\fB\fBaltroot\fR\fR
.ad
.sp .6
.RS 4n
代替ルートディレクトリ。設定されている場合、プール内のすべてのマウントポイントの先頭にこのディレクトリが付加されます。このプロパティーは、マウントポイントが信頼できない不明なプールを調べるときや、通常のパスが有効でない代替ブート環境で使用できます。\fBaltroot\fR は永続的プロパティーではありません。システムが稼働しているときにのみ有効です。\fBaltroot\fR を設定すると、デフォルトで \fBcachefile\fR=none が使用されます。ただし、これは明示的な設定を使用して上書きできます。
.RE

.sp
.LP
次のプロパティーは、インポート時に設定できます。
.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
このプールを変更できるかどうかを制御します。有効になっている場合は、そのプールが読み取り/書き込みモードでインポートされるまで、インテントログ内にのみ存在するどの同期データにもアクセスできません。
.sp
読み取り専用モードでのプールのインポートには、次の制限事項があります。
.RS +4
.TP
.ie t \(bu
.el o
インポート中に追加のプールプロパティーを設定しようとしても無視されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ファイルシステムのマウントはすべて、読み取り専用 (\fBro\fR) マウントオプションを含むように変換されます。
.RE
読み取り専用モードでインポートされたプールは、そのプールをエクスポートおよびインポートすることによって読み取り/書き込みモードに戻すことができます。
.RE

.sp
.LP
次のプロパティーは作成時とインポート時に設定でき、あとで \fBzpool set\fR コマンドを使用して変更できます。
.sp
.ne 2
.mk
.na
\fB\fBautoexpand\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
基本となる LUN が増えたときに、自動プール拡張を制御します。\fBon\fR に設定すると、拡張されたデバイスのサイズに応じてプールのサイズが変更されます。デバイスがミラーまたは \fBraidz\fR に含まれている場合、プールで新しい容量を使用できるようにするには、そのミラー/\fBraidz\fR グループ内のすべてのデバイスを拡張する必要があります。デフォルトの動作は \fBoff\fR です。このプロパティーは、列の短縮名 \fBexpand\fR を使用して参照することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBautoreplace\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
自動デバイス交換を制御します。「\fBoff\fR」に設定されている場合、管理者が「\fBzpool replace\fR」コマンドを使ってデバイス交換を開始する必要があります。「\fBon\fR」に設定されている場合、そのプールに以前属していたデバイスと物理的に同じ位置にある新しいデバイスは、いずれも自動的にフォーマットされ、置き換えられます。デフォルトの動作は「\fBoff\fR」です。このプロパティーは、列名の短縮形「replace」を使用しても参照できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbootfs\fR=\fIpool\fR/\fIdataset\fR\fR
.ad
.sp .6
.RS 4n
ルートプールのデフォルトのブート可能データセットを示します。このプロパティーは、主にインストールプログラムとアップグレードプログラムによって設定されるものと想定されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcachefile\fR=\fIpath\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
プール構成をキャッシュする場所を制御します。システムの起動時にすべてのプールを見つけるには、ルートファイルシステムに保存されている構成データのキャッシュされたコピーが必要です。システムのブート時に、このキャッシュ内のすべてのプールが自動的にインポートされます。インストール環境やクラスタ化環境などの一部の環境では、プールが自動的にインポートされないようにするために、この情報を別の場所にキャッシュする必要があります。このプロパティーを設定すると、プール構成を別の場所にキャッシュし、あとで「\fBzpool import -c\fR」コマンドを使用してインポートできます。特殊な値「\fBnone\fR」に設定すると、キャッシュされることのない一時プールが作成されます。特殊な値 \fB\&''\fR (空の文字列) に設定すると、デフォルトの場所が使用されます。 
.sp
同じキャッシュファイルを複数のプールで共有できます。プールの追加時と削除時に、このファイルはカーネルによって破棄され再作成されるため、このファイルにアクセスしようとするときは注意が必要です。キャッシュファイルを使用している最後のプールがエクスポートまたは破棄されると、そのファイルは削除されます。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBdedupditto\fR=\fInumber\fR\fR
.ad
.sp .6
.RS 4n
コピー数のしきい値を設定します。複製解除されたブロックの参照数がこのしきい値を超えると、そのブロックの別の複製コピーが自動的に格納されます。デフォルト値は \fB0\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelegation\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
データセットに定義されているデータセットのアクセス権に基づいて非特権ユーザーにアクセス権を付与するかどうかを制御します。\fBZFS\fR 委任管理の詳細については、\fBzfs\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailmode\fR=\fBwait\fR | \fBcontinue\fR | \fBpanic\fR\fR
.ad
.sp .6
.RS 4n
壊滅的なプール障害が発生した場合のシステムの動作を制御します。通常は、配下のストレージデバイスへの接続が失われた場合や、プール内のすべてのデバイスに障害が発生した場合に、このような状況になります。このような場合の動作は、次のように決定されます。
.sp
.ne 2
.mk
.na
\fB\fBwait\fR\fR
.ad
.sp .6
.RS 4n
デバイスへの接続が復元され、エラーがクリアされるまで、プールに対するすべての入出力アクセスをブロックします。\fB\fRデバイスの問題が解決されるまで、プールの状態は wait のままです。これはデフォルトの動作です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcontinue\fR\fR
.ad
.sp .6
.RS 4n
新しい書き込み入出力要求には \fBEIO\fR を返しますが、正常な残りのデバイスに対する読み取りは許可します。\fB\fRまだディスクにコミットされていない書き込み要求はブロックされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpanic\fR\fR
.ad
.sp .6
.RS 4n
コンソールにメッセージを出力し、システムクラッシュダンプを生成します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBlistsnaps\fR=on | off\fR
.ad
.sp .6
.RS 4n
\fB-t\fR オプションを指定せずに「\fBzfs list\fR」を実行しているときに、このプールに関連付けられたスナップショットに関する情報を出力するかどうかを制御します。デフォルト値は「off」です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBversion\fR=\fIversion\fR\fR
.ad
.sp .6
.RS 4n
プールの現在のディスク上バージョン。この値を増やすことはできても、減らすことはできません。プールを更新する方法としては \fBzpool upgrade\fR コマンドをお勧めしますが、下位互換性のために特定のバージョンが必要な場合には、このプロパティーを使用できます。このプロパティーには、1 から \fBzpool upgrade -v\fR で報告される現在のバージョンまでの任意の数値を設定できます。
.RE

.SS "サブコマンド"
.sp
.LP
状態を変更するサブコマンドはすべて、元の形式でプールに永続的に記録されます。
.sp
.LP
\fBzpool\fR コマンドの提供するサブコマンドを使用すると、ストレージプールの作成と破棄、ストレージプールへの容量の追加、およびストレージプールに関する情報提供を行えます。サポートされているサブコマンドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBzpool\fR \fB-?\fR\fR
.ad
.sp .6
.RS 4n
ヘルプメッセージを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool help\fR \fIcommand\fR | \fBhelp\fR | \fIproperty\fR \fIproperty-name\fR\fR
.ad
.sp .6
.RS 4n
\fBzpool\fR コマンドの使用法を表示します。 特定のコマンドまたはプロパティーのヘルプを表示できます。 特定のコマンドまたはプロパティーのヘルプを表示すると、コマンドの構文または使用可能なプロパティー値が表示されます。引数を指定しないで \fBzpool help\fR を使用すると、\fBzpool\fR コマンドの完全なリストが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool add\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]]\fIpool\fR \fIvdev\fR ...\fR
.ad
.sp .6
.RS 4n
指定された仮想デバイスを指定したプールに追加します。\fIvdev\fR の仕様については、「仮想デバイス」の節を参照してください。\fB-f\fR オプションの動作、および実行されるデバイス検査については、「zpool create」サブコマンドを参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
使用中と表示されていたり、競合する複製レベルが指定されていたとしても、\fBvdev\fR の使用を強制します。この方法で、すべてのデバイスを上書きできるわけではありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fBvdev\fR を実際に追加することなく、使用される構成を表示します。実際のプール作成は、特権の不足またはデバイス共有のために失敗する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-n\fR は現在の \fB/dev/chassis\fR の場所の形式で構成を表示します。
.RE

現在構成されているディスクは、定足数デバイスとして zpool に追加しないでください。ディスクをプールに追加したあとで、そのディスクを定足数デバイスとして構成できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool attach\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR \fInew_device\fR\fR
.ad
.sp .6
.RS 4n
\fInew_device\fR を既存の \fBzpool\fR デバイスに接続します。既存のデバイスを、\fBraidz\fR 構成の一部にすることはできません。\fIdevice\fR が現在ミラー構成の一部ではない場合、\fIdevice\fR は \fIdevice\fR および \fInew_device\fR の 2 方向のミラーに自動的に変換されます。\fIdevice\fR が 2 方向ミラーの一部である場合、\fInew_device\fR を接続すると 3 方向ミラーが作成され、以下同様に作成されます。どの場合でも、\fInew_device\fR の再同期化がすぐに開始されます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
\fInew_device\fR が使用中と表示されている場合でも、これを強制的に使用します。この方法で、すべてのデバイスを上書きできるわけではありません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool clear\fR [\fB-F\fR [\fB-n\fR]] \fIpool\fR [\fIdevice\fR] ...\fR
.ad
.sp .6
.RS 4n
プール内のデバイスエラーをクリアします。引数を指定しない場合、プール内のすべてのデバイスエラーがクリアされます。1 つ以上のデバイスを指定すると、指定したデバイスに関連するエラーだけがクリアされます。
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
開くことのできないプールに対して回復モードを開始します。プール内にある最後のいくつかのトランザクションを破棄して、開くことのできる状態に戻そうと試みます。このオプションを使用しても、損傷を受けたすべてのプールを回復できるわけではありません。成功した場合、破棄されたトランザクションのデータは回復されずに失われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fB-F\fR フラグと組み合わせて使用します。トランザクションの破棄によってプールが開くことのできる状態になるかどうかを調べますが、実際にトランザクションを破棄することはありません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool create\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] [\fB-o\fR \fIproperty=value\fR] ... [\fB-O\fR \fIfile-system-property=value\fR] ... [\fB-m\fR \fImountpoint \fR] [\fB-R\fR \fIroot\fR] \fIpool\fR \fIvdev\fR ...\fR
.ad
.sp .6
.RS 4n
コマンド行で指定した仮想デバイスを含む新規ストレージプールを作成します。プール名の先頭は文字でなければなりません。また、プール名に含めることができるのは、英数字、下線 (「_」)、ダッシュ (「-」)、およびピリオド (「.」) です。\fBmirror\fR、\fBraidz\fR、\fBspare\fR、\fBlog\fR の各プール名、およびパターン \fBc\fR[\fB0-9\fR] で始まる名前は予約されています。\fBvdev\fR の仕様については、「仮想デバイス」の節を参照してください。
.sp
このコマンドは、指定された各デバイスがアクセス可能であり、現在別のサブシステムにより使用されていないことを確認します。ある種の用法 (現在マウントされている、専用のダンプデバイスとして指定されているなど) では、\fBZFS\fR によるデバイスの使用が妨げられます。\fB-f\fR オプションを使用すると、その他の用法 (既存の \fBUFS\fR ファイルシステムの使用など) を上書きできます。
.sp
このコマンドは、プールの複製方法が一貫しているかどうかもチェックします。\fB-f\fR を指定せずに、単一のプール内で冗長ストレージと非冗長ストレージの結合を試みたり、ディスクとファイルの混在を試みると、エラーが発生します。\fB-f\fR を指定せずに、単一の \fBraidz\fR またはミラーグループ内でサイズの異なるデバイスを使用しても、エラーのフラグが付けられます。
.sp
\fB-R\fR オプションを指定しない場合の、デフォルトのマウントポイントは「/\fIpool\fR」です。このマウントポイントは存在しないか、空でなければなりません。さもないと、ルートデータセットをマウントすることはできません。これは、\fB-m\fR オプションを使って上書きできます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
使用中と表示されていたり、競合する複製レベルが指定されていたとしても、\fBvdev\fR の使用を強制します。この方法で、すべてのデバイスを上書きできるわけではありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
使用する設定を、実際にプールを作成せずに表示します。実際のプール作成は、特権不足やデバイスが現在使用中などのために、まだ失敗する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-n\fR は現在の \fB/dev/chassis\fR の場所の形式で構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR [\fB-o\fR \fIproperty=value\fR] ...\fR
.ad
.sp .6
.RS 4n
指定されたプールのプロパティーを設定します。設定できる有効なプロパティーのリストについては、「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR \fIfile-system-property=value\fR\fR
.ad
.br
.na
\fB[\fB-O\fR \fIfile-system-property=value\fR] ...\fR
.ad
.sp .6
.RS 4n
プールの最上位レベルのファイルシステムの指定されたプロパティーを設定します。設定できる有効なプロパティーのリストについては、\fBzfs\fR(1M) の「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
「-o cachefile=none,altroot=\fIroot\fR」と同等
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImountpoint\fR\fR
.ad
.sp .6
.RS 4n
プールの最上位レベルのファイルシステムのマウントポイントを設定します。デフォルトのマウントポイントは、「/\fIpool\fR」です。または、\fBaltroot\fR が指定されている場合は「\fBaltroot\fR/\fIpool\fR」です。このマウントポイントは絶対パス、「\fBlegacy\fR」または「\fBnone\fR」でなければなりません。データセットマウントポイントの詳細は、\fBzfs\fR(1M)を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool destroy\fR [\fB-f\fR] \fIpool\fR\fR
.ad
.sp .6
.RS 4n
指定したプールを破棄し、すべてのデバイスを解放してほかの用途で使用できるようにします。このコマンドは、プールを破棄する前に、アクティブなデータセットすべてのマウント解除を試みます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
プール内に含まれるアクティブなデータセットすべてのマウント解除を強制的に行います。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool detach\fR \fIpool\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
ミラー化されたストレージプールからデバイスまたはスペアを切り離します。\fI\fR既存のデバイスが物理的に置き換えられた場合は、RAID-Z ストレージプールからスペアを切り離すこともできます。また、スペアで置き換えられた場合は、RAID-Z ストレージプールの既存デバイスを切り離すこともできます。データの有効な複製がほかに存在しない場合、この操作は拒否されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool export\fR [\fB-f\fR] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
指定したプールをシステムからエクスポートします。すべてのデバイスにエクスポート済みのマークが付けられますが、別のサブシステムからは引き続き使用中と見なされます。十分な数のデバイスが存在するかぎり、このデバイスをシステム間 (エンディアンの異なるシステムを含む) で移動またはインポートすることが可能です。
.sp
プールをエクスポートする前に、プール内のすべてのデータセットがマウント解除されます。
.sp
プールを可搬性のあるものにするため、\fBzpool\fR コマンドに単なるスライスではなく、ディスク全体を指定する必要があります。これにより、\fBZFS\fR は可搬性のある \fBEFI\fR ラベルをディスクに設定します。そうしなければ、エンディアンの異なるプラットフォーム上のディスクドライバは、ディスクを認識しません。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
「\fBunmount -f\fR」コマンドを使用して、すべてのデータセットを強制的にマウント解除します。
.sp
このコマンドは強制的にプールをエクスポートします。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool get\fR "\fIall\fR" | \fIproperty\fR[,...] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
指定されたストレージプールについて、指定されたプロパティー (「\fBall\fR」が指定された場合はすべてのプロパティー) のリストを取得します。これらのプロパティーは、次のフィールドで表示されます。
.sp
.in +2
.nf
       name          Name of storage pool
        property      Property name
        value         Property value
        source        Property source, either 'default' or 'local'.
.fi
.in -2
.sp

使用可能なプールプロパティーの詳細については、「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool history\fR [\fB-il\fR] [\fIpool\fR] ...\fR
.ad
.sp .6
.RS 4n
指定したプール (プールを指定しない場合はすべてのプール) のコマンド履歴を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
ユーザーによって開始されたイベントに加え、内部で記録された \fBZFS\fR イベントを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
ログレコードを長形式で表示します。これには、標準形式のほかに、ユーザー名、ホスト名、および操作が実行されたゾーンが含まれます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile\fR] [\fB-D\fR]\fR
.ad
.sp .6
.RS 4n
インポートに使用可能なプールを一覧表示します。\fB-d\fR オプションを指定しない場合、このコマンドは \fB/dev/dsk\fR 内のデバイスを検索します。\fB-d\fR オプションは、複数回指定できます。このオプションを指定すると、すべてのディレクトリおよびデバイスパスが検索されます。デバイスがエクスポートされたプールの一部として表示される場合、このコマンドは、プールの名前、数値識別子、および各デバイスやファイルの \fIvdev\fR レイアウトと現在の健全性を含むプールの要約を表示します。\fB-D\fR オプションを指定しないかぎり、破棄プール、つまり \fBzpool destroy\fR コマンドを使用して以前に破棄されたプールは表示されません。 
.sp
数値識別子は一意であり、エクスポートされた同名のプールを複数利用可能な場合にプール名の代わりに使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
「\fBcachefile\fR」プールプロパティーで作成された指定の \fBcachefile\fR から構成を読み取ります。デバイスを検索する代わりに、この \fBcachefile\fR が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
\fIpath\fR 内のデバイスまたはファイルを検索します。ここで、\fIpath\fR にはディレクトリまたはデバイスパスを指定できます。\fB-d\fR オプションは複数回指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
破棄されたプールだけを一覧表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-o\fR \fImntopts\fR] [ \fB-o\fR \fIproperty\fR=\fIvalue\fR] ... [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile \fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]] \fB-a\fR\fR
.ad
.sp .6
.RS 4n
検索ディレクトリまたはデバイスパスで見つかったすべてのプールをインポートします。十分な数のデバイスを使用可能なプールがすべてインポートされることを除き、前のコマンドと同じです。\fB-D\fR オプションを指定しないかぎり、破棄プール、つまり、\fBzpool destroy\fR コマンドを使用して以前に破棄されたプールはインポートされません。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
プール内のデータセットのマウント時に使用するマウントオプションのコンマ区切りのリスト。データセットのプロパティーとマウントオプションの説明については、\fBzfs\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR\fR
.ad
.sp .6
.RS 4n
インポートされたプールに、指定されたプロパティーを設定します。使用可能なプールプロパティーの詳細については、「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
「\fBcachefile\fR」プールプロパティーで作成された指定の \fBcachefile\fR から構成を読み取ります。デバイスを検索する代わりに、この \fBcachefile\fR が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
デバイスまたはファイルを \fIpath\fR 内で検索します。\fB-d\fR オプションは複数回指定できます。このオプションは \fB-c\fR オプションと同時には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
破棄されたプールだけをインポートします。\fB-f\fR オプションも指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
プールが潜在的にアクティブであると表示されている場合でも、インポートを強制的に実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
インポート不可能なプールの回復モード。最後のいくつかのトランザクションを破棄することによって、プールをインポート可能な状態に戻そうとします。このオプションを使用しても、損傷を受けたすべてのプールを回復できるわけではありません。成功した場合、破棄されたトランザクションのデータは回復されずに失われます。このオプションは、プールがインポート可能であるか、すでにインポートされている場合には無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
プールを検索し、見つかったすべてのプールをインポートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
ログデバイスがない場合のプールのインポートを許可します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
「\fBcachefile\fR」プロパティーを「\fBnone\fR」、「\fIaltroot\fR」プロパティーを「\fIroot\fR」に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR \fR
.ad
.sp .6
.RS 4n
ファイルシステムをマウントせずにプールをインポートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fB-F\fR 回復オプションとともに使用します。インポート不可能なプールを再度インポート可能にできるかどうかを判断しますが、実際にはプール回復を実行することはありません。プール回復モードの詳細については、前述の \fB-F\fR オプションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-n\fR は現在の \fB/dev/chassis\fR の場所の形式で情報を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-o\fR \fImntopts\fR] [ \fB-o\fR \fIproperty\fR=\fIvalue\fR] ... [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile \fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]] \fIpool\fR | \fIid\fR [\fInewpool\fR]\fR
.ad
.sp .6
.RS 4n
特定のプールをインポートします。プールは、名前または数値識別子を使って識別できます。\fInewpool\fR が指定されている場合、プールは永続的な名前 \fInewpool\fR を使用してインポートされます。それ以外の場合は、エクスポートされた名前と同じ名前を使ってインポートが行われます。ルートプールを新しい名前でインポートしないでください。そうでないと、システムがブートしなくなる可能性があります。
.sp
\fBzpool export\fR を最初に実行せずにシステムからデバイスを削除すると、そのデバイスは潜在的にアクティブな状態として表示されます。これがエクスポートの失敗を示すのか、デバイスが別のホストにより実際に使用されていることを示すのかを見分けることはできません。この状態のプールをインポートするには、\fB-f\fR オプションを指定する必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
プール内のデータセットのマウント時に使用するマウントオプションのコンマ区切りのリスト。データセットのプロパティーとマウントオプションの説明については、\fBzfs\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR\fR
.ad
.sp .6
.RS 4n
インポートされたプールに、指定されたプロパティーを設定します。使用可能なプールプロパティーの詳細については、「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
「\fBcachefile\fR」プールプロパティーで作成された指定の \fBcachefile\fR から構成を読み取ります。デバイスを検索する代わりに、この \fBcachefile\fR が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
デバイスまたはファイルを \fIpath\fR 内で検索します。\fB-d\fR オプションは複数回指定できます。このオプションは \fB-c\fR オプションと同時には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
破棄されたプールをインポートします。\fB-f\fR オプションも指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
プールが潜在的にアクティブであると表示されている場合でも、インポートを強制的に実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
インポート不可能なプールの回復モード。最後のいくつかのトランザクションを破棄することによって、プールをインポート可能な状態に戻そうとします。このオプションを使用しても、損傷を受けたすべてのプールを回復できるわけではありません。成功した場合、破棄されたトランザクションのデータは回復されずに失われます。このオプションは、プールがインポート可能であるか、すでにインポートされている場合には無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
「\fBcachefile\fR」プロパティーを「\fBnone\fR」、「\fIaltroot\fR」プロパティーを「\fIroot\fR」に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
\fB-F\fR 回復オプションとともに使用します。インポート不可能なプールを再度インポート可能にできるかどうかを判断しますが、実際にはプール回復を実行することはありません。プール回復モードの詳細については、前述の \fB-F\fR オプションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-n\fR は現在の \fB/dev/chassis\fR の場所の形式で情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
ログデバイスがない場合のプールのインポートを許可します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool iostat\fR [\fB-T\fR \fBd\fR|\fBu\fR] [\fB-v\fR [\fB-l\fR]] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]\fR
.ad
.sp .6
.RS 4n
指定したプールの \fBI/O\fR 統計を表示します。間隔を指定した場合、\fBCtrl-C\fR キーを押すまで、統計が \fIinterval\fR 秒ごとに出力されます。\fIpools\fR を指定しない場合、システム内のすべてのプールの統計が表示されます。\fIcount\fR を指定した場合、このコマンドは \fIcount\fR レポートの出力後に配置されます。
.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
タイムスタンプを表示します。
.sp
標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。  
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
詳細な統計。プール全体の統計とともに、プール内の各 \fIvdevs\fR の使用状況統計をレポートします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-v\fR は現在の \fB/dev/chassis\fR  の場所の形式で \fBvdev\fR 統計を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool list\fR [\fB-H\fR] [\fB-o\fR \fIprops\fR[,...]] [\fB-T\fR \fBd\fR|\fBu\fR] [\fIpool\fR] ...\fR
.ad
.sp .6
.RS 4n
指定したプールについて、健全性ステータスおよび領域使用状況を一覧表示します。引数を指定しない場合、システム内のすべてのプールが表示されます。
.sp
間隔を指定した場合、Ctrl-C キーを押すまで、ステータスおよび領域使用状況が \fIinterval\fR 秒ごとに表示されます。\fIcount\fR を指定した場合、このコマンドは \fIcount\fR レポートの表示後に終了します。
.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
スクリプトモード。ヘッダーを表示せず、フィールドを任意のスペース文字ではなく単一のタブで区切ります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIprops\fR\fR
.ad
.sp .6
.RS 4n
表示するプロパティーのコンマ区切りのリスト。有効なプロパティーのリストについては、「プロパティー」の節を参照してください。デフォルトのリストは、\fBname\fR、\fBsize\fR、\fBallocated\fR、\fBfree\fR、\fBcapacity\fR、\fBhealth\fR、\fBaltroot\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
タイムスタンプを表示します。
.sp
標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。  
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool offline\fR [\fB-t\fR] \fIpool\fR \fIdevice\fR ...\fR
.ad
.sp .6
.RS 4n
指定した物理デバイスをオフラインにします。オフライン状態にある \fIdevice\fR に対して、読み取りや書き込みは行われません。
.sp
このコマンドは、スペアまたはキャッシュデバイスには使用できません。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
一時的に使用する場合に指定します。リブートすると、指定した物理デバイスは以前の状態に戻ります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool online\fR [\fB-e\fR] \fIpool\fR \fIdevice\fR...\fR
.ad
.sp .6
.RS 4n
指定した物理デバイスをオンラインにします。
.sp
このコマンドは、スペアまたはキャッシュデバイスには使用できません。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべての容量を使用するようにデバイスを拡張します。デバイスがミラーまたは \fBraidz\fR に含まれている場合、プールで新しい容量を使用できるようにするには、すべてのデバイスを拡張する必要があります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool remove\fR \fIpool\fR \fIdevice\fR ...\fR
.ad
.sp .6
.RS 4n
指定されたデバイスをプールから削除します。現在、このコマンドでは、ホットスペア、キャッシュ、およびログデバイスの削除のみをサポートしています。ミラー化されたログデバイスは、ログの最上位レベルのミラーを指定することによって削除できます。ミラー構成の一部となっている非ログデバイスは、\fBzpool detach\fR コマンドを使用すると削除できます。非冗長デバイスおよび \fBraidz\fR デバイスはプールから削除することはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool replace\fR [\fB-f\fR] \fIpool\fR \fIold_device\fR [\fInew_device\fR]\fR
.ad
.sp .6
.RS 4n
\fIold_device\fR を \fInew_device\fR で置き換えます。これは、\fInew_device\fR を接続し、再同期化の実行まで待機してから \fIold_device\fR を切り離す操作と同等です。
.sp
\fInew_device\fR のサイズは、ミラーまたは \fBraidz\fR 構成内の全デバイスの最小サイズ以上でなければなりません。
.sp
\fInew_device\fR は、プールに冗長性がない場合に必要です。\fInew_device\fR を指定しない場合、デフォルトの \fIold_device\fR が使用されます。この置換形式は、既存のディスクで障害が発生したためにディスクを物理的に交換したあとで実行する場合に役立ちます。この場合、実際には別のディスクであっても、新規ディスクには以前のデバイスと同じ \fB/dev/dsk\fR パスが使用されます。これは、\fBZFS\fR により認識されます。
.sp
\fBzpool status\fR 出力では、\fIold_device\fR はワード \fBreplacing\fR の下に表示され、文字列 \fB/old\fR が付加されます。再同期化が完了すると、\fBreplacing\fR と \fIold_device\fR の両方が自動的に削除されます。再同期化が完了する前に新しいデバイスに障害が発生し、第 3 のデバイスが代わりに取り付けられると、障害が発生した両方のデバイスは \fB/old\fR が付加された状態で表示され、再同期化がもう一度開始されます。再同期化が完了すると、両方の \fB/old\fR デバイスは、ワード \fBreplacing\fR とともに削除されます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
\fInew_device\fR が使用中と表示されている場合でも、これを強制的に使用します。この方法で、すべてのデバイスを上書きできるわけではありません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool scrub\fR [\fB-s\fR] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
消し込みを開始します。消し込みにより、指定したプール内のすべてのデータが検査され、チェックサムが適正に検証されます。複製された (ミラーまたは \fBraidz\fR) デバイスの場合、消し込み中に検出されたすべての損傷は、\fBZFS\fR により自動的に修復されます。「\fBzpool status\fR」コマンドは、消し込みの進捗状況をレポートします。また、完了時には消し込み結果の概要を出力します。
.sp
消し込みおよび再同期化は、非常に類似した操作です。相違点は、再同期化では \fBZFS\fR が期限切れであることを認識しているデータだけが検査されますが (新規デバイスをミラーに接続する場合や、既存のデバイスを置換する場合など)、消し込みではすべてのデータが検査されるため、ハードウェア障害やディスク障害に起因する非表示のエラーも検出されます。
.sp
消し込みと再同期化は、\fBI/O\fR 集約的な操作であるため、\fBZFS\fR では一度に 1 つの操作だけが許可されます。消し込みがすでに進行している場合、以降の「\fBzpool scrub\fR」はエラーを返し、\fBzpool scrub\fR \fB- s\fR を使用して現在の消し込みを取り消すことを勧めるアドバイスが表示されます。進行中の再同期化が存在する場合、\fBZFS\fR は、再同期化が完了するまで書き込みの開始を許可しません。
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
消し込みを停止します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool set\fR \fIproperty\fR=\fIvalue\fR \fIpool\fR\fR
.ad
.sp .6
.RS 4n
指定されたプールに、特定のプロパティーを設定します。設定可能なプロパティーおよび有効な値については、「プロパティー」の節を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool split\fR [\fB-R\fR \fIaltroot\fR] [\fB-n\fR [\fB-l\fR]] [\fB-o\fR \fImntopts\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] \fI pool\fR \fInewpool\fR [\fIdevice\fR ...]\fR
.ad
.sp .6
.RS 4n
プール内のミラー化された各最上位 vdev から 1 つのディスクを分割し、分割したディスクから新しいプールを作成します。元のプールは 1 つ以上のミラーから構成されている必要があり、再同期化のプロセスが進行中であってはいけません。\fBsplit\fR サブコマンドは、コマンド行でのデバイス指定によって上書きされないかぎり、各ミラー vdev の最後のデバイスを選択します。
.sp
\fIdevice\fR 引数を使用した場合、\fBsplit\fR は指定されたデバイスを新しいプールに含め、どのデバイスも指定されないままであれば、通常どおり、各ミラー vdev 内の最後のデバイスをそのプールに割り当てます。\fBsplit\fR コマンドの結果が不明な場合は、\fB-n\fR (「予行演習」) オプションを使用して、コマンドが意図した結果をもたらすことを確認します。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIaltroot\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIaltroot\fR パラメータを新しいプールの代替ルートに使用して、分割後に新しく作成されたプールを自動的にインポートします。前述の「プロパティー」節の \fBaltroot\fR の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
作成される構成を、実際にプールを分割せずに表示します。実際のプール分割は、特権の不足やデバイスのステータスのために失敗する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、\fB-n\fR は現在の \fB/dev/chassis\fR の場所の形式で構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
プール内のデータセットのマウント時に使用するマウントオプションのコンマ区切りのリスト。データセットのプロパティーとマウントオプションの説明については、\fBzfs\fR(1M) を参照してください。\fB-R\fR オプションと組み合わせた場合にのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
新しいプールに、指定されたプロパティーを設定します。使用可能なプールプロパティーの詳細については、前述の「プロパティー」の節を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool status\fR [\fB-l\fR] [\fB-v\fR] [\fB-x\fR] [\fB-T\fR \fBd\fR|\fBu\fR] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]\fR
.ad
.sp .6
.RS 4n
指定したプールの詳細な健全性ステータスを表示します。\fIpool\fR を指定しない場合、システムの各プールのステータスが表示されます。プールおよびデバイスの健全性の詳細については、「デバイスの障害と復旧」の節を参照してください。
.sp
間隔を指定した場合、Ctrl-C キーを押すまで、ステータスおよび領域使用状況が \fIinterval\fR 秒ごとに表示されます。\fIcount\fR を指定した場合、このコマンドは \fIcount\fR レポートの表示後に終了します。
.sp
消し込みまたは再同期化が進行中の場合、このコマンドは、実行済みの割合 (パーセント) および推定完了時間をレポートします。プール内のデータ量およびシステムのその他のワークロードは変化する場合があるため、これらはどちらも概算値に過ぎません。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
可能な場合、現在の \fB/dev/chassis\fR の場所の形式で vdev 統計を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しているか、使用不可能なプールの状態だけを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
詳細なデータエラー情報を表示し、前回のプール消し込みが完了して以降のデータエラーすべての完全なリストを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
タイムスタンプを表示します。
.sp
標準の日付フォーマットに \fBd\fR を指定します。\fBdate\fR(1) を参照してください。時刻の内部表現の出力表現に \fBu\fR  を指定します。\fBtime\fR(2) を参照してください。  
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR\fR
.ad
.sp .6
.RS 4n
プールのディスク上バージョンを指定します。このバージョンによって、現在実行中のソフトウェアリリースで使用可能なプール機能が決まります。古いプールバージョンを使用し続けることはできますが、一部の機能が使用できなくなる可能性があります。プールは、\fBzpool upgrade\fR \fB- a\fR コマンドを使用するとアップグレードできます。以前のソフトウェアバージョンを実行しているシステムで、以降のバージョンのプールにアクセスすることはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR \fB-v\fR\fR
.ad
.sp .6
.RS 4n
現在のソフトウェアでサポートされている \fBZFS\fR プールバージョンを表示します。現在の \fBZFS\fR プールバージョンおよびサポートされる以前のバージョンすべてが、各バージョンで提供される機能に関する説明とともに表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR [\fB-V\fR \fIversion\fR] \fB-a\fR | \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
指定したプールを最新のディスク上バージョンにアップグレードします。このコマンドでプールが古いバージョンであることがわかった場合、続けて \fBzpool upgrade\fR \fB-a\fR コマンドを使用すると、そのプールをアップグレードできます。アップグレードされたプールは、以前のソフトウェアリリースを実行するシステムではアクセスできなくなります。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
すべてのプールをアップグレードします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
指定されたバージョンにアップグレードします。現在のバージョンよりも高いバージョンを指定する必要があります。\fB-V\fR フラグが指定されていない場合、プールは最新のバージョンにアップグレードされます。
.RE

.RE

.SH 使用例
.LP
\fB例 1 \fRRAID-Z ストレージプールを作成する
.sp
.LP
次のコマンドは、6 台のディスクで構成される単一の \fBraidz\fR ルート \fIvdev\fR を含むプールを作成します。

.sp
.in +2
.nf
# \fBzpool create tank raidz c0t0d0 c0t1d0 c0t2d0 c0t3d0 c0t4d0 c0t5d0\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRミラー化されたストレージプールを作成する
.sp
.LP
次のコマンドは、2 つのミラーを持つプールを作成します。各ミラーには 2 台のディスクが含まれます。

.sp
.in +2
.nf
# \fBzpool create tank mirror c0t0d0 c0t1d0 mirror c0t2d0 c0t3d0\fR
.fi
.in -2
.sp

.sp
.LP
また、ディスクの現在の場所を指定する \fB/dev/chassis\fR パスを使って、ディスク全体を指定することもできます。

.sp
.in +2
.nf
# \fBzpool create tank \e
    mirror \e
        /dev/chassis/RACK29.U01-04/DISK_00/disk \e
        /dev/chassis/RACK29.U05-08/DISK_00/disk \e
    mirror \e
        /dev/chassis/RACK29.U01-04/DISK_01/disk \e
/dev/chassis/RACK29.U05-08/DISK_01/disk\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRスライスを使って ZFS ストレージプールを作成する
.sp
.LP
次のコマンドは、2 つのディスクスライスを使ってミラー化されていないプールを作成します。

.sp
.in +2
.nf
# \fBzpool create tank /dev/dsk/c0t0d0s1 c0t1d0s4\fR
.fi
.in -2
.sp

.sp
.LP
また、ディスクの現在の場所を指定する \fB/dev/chassis\fR パスを使って、ディスク全体を指定することもできます。

.sp
.in +2
.nf
# \fBzpool add tank mirror \e
        /dev/chassis/RACK29.U01-04/DISK_02/disk \e
        /dev/chassis/RACK29.U05-08/DISK_02/disk\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRミラーを ZFS ストレージプールに追加する
.sp
.LP
次のコマンドは、2 つのミラー化ディスクをプール「\fItank\fR」に追加します。ただし、プールは 2 方向ミラーで構成済みであるものとします。プール内のすべてのデータセットは、追加された領域をすぐに利用できます。

.sp
.in +2
.nf
# \fBzpool add tank mirror c1t0d0 c1t1d0\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fR使用可能な ZFS ストレージプールを一覧表示する
.sp
.LP
次のコマンドは、システムで使用可能なすべてのプールを一覧表示します。

.sp
.in +2
.nf
# \fBzpool list\fR
NAME    SIZE  ALLOC   FREE    CAP  DEDUP  HEALTH  ALTROOT
pool    136G   109M   136G     0%  3.00x  ONLINE  -
rpool  67.5G  12.6G  54.9G    18%  1.01x  ONLINE  -
.fi
.in -2
.sp

.LP
\fB例 6 \fRプールのすべてのプロパティーを一覧表示する
.sp
.LP
次のコマンドは、プールのプロパティーをすべて一覧表示します。

.sp
.in +2
.nf
% \fBzpool get all pool\fR
NAME  PROPERTY       VALUE       SOURCE
pool  size           464G        -
pool  capacity       0%          -
pool  altroot        -           default
pool  health         ONLINE      -
pool  guid           9893442355858802973  default
pool  version        23          default
pool  bootfs         -           default
pool  delegation     on          default
pool  autoreplace    off         default
pool  cachefile      -           default
pool  failmode       wait        default
pool  listsnapshots  off         default
pool  autoexpand     off         default
pool  dedupditto     0           default
pool  dedupratio     1.00x       -
pool  free           464G        -
pool  allocated      130K        -
.fi
.in -2
.sp

.LP
\fB例 7 \fRZFS ストレージプールを破棄する
.sp
.LP
次のコマンドは、プール「\fItank\fR」およびその内部のデータセットをすべて破棄します。

.sp
.in +2
.nf
# \fBzpool destroy -f tank\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fRZFS ストレージプールをエクスポートする
.sp
.LP
次のコマンドは、プール \fItank\fR 内のデバイスをエクスポートします。エクスポートされたデバイスは、再配置したり、あとでインポートしたりすることが可能です。

.sp
.in +2
.nf
# \fBzpool export tank\fR
.fi
.in -2
.sp

.LP
\fB例 9 \fRZFS ストレージプールをインポートする
.sp
.LP
次のコマンドは、使用可能なプールを表示してから、プール「tank」をインポートしてシステムで使用できるようにします。

.sp
.LP
このコマンドを実行すると、次のような結果が表示されます。

.sp
.in +2
.nf
# \fBzpool import\fR
  pool: tank
    id: 7678868315469843843
 state: ONLINE
action: The pool can be imported using its name or numeric identifier.
config:

              tank  ONLINE
          mirror-0  ONLINE
            c1t2d0  ONLINE
            c1t3d0  ONLINE

# \fBzpool import tank\fR
.fi
.in -2
.sp

.LP
\fB例 10 \fRすべての ZFS ストレージプールを最新のバージョンにアップグレードする
.sp
.LP
次のコマンドは、すべての ZFS ストレージプールを最新バージョンのソフトウェアにアップグレードします。

.sp
.in +2
.nf
# \fBzpool upgrade -a\fR
This system is currently running ZFS pool version 22.

All pools are formatted using this version.
.fi
.in -2
.sp

.LP
\fB例 11 \fRホットスペアを管理する
.sp
.LP
次のコマンドは、使用可能なホットスペアを 1 つ含む新しいプールを作成します。

.sp
.in +2
.nf
# \fBzpool create tank mirror c0t0d0 c0t1d0 spare c0t2d0\fR
.fi
.in -2
.sp

.sp
.LP
いずれかのディスクで障害が発生すると、このプールは機能低下状態に陥ります。障害が発生したデバイスを交換するには、次のコマンドを使用します。

.sp
.in +2
.nf
# \fBzpool replace tank c0t0d0 c0t3d0\fR
.fi
.in -2
.sp

.sp
.LP
デバイスが回復されると、スペアは自動的に切り離され、障害が発生した別のデバイスで使用可能となります。ホットスペアをプールから完全に削除するには、次のコマンドを使用します。

.sp
.in +2
.nf
# \fBzpool remove tank c0t2d0\fR
.fi
.in -2
.sp

.LP
\fB例 12 \fR個別のミラー化されたログデバイスによる ZFS プールの作成
.sp
.LP
次のコマンドは、2 つの 2 方向ミラーとミラー化されたログデバイスから構成される ZFS ストレージプールを作成します。

.sp
.in +2
.nf
# \fBzpool create pool mirror c0d0 c1d0 mirror c2d0 c3d0 log mirror \e
   c4d0 c5d0\fR
.fi
.in -2
.sp

.LP
\fB例 13 \fRZFS プールにキャッシュデバイスを追加する
.sp
.LP
次のコマンドは、キャッシュデバイスとして使用する 2 つのディスクを ZFS ストレージプールに追加します。

.sp
.in +2
.nf
# \fBzpool add pool cache c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
キャッシュデバイスを追加すると、そのキャッシュデバイスにメインメモリーの内容が徐々に書き込まれていきます。キャッシュデバイスのサイズによっては、キャッシュがいっぱいになるまでに 1 時間以上かかる場合もあります。\fBiostat\fR オプションを次のように使用して、容量と読み込みを監視できます。 

.sp
.in +2
.nf
# \fBzpool iostat -v pool 5\fR
.fi
.in -2
.sp

.LP
\fB例 14 \fRミラー化されたログデバイスを削除する
.sp
.LP
すぐ下で示す構成を想定した場合、次のコマンドはプール \fBtank\fR 内のミラー化されたログデバイス \fBmirror-2\fR を削除します。

.sp
.in +2
.nf
   pool: tank
  state: ONLINE
  scrub: none requested
config:

         NAME        STATE     READ WRITE CKSUM
         tank        ONLINE       0     0     0
           mirror-0  ONLINE       0     0     0
             c6t0d0  ONLINE       0     0     0
             c6t1d0  ONLINE       0     0     0
           mirror-1  ONLINE       0     0     0
             c6t2d0  ONLINE       0     0     0
             c6t3d0  ONLINE       0     0     0
         logs
           mirror-2  ONLINE       0     0     0
             c4t0d0  ONLINE       0     0     0
             c4t1d0  ONLINE       0     0     0
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzpool remove tank mirror-2\fR
.fi
.in -2
.sp

.LP
\fB例 15 \fR障害が発生した ZFS プールを回復する
.sp
.LP
プールに障害が発生したが回復可能である場合、このステータスを示すメッセージは、そのプールがキャッシュされていた場合 (前述の \fBcachefile\fR を参照) には \fBzpool status\fR によって表示され、キャッシュされていなかった場合にはそのプールで失敗した \fBzpool import\fR のエラー出力の一部として表示されます。

.sp
.LP
\fBzpool clear\fR コマンドを使用して、キャッシュされたプールを回復します。

.sp
.in +2
.nf
# \fBzpool clear -F data\fR
Pool data returned to its state as of Tue Sep 08 13:23:35 2009.
Discarded approximately 29 seconds of transactions.
.fi
.in -2
.sp

.sp
.LP
プール構成がキャッシュされなかった場合は、\fBzpool import\fR を回復モードフラグを指定して使用します。

.sp
.in +2
.nf
# \fBzpool import -F data\fR
Pool data returned to its state as of Tue Sep 08 13:23:35 2009.
Discarded approximately 29 seconds of transactions.
.fi
.in -2
.sp

.LP
\fB例 16 \fRログデバイスがない場合の ZFS プールのインポート
.sp
.LP
次の例は、ログデバイスがない場合にプールのインポートを試みる方法を示しています。\fB-m\fR オプションは、インポート操作を完了するために使用されます。

.sp
.LP
このプールに追加のデバイスが含まれていることがわかっていますが、その正確な構成は特定できません。

.sp
.in +2
.nf
# \fBzpool import tank\fR
The devices below are missing, use '-m' to import the pool anyway:
             c5t0d0 [log]

cannot import 'tank': one or more devices is currently unavailable

# \fBzpool import -m tank\fR
# \fBzpool status tank\fR
   pool: tank
  state: DEGRADED
status: One or more devices could not be opened.  Sufficient replicas
exist for
         the pool to continue functioning in a degraded state.
action: Attach the missing device and online it using 'zpool online'.
    see: http://www.sun.com/msg/ZFS-8000-2Q
   scan: none requested
config:

         NAME                   STATE     READ WRITE CKSUM
         tank                   DEGRADED     0     0     0
           c7t0d0               ONLINE       0     0     0
         logs
           1693927398582730352  UNAVAIL      0     0     0  was 
/dev/dsk/c5t0d0

errors: No known data errors
.fi
.in -2
.sp

.sp
.LP
次の例は、\fBミラー化された\fRログデバイスがない場合にプールをインポートする方法を示しています。

.sp
.in +2
.nf
# \fBzpool import tank\fR
The devices below are missing, use ?-m? to import the pool anyway:
mirror-1 [log]
c5t0d0
c5t1d0

# \fBzpool import -m tank\fR

# \fBzpool status tank\fR
   pool: tank
  state: DEGRADED
status: One or more devices could not be opened.  Sufficient replicas
exist for the pool to continue functioning in a degraded state.
action: Attach the missing device and online it using 'zpool online'.
    see: http://www.sun.com/msg/ZFS-8000-2Q
    scan: none requested
config:

         NAME                      STATE     READ WRITE CKSUM
         tank                      DEGRADED     0     0     0
           c7t0d0                  ONLINE       0     0     0
         logs
           mirror-1                UNAVAIL      0     0     0
insufficient replicas
             46385995713041169     UNAVAIL      0     0     0  was
/dev/dsk/c5t0d0
             13821442324672734438  UNAVAIL      0     0     0  was
/dev/dsk/c5t1d0

errors: No known data errors
.fi
.in -2
.sp

.LP
\fB例 17 \fR特定のパスを使用してプールをインポートする
.sp
.LP
次のコマンドは、プールの特定のデバイスパス (この例では、\fB/dev/dsk/c9t9d9\fR と \fB/dev/dsk/c9t9d8\fR) を指定することによってプール \fBtank\fR をインポートします。

.sp
.in +2
.nf
# \fBzpool import -d /dev/dsk/c9t9d9s0 /dev/dsk/c9t9d8s0 tank\fR
.fi
.in -2
.sp

.sp
.LP
このプールがディスク全体から構成されている場合でも、特定のデバイスのスライス識別子をコマンドに含める必要があるという既存の制限があります。

.SH 終了ステータス
.sp
.LP
次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
無効なコマンド行オプションが指定されました。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/file-system/zfs
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBzfs\fR(1M), \fBattributes\fR(5)
