Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/zh_CN.UTF-8/man1m/prtdscp.1m
'\" te
.\" 版权所有 (c) 2003，Oracle 和/或其附属公司。保留所有权利
.TH prtdscp 1M "2006 年 4 月 25 日" "SunOS 5.11" "系统管理命令"
.SH 名称
prtdscp \- 显示 \fBDSCP\fR \fBIP\fR 地址
.SH 用法概要
.LP
.nf
\fBprtdscp\fR [\fB-v\fR ]
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-h\fR
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-d\fR
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-s\fR
.fi

.SH 描述
.sp
.LP
\fBprtdscp\fR 可显示与服务处理器通信协议域 (Domain to Service Processor Communications Protocol, \fBDSCP\fR) 链接有关的 \fBIP\fR 地址。如果没有指定参数，\fBprtdscp\fR 将显示 \fBDSCP\fR 链接两端的 \fBIP\fR 地址。通过使用 \fB-s\fR 选项或 \fB-d\fR 选项，可分别单独显示服务处理器或域端的 \fBIP\fR 地址。
.SH 选项
.sp
.LP
所支持的选项如下：
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
详细模式。将有关程序内部进度的附加详细信息打印到 \fBstderr\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
帮助。打印程序使用方法的简要用法概要并退出。将忽略所有其他命令行参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
仅显示本地域的 \fBIP\fR 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
仅显示远程服务处理器的 \fBIP\fR 地址。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示本地域和远程服务处理器的地址
.sp
.LP
以下示例显示本地域的 \fBIP\fR 地址和远程 \fBSP\fR 的 \fBIP\fR 地址：

.sp
.in +2
.nf
\fB# prtdscp\fR
Domain Address: 192.168.103.2
SP Address: 192.168.103.1
.fi
.in -2
.sp

.LP
\fB示例 2 \fR显示本地 \fBIP\fR 地址
.sp
.LP
以下示例显示本地域的 \fBIP\fR 地址：

.sp
.in +2
.nf
\fB# prtdscp -d\fR
192.168.103.2
.fi
.in -2
.sp

.LP
\fB示例 3 \fR显示远程 \fBIP\fR 地址
.sp
.LP
以下示例显示远程 \fBSP\fR 的 \fBIP\fR 地址：

.sp
.in +2
.nf
\fB# prtdscp -s\fR
192.168.103.1
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性T{
system/domain-service-processor-protocol/sparc-enterprise、SUNWdscpu.u
T}
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBattributes\fR(5)
