Arquivotheca/solaris11/usr/man/man/usr/share/man/man7p/rarp.7p
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH rarp 7P "7 Jul 2011" "SunOS 5.11" "Protocols"
.SH NAME
rarp, RARP \- Reverse address resolution protocol
.SH DESCRIPTION
.sp
.LP
You use the RARP protocol to map dynamically between the Internet Protocol (IP) and network interface MAC addresses. RARP is often used to boot a Solaris client. RARP clients include the SPARC boot PROM, SunOS kernel, and \fBifconfig\fR(1M). \fBin.rarpd\fR(1M) provides the server-side implementation. 
.sp
.LP
RARP request timeout behavior in application-layer clients is governed by the \fB/etc/inet/rarp\fR default file. To tune the number of retries an application attempts before giving up, set the \fBRARP_RETRIES\fR variable in \fB/etc/inet/rarp\fR. If the file is not present or \fBRARP_RETRIES\fR is not initialized within it, applications retry a maximum of five times with a eight second wait between retries.
.SH FILES
.sp
.LP
\fB/etc/inet/rarp\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability (protocol)Standard
_
Interface Stability (defaults file)Uncommitted
_
Interface Stability (RARP_RETRIES)Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBin.rarpd\fR(1M), \fBarp\fR(7P)
.sp
.LP
\fIReverse Address Resolution Protocol RFC 903.  June, 1984\fR R. Finlayson, T. Mann, J.C. Mogul, M. Theimer
