Arquivotheca/solaris11/usr/man/man/usr/share/man/man1b/biff.1b
'\" te
.\"  Copyright (c) 1988, Sun Microsystems, Inc.  All Rights Reserved
.TH biff 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
biff \- give notice of incoming mail messages
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/biff\fR [y | n]
.fi

.SH DESCRIPTION
.sp
.LP
\fBbiff\fR turns mail notification on or off for the terminal session. With no arguments, \fBbiff\fR displays the current notification status for the terminal.
.sp
.LP
If notification is allowed, the terminal rings the bell and displays the header and the first few lines of each arriving mail message. \fBbiff\fR operates asynchronously. For synchronized notices, use the \fBMAIL\fR variable of \fBsh\fR(1) or the \fBmail\fR variable of \fBcsh\fR(1).
.sp
.LP
A `\fBbiff y\fR' command can be included in your \fB~/.login\fR or \fB~/.profile\fR file for execution when you log in.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fBy\fR\fR
.ad
.RS 5n
.rt  
Allow mail notification for the terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fBn\fR\fR
.ad
.RS 5n
.rt  
Disable notification for the terminal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB~/.login\fR\fR
.ad
.RS 14n
.rt  
User's login file
.RE

.sp
.ne 2
.mk
.na
\fB\fB~/.profile\fR\fR
.ad
.RS 14n
.rt  
User's profile file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBcsh\fR(1), \fBmail\fR(1), \fBsh\fR(1), \fBattributes\fR(5)
