Arquivotheca/solaris11/usr/man/man/usr/share/man/man1b/install.1b
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.TH install 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
install \- install files
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/install\fR [\fB-cs\fR] [\fB-g\fR \fIgroup\fR] [\fB-m\fR \fImode\fR]
     [\fB-o\fR \fIowner\fR] \fIfilename1\fR \fIfilename2\fR
.fi

.LP
.nf
\fB/usr/ucb/install\fR [\fB-cs\fR] [\fB-g\fR \fIgroup\fR] [\fB-m\fR \fImode\fR]
     [\fB-o\fR \fIowner\fR] \fIfilename\fR... \fIdirectory\fR
.fi

.LP
.nf
\fB/usr/ucb/install\fR \fB-d\fR [\fB-g\fR \fIgroup\fR] [\fB-m\fR \fImode\fR]
     [\fB-o\fR \fIowner\fR] \fIdirectory\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBinstall\fR is used within makefiles to copy new versions of files into a destination directory and to create the destination directory itself.
.sp
.LP
The first two forms are similar to the \fBcp\fR(1) command with the addition that executable files can be stripped during the copy and the owner, group, and mode of the installed file(s) can be given.
.sp
.LP
The third form can be used to create a destination directory with the required owner, group and permissions.
.sp
.LP
Note: \fBinstall\fR uses no special privileges to copy files from one place to another. The implications of this are:
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to read the files to be installed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to copy into the destination file or directory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to change the modes on the final copy of the file if you want to use the \fB-m\fR option to change modes.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must be superuser if you want to specify the ownership of the installed file with \fB-o\fR. If you are not the super-user, or if \fB-o\fR is not in effect, the installed file will be owned by you, regardless of who owns the original.
.RE
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 12n
.rt  
Copy files. In fact \fBinstall\fR \fIalways\fR copies files, but the \fB-c\fR option is retained for backwards compatibility with old shell scripts that might otherwise break.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 12n
.rt  
Create a directory. Missing parent directories are created as required as in \fBmkdir \fR\fB-p\fR. If the directory already exists, the owner, group and mode will be set to the values given on the command line.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 12n
.rt  
Strip executable files as they are copied.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgroup\fR\fR
.ad
.RS 12n
.rt  
Set the group ownership of the installed file or directory. (staff by default.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fI mode\fR\fR
.ad
.RS 12n
.rt  
Set the mode for the installed file or directory. (0755 by default.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fI owner\fR\fR
.ad
.RS 12n
.rt  
If run as root, set the ownership of the installed file to the user-ID of \fIowner\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBchgrp\fR(1), \fBchmod\fR(1), \fBchown\fR(1), \fBcp\fR(1), \fBmkdir\fR(1), \fBstrip\fR(1), \fBinstall\fR(1M), \fBattributes\fR(5)
