Arquivotheca/solaris11/usr/man/man/usr/share/man/man1b/ls.1b
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.TH ls 1B "5 May 2005" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
ls \- list the contents of a directory
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/ls\fR [\fB-aAcCdfFgilLqrRstu1\fR] \fIfile\fR...
.fi

.SH DESCRIPTION
.sp
.LP
For each \fIfilename\fR that is a directory, \fBls\fR lists the contents of the directory; for each \fIfilename\fR that is a file, \fBls\fR repeats its name and any other information requested. By default, the output is sorted alphabetically. When no argument is given, the current directory is listed. When several arguments are given, the arguments are first sorted appropriately, but file arguments are processed before directories and their contents.
.SS "Permissions Field"
.sp
.LP
The mode printed under the \fB-l\fR option contains 10 characters interpreted as follows. If the first character is:
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 8n
.rt  
Entry is a directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 8n
.rt  
Entry is a door.
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 8n
.rt  
Entry is a block-type special file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.RS 8n
.rt  
Entry is a character-type special file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.RS 8n
.rt  
Entry is a symbolic link.
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.RS 8n
.rt  
Entry is a \fBFIFO\fR (also known as "named pipe") special file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 8n
.rt  
Entry is an \fBAF_UNIX\fR address family socket.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\(mi\fR\fR
.ad
.RS 8n
.rt  
Entry is a plain file.
.RE

.sp
.LP
The next 9 characters are interpreted as three sets of three bits each. The first set refers to owner permissions; the next refers to permissions to others in the same user-group; and the last refers to all others. Within each set, the three characters indicate permission respectively to read, to write, or to execute the file as a program. For a directory, "execute" permission is interpreted to mean permission to search the directory. The permissions are indicated as follows:
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 8n
.rt  
The file is readable.
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.RS 8n
.rt  
The file is writable.
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.RS 8n
.rt  
The file is executable.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\(mi\fR\fR
.ad
.RS 8n
.rt  
The indicated permission is not granted.
.RE

.sp
.LP
The group-execute permission character is given as \fBs\fR if the file has the set-group-id bit set; likewise the owner-execute permission character is given as \fBs\fR if the file has the set-user-id bit set.
.sp
.LP
The last character of the mode (normally \fBx\fR or `\fB\(mi\fR\&') is \fBtrue\fR if the 1000 bit of the mode is on. See \fBchmod\fR(1) for the meaning of this mode. The indications of set-ID and 1000 bits of the mode are capitalized (\fBS\fR and \fBT\fR, respectively) if the corresponding execute permission is \fInot\fR set.
.sp
.LP
A plus sign (\fB+\fR) appended to the list of permissions indicates that an \fBACL\fR is associated with the file.
.sp
.LP
When the sizes of the files in a directory are listed, a total count of blocks, including indirect blocks, is printed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Lists all entries; in the absence of this option, entries whose names begin with a `\fB\&.\fR' are \fInot\fR listed (except for the privileged user, for whom \fBls\fR normally prints even files that begin with a `\fB\&.\fR').
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.RS 6n
.rt  
Same as \fB-a\fR, except that `\fB\&.\fR' and `\fB\&.\|.\fR' are not listed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Uses time of last edit (or last mode change) for sorting or printing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 6n
.rt  
Forces multi-column output, with entries sorted down the columns; for \fBls\fR, this is the default when output is to a terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
If argument is a directory, lists only its name (not its contents); often used with \fB-l\fR to get the status of a directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Forces each argument to be interpreted as a directory and lists the name found in each slot. This option turns off \fB-l\fR, \fB-t\fR, \fB-s\fR, and \fB-r\fR, and turns on \fB-a\fR; the order is the order in which entries appear in the directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 6n
.rt  
Marks directories with a trailing slash (\fB/\fR), doors with a trailing greater-than sign (\fB>\fR), executable files with a trailing asterisk (\fB*\fR), FIFOs with a trailing vertical bar (\fB|\fR), symbolic links with a trailing at-sign (\fB@\fR), and \fBAF_UNIX\fR address family sockets with a trailing equals sign (\fB=\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
.rt  
For \fBls\fR, shows the group ownership of the file in a long output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
For each file, prints the i-node number in the first column of the report.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Lists in long format, giving mode, \fBACL\fR indication, number of links, owner, size in bytes, and time of last modification for each file. If the file is a special file the size field will instead contain the major and minor device numbers. If the time of last modification is greater than six months ago, it is shown in the format `\fImonth date year\fR'; files modified within six months show `\fImonth date time\fR'. If the file is a symbolic link, the pathname of the linked-to file is printed preceded by `\fB\(em>\fR\&'.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
If argument is a symbolic link, lists the file or directory the link references rather than the link itself.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Displays non-graphic characters in filenames as the character \fB?\fR; for \fBls\fR, this is the default when output is to a terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
Reverses the order of sort to get reverse alphabetic or oldest first as appropriate.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
Recursively lists subdirectories encountered.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Indicate the total number of file system blocks consumed by each file displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 6n
.rt  
Sorts by time modified (latest first) instead of by name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
Uses time of last access instead of last modification for sorting (with the \fB-t\fR option) and/or printing (with the \fB-l\fR option).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.RS 6n
.rt  
Forces one entry per line output format; this is the default when output is not to a terminal.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
\fB\fIfile\fR \fR
.ad
.RS 9n
.rt  
A path name of a file to be listed. If the file specified is not found, a diagnostic message is output on standard error.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBls\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 15n
.rt  
to get group ID for `\fBls\fR \fB-g\fR'
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
to get user IDs for `\fBls\fR \fB-l\fR' and `\fBls\fR \fB-o\fR'
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBls\fR(1), \fBattributes\fR(5), \fBlargefile\fR(5)
.SH NOTES
.sp
.LP
\fBNEWLINE\fR and \fBTAB\fR are considered printing characters in filenames.
.sp
.LP
The output device is assumed to be 80 columns wide.
.sp
.LP
The option setting based on whether the output is a teletype is undesirable as `\fBls\fR \fB-s\fR' is much different than `\fBls\fR \fB-s\fR | lpr'. On the other hand, not doing this setting would make old shell scripts which used \fBls\fR almost certain losers.
.sp
.LP
Unprintable characters in file names can confuse the columnar output options.
