Arquivotheca/solaris11/usr/man/man/usr/share/man/man1b/tr.1b
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.TH tr 1B "26 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
tr \- translate characters
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/tr\fR [\fB-cds\fR] [\fIstring1\fR [\fIstring2\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtr\fR utility copies the standard input to the standard output with substitution or deletion of selected characters. The arguments \fIstring1\fR and \fIstring2\fR are considered sets of characters. Any input character found in \fIstring1\fR is mapped into the character in the corresponding position within \fIstring2\fR. When \fIstring2\fR is short, it is padded to the length of \fIstring1\fR by duplicating its last character.
.sp
.LP
In either string the notation:
.sp
.LP
\fIa\fR\fB\(mi\fR\fIb\fR
.sp
.LP
denotes a range of characters from \fIa\fR to \fIb\fR in increasing \fBASCII\fR order. The character \fB\e\|\fR, followed by 1, 2 or 3 octal digits stands for the character whose \fBASCII\fR code is given by those digits. As with the shell, the escape character \fB\e\|\fR, followed by any other character, escapes any special meaning for that character.
.SH OPTIONS
.sp
.LP
Any combination of the options \fB-c\fR, \fB-d\fR, or \fB-s\fR may be used:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Complement the set of characters in \fIstring1\fR with respect to the universe of characters whose \fBASCII\fR codes are 01 through 0377 octal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Delete all input characters in \fIstring1\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Squeeze all strings of repeated output characters that are in \fIstring2\fR to single characters.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRCreating a list of all the words in a filename
.sp
.LP
The following example creates a list of all the words in \fIfilename1\fR, one per line, in \fIfilename2\fR, where a word is taken to be a maximal string of alphabetics. The second string is quoted to protect `\fB\|\e\|\fR\&' from the shell. 012 is the \fBASCII\fR code for NEWLINE.

.sp
.in +2
.nf
example% \fBtr \fR\fB-cs\fR\fB A\(miZa\(miz '\e012' <\|\fIfilename1\fR\fR\fB>\|\fR\fB\fIfilename2\fR\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBed\fR(1), \fBascii\fR(5), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Will not handle \fBASCII NUL\fR in \fIstring1\fR or \fIstring2.\fR \fBtr\fR always deletes \fBNUL\fR from input.
