Arquivotheca/solaris11/usr/man/man/usr/share/man/man1b/whereis.1b
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.TH whereis 1B "4 May 2011" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
whereis \- locate the binary, source, and manual page files for a command
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/whereis\fR [\fB-bmsu\fR] [\fB-BMS\fR \fIdirectory\fR... \fB-f\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBwhereis\fR utility locates source/binary and manuals sections for specified files. The supplied names are first stripped of leading pathname components and any (single) trailing extension of the form \fB\&.\fR\fIext\fR, for example, \fB\&.c\fR. Prefixes of \fBs.\fR resulting from use of source code control are also dealt with. \fBwhereis\fR then attempts to locate the desired program in a list of standard places:
.sp
.in +2
.nf
etc
/sbin
/usr/bin
/usr/lang
/usr/lbin
/usr/lib
/usr/sbin
/usr/ucb
/usr/ucblib
/usr/ucbinclude
/usr/games
/usr/local
/usr/local/bin
/usr/new
/usr/old
/usr/hosts
/usr/include
.fi
.in -2
.sp

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 6n
.rt  
Searches only for binaries.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.RS 6n
.rt  
Changes or otherwise limits the places where \fBwhereis\fR searches for binaries.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Terminates the last directory list and signals the start of file names, and \fImust\fR be used when any of the \fB-B\fR, \fB-M\fR, or \fB-S\fR options are used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
Searches only for manual sections.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.RS 6n
.rt  
Changes or otherwise limits the places where \fBwhereis\fR searches for manual sections.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Searches only for sources.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.RS 6n
.rt  
Changes or otherwise limit the places where \fBwhereis\fR searches for sources.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
Searches for unusual entries. A file is said to be unusual if it does not have one entry of each requested type. Thus `\fBwhereis\fR \fB-m\fR \fB-u\fR \fB*\fR' asks for those files in the current directory which have no documentation.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRFinding files
.sp
.LP
Find all files in \fB/usr/bin\fR which are not documented in \fB/usr/share/man/man1\fR with source in \fB/usr/src/cmd\fR:

.sp
.in +2
.nf
example% cd /usr/ucb
example% whereis -u -M /usr/share/man/man1 -S /usr/src/cmd -f *
.fi
.in -2
.sp

.SH FILES
.sp
.LP
\fB/usr/src/*\fR
.sp
.LP
\fB/usr/{doc,man}/*\fR
.sp
.LP
\fB/etc, /usr/{lib,bin,ucb,old,new,local}\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBchdir\fR(2), \fBattributes\fR(5)
.SH BUGS
.sp
.LP
Since \fBwhereis\fR uses \fBchdir\fR(2) to run faster, pathnames given with the \fB-M\fR, \fB-S\fR, or \fB-B\fR must be full; that is, they must begin with a \fB/\fR.
