Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/bart_manifest.4
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH bart_manifest 4 "7 Mar 2011" "SunOS 5.11" "File Formats"
.SH NAME
bart_manifest \- system audit manifest file
.SH DESCRIPTION
.sp
.LP
The \fBbart\fR(1M) command generates a manifest that describes the contents of a managed host. A manifest consists of a header and entries. Each entry represents a single file. Entries are sorted in ascending order by file name. Any nonstandard file names, such as those that contain embedded newline or tab characters, have the special characters quoted prior to being sorted. See \fBQuoting Syntax\fR.
.sp
.LP
Lines that begin with \fB!\fR supply metadata about the manifest. The manifest version line indicates the manifest specification version. The date line shows the date on which the manifest was created, in \fBdate\fR(1) form.
.sp
.LP
Some lines are ignored by the manifest comparison tool. Ignored lines include blank lines, lines that consist only of white space, and comments that begin with \fB#\fR.
.sp
.LP
In addition to metadata lines, the header contains the format comment block. This comment block lists the attributes reported for each file type.
.sp
.LP
To see the format of a manifest file, see \fBEXAMPLES\fR.
.SS "Manifest File Entries"
.sp
.LP
Each manifest file entry is a single line of one of the following forms, depending on the file type:
.sp
.in +2
.nf
\fIfname\fR D \fIsize mode acl dirmtime uid gid\fR 
\fIfname\fR P \fIsize mode acl mtime uid gid\fR
\fIfname\fR S \fIsize mode acl mtime uid gid\fR
\fIfname\fR F \fIsize mode acl mtime uid gid contents\fR
\fIfname\fR L \fIsize mode acl lnmtime uid gid dest\fR
\fIfname\fR B \fIsize mode acl mtime uid gid devnode\fR
\fIfname\fR C \fIsize mode acl mtime uid gid devnode\fR
.fi
.in -2

.sp
.LP
The fields of the manifest file entries are described as follows: 
.sp
.ne 2
.mk
.na
\fB\fIfname\fR\fR
.ad
.RS 12n
.rt  
Name of the file. To prevent parsing problems that are caused by special characters embedded in file names, file names are encoded as described in Quoting Syntax.
.RE

.sp
.ne 2
.mk
.na
\fB\fItype\fR\fR
.ad
.RS 12n
.rt  
Type of file. 
.sp
Possible values for \fItype\fR are as follows:
.sp
.ne 2
.mk
.na
\fBB\fR
.ad
.RS 5n
.rt  
Block device node
.RE

.sp
.ne 2
.mk
.na
\fBC\fR
.ad
.RS 5n
.rt  
Character device node
.RE

.sp
.ne 2
.mk
.na
\fBD\fR
.ad
.RS 5n
.rt  
Directory
.RE

.sp
.ne 2
.mk
.na
\fBF\fR
.ad
.RS 5n
.rt  
File
.RE

.sp
.ne 2
.mk
.na
\fBL\fR
.ad
.RS 5n
.rt  
Symbolic link
.RE

.sp
.ne 2
.mk
.na
\fBP\fR
.ad
.RS 5n
.rt  
Pipe
.RE

.sp
.ne 2
.mk
.na
\fBS\fR
.ad
.RS 5n
.rt  
Socket
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIsize\fR\fR
.ad
.RS 12n
.rt  
File size in bytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fImode\fR\fR
.ad
.RS 12n
.rt  
Octal number that represents the permissions of the file.
.RE

.sp
.ne 2
.mk
.na
\fB\fIacl\fR\fR
.ad
.RS 12n
.rt  
ACL attributes for the file. For a file with ACL attributes, this field contains the output from \fBacltotext()\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIuid\fR\fR
.ad
.RS 12n
.rt  
Numerical user ID of the owner of this entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fIgid\fR\fR
.ad
.RS 12n
.rt  
Numerical group ID of the owner of this entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdirmtime\fR\fR
.ad
.RS 12n
.rt  
Modification time in seconds since 00:00:00 UTC, January 1, 1970 for directories.
.RE

.sp
.ne 2
.mk
.na
\fB\fIlnmtime\fR\fR
.ad
.RS 12n
.rt  
Creation time for links.
.RE

.sp
.ne 2
.mk
.na
\fB\fImtime\fR\fR
.ad
.RS 12n
.rt  
Modification time in seconds since 00:00:00 UTC, January 1, 1970 for files.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcontents\fR\fR
.ad
.RS 12n
.rt  
Checksum value of the file. This attribute is only specified for regular files. If you turn off context checking or if checksums cannot be computed, the value of this field is \fB-\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdest\fR\fR
.ad
.RS 12n
.rt  
Destination of a symbolic link.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdevnode\fR\fR
.ad
.RS 12n
.rt  
Value of the device node. This attribute is for character device files and block device files only.
.RE

.SS "Quoting Syntax"
.sp
.LP
The rules file supports a quoting syntax for representing nonstandard file names.
.sp
.LP
When generating a manifest for file names that embeded TAB, SPACE, or NEWLINE characters, the special characters are encoded in their octal forms.
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
Input CharacterQuoted Character
_
SPACE\eSPACE
_
TAB\eTAB
_
NEWLINE\eNEWLINE
_
?\e?
_
[\e[
_
*\e*
.TE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample Manifest File
.sp
.LP
The following is a sample system manifest file. The file entries are sorted by the encoded versions of the file names to correctly handle special characters.

.sp
.in +2
.nf
! Version 1.0
! Mon Feb 11 10:55:30 2002
# Format:
# fname D size mode acl dirmtime uid gid
# fname P size mode acl mtime uid gid
# fname S size mode acl mtime uid gid
# fname F size mode acl mtime uid gid contents
# fname L size mode acl lnmtime uid gid dest
# fname B size mode acl mtime uid gid devnode
# fname C size mode acl mtime uid gid devnode
/etc D 3584 40755 user::rwx,group::r-x,mask::r-x,other::r-x,
     3c6803d7 0 3
/etc/.login F 524 100644 user::rw-,group::r--,mask::r--,other::r--, 
     3c165878 0 3 27b53d5c3e844af3306f1f12b330b318
/etc/.pwd.lock F 0 100600 user::rw-,group::---,mask::---,other::---, 
     3c166121 0 0 d41d8cd98f00b204e9800998ecf8427e
/etc/.syslog_door L 20 120777 user::rw-,group::r--,mask::
     rwx,other::r--,3c6803d5 0 0 /var/run/syslog_door
/etc/cron.d/FIFO P 0 10600 user::rw-,group::---,mask::---,other::---, 
     3c6803d5 0 0 
.fi
.in -2

.SH SEE ALSO
.sp
.LP
\fBdate\fR(1), \fBbart\fR(1M), \fBbart_rules\fR(4), \fBattributes\fR(5)
