Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/bootparams.4
'\" te
.\" Copyright (c) 1998, 2011, Oracle and/or its affiliates. All rights reserved.
.TH bootparams 4 "20 Oct 2010" "SunOS 5.11" "File Formats"
.SH NAME
bootparams \- boot parameter data base
.SH SYNOPSIS
.LP
.nf
\fB/etc/bootparams\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBbootparams\fR file contains a list of client entries that diskless clients use for booting. Diskless booting clients retrieve this information by issuing requests to a server running the \fBrpc.bootparamd\fR(1M) program. The \fBbootparams\fR file may be used in conjunction with or in place of other sources for the \fBbootparams\fR information. See \fBnsswitch.conf\fR(4).
.sp
.LP
For each client the file contains an entry with the client's name and a list of boot parameter values for that client. Each entry has the form:
.sp
.in +2
.nf
\fIclientname    keyword=value\fR...
.fi
.in -2
.sp

.sp
.LP
The first item of each entry is the host name of the diskless clieFnt. You can use the asterisk ('*') character as a wildcard in place of the client name in a single entry. A wildcard entry applies to all clients for which there is not an entry that specifically names them.
.sp
.LP
In a given entry, the host name or asterisk is followed by one or more whitespace characters and a series of keyword\(emvalue pairs separated by whitespace characters. There must not be any whitespace within a keyword\(emvalue pair.
.sp
.LP
Each keyword\(emvalue pair has the syntax: 
.sp
.in +2
.nf
\fIkeyword\fR\fB=\fR\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
The preceding form breaks out further as:
.sp
.in +2
.nf
\fIkeyword\fR\fB=\fR\fIserver\fR\fB:\fR\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
Where \fIserver\fR can be null and \fIvalue\fR can be a pathname. 
.sp
.LP
An example that includes a server is:
.sp
.in +2
.nf
client1 root=server1:/export/client1/root 
.fi
.in -2
.sp

.sp
.LP
An example where \fIserver\fR is null is:
.sp
.in +2
.nf
client1 rootopts=:vers2
.fi
.in -2
.sp

.sp
.LP
A minor variation of the \fIkeyword=value\fR syntax is used for the \fBdomain\fR keyword. Unlike the forms shown above, this syntax does not use a colon. For example:
.sp
.in +2
.nf
client1 domain=bldg1.workco.com
.fi
.in -2
.sp

.sp
.LP
Entries can span multiple lines. Use the backslash ('\e') character as the last character of a line to continue the entry to the following line. For multiple-line entries, you can split a line only in places where whitespace is allowed. For example, you can use a backslash to split the following entry between the end of the path (\fBroot\fR) and the keyword \fBdomain\fR:
.sp
.in +2
.nf
client1 root=server1:/export/client1/root domain=bldg1.workco.com
.fi
.in -2
.sp

.sp
.LP
In entries that specify a server, \fIserver\fR is the name of the server that will provide the file or filesystem to the diskless client and \fIvalue\fR is the pathname of the exported file or filesystem on that server.
.sp
.LP
In entries that use the \fBdomain\fR keyword, the domain name specified must be the client's domain name. The algorithm for determining a client's domain name is to first check for a \fBdomain\fR keyword in the client-specific entry and then in wildcard entry. If none is found, the server's domain name is used.
.sp
.LP
An entry with the \fBns\fR keyword associates a server (a name server) with, instead of a pathname, a specific name service (\fBNIS\fR, \fBLDAP\fR, or \fBnone\fR) and, if that server is not on a local subnet, the netmask needed to reach it. For example:
.sp
.in +2
.nf
ns=hoot:nis(255.255.255.0)
.fi
.in -2
.sp

.sp
.LP
An \fBns\fR entry forces  installation software to use the specified name service. By default, \fBNIS\fR is used in preference to \fBLDAP\fR if it can find an \fBNIS\fR server for the system's domain on the subnet. An \fBns\fR entry might be necessary if you are trying to set up a hands-off installation.
.sp
.LP
If an \fBns\fR keyword is not used, installation software uses broadcast to attempt to bind to either an \fBNIS\fR or \fBLDAP\fR server. If a name server is not on the local subnet, which is possible for \fBLDAP\fR, the bind will fail, automatic configuration of the name service will fail, and an interactive screen is displayed, prompting the user to specify the name service.
.sp
.LP
The \fBns\fR keyword can be set by Host Manager.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample \fBbootparams\fR Entry
.sp
.LP
Here is an example of an entry in the \fBbootparams\fR file:

.sp
.in +2
.nf
	client1 root=server1:/export/client1/root rootopts=:vers=2 \e
		domain=bldg1.workco.com
	client2 root=server2:/export/client2/root ns=:nis
	client3 root=server2:/export/client3/root ns=watson:
	client4 root=server2:/export/client4/root \e
		ns=mach:nis(255.255.255.0)
.fi
.in -2
.sp

.SH FILES
.sp
.LP
\fB/etc/bootparams\fR
.SH SEE ALSO
.sp
.LP
\fBrpc.bootparamd\fR(1M), \fBnsswitch.conf\fR(4) 
.SH NOTES
.sp
.LP
Solaris diskless clients use the keywords \fBroot\fR and \fBrootopts\fR to look up the pathname for the root filesystem and the mount options for the root filesystem, respectively. These are the only keywords meaningful for diskless booting clients. See \fBmount_ufs\fR(1M).
