Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/compver.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.TH compver 4 "4 Oct 1996" "SunOS 5.11" "File Formats"
.SH NAME
compver \- compatible versions file
.SH DESCRIPTION
.sp
.LP
\fBcompver\fR is an \fBASCII\fR file used to specify previous versions of the associated package which are upward compatible. It is created by a package developer.
.sp
.LP
Each line of the file specifies a previous version of the associated package with which the current version is backward compatible.
.sp
.LP
Since some packages may require installation of a specific version of another software package, compatibility information is extremely crucial. Consider, for example, a package called "A" which requires version "1.0" of application "B" as a prerequisite for installation. If the customer installing "A" has a newer version of "B" (version 1.3), the \fBcompver\fR file for "B" must indicate that "1.3" is compatible with version "1.0" in order for the customer to install package "A".
.SH EXAMPLES
.LP
\fBExample 1 \fRSample \fBcompver\fR file.
.sp
.LP
A sample \fBcompver\fR file is shown below:

.sp
.in +2
.nf
Version 1.3
Version 1.0
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBpkginfo\fR(4)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
The comparison of the version string disregards white space and tabs. It is performed on a word-by-word basis. Thus, "Version 1.3" and "Version 1.3" would be considered the same.
.sp
.LP
The entries in the \fBcompver\fR file must match the values assigned to the \fBVERSION\fR parameter in the \fBpkginfo\fR(4) files.
