Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/crypto_certs.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH crypto_certs 4 "23 Feb 2007" "SunOS 5.11" "File Formats"
.SH NAME
crypto_certs \- directory for certificate files for Solaris Cryptographic Framework
.SH SYNOPSIS
.LP
.nf
\fB/etc/crypto/certs/CA\fR
.fi

.LP
.nf
\fB/etc/crypto/certs/SUNWobjectCA\fR
.fi

.LP
.nf
\fB/etc/crypto/certs/*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/crypto/certs\fR directory contains ASN.1 BER or PEM encoded certificate files for use by the Solaris Cryptographic Framework.
.sp
.LP
A default installation contains root anchors and signing certificates. The \fBCA\fR and \fBSUNWobjectCA\fR certificates are the trust anchors for all other certificates. Other certificates contain the certificates used to sign and verify the Solaris user and kernel cryptographic plug-ins
.sp
.LP
Additional signing certificates may be installed by third-party cryptographic providers. They should either be copied to \fB/etc/crypto/certs\fR or included in the package that delivers the provider.
.sp
.LP
Only certificates that are issued by the \fBCA\fR or \fBSUNWobjectCA\fR certificates and include the organization unit "Solaris Cryptographic Framework" in their subject distinguished names are accepted by the Solaris Cryptographic Framework. This restriction is in place due to US Export Law on the export of open cryptographic interfaces at the time of shipping this revision of the product.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBelfsign\fR(1), \fBlibpkcs11\fR(3LIB), \fBattributes\fR(5)
