Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/dacf.conf.4
'\" te
.\"  Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved.
.TH dacf.conf 4 "15 May 2001" "SunOS 5.11" "File Formats"
.SH NAME
dacf.conf \- device auto-configuration configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/dacf.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The kernel uses the \fBdacf.conf\fR file to automatically configure hot plugged devices. Because the \fBdacf.conf\fR file contains important kernel state information, it should not be modified. 
.sp
.LP
The format of the \fB/etc/dacf.conf\fR file is not public and might change in versions of the Solaris operating environment that are not compatible with Solaris 8. 
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.SH NOTES
.sp
.LP
 This document does not constitute an \fBAPI\fR. The \fB/etc/dacf.conf\fR file might not exist or might contain different contents or interpretations in versions of the Solaris operating environment that are not compatible with Solaris 8. The existence of this notice does not imply that any other documentation lacking this notice constitutes an \fBAPI\fR.
