Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/defaultdomain.4
'\" te
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.TH defaultdomain 4 "18 Jul 2011" "SunOS 5.11" "File Formats"
.SH NAME
defaultdomain \- specify host's domain name
.SH SYNOPSIS
.LP
.nf
\fBsvc:/network/nis/domain\fR
.fi

.LP
.nf
\fB/etc/defaultdomain\fR
.fi

.SH DESCRIPTION
.sp
.LP
The service \fBsvc:/network/nis/domain\fR determines a host's domain name for direct use by the NIS name service.  For the purposes of backwards compatibility, the service also generates the \fBdefaultdomain\fR file.
.sp
.LP
The property \fBgroup/property config/domainname\fR represents the NIS \fBdomainname\fR represented by \fB/etc/defaultdomain\fR. 
.sp
.LP
The contents of \fBdefaultdomain\fR consists of a single line containing a host's domain name.
.SH EXAMPLES
.LP
\fBExample 1 \fRSetting Up \fBdomainname\fR and Enabling the \fBnis/domain\fR Service
.sp
.LP
The following example sets up \fBdomainname\fR and enables the \fBnis/domain\fR service:

.sp
.in +2
.nf
% svccfg -s nis/domain setprop config/domainname = \e
          hostname: nisdomain.example.com
% svccfg -s nis/domain:default refresh
% svcadm enable nis/domain
.fi
.in -2
.sp

.sp
.LP
The service is not enabled by default. The \fBnis/domain\fR service sets up all the shared NIS configuration, of which \fBdomainname\fR is the one mandatory configuration parameter.

.SH SEE ALSO
.sp
.LP
\fBuname\fR(1), \fBldapclient\fR(1M), \fBypbind\fR(1M), \fBypinit\fR(1M), \fBresolv.conf\fR(4), \fBldap\fR(5)
.SH NOTES
.sp
.LP
The \fBdefaultdomain\fR file is created and modified by Oracle Solaris installation and configuration scripts. Only users knowledgeable of name service configuration should edit the file.
