Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/defaultrouter.4
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved
.TH defaultrouter 4 "17 Aug 2004" "SunOS 5.11" "File Formats"
.SH NAME
defaultrouter \- configuration file for default router(s)
.SH SYNOPSIS
.LP
.nf
\fB/etc/defaultrouter\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/defaultrouter\fR file specifies a IPv4 host's default router(s).
.sp
.LP
The format of the file is as follows:
.sp
.in +2
.nf
IP_address
\&...
.fi
.in -2
.sp

.sp
.LP
The \fB/etc/defaultrouter\fR file can contain the IP addresses or hostnames of one or more default routers, with each entry on its own line. If you use hostnames, each hostname must also be listed in the local \fB/etc/hosts\fR file, because no name services are running at the time that \fBdefaultrouter\fR is read.
.sp
.LP
Lines beginning with the ``#'' character are treated as comments.
.sp
.LP
The default routes listed in this file replace those added by the kernel during diskless booting. An empty \fB/etc/defaultrouter\fR file will cause the default route added by the kernel to be deleted.
.sp
.LP
Use of a default route, whether received from a \fBDHCP\fR server or from \fB/etc/defaultrouter\fR, prevents a machine from acting as an IPv4 router. You can use \fBrouteadm\fR(1M) to override this behavior.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/defaultrouter\fR\fR
.ad
.RS 22n
.rt  
Configuration file containing the hostnames or IP addresses of one or more default routers.
.RE

.SH SEE ALSO
.sp
.LP
\fBin.rdisc\fR(1M), \fBin.routed\fR(1M), \fBrouteadm\fR(1M), \fBhosts\fR(4)
