Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/default_fs.4
'\" te
.\"  Copyright 1989 AT&T
.TH default_fs 4 "20 Mar 1992" "SunOS 5.11" "File Formats"
.SH NAME
default_fs, fs \- specify the default file system type for local or remote file systems
.SH DESCRIPTION
.sp
.LP
When file system administration commands have both specific and generic components (for example, \fBfsck\fR(1M)), the file system type must be specified. If it is not explicitly specified using the \fB-F\fR \fIFSType\fR command line option, the generic command looks in \fB/etc/vfstab\fR in order to determine the file system type, using the supplied raw or block device or mount point.  If the file system type can not be determined by searching \fB/etc/vfstab\fR, the command will use the default file system type specified in either \fB/etc/default/fs\fR or \fB/etc/dfs/dfstypes\fR, depending on whether the file system is local or remote.
.sp
.LP
The default local file system type is specified in \fB/etc/default/fs\fR by a line of the form \fBLOCAL=\fR\fIfstype\fR (for example, \fBLOCAL=ufs\fR). The default remote file system type is determined by the first entry in the \fB/etc/dfs/fstypes\fR file.
.sp
.LP
File system administration commands will determine whether the file system is local or remote by examining the specified device name.  If the device  name starts with ``/'' (slash), it is considered to be local; otherwise it is remote.
.sp
.LP
The default file system types can be changed by editing the default files with a text editor.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.RS 20n
.rt  
list of default parameters for each file system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/fs\fR\fR
.ad
.RS 20n
.rt  
the default local file system type
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.RS 20n
.rt  
the default remote file system type
.RE

.SH SEE ALSO
.sp
.LP
\fBfsck\fR(1M), \fBfstypes\fR(4), \fBvfstab\fR(4) 
