Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/devices.4
'\" te
.\" Copyright (c) Oracle and/or its affiliates. All rights reserved.
.TH devices 4 "14 Sep 2010" "SunOS 5.11" "File Formats"
.SH NAME
devices, devid_cache, snapshot_cache, mdi_scsi_vhci_cache, mdi_ib_cache, devname_cache, pci_unitaddr_persistent, infiniband_hca_persistent_cache \- device configuration information
.SH SYNOPSIS
.LP
.nf
\fB/etc/devices\fR
.fi

.LP
.nf
\fB/etc/devices/devid_cache\fR
.fi

.LP
.nf
\fB/etc/devices/devname_cache\fR
.fi

.LP
.nf
\fB/etc/devices/mdi_ib_cache\fR
.fi

.LP
.nf
\fB/etc/devices/mdi_scsi_vhci_cache\fR
.fi

.LP
.nf
\fB/etc/devices/snapshot_cache\fR
.fi

.LP
.nf
\fB/etc/devices/pci_unitaddr_persistent\fR
.fi

.LP
.nf
\fB/etc/devices/pci_unitaddr_persistent_cache\fR
.fi

.SH DESCRIPTION
.sp
.LP
The directory \fB/etc/devices\fR is a repository of device-related data. Files in this directory are used to preserve this information across reboots and are created and updated as necessary by the system.
.sp
.LP
There are no administrative actions necessary with respect to files in \fB/etc/devices\fR. Should the contents of a file become corrupted or an update fail, the file can simply be removed. The system re-creates the file as necessary.
.sp
.LP
Do not delete or modify the contents of \fB/etc/devices/pci_unitaddr_persistent\fR or \fB/etc/devices/pci_unitaddr_persistent_cache\fR.
.SH SEE ALSO
.sp
.LP
\fBdevfsadm\fR(1M), \fBdev\fR(7FS), \fBddi_devid_compare\fR(9F), \fBddi_devid_compare\fR(9F)
.SH NOTES
.sp
.LP
Files in this directory do not constitute an API. Files might not exist or might have a different content or interpretation in a future release. The existence of this notice does not imply that any other documentation that lacks this notice constitutes an API.
