Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/dfstab.4
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved..
.\" Copyright 1989 AT&T
.TH dfstab 4 "14 Mar 2011" "SunOS 5.11" "File Formats"
.SH NAME
dfstab \- file containing commands for sharing resources across a network
.SH DESCRIPTION
.sp
.LP
This file is obsolete in the Oracle Solaris 11 release.
.sp
.LP
Adding share entries to the \fB/etc/dfs/dfstab\fR file is no longer required to permanently share files across a network. File systems are shared in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
The \fBshare\fR command is used to create and publish a NFS or SMB share of a file system or directory. Using the \fBshare\fR command to share a ZFS file system is considered a legacy operation.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The \fBzfs set share\fR command is used to establish NFS or SMB share properties for a ZFS dataset. Then, set the ZFS \fBsharenfs\fR or \fBsharesmb\fR to \fBon\fR to publish an NFS or SMB share. 
.RE
.sp
.LP
An NFS or SMB share is published automatically when a system is rebooted by an SMF service. Because an SMF service manages NFS or SMB shares, editing the \fB/etc/dfs/dfstab\fR file is obsolete.
.sp
.LP
For more information, see the \fBshare\fR(1M) manual page.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBshare_nfs\fR(1M), \fBshare_smb\fR(1M), \fBzfs\fR(1M), \fBshareall\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5)
