Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ethers.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.TH ethers 4 "10 Dec 2009" "SunOS 5.11" "File Formats"
.SH NAME
ethers \- Ethernet address to hostname database or domain
.SH DESCRIPTION
.sp
.LP
The \fBethers\fR file is a local source of information about the (48-bit) Ethernet addresses of hosts on the Internet. The \fBethers\fR file can be used in conjunction with or instead of other \fBethers\fR sources, including the \fBNIS\fR maps \fBethers.byname\fR and \fBethers.byaddr\fR, or Ethernet address data stored on an LDAP server. Programs use the \fBethers\fR(3SOCKET) routines to access this information.
.sp
.LP
The \fBethers\fR file has one line for each host on an Ethernet. The line has the following format:
.sp
.LP
\fIEthernet-address\fR \fIofficial-host-name\fR
.sp
.LP
Items are separated by any number of \fBSPACE\fR and/or \fBTAB\fR characters. A `\fB#\fR' indicates the beginning of a comment extending to the end of line.
.sp
.LP
The standard form for Ethernet addresses is "\fIx\fR\fB:\fR\fIx\fR\fB:\fR\fIx\fR\fB:\fR\fIx\fR\fB:\fR\fIx\fR\fB:\fR\fIx\fR" where \fIx\fR is a hexadecimal number between 0 and ff, representing one byte. The address bytes are always in network order. Host names may contain any printable character other than \fBSPACE\fR, \fBTAB\fR, \fBNEWLINE\fR, or comment character.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/ethers\fR\fR
.ad
.RS 15n
.rt  
file listing Ethernet hosts
.RE

.SH SEE ALSO
.sp
.LP
\fBethers\fR(3SOCKET), \fBhosts\fR(4), \fBnsswitch.conf\fR(4) 
