Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/fstypes.4
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH fstypes 4 "18 Dec 1991" "SunOS 5.11" "File Formats"
.SH NAME
fstypes \- file that registers distributed file system packages
.SH DESCRIPTION
.sp
.LP
\fBfstypes\fR resides in directory \fB/etc/dfs\fR and lists distributed file system utilities packages installed on  the system.  For each installed distributed file system type, there is a line that begins with the file system type name (for example, ``nfs''), followed by white space and descriptive text.
.sp
.LP
The file system indicated in the first line of the file is the  default file system; when Distributed File System (DFS)  Administration commands are entered without the  option  \fB\(miF\fR \fIfstypes\fR, the system takes the file system type from the first line of the  \fBfstypes\fR file.
.sp
.LP
The default file system can be changed by editing the \fBfstypes\fR file with any supported text editor.
.SH SEE ALSO
.sp
.LP
\fBdfmounts\fR(1M), \fBdfshares\fR(1M), \fBshare\fR(1M), \fBshareall\fR(1M), \fBunshare\fR(1M) 
