Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ftpusers.4
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ftpusers 4 "15 Jun 2011" "SunOS 5.11" "File Formats"
.SH NAME
ftpusers \- file listing users to be disallowed ftp login privileges
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpusers\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftpusers\fR file lists users for whom \fBftp\fR login privileges are disallowed. Each \fBftpuser\fR entry is a single line of the form:
.sp
.in +2
.nf
name
.fi
.in -2

.sp
.LP
where \fBname\fR is the user's login name.
.sp
.LP
The FTP Server, \fBin.ftpd-1m\fR, reads the \fBftpusers\fR file. If the login name of the user matches one of the entries listed, it rejects the login attempt.
.sp
.LP
The \fBftpusers\fR file has the following default configuration entries:
.sp
.in +2
.nf
root
daemon
bin
sys
adm
lp
uccp
nuucp
dladm
smmsp
listen
gdm
upnp
xvm
mysql
openldap
webservd
svctag
unknown
nobody
noaccess
nobody4
.fi
.in -2

.sp
.LP
These entries match the default instantiated entries from \fBpasswd\fR(4). The list of default entries typically contains the superuser \fBroot\fR and other administrative and system application identities.
.sp
.LP
The root entry is included in the \fBftpusers\fR file as a security measure since the default policy is to disallow remote logins for this identity. This policy is also set in the default value of the \fBCONSOLE\fR entry in the \fB/etc/default/login\fR file. See \fBlogin\fR(1). If you allow \fBroot\fR login privileges by deleting the root entry in \fBftpusers\fR, you should also modify the security policy in \fB/etc/default/login\fR to reflect the site security policy for remote login access by \fBroot\fR.
.sp
.LP
Other default entries are administrative identities that are typically assumed by system applications but never used for local or remote login, for example \fBsys\fR and \fBnobody\fR. Since these entries do not have a valid password field instantiated in \fBshadow\fR(4), no login can be performed.
.sp
.LP
If a site adds similar administrative or system application identities in \fBpasswd\fR(4) and \fBshadow\fR(4), for example, \fBmajordomo\fR, the site should consider including them in the \fBftpusers\fR file for a consistent security policy.
.sp
.LP
Lines that begin with \fB#\fR are treated as comment lines and are ignored.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/ftpd/ftpusers\fR\fR
.ad
.RS 22n
.rt  
A file that lists users for whom \fBftp\fR login privileges are disallowed by default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/ftpusers\fR\fR
.ad
.RS 22n
.rt  
This is symbolic link to \fB/etc/ftpd/ftpusers\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/login\fR\fR
.ad
.RS 22n
.rt  
Establishes login environment.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 22n
.rt  
Password file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 22n
.rt  
Shadow password file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/ftp
_
Interface StabilitySee below.
.TE

.sp
.LP
The Interface Stability for \fB/etc/ftpd/ftpusers\fR is Volatile.
.SH SEE ALSO
.sp
.LP
\fBlogin\fR(1), \fBpasswd\fR(4), \fBshadow\fR(4), \fBattributes\fR(5), \fBenviron\fR(5)
