Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ike.preshared.4
'\" te
.\" Copyright (c) 2001, 2010, Oracle and/or its affiliates. All rights reserved.
.TH ike.preshared 4 "27 Apr 2010" "SunOS 5.11" "File Formats"
.SH NAME
ike.preshared \- pre-shared keys file for IKE
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/secret/ike.preshared\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/inet/secret/ike.preshared\fR file contains secret keying material that two \fBIKE\fR instances can use to authenticate each other. Because of the sensitive nature of this data, it is kept in the \fB/etc/inet/secret\fR directory, which is only accessible by root.
.sp
.LP
Pre-shared keys are delimited by open-curly-brace (\fB{\fR) and close-curly-brace (\fB}\fR) characters. There are five name-value pairs required inside a pre-shared key:
.sp

.sp
.TS
tab();
cw(1.83i) cw(1.83i) cw(1.83i) 
lw(1.83i) lw(1.83i) lw(1.83i) 
.
NameValueExample
localidtypeIPlocalidtype IP
remoteidtypeIPremoteidtype IP
localidIP-addresslocalid 10.1.1.2
Subnet/Prefix  localid 10.1.1.0/24
remoteidIP-addressremoteid 10.1.1.3
Subnet/Prefixremoteid 10.1.1.0/24
keyhex-string1234567890abcdef
hex-string1234567890abcdef
hex-string0x1234567890abcdef
ASCII-string\fB"This is my preshared key"\fR
.TE

.sp
.LP
Comment lines with \fB#\fR appearing in the first column are also legal. 
.sp
.LP
An ASCII-string can consist of any valid ASCII character except for NEWLINE.  A backslash (\fB\e\fR) is considered an escape character when it precedes a double quote or itself. Otherwise a backslash is taken literally.
.sp
.LP
Files in this format can also be used by the \fBikeadm\fR(1M) command to load additional pre-shared keys into a running an \fBin.iked\fR(1M) process. 
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample \fBike.preshared\fR File
.sp
.LP
The following is an example of an \fBike.preshared\fR file:

.sp
.in +2
.nf
  
#
# Two pre-shared keys between myself, 10.1.1.2, and two remote
# hosts.  Note that names are not allowed for IP addresses.     
#
# A decent hex string can be obtained by performing:
#           od -x </dev/random | head
#

{
    localidtype IP
    localid 10.1.1.2
    remoteidtype IP
    remoteid 10.21.12.4
    key 4b656265207761732068657265210c0a 
}
{
    localidtype IP
    localid 10.1.1.2
    remoteidtype IP
    remoteid 10.21.13.0/24
    key "str!ng 0f my ch01c3"
}

{
   localidtype IP
   localid 10.1.1.2
   remoteidtype IP
   remoteid 10.9.1.25
   key 536f20776572652042696c6c2c2052656e65652c20616e642043687269732e0a
}
.fi
.in -2

.SH SECURITY
.sp
.LP
If this file is compromised, all \fBIPsec\fR security associations derived from secrets in this file will be compromised as well. The default permissions on \fBike.preshared\fR are \fB0600\fR. They should stay this way.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBod\fR(1), \fBikeadm\fR(1M), \fBin.iked\fR(1M), \fBipseckey\fR(1M), \fBattributes\fR(5), \fBrandom\fR(7D)
