Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/issue.4
'\" te
.\"  Copyright 1989 AT&T, Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.TH issue 4 "2 Jan 2002" "SunOS 5.11" "File Formats"
.SH NAME
issue \- issue identification file
.SH DESCRIPTION
.sp
.LP
The file \fB/etc/issue\fR contains the issue or project identification to be printed as a login prompt. \fBissue\fR is an ASCII file that is read by program \fBttymon\fR and then written to any terminal spawned or respawned, prior to the normal prompt. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/issue\fR\fR
.ad
.RS 14n
.rt  
 
.RE

.SH SEE ALSO
.sp
.LP
\fBlogin\fR(1), \fBttymon\fR(1M)
