Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/logadm.conf.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH logadm.conf 4 "23 May 2007" "SunOS 5.11" "File Formats"
.SH NAME
logadm.conf \- configuration file for logadm command
.SH SYNOPSIS
.LP
.nf
\fB/etc/logadm.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB/etc/logadm.conf\fR is the default configuration file for the log management tool \fBlogadm\fR(1M). Comments are allowed using the pound character (\fB#\fR) and extend to the end of line. Each non-comment line has the form:
.sp
.in +2
.nf
\fIlogname\fR \fIoptions\fR
.fi
.in -2

.sp
.LP
where \fIlogname\fR is the name of the entry and \fIoptions\fR are the default command line options for the \fBlogadm\fR command. The name of the entry may be the same as the name of the log file, or a log file name may be given in the options section of the entry. Long lines may be folded using a backslash followed by a newline to continue an entry on the next line. Single or double quotes may be used to protect spaces or alternate-style quotes in strings. 
.sp
.LP
The preferred method for changing \fB/etc/logadm.conf\fR is to use the \fB-V\fR, \fB-w\fR, and \fB-r\fR options to the \fBlogadm\fR(1M) command, which allow you to lookup an entry, write an entry, or remove an entry from \fB/etc/logadm.conf\fR. 
.sp
.LP
A full description of how and when \fB/etc/logadm.conf\fR is used and sample entries are found in \fBlogadm\fR(1M).
.sp
.LP
By default, \fBlogadm\fR(1M) works in \fBGMT\fR. Therefore, all entries in \fB/etc/logadm.conf\fR will have a \fBGMT\fR timestamp. Users can use the \fB-l\fR option to set \fBlogadm\fR to local time.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBlogadm\fR(1M), \fBattributes\fR(5)
