Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/loginlog.4
'\" te
.\"  Copyright 1989 AT&T
.TH loginlog 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
loginlog \- log of failed login attempts
.SH DESCRIPTION
.sp
.LP
After five unsuccessful login attempts, all the attempts are logged in the file \fB/var/adm/loginlog\fR. This file contains one record for each failed attempt. Each record contains the login name, tty specification, and time.
.sp
.LP
This is an \fBASCII\fR file. Each field within each entry is separated from the next by a colon. Each entry is separated from the next by a new-line.
.sp
.LP
By default, \fBloginlog\fR does not exist, so no logging is done. To enable logging, the log file must be created with read and write permission for owner only. Owner must be \fBroot\fR and group must be \fBsys\fR.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/loginlog\fR\fR
.ad
.RS 21n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBlogin\fR(1), \fBpasswd\fR(1)
