Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/mddb.cf.4
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH mddb.cf 4 "8 Aug 2003" "SunOS 5.11" "File Formats"
.SH NAME
mddb.cf \- metadevice state database replica locations
.SH SYNOPSIS
.LP
.nf
\fB/etc/lvm/mddb.cf\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/lvm/mddb.cf\fR file is created when the \fBmetadb\fR(1M) command is invoked. You should never directly edit this file.
.sp
.LP
The file \fB/etc/lvm/mddb.cf\fR is used by the \fBmetainit\fR(1M) command to find the locations of the metadevice state databases replicas. The \fBmetadb\fR command creates the file and updates it each time it is run. Similar information is entered in the \fB/kernel/drv/md.conf\fR file.
.sp
.LP
Each metadevice state database replica has a unique entry in the \fB/etc/lvm/mddb.cf\fR file. Each entry contains the \fIdriver\fR and \fIminor\fR unit numbers associated with the block physical device where a replica is stored. Each entry also contains the block number of the master block, which contains a list of all other blocks in the replica. 
.sp
.LP
Entries in the \fB/etc/lvm/mddb.cf\fR file are of the form: \fIdriver_name \|\|minor_t \|\|daddr_t \| \|checksum\fR where \fIdriver_name\fR and \fIminor_t\fR represent the device number of the physical device storing this replica. \fIdaddr_t\fR is the disk block address. \fIchecksum\fR is used to make certain the entry has not been corrupted. A pound sign (#) introduces a comment.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample File
.sp
.LP
The following example shows a \fBmddb.cf\fR file.

.sp
.in +2
.nf
#metadevice database location file do not hand edit
#driver minor_t daddr_t device id       checksum
sd      152     16      id1,sd@SSEAGATE_JDD288110MC9LH/a        -2613
.fi
.in -2
.sp

.sp
.LP
In the example above, the value for \fBdaddr_t\fR indicates that the offset from the start of a given partition is 16 disk blocks from the start of that partition.

.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/lvm/mddb.cf\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/kernel/drv/md.conf\fR
.RE
.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetassist\fR(1M), \fBmetaset\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fISolaris Volume Manager Administration Guide\fR
