Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/meddb.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.TH meddb 4 "20 September 2000" "SunOS 5.11" "File Formats"
.SH NAME
meddb \- mediator data file
.SH SYNOPSIS
.LP
.nf
\fB/etc/lvm/meddb\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The file \fB/etc/lvm/meddb\fR is a data file used by \fBrpc.metamedd\fR(1M) to store the mediator data used in 2-string HA configurations.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/lvm/meddb\fR \fR
.ad
.RS 19n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBrpc.metamedd\fR(1M)
.sp
.LP
\fISun Cluster 3.0 Collection\fR
.sp
.LP
\fISolaris Volume Manager Administration Guide\fR
