Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/nca.if.4
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH nca.if 4 "11 Feb 2011" "SunOS 5.11" "File Formats"
.SH NAME
nca.if \- the NCA configuration file that specifies physical interfaces
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/nca.if\fR
.fi

.SH DESCRIPTION
.sp
.LP
Specify the physical interfaces for which the Solaris Network Cache and Accelerator ("\fBNCA\fR") feature will be configured in the \fBnca.if\fR configuration file. List the physical interfaces in the file, one per line. To configure \fBNCA\fR to listen on all physical interfaces present on the system backed by a \fBhostname.{interface_name}\fR, then list only an asterik ("\fB*\fR") in \fBnca.if\fR. 
.sp
.LP
When the \fBncakmod\fR(1) initialization script is invoked during system boot, it will attempt to configure each physical interface specified in the \fBnca.if\fR file by using \fBncaconfd\fR(1M). Note that there must be an accompanying \fBhostname.{interface_name}\fR file and an entry in \fB/etc/hosts\fR for the contents of \fBhostname.{interface_name}\fR.
.sp
.LP
You must reboot in order to implement changes to the \fBnca.if\fR file.
.SH EXAMPLES
.SS "x86"
.LP
\fBExample 1 \fR\fBnca.if\fR on x86
.sp
.LP
The following is an example of an \fBnca.if\fR file that would be used on an x86 system:

.sp
.in +2
.nf
iprb1
iprb6
iprb8
.fi
.in -2

.SS "SPARC"
.LP
\fBExample 2 \fR\fBnca.if\fR on SPARC
.sp
.LP
The following is an example of an \fBnca.if\fR file that would be used on a SPARC system:

.sp
.in +2
.nf
hme2
hme3
hme4
.fi
.in -2

.SS "All Platforms"
.LP
\fBExample 3 \fRConfiguring NCA to Listen on All Physical Interfaces
.sp
.LP
The following example shows the contents of an \fBnca.if\fR file that would be used to configure either platform to listen on all physical interfaces present on the system:

.sp
.in +2
.nf
*
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/nca.if\fR\fR
.ad
.RS 25n
.rt  
Lists the physical interfaces on which \fBNCA\fR will run.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/hostname.{}{0-9}\fR\fR
.ad
.RS 25n
.rt  
Lists all physical interfaces configured on the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/hosts\fR\fR
.ad
.RS 25n
.rt  
Lists all host names associated with the server. Entries in this file must match with entries in \fB/etc/hostname.{}{0-9}\fR for \fBNCA\fR to function.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/http-cache-accelerator
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBncab2clf\fR(1), \fBncakmod\fR(1), \fBifconfig\fR(1M), \fBncakmod.conf\fR(4), \fBncalogd.conf\fR(4), \fBattributes\fR(5), \fBnca\fR(7d)
.sp
.LP
\fIOracle Solaris Administration: IP Services\fR
