Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ncad_addr.4
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ncad_addr 4 "11 Feb 2011" "SunOS 5.11" "File Formats"
.SH NAME
ncad_addr \- name of the Solaris Network Cache and Accelerator (NCA) socket utility library
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ncad_addr.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBncad_addr.so\fR is the Solaris Network Cache and Accelerator (\fBNCA\fR) socket utility library. Use this library with a web server to avoid support for the \fBPF_NCA\fR family type socket. The web server can take advantage of NCA functionality.
.sp
.LP
Interpose the \fBncad_addr\fR interfaces before the interfaces in \fBlibsocket\fR by setting the environment variable \fBLD_PRELOAD\fR to \fBncad_addr.so\fR so that it is preloaded before \fBlibsocket.so.1\fR. The \fBncad_addr.so\fR interfaces will be interposed only if NCA is enabled. See \fBncakmod\fR(1).
.SH EXAMPLES
.LP
\fBExample 1 \fRInterposing \fBncad_addr\fR
.sp
.LP
Using Bourne shell syntax as an example, set \fBLD_PRELOAD\fR as shown below to interpose the \fBncad_addr\fR socket utility libary:

.sp
.in +2
.nf
LD_PRELOAD=/usr/lib/ncad_addr.so /usr/bin/httpd
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ncad_addr.so\fR\fR
.ad
.RS 25n
.rt  
\fBncad_addr\fR socket utility library shared object
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
system/network/http-cache-accelerator (32-bit)
T}
_
SUNWncarx (64-bit)
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBncab2clf\fR(1), \fBncakmod\fR(1), \fBsocket\fR(3SOCKET), \fBnca.if\fR(4), \fBncakmod.conf\fR(4), \fBattributes\fR(5), \fBnca\fR(7d)
.SH NOTES
.sp
.LP
Only applications that use the \fBNCA\fR feature, for example, web servers, should interpose this library.
