Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ncakmod.conf.4
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ncakmod.conf 4 "11 Feb 2011" "SunOS 5.11" "File Formats"
.SH NAME
ncakmod.conf \- ncakmod configuration file 
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncakmod.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBncakmod.conf\fR file is used to configure the Solaris Network Cache and Accelerator (\fBNCA\fR) kernel module. The file contains two fields, \fBkey\fR and \fBvalue\fR. 
.sp
.LP
The \fBstatus\fR key is used to indicate if the user wants to have \fBNCA\fR turned on as a feature.  If the value of \fBstatus\fR key is \fBenabled\fR, then the \fBNCA\fR kernel module will be pushed on to the specified interfaces. If the value of the \fBstatus\fR key is \fBdisabled\fR, then the \fBNCA\fR kernel module will not be pushed on to any interfaces . The default is \fBdisabled\fR.
.sp
.LP
The \fBhttpd_door_path\fR key specifies the path name of the Solaris Door \fBRPC\fR mechanism that will be used to communicate with the \fBhttp\fR daemon.  The default value is \fB/var/run/nca_httpd_1.door\fR. 
.sp
.LP
Use the \fBnca_active\fR key to indicate whether to allow NCA to actively open outgoing TCP connections. The default value for \fBnca_active\fR is \fBdisabled\fR. If set to \fBenabled\fR, \fBncaconfd\fR sets up NCA for each interface and then operates as a daemon, allowing NCA to make outgoing TCP connections. This functionality is possible only by using the doors interface to NCA. A web server that uses the sockets interface with \fBPF_NCA\fR or \fBncad_addr.so\fR cannot connect by means of \fBnca_active\fR.
.sp
.LP
NCA supports the logging of in-kernel cache hits. See \fBncalogd.conf\fR(4). NCA stores logs in a binary format. Use the \fBncab2clf\fR(1) utility to convert the log from a binary format to the Common Log File format.
.sp
.LP
In order to implement changes to the \fBncakmod.conf\fR file, you will need to reboot.
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample \fBncakmod.conf\fR File
.sp
.LP
The following is a sample \fBncakmod.conf\fR file: 

.sp
.in +2
.nf
#
# NCA Kernel Module Configuration File
#
status=disabled
httpd_door_path=/var/run/nca_httpd_1.door
nca_active=disabled
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/ncakmod.conf\fR\fR
.ad
.RS 25n
.rt  
The NCA kernel module configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/http-cache-accelerator
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBncab2clf\fR(1), \fBncakmod\fR(1), \fBdoor_create\fR(3C), \fBnca.if\fR(4), \fBncad_addr\fR(4), \fBncalogd.conf\fR(4), \fBattributes\fR(5), \fBnca\fR(7d)
.sp
.LP
\fIOracle Solaris Administration: IP Services\fR
