Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ncalogd.conf.4
'\" te
.\" Copyright (c) 2002, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ncalogd.conf 4 "11 Feb 2011" "SunOS 5.11" "File Formats"
.SH NAME
ncalogd.conf \- NCA logging configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncalogd.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBncalogd.conf\fR is used to configure Solaris Network Cache and Accelerator ("\fBNCA\fR") logging. The file contains two fields, \fBkey\fR and \fBvalue\fR. 
.sp
.LP
The \fBstatus\fR key is used to indicate if the user wants to have \fBNCA\fR logging turned on. If the value of \fBstatus\fR key is \fBenabled\fR, then \fBNCA\fR logging will be turned on. If the value of the \fBstatus\fR key is \fBdisabled\fR, then \fBNCA\fR logging will not be invoked. The default value is \fBdisabled\fR.
.sp
.LP
The \fBlogd_path_name\fR key specifies the absolute pathname of the log file. The log file must be a raw device without a filesystem or a file on a local file system. The default value is \fB/var/nca/log\fR. \fBlogd_path_name\fR can also contain a whitespace-delimited list of values for multiple log files to a maximum of 16. If you specify multiple log files, you must enclose the list in quotation marks ("). With multiple files, \fBNCA\fR logging moves to the next file on the list once the file size specified by \fBlogd_file_size\fR has been reached. When the last file is full, \fBNCA\fR logging rotates back to the first file in the list. A pointer to the current log file is stored in \fB/var/nca/current\fR.
.sp
.LP
The \fBlogd_file_size\fR key specifies the value of the file size, in bytes, allowed for each log file specified in by the \fBlogd_path_name\fR key. The default value is 1000000 bytes.
.sp
.LP
In order to implement changes to the \fBncalogd.conf\fR file, you will need to stop and start NCA logging or reboot.
.sp
.LP
NCA stores logs in a binary format. Use the \fBncab2clf\fR(1) utility to convert the log from a binary format to the Common Log File format.
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample \fBncalogd.conf\fR File
.sp
.LP
The following is a sample \fBncalogd.conf\fR file that specifies three log files:

.sp
.in +2
.nf
#
# NCA Log Daemon Configuration File
#

status=enabled
logd_path_name="/var/nca/log1 /var/nca/log2 /var/nca/log3"
logd_file_size=1000000
.fi
.in -2

.sp
.LP
Note that there is no NCA logging daemon. Logging is performed as one of the functions of the NCA software.

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/ncalogd.conf\fR\fR
.ad
.RS 25n
.rt  
Lists configuration parameters for \fBNCA\fRlogging.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/http-cache-accelerator
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBncab2clf\fR(1), \fBncakmod\fR(1), \fBdd\fR(1M), \fBdoor_create\fR(3C), \fBnca.if\fR(4), \fBncakmod.conf\fR(4), \fBattributes\fR(5), \fBnca\fR(7d)
.sp
.LP
\fIOracle Solaris Administration: IP Services\fR
