Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/ncaport.conf.4
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ncaport.conf 4 "11 Feb 2011" "SunOS 5.11" "File Formats"
.SH NAME
ncaport.conf \- ncaport configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncaport.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBncaport.conf\fR file is used to configure the IP addresses and ports that the Solaris Network Cache and Acceleration (NCA) kernel module services. The file contains two fields, key and value, in the format of \fBncaport=\fIipaddress\fR/\fIport\fR\fR. IPv4 addresses must be in the dot notation \fId\fR.\fId\fR.\fId\fR.\fId\fR. IPv6 addresses must be in one of the three conventional forms (see \fBinet_pton\fR(3SOCKET)). If an asterisk (\fB*\fR) is used for an IP address, it is interpreted as \fBINADDR_ANY\fR, which matches any IP address.
.sp
.LP
A web server uses the environment variable \fBLD_PRELOAD\fR and the \fBncaport.conf\fR configuration file to convert an \fBAF_INET\fR socket to an \fBAF_NCA\fR socket. \fBLD_PRELOAD\fR enables the NCA socket utility library to be loaded before \fBlibsocket.so.1\fR. See the \fBncad_addr\fR(4) for details. When a web server issues the \fBbind\fR(3SOCKET) system call, it is intercepted by the interposition library \fBncad_addr.so\fR. If the bind address is in the \fBncaport.conf\fR file, the \fBAF_INET\fR socket is converted to a \fBAF_NCA\fR socket.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample \fBncaport.conf\fR File
.sp
.LP
The following is a sample \fBncaport.conf\fR file:

.sp
.in +2
.nf
#
# NCA Kernel Module Port Configuration File
#
ncaport=1080:0:0:0:8:800:200C:417A/100
ncaport=192.168.84.71/80
ncaport=*/9000
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBbind\fR(3SOCKET), \fBinet_pton\fR(3SOCKET), \fBncad_addr\fR(4), \fBattributes\fR(5), \fBnca\fR(7d)
.SH NOTES
.sp
.LP
For those web servers that use \fBAF_NCA\fR sockets, the NCA port configuration described here has no effect.
.sp
.LP
NCA does not currently support IPv6. Any IPv6 addresses in the file \fBncaport.conf\fR are ignored.
