Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/nfslog.conf.4
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc. All Rights Reserved.
.TH nfslog.conf 4 "2 Dec 2004" "SunOS 5.11" "File Formats"
.SH NAME
nfslog.conf \- NFS server logging configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nfs/nfslog.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnfslog.conf\fR file specifies the location of the \fBNFS\fR server logs, as well as the location of the private work files used by the \fBNFS\fR server and \fBnfslogd\fR(1M) daemon during logging. Each entry in the file consists of a mandatory tag identifier and one or more parameter identifiers. The parameter identifier specifies the value or location of the specific parameter. For instance, the parameter identifier "\fBlog=/var/nfs/logs/serverLog\fR" specifies the location of the \fBNFS\fR server activity log. The mandatory tag identifier serves as an index into the \fB/etc/nfs/nfslog.conf\fR file to identify the various parameters to be used. At export time, the \fBshare_nfs\fR(1M) command specifies the \fBNFS\fR server logging parameters  to use by associating a tag from the \fB/etc/nfs/nfslog.conf\fR file to the exported file system. It is legal for more than one file system to be exported using the same logging tag identifier.
.sp
.LP
NFS server logging is not supported on Solaris machines that are  using NFS Version 4.
.sp
.LP
A "global" tag identifier is included in \fB/etc/nfs/nfslog.conf\fR. It specifies the default set of values to be used during logging. If no tag identifier is specified at export time, then the values in the "global" entry are used. The "global" values can be modified by updating this entry in \fB/etc/nfs/nfslog.conf\fR.
.sp
.LP
Each entry in the file must contain a mandatory tag identifier and at least one parameter/value pair. If a parameter is not specified in a given entry, the global value of the parameter will be used. The exact entry syntax follows:
.sp
.in +2
.nf
<tag>	[defaultdir=<path>] [log=<path><file>] \e
[fhtable=<path><file>] [buffer=<path><file>] [logformat=basic|extended]
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBdefaultdir=\fI<path>\fR\fR\fR
.ad
.RS 28n
.rt  
Specifies the directory where the logging files and working files will be placed. This path is prepended to all relative paths specified in other parameters.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlog=\fI<path>\fR\fI<file>\fR\fR\fR
.ad
.RS 28n
.rt  
Specifies the location of the user-readable log file. The log will be located in the \fBdefaultdir\fR, unless \fB<path>\fR is an absolute path.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfhtable=\fI<path>\fR\fI<file>\fR\fR\fR
.ad
.RS 28n
.rt  
Specifies the location of the private file handle to path mapping database files. These database files are for the private use of the \fBNFS\fR server kernel module and the \fBnfslog\fRd daemon. These files will be located in the \fBdefaultdir\fR, unless \fB<path>\fR is an absolute path. These database files are permanently stored in the file system. Consult \fBnfslogd\fR(1M) for information on pruning the database files.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbuffer=\fI<path>\fR\fI<file>\fR\fR\fR
.ad
.RS 28n
.rt  
Specifies the location of the private work buffer file  used by the \fBNFS\fR server kernel module to record raw \fBRPC\fR information. This file is later processed by the \fBnfslog\fR daemon, which in turn generates the user-readable log file. This work buffer file will be located in the \fBdefaultdir\fR, unless \fB<path>\fR is an absolute path.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlogformat=basic|extended\fR\fR
.ad
.RS 28n
.rt  
Sets the format of the user-readable log file. If not specified, the basic format is used. The basic format is compatible with log files generated by the Washington University \fBFTPd\fR. The extended format provides a more detailed log, which includes directory modification operations not included in the basic format, such as \fBmkdir\fR, \fBrmdir\fR and \fBremove\fR. Note that the extended format is not compatible with Washington University's \fBFTPd\fR log format.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing the \fBglobal\fR Tag
.sp
.LP
The "global" tag may be modified so that all exported file systems that enabled logging use a common set of parameters that conform to the specific needs of the user. These values are used until a specific tag identifier overrides them. 

.sp
.in +2
.nf
global	defaultdir=/var/nfs log=logs/nfslog \e
		fhtable=tables/fhtable buffer=buffers/nfslog_workbuffer \e
		logformat=basic
.fi
.in -2

.LP
\fBExample 2 \fROverriding the Global \fBdefaultdir\fR and \fBlogformat\fR
.sp
.LP
Because log files can become very large, it may be desirable to store the logs and working files in separate file systems. This can be easily accomplished by simply specifying a different \fBdefaultdir\fR for every file system exported by means of a unique tag:

.sp
.in +2
.nf
engineering	defaultdir=/engineering/logging \e
	            logformat=extended
accounting defaultdir=/accounting/logging
marketing  defaultdir=/marketing/logging
.fi
.in -2

.sp
.LP
File systems shared with the engineering identifier will have their logs and workfiles located in \fB/engineering/logging\fR. For instance, the log file will be located at \fB/engineering/logging/logs/nfslog\fR. Note that the engineering log file will be stored in the extended format, while the rest of the log files will remain in the basic format.

.sp
.LP
Any of the parameters can be updated in a tag identifier, which overrides the global settings.

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/nfs
.TE

.SH SEE ALSO
.sp
.LP
\fBnfslogd\fR(1M), \fBshare_nfs\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Logs, work files, and file handle to path mapping database can become very large. Be aware of appropriate placement within the file system name space. See \fBnfslogd\fR(1M)) for information on pruning the database files and cycling logs.
