Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/phones.4
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc. 
.TH phones 4 "14 Jan 1992" "SunOS 5.11" "File Formats"
.SH NAME
phones \- remote host phone number database
.SH SYNOPSIS
.LP
.nf
\fB/etc/phones\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file \fB/etc/phones\fR contains the system-wide private phone numbers for the \fBtip\fR(1) program. \fB/etc/phones\fR is normally unreadable, and so may contain privileged information.  The format of \fB/etc/phones\fR is a series of lines of the form:
.sp
.in +2
.nf
\fB<\fR\fIsystem-name\fR\fB>[ \et]*<\fR\fIphone-number\fR\fB>.\fR
.fi
.in -2

.sp
.LP
The system name is one of those defined in the \fBremote\fR(4) file and the phone number is constructed from \fB[0123456789\(mi=*%]\fR. The `\fB=\fR' and `\fB*\fR' characters are indicators to the auto call units to pause and wait for a second dial tone (when going through an exchange).  The `\fB=\fR' is required by the \fBDF02-AC\fR and the `\fB*\fR' is required by the \fBBIZCOMP\fR 1030.
.sp
.LP
Comment lines are lines containing a `\fB#\fR' sign in the first column of the line.
.sp
.LP
Only one phone number per line is permitted. However, if more than one line in the file contains the same system name \fBtip\fR(1) will attempt to dial each one in turn, until it establishes a connection.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/phones\fR\fR
.ad
.RS 15n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBtip\fR(1), \fBremote\fR(4)
