Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/priv_names.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH priv_names 4 "24 Nov 2003" "SunOS 5.11" "File Formats"
.SH NAME
priv_names \- privilege definition file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/priv_names\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpriv_names\fR file, located in \fB/etc/security\fR, defines the privileges with which a process can be associated. See \fBprivileges\fR(5) for the privilege definitions. In that man page, privileges correspond to privilege names in \fBpriv_names\fR as shown in the following examples:
.sp

.sp
.TS
tab();
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
name in privileges(5)Name in \fBpriv_names\fR
_
\fBPRIV_FILE_CHOWN\fR\fBfile_chown\fR
\fBPRIV_FILE_CHOWN_SELF\fR\fBfile_chown_self\fR
\fBPRIV_FILE_DAC_EXECUTE\fR\fBfile_dac_execute\fR
.TE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBppriv\fR(1), \fBattributes\fR(5), \fBprivileges\fR(5)
