Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/pseudo.4
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.TH pseudo 4 "15 Jun 1993" "SunOS 5.11" "File Formats"
.SH NAME
pseudo \- configuration files for pseudo device drivers
.SH DESCRIPTION
.sp
.LP
Pseudo devices are devices that are implemented entirely in software. Drivers for pseudo devices must provide driver configuration files to inform the system of each pseudo device that should be created.
.sp
.LP
Configuration files for pseudo device drivers must identify the parent driver explicitly as \fIpseudo,\fR and must create an integer property called \fIinstance\fR which is unique to this entry in the configuration file.
.sp
.LP
Each entry in the configuration file creates a prototype devinfo node. Each node is assigned an instance number which is determined by the value of the \fIinstance\fR property. This property is only applicable to children of the \fIpseudo\fR parent, and is required since pseudo devices have no hardware address from which to determine the instance number. See \fBdriver.conf\fR(4) for further details of configuration file syntax.
.SH EXAMPLES
.LP
\fBExample 1 \fRA sample configuration file.
.sp
.LP
Here is a configuration file called \fBramdisk.conf\fR for a pseudo device driver that implements a RAM disk. This file creates two nodes called "ramdisk". The first entry creates ramdisk node instance 0, and the second creates ramdisk node, instance 1, with the additional \fBdisk-size\fR property set to \fB512.\fR

.sp
.in +2
.nf
#
# Copyright (c) 1993, by Sun Microsystems, Inc.
#
#ident  "@(#)ramdisk.conf       1.3     93/06/04 SMI"
name="ramdisk" parent="pseudo" instance=0;
name="ramdisk" parent="pseudo" instance=1 disk-size=512;
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBdriver.conf\fR(4), \fBddi_prop_op\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
