Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/publickey.4
'\" te
.\"  Copyright 1989 AT&T .\e" Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.TH publickey 4 "10 Dec 2009" "SunOS 5.11" "File Formats"
.SH NAME
publickey \- public key database
.SH SYNOPSIS
.LP
.nf
\fB/etc/publickey\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB/etc/publickey\fR is  a local  public key database that is used for secure RPC. The  \fB/etc/publickey\fR file can be used in conjunction with or instead of other publickey databases, including the NIS publickey map.  Each entry in the database consists of a network user name (which may refer to either a user or a hostname), followed by the user's public key (in hex notation), a colon, and then the user's secret key encrypted with a password (also in hex notation).
.sp
.LP
The \fB/etc/publickey\fR file contains a default entry for \fBnobody\fR.
.SH SEE ALSO
.sp
.LP
\fBchkey\fR(1), \fBnewkey\fR(1M), \fBgetpublickey\fR(3NSL), \fBnsswitch.conf\fR(4)
