Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/queuedefs.4
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.TH queuedefs 4 "1 Mar 1994" "SunOS 5.11" "File Formats"
.SH NAME
queuedefs \- queue description file for at, batch, and cron
.SH SYNOPSIS
.LP
.nf
\fB/etc/cron.d/queuedefs\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBqueuedefs\fR file describes the characteristics of the queues managed by \fBcron\fR(1M). Each non-comment line in this file describes one queue. The format of the lines are as follows:
.sp
.LP
\fIq\fR\fB\&.\fR[\fInjob\fR\fBj\fR][\fBnice\fR\fBn\fR][\fInwait\fR\fBw\fR]
.sp
.LP
The fields in this line are:
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 9n
.rt  
The name of the queue. \fBa\fR is the default queue for jobs started by \fBat\fR(1); \fBb\fR is the default queue for jobs started by \fBbatch\fR (see \fBat\fR(1)); \fBc\fR is the default queue for jobs run from a \fBcrontab\fR(1) file.
.RE

.sp
.ne 2
.mk
.na
\fB\fInjob\fR\fR
.ad
.RS 9n
.rt  
The maximum number of jobs that can be run simultaneously in that queue; if more than \fInjob\fR jobs are ready to run, only the first \fInjob\fR jobs will be run, and the others will be run as jobs that are currently running terminate. The default value is  \fB100\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnice\fR\fR
.ad
.RS 9n
.rt  
The \fBnice\fR(1) value to give to all jobs in that queue that are not run with a user \fBID\fR of super-user.  The default value is \fB2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fInwait\fR\fR
.ad
.RS 9n
.rt  
The number of seconds to wait before rescheduling a job that was deferred because more than \fInjob\fR jobs were running in that job's queue, or because the system-wide limit of jobs executing has been reached.  The default value is \fB60\fR.
.RE

.sp
.LP
Lines beginning with \fB#\fR are comments, and are ignored.
.SH EXAMPLES
.LP
\fBExample 1 \fRA sample file.
.sp
.in +2
.nf
#
#
a.4j1n
b.2j2n90w
.fi
.in -2
.sp

.sp
.LP
This file specifies that the \fBa\fR queue, for \fBat\fR jobs, can have up to 4 jobs running simultaneously; those jobs will be run with a \fBnice\fR value of 1.  As no \fInwait\fR value was given, if a job cannot be run because too many other jobs are running \fBcron\fR will wait 60 seconds before trying again to run it.

.sp
.LP
The \fBb\fR queue, for \fBbatch\fR(1) jobs, can have up to 2 jobs running simultaneously; those jobs will be run with a \fBnice\fR(1) value of 2.  If a job cannot be run because too many other jobs are running, \fBcron\fR(1M) will wait 90 seconds before trying again to run it. All other queues can have up to 100 jobs running simultaneously; they will be run with a \fBnice\fR value of 2, and if a job cannot be run because too many other jobs are running \fBcron\fR will wait 60 seconds before trying again to run it.

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/cron.d/queuedefs\fR\fR
.ad
.RS 25n
.rt  
queue description file for  \fBat\fR, \fBbatch\fR, and  \fBcron\fR.
.RE

.SH SEE ALSO
.sp
.LP
\fBat\fR(1), \fBcrontab\fR(1), \fBnice\fR(1), \fBcron\fR(1M)
