Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/rmtab.4
'\" te
.\" Copyright (C) 1999, Sun Microsystems, Inc. All Rights Reserved
.TH rmtab 4 "15 Nov 1990" "SunOS 5.11" "File Formats"
.SH NAME
rmtab \- remote mounted file system table
.SH SYNOPSIS
.LP
.nf
\fB/etc/rmtab\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBrmtab\fR contains a table of filesystems that are remotely mounted by \fBNFS\fR clients. This file is maintained by \fBmountd\fR(1M), the mount daemon. The data in this file should be obtained only from  \fBmountd\fR(1M) using the \fBMOUNTPROC_DUMP\fR remote procedure call.
.sp
.LP
The file contains a line of information for each remotely mounted filesystem. There are a number of lines of the form:
.sp
.in +2
.nf
\fBhostname\fR\fB:\fR\fIfsname\fR
.fi
.in -2

.sp
.LP
The mount daemon adds an entry for any client that successfully executes a mount request and deletes the appropriate entries for an unmount request.
.sp
.LP
Lines beginning with a hash (' \fB#\fR') are commented out. These lines are removed from the file by \fBmountd\fR(1M) when it first starts up. Stale entries may accumulate for clients that crash without sending an unmount request.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/rmtab\fR\fR
.ad
.RS 14n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBmountd\fR(1M), \fBshowmount\fR(1M)
