Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/rpc.4
'\" te
.\" Copyright (c) 1991, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH rpc 4 "10 Dec 2009" "SunOS 5.11" "File Formats"
.SH NAME
rpc \- rpc program number data base
.SH SYNOPSIS
.LP
.nf
\fB/etc/rpc\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrpc\fR file is a local source containing user readable names that can be used in place of \fBRPC\fR program numbers.  The  \fBrpc\fR file can be used in conjunction with or instead of other rpc sources, including the \fBNIS\fR maps ``rpc.byname'' and ``rpc.bynumber''.
.sp
.LP
The rpc file has one line for each \fBRPC\fR program name. The line has the following format:
.sp
.in +2
.nf
\fIname-of-the-RPC-program\fR \fIRPC-program-number\fR \fIaliases\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of blanks and/or tab characters. A ``\fB#\fR'' indicates the beginning of a comment; characters up to the end of the line are not interpreted by routines which search the file.
.SH EXAMPLES
.LP
\fBExample 1 \fRRPC Database
.sp
.LP
Below is an example of an RPC database:

.sp
.in +2
.nf
#
#	rpc
#
rpcbind	100000	portmap	sunrpc	portmapper
rusersd	100002	rusers
nfs	100003	nfsprog
mountd	100005	mount	showmount
walld	100008	rwall	shutdown
sprayd	100012	spray
llockmgr	100020
nlockmgr	100021
status	100024
bootparam	100026
keyserv	100029	keyserver
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 22n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBnsswitch.conf\fR(4)
