Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/securenets.4
'\" te
.\" Copyright (C) 2000, 2010, Oracle and/or its affiliates. All rights reserved.
.TH securenets 4 "29 Mar 2010" "SunOS 5.11" "File Formats"
.SH NAME
securenets \- configuration file for NIS security
.SH SYNOPSIS
.LP
.nf
\fB/var/yp/securenets\fR
.fi

.SH DESCRIPTION
.sp
.LP
The  \fB/var/yp/securenets\fR file defines the networks or hosts which are allowed access to information by the Network Information Service ("\fBNIS\fR").
.sp
.LP
The format of the file is as follows:
.RS +4
.TP
.ie t \(bu
.el o
Lines beginning with the ``#'' character are treated as comments.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Otherwise, each line contains two fields separated by white space.  The first field is a netmask, the second a network.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The netmask field may be either \fB255.255.255.255\fR (IPv4), \fBffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff\fR (IPv6) , or the string ``host'' indicating that the second field is a specific host to be allowed access.
.RE
.sp
.LP
Both \fBypserv\fR(1M) and \fBypxfrd\fR(1M) use the \fB/var/yp/securenets\fR file.  The file is read when the  \fBypserv\fR(1M) and \fBypxfrd\fR(1M) daemons begin. If \fB/var/yp/securenets\fR is present, \fBypserv\fR(1M) and \fBypxfrd\fR(1M) respond only to \fBIP\fR addresses in the range given. In order for a change in the \fB/var/yp/securenets\fR file to take effect, you must kill and restart any active daemons using \fBypstop\fR(1M) and \fBypstart\fR(1M). 
.sp
.LP
An important thing to note for all the examples below is that the server must be allowed to access itself. You accomplish this either by the server being part of a subnet that is allowed to access the server, or by adding an individual entry, as the following:
.sp
.in +2
.nf
host 127.0.0.1
.fi
.in -2
.sp

.SH EXAMPLES
.LP
\fBExample 1 \fRGiving Access for Individual Machines
.sp
.LP
If individual machines are to be given access, the entry could be:

.sp
.in +2
.nf
255.255.255.255	192.9.1.20
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
host	192.0.1.20
.fi
.in -2
.sp

.LP
\fBExample 2 \fRGiving Access to an Entire Class C Network
.sp
.LP
If access is to be given to an entire class C network, the entry could be:

.sp
.in +2
.nf
255.255.255.0	192.9.1.0
.fi
.in -2
.sp

.LP
\fBExample 3 \fRGiving Access to a Class B Network
.sp
.LP
If access is to be given to a class B network, the entry could be:

.sp
.in +2
.nf
255.255.0.0	9.9.0.0
.fi
.in -2
.sp

.LP
\fBExample 4 \fRGiving Access for an Individual IPv6 Address
.sp
.LP
To allow access for an individual IPv6 address:

.sp
.in +2
.nf
ffff:ffff:ffff:ffff:ffff:ffff:ffff:ffff  fec0::111:abba:ace0:fba5e:1
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
host  fec0::111:abba:ace0:fba5e:1
.fi
.in -2
.sp

.LP
\fBExample 5 \fRGiving Access for all IPv6 Addresses Starting with fe80
.sp
.LP
To allow access for all IPv6 addresses starting with fe80:

.sp
.in +2
.nf
ffff::  fe80::
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/yp/securenets\fR\fR
.ad
.RS 22n
.rt  
Configuration file for  \fBNIS\fR security.
.RE

.SH SEE ALSO
.sp
.LP
\fBypserv\fR(1M), \fBypstart\fR(1M), \fBypstop\fR(1M), \fBypxfrd\fR(1M)
.SH NOTES
.sp
.LP
The Network Information Service (NIS) was formerly known as Sun Yellow Pages (YP).  The functionality of the two remains the same; only the name has changed. The name Yellow Pages is a registered trademark in the United Kingdom of British Telecommunications plc, and may not be used without permission.
