Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/sharetab.4
'\" te
.\"  Copyright 1989 AT&T
.TH sharetab 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
sharetab \- shared file system table
.SH DESCRIPTION
.sp
.LP
\fBsharetab\fR resides in directory \fB/etc/dfs\fR and contains a table of local resources shared by the \fBshare\fR command.
.sp
.LP
Each line of the file consists of the following fields:
.sp
.LP
\fIpathname resource fstype specific_options description\fR
.sp
.LP
where
.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 20n
.rt  
Indicate the path name of the shared resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 20n
.rt  
Indicate the symbolic name by which remote systems can  access the resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIfstype\fR\fR
.ad
.RS 20n
.rt  
Indicate the file system type of the shared resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIspecific_options\fR\fR
.ad
.RS 20n
.rt  
Indicate file-system-type-specific options that were given to the \fBshare\fR command when the resource was shared.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdescription\fR\fR
.ad
.RS 20n
.rt  
Describe the shared resource provided by the system administrator when the resource was shared.
.RE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M)
