Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/shells.4
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.TH shells 4 "20 Nov 2007" "SunOS 5.11" "File Formats"
.SH NAME
shells \- shell database
.SH SYNOPSIS
.LP
.nf
\fB/etc/shells\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBshells\fR file contains a list of the shells on the system. Applications use this file to determine whether a shell is valid. See \fBgetusershell\fR(3C). For each shell a single line should be present, consisting of the shell's path, relative to root.
.sp
.LP
A hash mark (\fB#\fR) indicates the beginning of a comment; subsequent characters up to the end of the line are not interpreted by the routines which search the file. Blank lines are also ignored.
.sp
.LP
The following default shells are used by utilities: \fB/bin/bash\fR, \fB/bin/csh\fR, \fB/bin/jsh\fR, \fB/bin/ksh\fR, \fB/bin/ksh93\fR, \fB/bin/pfcsh\fR, \fB/bin/pfksh\fR, \fB/bin/pfsh\fR, \fB/bin/sh\fR, \fB/bin/tcsh\fR, \fB/bin/zsh\fR, \fB/sbin/jsh\fR, \fB/sbin/sh\fR, \fB/usr/bin/bash\fR, \fB/usr/bin/csh\fR, \fB/usr/bin/jsh\fR, \fB/usr/bin/ksh\fR, \fB/usr/bin/ksh93\fR, \fB/usr/bin/pfcsh\fR, \fB/usr/bin/pfksh\fR, \fB/usr/bin/pfsh\fR, and \fB/usr/bin/sh\fR, \fB/usr/bin/tcsh\fR, \fB/usr/bin/zsh\fR, and \fB/usr/sfw/bin/zsh\fR. \fB/etc/shells\fR overrides the default list.
.sp
.LP
Invalid shells in \fB/etc/shells\fR could cause unexpected behavior, such as being unable to log in by way of \fBftp\fR(1).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/shells\fR\fR
.ad
.RS 15n
.rt  
list of shells on system
.RE

.SH SEE ALSO
.sp
.LP
\fBvipw\fR(1B), \fBsendmail\fR(1M), \fBgetusershell\fR(3C), \fBaliases\fR(4)
