Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/smb.4
'\" te
.\" Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smb 4 "30 Jun 2011" "SunOS 5.11" "File Formats"
.SH NAME
smb \- configuration properties for the Oracle Solaris SMB server and client
.SH DESCRIPTION
.sp
.LP
The behavior of the Oracle Solaris SMB server and client is defined by property values that are stored in the Service Management Facility, \fBsmf\fR(5).
.sp
.LP
An authorized user can use the \fBsharectl\fR(1M) command to set global values for these properties in SMF.
.sp
.LP
The following list describes the properties:
.sp
.ne 2
.mk
.na
\fB\fBads_site\fR\fR
.ad
.sp .6
.RS 4n
Specifies the Active Directory site. Sites provide a mechanism to partition or delegate administration and policy management, which are typically used in large or complex domains.
.sp
The value should not be set if you do not have a local Active Directory site. By default, no value is set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBautohome_map\fR\fR
.ad
.sp .6
.RS 4n
Specifies the full path for the SMB \fBautohome\fR map file, \fBsmbautohome\fR. The Oracle Solaris SMB server can automatically share home directories when a SMB client connects. The default path is \fB/etc\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBclient_lmauth_level\fR\fR
.ad
.sp .6
.RS 4n
Specifies the LAN Manager (LM) authentication level for the Oracle Solaris SMB client. The LM compatibility level controls the type of user authentication to use in workgroup mode or domain mode. The default value is \fB3\fR.
.sp
The following describes the behavior at each level.
.sp
.in +2
.nf
    Oracle Solaris SMB Client
         
+---+------------------------------+
| 1 | Uses LM and NTLM             |
|   | authentication               |
+---+------------------------------+
| 2 | Uses NTLM authentication     |
|   |                              |
+---+------------------------------+
| 3 | Uses NTLMv2 authentication   |
|   |                              |
+---+------------------------------+
| 4 | Uses NTLMv2 authentication   |
+---+------------------------------+
| 5 | Uses NTLMv2 authentication   |
|   |                              |
+---+------------------------------+
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBclient_signing_required\fR\fR
.ad
.sp .6
.RS 4n
When SMB client signing is required, the Oracle Solaris SMB client signs all packets, and is not able to connect to servers configured with signing not enabled and not required. When SMB client signing is not required (\fBfalse\fR), the Oracle Solaris SMB client only signs packets if required by the server. Valid values are \fBtrue\fR and \fBfalse\fR. The default value is \fBfalse\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisposition\fR\fR
.ad
.sp .6
.RS 4n
A value that controls whether the Oracle Solaris SMB server disconnects the share or proceed if the map command fails. The disposition property only has meaning when the map property has been set. Otherwise it has no effect.
.sp
.in +2
.nf
disposition = [ continue | terminate ]
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fB\fBcontinue\fR\fR
.ad
.sp .6
.RS 4n
Proceed with share connection if the map command fails. This is the default in the event that disposition is not specified.
.RE

.sp
.ne 2
.mk
.na
\fB\fBterminate\fR\fR
.ad
.sp .6
.RS 4n
Disconnect the share if the map command fails.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBddns_enable\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables dynamic DNS updates. A value of \fBtrue\fR enables dynamic updates, while a value of \fBfalse\fR disables dynamic updates. By default, the value is \fBfalse\fR.
.sp
For Active Directory DNS servers, when the system is joined to the AD domain, secure updates (defined in \fIRFC 3007\fR) are used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdns_suffix\fR\fR
.ad
.sp .6
.RS 4n
Specifies a primary DNS suffix for this system. Some domain member systems have a primary DNS suffix that does not match the DNS name of the Active Directory domain (of which they are members). This creates a disjoint namespace. By default, no value is set. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBenforce_vczero\fR\fR
.ad
.sp .6
.RS 4n
Specifies the behavior on receiving a connection on virtual circuit (VC) zero. The SMB protocol default is to enforce VC zero behavior. When a client connects using VC zero the server disconnects all previous connections from that client. The default behavior can cause sessions to be disconnected when the DNS contains aliases for the server and shares are mapped using different names. To avoid disconnection, the default behavior can be changed by setting \fBenforce_vczero\fR to \fBfalse\fR. The default value is \fBtrue\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBipv6_enabled\fR\fR
.ad
.sp .6
.RS 4n
Enables IPv6 Internet protocol support within the Oracle Solaris SMB Service. Valid values are \fBtrue\fR and \fBfalse\fR. The default value is \fBfalse\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBkeep_alive\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of seconds before an idle SMB connection is dropped by the Oracle Solaris SMB server. If set to \fB0\fR, idle connections are not dropped. Valid values are \fB0\fR and from \fB20\fR seconds and above. The default value is \fB5400\fR seconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmap\fR\fR
.ad
.sp .6
.RS 4n
The value is a command to be executed on the Oracle Solaris SMB server when a SMB client connects to the share. The command can take the following arguments, which is substituted when the command is exec'd as described below:
.sp
.ne 2
.mk
.na
\fB\fB%U\fR\fR
.ad
.sp .6
.RS 4n
Windows username.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%D\fR\fR
.ad
.sp .6
.RS 4n
Name of the domain or workgroup of \fB%U\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%h\fR\fR
.ad
.sp .6
.RS 4n
The server hostname.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%M\fR\fR
.ad
.sp .6
.RS 4n
The client hostname, or \fB""\fR if not available.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%L\fR\fR
.ad
.sp .6
.RS 4n
The server NetBIOS name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%m\fR\fR
.ad
.sp .6
.RS 4n
The client NetBIOS name, or \fB""\fR if not available. This option is only valid for NetBIOS connections (port 139).
.RE

.sp
.ne 2
.mk
.na
\fB\fB%I\fR\fR
.ad
.sp .6
.RS 4n
The IP address of the client machine.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%i\fR\fR
.ad
.sp .6
.RS 4n
The local IP address to which the client is connected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%S\fR\fR
.ad
.sp .6
.RS 4n
The name of the share.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%P\fR\fR
.ad
.sp .6
.RS 4n
The root directory of the share.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%u\fR\fR
.ad
.sp .6
.RS 4n
The UID of the Unix user.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBmax_connections\fR\fR
.ad
.sp .6
.RS 4n
Specifies the maximum number of concurrent open connections on the SMB server. The value is an upper limit and it has no effect when the number of concurrent connections is below the limit. The only reason to change this value is to enforce a lower or higher limit on the number of concurrent connections. The default value is \fB32768\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmax_workers\fR\fR
.ad
.sp .6
.RS 4n
Specifies the maximum number of worker threads that are launched to process incoming SMB requests. The SMB \fBmax_mpx\fR value, which indicates to a SMB client the maximum number of outstanding SMB requests that it can have pending on the Oracle Solaris SMB server, is derived from the \fBmax_workers\fR value. To ensure compatibility with older versions of Windows the lower 8-bits of \fBmax_mpx\fR must not be zero. If the lower byte of \fBmax_workers\fR is zero, \fB64\fR is added to the value. Thus the minimum value is \fB64\fR and the default value, which appears in \fBsharectl\fR(1M) as \fB1024\fR, is \fB1088\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBnetbios_scope\fR\fR
.ad
.sp .6
.RS 4n
Specifies the NetBIOS scope identifier, which identifies logical NetBIOS networks that are on the same physical network. When you specify a NetBIOS scope identifier, the Oracle Solaris SMB server filters the number of machines that are listed in the browser display to make it easier to find other hosts. The value is a text string that represents a domain name. By default, no value is set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpdc\fR\fR
.ad
.sp .6
.RS 4n
Specifies the preferred IP address for the domain controller with which the Oracle Solaris SMB server communicates. This property is sometimes used when there are multiple domain controllers to indicate which one is preferred. If the specified domain controller responds, it is chosen even if the other domain controllers are also available. By default, no value is set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestrict_anonymous\fR\fR
.ad
.sp .6
.RS 4n
Disables anonymous access to \fBIPC$\fR on the Oracle Solaris SMB server, which requires that the SMB client be authenticated to get access to MSRPC services through \fBIPC$\fR. A value of true disables anonymous access to \fBIPC$\fR, while a value of \fBfalse\fR enables anonymous access.
.RE

.sp
.ne 2
.mk
.na
\fB\fBserver_lmauth_level\fR\fR
.ad
.sp .6
.RS 4n
Specifies the LAN Manager (LM) authentication level for the Oracle Solaris SMB server. The LM compatibility level controls the type of user authentication to use in workgroup mode or domain mode. The default value is \fB3\fR.
.sp
The following describes the behavior at each level:
.sp
.in +2
.nf
       Oracle Solaris SMB Server
+---------------------------------+
| 2 | Accepts LM, NTLM and NTLMv2 |
|   | authentication              |
+---+-----------------------------+
| 3 | Accepts LM, NTLM and NTLMv2 |
|   | authentication              |
+---+-----------------------------+
| 4 | Accepts NTLM and NTLMv2     |
|   | authentication              |
+---+-----------------------------+
| 5 | Accepts NTLMv2              |
|   | authentication              |
+---+-----------------------------+
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBserver_signing_enabled\fR\fR
.ad
.sp .6
.RS 4n
Enables SMB server signing. When server signing is enabled but not required, packets signing is at the discretion of the client. When Oracle Solaris SMB server signing is not enabled and not required, packets are signed if, and only if, the client requires signing. When \fBserver_signing_required=true\fR, \fBserver_signing_enabled\fR is treated as \fBtrue\fR. Valid values are \fBtrue\fR and \fBfalse\fR. The default value is \fBfalse\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBserver_signing_required\fR\fR
.ad
.sp .6
.RS 4n
When SMB server signing is required, all packets must be signed or they are rejected. Clients that do not support signing are unable to connect to the Oracle Solaris SMB server. Valid values are \fBtrue\fR and \fBfalse\fR. The default value is \fBfalse\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsystem_comment\fR\fR
.ad
.sp .6
.RS 4n
Specifies an optional description for the system, which is a text string. This property value might appear in various places, such as Network Neighborhood or Network Places on Windows clients. By default, no value is set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunmap\fR\fR
.ad
.sp .6
.RS 4n
The value is a command to be executed on the Oracle Solaris SMB server when a SMB client disconnects the share. The command can take the same substitutions listed on the map property.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwins_exclude\fR\fR
.ad
.sp .6
.RS 4n
Specifies a comma-separated list of network interfaces that should not be registered with WINS for the Oracle Solaris SMB server. NetBIOS host announcements are not made on excluded interfaces.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwins_server_1\fR\fR
.ad
.sp .6
.RS 4n
Specifies the IP address of the primary WINS server. By default, no value is set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwins_server_2\fR\fR
.ad
.sp .6
.RS 4n
Specifies the IP address of the secondary WINS server. By default, no value is set.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/smb
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsharectl\fR(1M), \fBsmbadm\fR(1M), \fBsmbd\fR(1M), \fBsmbstat\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
\fIRFC 3007\fR
