Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/sndr.4
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sndr 4 "16 Aug 2011" "SunOS 5.11" "File Formats"
.SH NAME
sndr \- SNDR parameter values
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/sndr\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsndr\fR file resides in \fB/etc/default\fR and provides startup parameters for the \fBsndrd\fR(1M) and \fBsndrsyncd\fR(1M) daemons.
.sp
.LP
The \fBsndr\fR file format is ASCII and comment lines begin with the crosshatch  (#)  character. Parameters consist of a keyword followed by an equal (=) sign  followed by the parameter value of the form:
.sp
.in +2
.nf
keyword=value
.fi
.in -2

.sp
.LP
The following parameters are currently supported in the \fBsndr\fR file:
.sp
.ne 2
.mk
.na
\fBSNDR_THREADS=num\fR
.ad
.sp .6
.RS 4n
Sets the maximum number of connections allowed to the server over connection-oriented transports.  By default, the number of connections is 16.
.RE

.sp
.ne 2
.mk
.na
\fBSNDR_LISTEN_BACKLOG=num\fR
.ad
.sp .6
.RS 4n
Sets connection queue length for the RDC TCP over a connection-oriented transport. The default value is 10 entries.
.RE

.sp
.ne 2
.mk
.na
\fBSNDR_TRANSPORT=string\fR
.ad
.sp .6
.RS 4n
Sets the transport used for the RDC connection. If IPv6 is installed, the default value is "\fB/dev/tcp\fR" or "\fB/dev/tcp6\fR."
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability storage/avs/avs-remote-mirror
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsndrd\fR(1M), \fBsndrsyncd\fR(1M)
