Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/space.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH space 4 "7 Feb 1997" "SunOS 5.11" "File Formats"
.SH NAME
space \- disk space requirement file
.SH DESCRIPTION
.sp
.LP
\fBspace\fR is an \fBASCII\fR file that gives information about disk space requirements for the target environment. The \fBspace\fR file defines space needed beyond what is used by objects defined in the \fBprototype\fR(4) file; for example, files which will be installed with the \fBinstallf\fR(1M) command. The \fBspace\fR file should define the maximum amount of additional space that a package will require.
.sp
.LP
The generic format of a line in this file is:
.sp
.LP
\fIpathname  blocks  inodes\fR
.sp
.LP
Definitions for the fields are as follows:
.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 12n
.rt  
Specify a directory name which may or may not be the mount  point for a filesystem. Names that do not begin with a slash  ('\fB/\fR') indicate relocatable directories.
.RE

.sp
.ne 2
.mk
.na
\fB\fIblocks\fR\fR
.ad
.RS 12n
.rt  
Define the number of disk blocks required for installation of the files and directory entries contained in the pathname (using a 512-byte block size).
.RE

.sp
.ne 2
.mk
.na
\fB\fIinodes\fR\fR
.ad
.RS 12n
.rt  
Define the number of inodes required for installation of the files and directory entries contained in the pathname.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRA sample file.
.sp
.in +2
.nf
# extra space required by config data which is
# dynamically loaded onto the system
data	500	1
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBinstallf\fR(1M), \fBprototype\fR(4)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
