Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/telnetrc.4
'\" te
.\"  Copyright (c) 1995 Sun Microsystems, Inc.   All Rights Reserved.
.TH telnetrc 4 "9 Jan 1998" "SunOS 5.11" "File Formats"
.SH NAME
telnetrc \- file for telnet default options
.SH DESCRIPTION
.sp
.LP
The  \fB\&.telnetrc\fR file contains commands that are executed when a connection is established on a per-host basis. Each line in the file contains a host name, one or more spaces or tabs, and a \fBtelnet\fR(1) command. The host name, \fBDEFAULT,\fR matches all hosts. Lines beginning with the pound sign (\fB#\fR) are interpreted as comments and therefore ignored. \fBtelnet\fR(1) commands are case-insensitive to the contents of the \fB\&.telnetrc\fR file. 
.sp
.LP
The  \fB\&.telnetrc\fR file is retrieved from each user's  \fBHOME\fR directory.
.SH EXAMPLES
.LP
\fBExample 1 \fRA sample file.
.sp
.LP
In the following example, a \fB\&.telnetrc\fR file executes the \fBtelnet\fR(1) command, \fBtoggle\fR:

.sp
.in +2
.nf
weirdhost toggle crmod
# Always export $PRINTER
DEFAULT environ export PRINTER
.fi
.in -2
.sp

.sp
.LP
The lines in this file indicate that the \fBtoggle\fR argument \fBcrmod\fR, whose default value is "off" (or \fBFALSE),\fR should be enabled when connecting to the system \fBweirdhost\fR. In addition, the value of the environment variable  \fBPRINTER\fR should be exported to all systems. In this case, the \fBDEFAULT\fR keyword is used in place of the host name.

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB$\fR\fBHOME\fR\fB/.telnetrc\fR\fR
.ad
.RS 19n
.rt  
file for telnet default options
.RE

.SH SEE ALSO
.sp
.LP
\fBtelnet\fR(1), \fBin.telnetd\fR(1M), \fBenviron\fR(5)
