Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/timezone.4
'\" te
.\"  Copyright (c) 2003, 2011, Oracle and/or its affiliates. All rights reserved.
.TH timezone 4 "6 Apr 2011" "SunOS 5.11" "File Formats"
.SH NAME
timezone \- default timezone data base
.SH SYNOPSIS
.LP
.nf
\fB/etc/timezone\fR
.fi

.SH DESCRIPTION
.sp
.LP
The timezone file contains information regarding the default timezone for each host in a domain. Alternatively, a single default line for the entire domain  may be specified. Each entry has the format:
.sp
.in +2
.nf
\fITimezone-name    official-host-or-domain-name\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of blanks and/or TAB characters. A `#' indicates the beginning of a comment; characters up to the end of the line are not interpreted by routines which search the file. The timezone is a pathname relative to the directory \fB/usr/share/lib/zoneinfo\fR.
.sp
.LP
This file is not actually referenced by any system software; it is merely used as a source file to construct the \fBNIS\fR \fBtimezone.byname\fR map. This map is read by installation software to initialize the timezone of the client system at installation time.
.sp
.LP
The \fBtimezone\fR file does not set the timezone environment variable \fBTZ\fR. See \fBTIMEZONE\fR(4) for information to set the \fBTZ\fR environment variable.
.SH EXAMPLES
.LP
\fBExample 1 \fRTypical timezone line
.sp
.LP
Here is a typical line from the \fB/etc/timezone\fR file:

.sp
.in +2
.nf
US/Eastern          East.Sun.COM #Sun East Coast
.fi
.in -2
.sp

.SH FILES
.sp
.LP
\fB/etc/timezone\fR
.SH SEE ALSO
.sp
.LP
\fBTIMEZONE\fR(4)
.sp
.LP
\fIInstalling Oracle Solaris 11 Systems\fR
