Arquivotheca/solaris11/usr/man/man/usr/share/man/man4/utmp.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.TH utmp 4 "22 Feb 1999" "SunOS 5.11" "File Formats"
.SH NAME
utmp, wtmp \- utmp and wtmp database entry formats
.SH SYNOPSIS
.LP
.nf
\fB#include <utmp.h>\fR
\fB/var/adm/utmp\fR
\fB/var/adm/wtmp\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fButmp\fR and \fBwtmp\fR database files are obsolete and are no longer present on the system.  They have been superseded by the extended database contained in the \fButmpx\fR and \fBwtmpx\fR database files.  See \fButmpx\fR(4). 
.sp
.LP
It is possible for \fB/var/adm/utmp\fR to reappear on the system. This would most likely occur if a third party application that still uses \fButmp\fR recreates the file if it finds it missing. This file should not be allowed to remain on the system. The user should investigate to determine which application is recreating this file.
.SH SEE ALSO
.sp
.LP
\fButmpx\fR(4)
