Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/auths.1
'\" te
.\" 版权所有 (c) 2004, 2011, Oracle 和/或其附属公司。保留所有权利。
.TH auths 1 "2011 年 3 月 10 日" "SunOS 5.11" "用户命令"
.SH 名称
auths \- 显示授予用户的授权
.SH 用法概要
.LP
.nf
\fBauths\fR [ \fIuser\fR ]...
.fi

.SH 描述
.sp
.LP
\fBauths\fR 命令在标准输出上显示已授予您或者随意指定的用户或角色的授权。授权是某些特权程序在确定用户是否可以执行受限功能时要检查的权限。
.sp
.LP
每个用户可以具有零个或多个授权。授权由全限定名表示，该名称可标识创建授权的组织及其控制的功能。按照 Java 约定，授权的分层组件由句点 (\fB\&.\fR) 分隔，以创建组织的逆序 Internet 域名开头，以授权类中的特定函数结尾。
.sp
.LP
星号 (\fB*\fR) 表示类中的所有授权。
.sp
.LP
在 \fBuser_attr\fR(4) 和 \fB/etc/security/policy.conf\fR 文件中查找用户的授权（请参见 \fBpolicy.conf\fR(4)）。可在 \fBuser_attr\fR(4) 中直接指定授权，或通过 \fBprof_attr\fR(4) 间接指定授权。也可以将授权作为缺省授权直接分配给系统中的每个用户，或者作为 \fB/etc/security/policy.conf\fR 文件中的缺省配置文件间接分配给每个用户。
.SH 示例
.LP
\fB示例 1 \fR样例输出
.sp
.LP
\fBauths\fR 输出的格式如下：

.sp
.in +2
.nf
example% \fBauths tester01 tester02\fR
tester01 : solaris.system.date,solaris.jobs.admin
tester02 : solaris.system.*
example%
.fi
.in -2
.sp

.sp
.LP
请注意，在 \fBtester01\fR 中，授权名称之间由逗号分隔后不加空格。

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误。
.RE

.SH 文件
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBprofiles\fR(1)、\fBroles\fR(1)、\fBgetauthattr\fR(3C)、\fBauth_attr\fR(4)、\fBpolicy.conf\fR(4)、\fBprof_attr\fR(4)、\fBuser_attr\fR(4)、\fBattributes\fR(5)
