Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/isainfo.1
'\" te
.\"  版权所有 (c) 2007，Oracle 和/或其附属公司。保留所有权利。
.TH isainfo 1 "2007 年 2 月 8 日" "SunOS 5.11" "用户命令"
.SH 名称
isainfo \- 描述指令集合的体系结构
.SH 用法概要
.LP
.nf
\fBisainfo\fR [ [\fB-v\fR] [\fB-b\fR | \fB-n\fR | \fB-k\fR] | [\fB-x\fR]]
.fi

.SH 描述
.sp
.LP
\fBisainfo\fR 实用程序用于识别当前正在运行的系统支持的指令集体系结构的各种属性。它可以回答下列问题，是否支持 64 位应用程序、正在运行的内核使用的是 32 位设备驱动程序还是 64 位设备驱动程序，等等。
.sp
.LP
不带有任何选项进行调用时，\fBisainfo\fR 会输出当前版本的操作系统所支持的应用程序的本机指令集名称。这些是 \fBisalist\fR(1) 返回的列表的一个子集。该子集对应于当前正在运行的系统所支持的基本应用程序环境。
.SH 选项
.sp
.LP
支持下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 6n
.rt  
列显本机指令集的地址空间中的位数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 6n
.rt  
输出操作系统内核组件（例如设备驱动程序和 \fBSTREAMS\fR 模块）所使用的指令集的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
输出当前版本的操作系统支持的可移植应用程序所使用的本机指令集的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
当与 \fB-b\fR、\fB-k\fR 或 \fB-n\fR 选项结合使用时，可以输出更详细的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
输出平台所支持的本机 ABI 的指令扩展。
.RE

.SH 示例
.LP
\fB示例 1 \fR在 32 位 x86 平台上调用 \fBisainfo\fR
.sp
.LP
以下示例在 32 位 x86 平台上调用 \fBisainfo\fR：

.sp
.in +2
.nf
example% isainfo -v
32-bit i386 applications

example% isainfo -k
i386
.fi
.in -2
.sp

.LP
\fB示例 2 \fR从在 64 位 SPARC 处理器上运行 64 位操作系统的系统上调用 \fBisainfo\fR
.sp
.LP
以下示例从在 64 位 SPARC 处理器上运行 64 位操作系统的系统上调用 \fBisainfo\fR：

.sp
.in +2
.nf
example% isainfo
sparcv9 sparc
example% isainfo -n
sparcv9
example% isainfo -v
64-bit sparcv9 applications
32-bit sparc applications
example% isainfo -vk
64-bit sparcv9 kernel modules
.fi
.in -2
.sp

.LP
\fB示例 3 \fR在 AMD Opteron CPU 上调用 \fBisainfo\fR \fB-x\fR
.sp
.LP
以下示例在 AMD Opteron CPU 上使用 \fB-x\fR 选项调用 \fBisainfo\fR： 

.sp
.in +2
.nf
example% isainfo -x
i386: fpu tsc cx8 sep cmov mmx ammx a3dnow a3dnowx fxsr sse sse2 pause
.fi
.in -2
.sp

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB非零值\fR
.ad
.RS 13n
.rt  
未正确指定选项，或者命令无法识别运行它的系统的属性。会将一条错误消息输出到 \fBstderr\fR。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBisalist\fR(1)、\fBuname\fR(1)、\fBpsrinfo\fR(1M)、\fBgetisax\fR(2)、\fBsysinfo\fR(2)、\fBattributes\fR(5)、\fBisalist\fR(5)
