Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/isalist.1
'\" te
.\"  版权所有 (c) 2008，Oracle 和/或其附属公司。保留所有权利。
.TH isalist 1 "2008 年 3 月 20 日" "SunOS 5.11" "用户命令"
.SH 名称
isalist \- 显示在此平台上可执行的本机指令集
.SH 用法概要
.LP
.nf
\fBisalist\fR 
.fi

.SH 描述
.sp
.LP
\fBisalist\fR 在标准输出上列出在此平台上可执行的本机指令集的名称，与由 \fBsysinfo\fR(2) 的 \fBSI_ISALIST\fR 命令返回的结果相同。
.sp
.LP
名称以空格分隔，并按性能从最佳到最差的顺序排列。也就是说，较早列出的指令集可能比较晚列出的指令集包含更多的指令；在此计算机上，针对较早列出的指令集编译的程序将会比针对较晚列出的指令集编译的同一程序运行速度要快。
.sp
.LP
为列表中未显示的指令集编译的程序可能会出现性能下降，或无法在此计算机上运行。
.sp
.LP
\fBisalist\fR(5) 中列出了系统已知的指令集名称。这些名称可能与 C 语言编译系统中的预定义名称或编译器选项匹配，也可能不匹配。
.sp
.LP
此命令已过时，可能会在将来版本的 Solaris 中删除。有关更好地处理指令集扩展的方式，请参见 \fBisainfo\fR(1)。
.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
属性类型\fB\fR属性值\fB\fR
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBisainfo\fR(1)、\fBoptisa\fR(1)、\fBuname\fR(1)、\fBsysinfo\fR(2)、\fBattributes\fR(5)、\fBisalist\fR(5)
