Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/pfexec.1
'\" te
.\" Copyright (c) 2003, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH pfexec 1 "2011 年 7 月 12 日" "SunOS 5.11" "用户命令"
.SH 名称
pfexec, pfbash, pfcsh, pfksh, pfsh, pftcsh, pfzsh \- 执行配置文件中的命令
.SH 用法概要
.LP
.nf
\fB/usr/bin/pfexec\fR \fIcommand\fR
.fi

.LP
.nf
\fB/usr/bin/pfexec\fR \fB-P\fR \fIprivspec\fR \fIcommand\fR [ \fIarg\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfsh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfcsh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.LP
.nf
\fB/usr/bin/pfksh\fR [ \fIoptions\fR ] [ \fIargument\fR ]...
.fi

.SH 描述
.sp
.LP
\fBpfexec\fR 程序用于使用由 \fBexec_attr\fR(4) 数据库中的用户配置文件指定的属性执行命令。它是由分别链接到 Bourne shell、C shell 和 Korn shell 的配置文件 shell \fBpfsh\fR、\fBpfcsh\fR 和 \fBpfksh\fR 调用的。
.sp
.LP
将按\fBuser_attr\fR(4) 数据库中的用户条目指定的顺序搜索配置文件。如果同一命令出现在多个配置文件中，则配置文件 shell 将使用第一个匹配的条目。
.sp
.LP
使用第二种形式 (\fBpfexec\fR \fB-P\fR \fIprivspec\fR)，用户可以获取在 \fBprof_attr\fR(4) 中授予用户配置文件的附加特权。在命令行上指定的特权是使用 \fBpriv_str_to_set\fR(3C) 解析的。得到的特权将先与在 \fBprof_attr\fR(4) 中使用 \fBprivs\fR 关键字为所有用户配置文件指定的特权合并在一起，然后再执行命令。
.SH 用法
.sp
.LP
\fBpfexec\fR 用于使用预定义的进程属性（例如特定用户或组 \fBID\fR）执行命令。
.sp
.LP
有关配置文件 shell 的完整使用说明，请参阅\fBsh\fR(1)、\fBcsh\fR(1) 和 \fBksh\fR(1)手册页。
.SH 示例
.LP
\fB示例 1 \fR获取附加的用户特权
.sp
.in +2
.nf
example% \fBpfexec -P all chown user file\fR
.fi
.in -2
.sp

.sp
.LP
此命令仅以分配给当前用户的所有特权运行 \fBchown user file\fR，不必使用所有特权。

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBbash\fR(1)、\fBcsh\fR(1)、\fBksh\fR(1)、\fBksh88\fR(1)、\fBprofiles\fR(1)、\fBsh\fR(1)、\fBtcsh\fR(1)、\fBzsh\fR(1)、\fBexec_attr\fR(4)、\fBprof_attr\fR(4)、\fBuser_attr\fR(4)、\fBattributes\fR(5)
