Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/pkgparam.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.\" 版权所有 1989 AT&T
.TH pkgparam 1 "2011 年 7 月 7 日" "SunOS 5.11" "用户命令"
.SH 名称
pkgparam \- 显示软件包参数值
.SH 用法概要
.LP
.nf
\fBpkgparam\fR [\fB-v\fR] [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] \fIpkginst\fR [\fIparam\fR]...
.fi

.LP
.nf
\fBpkgparam\fR \fB-f\fR \fIfilename\fR [\fB-v\fR] [\fIparam\fR]...
.fi

.SH 描述
.sp
.LP
\fBpkgparam\fR 显示与命令行中请求的参数关联的值。这些值位于 \fIpkginst\fR 的 \fBpkginfo\fR(4) 文件中或通过 \fB-f\fR 选项命名的特定文件中。
.sp
.LP
每行显示一个参数值。除非使用 \fB-v\fR 选项，否则只给出参数值。使用此选项，命令的输出为以下格式：
.sp
.in +2
.nf
\fIparameter1\fR\fB='\fR\fIvalue1\fR\fB\&'\fR
\fIparameter2\fR\fB='\fR\fIvalue2\fR\fB\&'\fR
\fIparameter3\fR\fB='\fR\fIvalue3\fR\fB\&'\fR
.fi
.in -2
.sp

.sp
.LP
如果命令行未指定任何参数，则显示与软件包关联的所有参数的值。
.SH 选项
.sp
.LP
此命令的选项和参数是：
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.RS 16n
.rt  
指定存储 \fIpkginst\fR 的 \fIdevice\fR。它可以是磁带或可移除磁盘的目录路径名或标识符（例如，\fB/var/tmp\fR 或 \fB/dev/dsk/c1d0s0\fR）。特殊的令牌 \fBspool\fR 可以用来表示缺省的安装假脱机目录 (\fB/var/spool/pkg\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 16n
.rt  
读取参数值的 \fIfilename\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.RS 16n
.rt  
定义要用作 \fIroot_path\fR 的子目录全路径名。所有文件，包括软件包系统信息文件，都重定位到指定的 \fIroot_path\fR 下开始的目录树。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 16n
.rt  
详细模式。显示参数名称及其值。
.RE

.SH 操作数
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
定义应为其显示参数值的特定软件包实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fIparam\fR\fR
.ad
.RS 11n
.rt  
定义应显示其值的特定参数。
.RE

.SH 错误
.sp
.LP
如果指定软件包的参数信息不可用，命令以非零状态退出。
.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBpkgmk\fR(1)、\fBpkgproto\fR(1)、\fBpkgtrans\fR(1)、\fBpkgadd\fR(1M)、\fBpkginfo\fR(4)、\fBattributes\fR(5)、\fBlargefile\fR(5)
.sp
.LP
\fI《Application Packaging Developer\&'s Guide》\fR
.SH 附注
.sp
.LP
使用 \fB-f\fR 选项，可以指定应从中提取参数值的文件。此文件应与 \fBpkginfo\fR(4) 文件格式相同。例如，此类文件可能在软件包开发过程中创建，而在软件测试的此阶段使用。
.sp
.LP
软件包命令可识别 \fBlargefile\fR(5)。它们处理大于 2 GB 的文件的方法与处理较小文件的方法相同。在当前的执行中，\fBpkgadd\fR(1M)、\fBpkgtrans\fR(1) 和其他软件包命令可以处理最大 4 GB 的数据流。
