Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/pkgtrans.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. 保留所有权利。
.\" 版权所有 1989 AT&T
.TH pkgtrans 1 "2011 年 7 月 7 日" "SunOS 5.11" "用户命令"
.SH 名称
pkgtrans \- 转换软件包格式
.SH 用法概要
.LP
.nf
\fBpkgtrans\fR [\fB-inosg\fR] [\fB-k\fR \fIkeystore\fR] [\fB-a\fR \fIalias\fR] [\fB-P\fR \fIpasswd\fR] \fIdevice1\fR \fIdevice2\fR 
     [\fIpkginst\fR]...
.fi

.SH 描述
.sp
.LP
\fBpkgtrans\fR 实用程序用于将可安装的软件包从一种格式转换为另一种格式。它可进行下列转换：
.RS +4
.TP
.ie t \(bu
.el o
从文件系统格式到数据流
.RE
.RS +4
.TP
.ie t \(bu
.el o
从文件系统格式到已签名的数据流
.RE
.RS +4
.TP
.ie t \(bu
.el o
从数据流到文件系统格式
.RE
.RS +4
.TP
.ie t \(bu
.el o
从一种文件系统格式到另一种文件系统格式
.RE
.SH 选项
.sp
.LP
此命令的选项和参数如下：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIalias\fR\fR
.ad
.RS 15n
.rt  
使用与友好名称别名相关联的公钥证书以及对应的私钥。有关更多信息，请参见 \fBpkgadd\fR(1M) 中的\fB证书位置\fR与\fB密钥库和证书格式\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 15n
.rt  
对结果数据流进行签名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 15n
.rt  
仅复制 \fBpkginfo\fR(4) 和 \fBpkgmap\fR(4) 文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkeystore\fR\fR
.ad
.RS 15n
.rt  
使用密钥库检索用于生成签名的私钥。如果未指定此选项，将搜索缺省位置来查找由 \fB-a\fR 指定的指定私钥。如果没有给定别名且密钥库中存在多个密钥，则 \fBpkgtrans\fR 将中止。有关搜索位置和格式的更多信息，请参见 \fBpkgadd\fR(1M) 中的\fB密钥库位置\fR与\fB密钥库和证书格式\fR。
.sp
当以非 root 用户运行时，用于证书搜索的缺省基目录是 \fB~/.pkg/security\fR，其中 \fB~\fR 是调用 \fBpkgtrans\fR 的用户的起始目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
如果目标设备上已存在该软件包的任何实例，则会创建软件包的新实例，最大实例数由 \fBpkginfo\fR(4) 文件中的 \fBMAXINST\fR 变量指定。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 15n
.rt  
覆盖目标设备上的相同实例。如果软件包实例已经存在，将覆盖现有实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpasswd\fR\fR
.ad
.RS 15n
.rt  
提供用来解密密钥库的口令。有关此选项参数的语法的详细信息，请参见 \fBpkgadd\fR(1M) 中的\fB口令短语参数\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 15n
.rt  
指示软件包应该作为数据流（而不是作为文件系统）写入到 \fIdevice2\fR。缺省行为是以文件系统格式写入到支持这两种格式的设备中。
.RE

.SH 操作数
.sp
.ne 2
.mk
.na
\fB\fIdevice1\fR\fR
.ad
.RS 11n
.rt  
指示源设备。该设备上的软件包将被转换并放置到 \fIdevice2\fR 中。请参见下面的"设备说明符"。
.RE

.sp
.ne 2
.mk
.na
\fB\fIdevice2\fR\fR
.ad
.RS 11n
.rt  
指示目标设备。转换后的软件包将放置到该设备中。请参见下面的"设备说明符"。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
指定应转换 \fIdevice1\fR 中的哪个（些）软件包实例。可以使用标记 \fBall\fR 来指示所有软件包。可以使用 \fBpkginst.*\fR 来指示某个软件包的所有实例。如果没有定义软件包，则会出现一个提示，它显示设备上的所有软件包，并询问要转换哪一个。
.sp
星号字符(\fB*\fR) 对于某些 shell 来说是特殊字符，可能需要转义。在 C-Shell 中，\fB*\fR 必须放在单引号 (\fB\&'\fR) 中或者以反斜杠 (\fB\e\fR) 为前缀。
.RE

.SH 设备说明符
.sp
.LP
打包工具（包括 \fBpkgtrans\fR、\fBpkgadd\fR(1M) 和 \fBpkgchk\fR(1M)）都具有相应的选项，可以使用这些选项通过指定软件包所在的设备来指定软件包位置。下面列出了可以存储和从中检索软件包的设备类型。请注意，源设备和目标设备不能相同。
.sp
.ne 2
.mk
.na
\fBdevice\fR
.ad
.RS 25n
.rt  
通过将设备标识符指定为设备，可以将软件包存储为字符或块设备。该设备类型的一个常见示例是可移除磁带的 \fB/dev/rmt/0\fR。\fBpkgtrans\fR 还可以生成流格式的常规文件系统文件，该格式的文件适合存储在字符设备、Web 服务器上或者作为 \fBpkgadd\fR(1M) 的输入。
.RE

.sp
.ne 2
.mk
.na
\fBdirectory（目录）\fR
.ad
.RS 25n
.rt  
通过指定某个文件系统目录的绝对路径可以将软件包存储到某个目录中。软件包内容将驻留在指定目录内的一个目录中。软件包目录名称必须与其在 \fBpkginfo\fR(4) 文件中的 \fBPKG\fR 定义相同。此类型的一个设备定义示例为 \fB/export/packages\fR。
.RE

.SH 示例
.LP
\fB示例 1 \fR转换 \fB/tmp\fR 中的软件包
.sp
.LP
以下示例将 \fB/tmp\fR 中的软件包 \fBpkg1\fR 和 \fBpkg2\fR 转换为数据流格式：

.sp
.in +2
.nf
example% \fBpkgtrans -s /tmp /tmp/datastream.pkg pkg1 pkg2\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR创建已签名的软件包
.sp
.LP
以下示例基于 \fBpkg1\fR 和 \fBpkg2\fR 创建已签名的软件包，并从 \fB$PASS\fR 环境变量读取口令：

.sp
.in +2
.nf
example% \fBpkgtrans -sg -k /tmp/keystore.p12 -a foo \e\fR
    \fB-p env:PASS /tmp /tmp/signedpkg pkg1 pkg2\fR
.fi
.in -2
.sp

.LP
\fB示例 3 \fR转换软件包数据流
.sp
.LP
以下示例将软件包数据流转换为文件系统格式软件包：

.sp
.in +2
.nf
example% \fBpkgtrans /tmp/pkg1.pkg ~/tmp pkg1\fR
.fi
.in -2
.sp

.SH 环境变量
.sp
.LP
\fBMAXINST\fR 变量是在 \fBpkginfo\fR(4) 文件中设置的，它并声明软件包实例的最大数量。
.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性package/svr4
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBpkginfo\fR(1)、\fBpkgmk\fR(1)、\fBpkgparam\fR(1)、\fBpkgproto\fR(1)、\fBinstallf\fR(1M)、\fBpkgadd\fR(1M)、\fBpkgask\fR(1M)、\fBpkgrm\fR(1M)、\fBremovef\fR(1M)、\fBpkginfo\fR(4)、\fBpkgmap\fR(4)、\fBattributes\fR(5)、\fBlargefile\fR(5)
.sp
.LP
\fI《Application Packaging Developer\&'s Guide》\fR
.SH 附注
.sp
.LP
缺省情况下，如果目标设备上已存在某个软件包的任何实例，则 \fBpkgtrans\fR 不会转换该软件包的任何实例。如果已经存在该软件包的一个实例，使用 \fB-n\fR 选项将创建一个新实例。如果已经存在该软件包的一个实例，使用 \fB-o\fR 选项将覆盖该实例。如果目标设备是数据流，这两个选项都没有用。
.sp
.LP
软件包命令可识别 \fBlargefile\fR(5)。它们处理大于 2 GB 的文件的方法与处理较小文件的方法相同。在其当前实现中，\fBpkgadd\fR(1M)、\fBpkgtrans\fR 和其他软件包命令最多可以处理 4 GB 的数据流。
