Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/ptree.1
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH ptree 1 "2011 年 3 月 29 日" "SunOS 5.11" "用户命令"
.SH 名称
ptree \- 输出进程树
.SH 用法概要
.LP
.nf
\fB/usr/bin/ptree\fR [\fB-a\fR] [\fB-c\fR] [\fB-z\fR \fIzone\fR] [\fIpid\fR | \fIuser\fR]...
.fi

.SH 描述
.sp
.LP
\fBptree\fR 实用程序输出包含指定 \fIpid\fR 或 \fIuser\fR 的进程树，其中，子进程相对于其各自的父进程缩进排列。如果某个参数全部由数字组成，则会将其视为进程 ID，否则会将其假定为用户登录名。缺省设置为所有进程。
.SH 选项
.sp
.LP
支持下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 11n
.rt  
所有。输出所有进程，包括进程 0 的子进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 11n
.rt  
合同。输出包括父/子关系在内的进程合同成员身份。请参见 \fBprocess\fR(4)。此选项隐式指定 \fB-a\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR\fR
.ad
.RS 11n
.rt  
区域。仅输出 \fIzone\fR 中指定的进程。每个区域 \fBID\fR 可以指定为区域名称，也可以指定为数字区域 \fBID\fR。 
.sp
此选项仅在全局区域中执行时有效。
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIpid\fR\fR
.ad
.RS 8n
.rt  
进程 ID 或进程 ID 列表。\fBptree\fR 还可接受 \fB/proc/\fR\fInnn\fR 作为进程 ID，因此可使用 shell 扩展 \fB/proc/*\fR 来指定系统中的所有进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fIuser\fR\fR
.ad
.RS 8n
.rt  
用户名或用户名列表。显示其有效的用户 ID 与给定 ID 相匹配的进程。 
.RE

.SH 示例
.LP
\fB示例 1 \fR使用 \fBptree\fR
.sp
.LP
以下示例输出与命令名 \fBssh\fR 相匹配的进程的进程树（包括进程 0 的子进程）： 

.sp
.in +2
.nf
$ ptree -a `pgrep ssh`
        1     /usr/sbin/init
          100909 /usr/lib/ssh/sshd
            569150 /usr/lib/ssh/sshd
              569157 /usr/lib/ssh/sshd
                569159 -ksh
                  569171 bash
                    569173 /bin/ksh
                      569193 bash
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
操作成功。
.RE

.sp
.ne 2
.mk
.na
\fB非零值\fR
.ad
.RS 13n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.RS 11n
.rt  
进程文件
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性请参见下文。
.TE

.sp
.LP
人类可阅读的输出是 "Uncommitted"（未确定），选项是 "Committed"（已确定）。
.SH 另请参见
.sp
.LP
\fBgcore\fR(1)、\fBldd\fR(1)、\fBpargs\fR(1)、\fBpgrep\fR(1)、\fBpkill\fR(1)、\fBplimit\fR(1)、\fBpmap\fR(1)、\fBpreap\fR(1)、\fBproc\fR(1)、\fBps\fR(1)、\fBppgsz\fR(1)、\fBpwd\fR(1)、\fBrlogin\fR(1)、\fBtime\fR(1)、\fBtruss\fR(1)、\fBwait\fR(1)、\fBfcntl\fR(2)、\fBfstat\fR(2)、\fBsetuid\fR(2)、\fBdlopen\fR(3C)、\fBsignal.h\fR(3HEAD)、\fBcore\fR(4)、\fBproc\fR(4)、\fBprocess\fR(4)、\fBattributes\fR(5)、\fBzones\fR(5)
