Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/roles.1
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH roles 1 "2011 年 7 月 5 日" "SunOS 5.11" "用户命令"
.SH 名称
roles \- 输出授予用户的角色
.SH 用法概要
.LP
.nf
\fBroles\fR [ \fIuser\fR ]...
.fi

.SH 描述
.sp
.LP
\fBroles\fR 命令在标准输出上输出授予您或另外指定的用户的角色。角色是特殊帐户，对应于某个功能性职责而不是对应于实际的人员（称为普通用户）。
.sp
.LP
每个用户可以有零个或多个角色。角色具有普通用户的大多数属性，并且像普通用户一样是在 \fBpasswd\fR(4) 和 \fBshadow\fR(4) 中标识的。每个角色在 \fBuser_attr\fR(4) 文件中都必须有一个将其标识为角色的条目。角色可以有自己的授权和配置文件。有关下列属性的描述，请参见 \fBauths\fR(1) 和 \fBprofiles\fR(1)。
.sp
.LP
不允许角色作为主用户登录到系统中。相反，用户必须以其自己的身份登录并担任该角色。角色的操作被视为系普通用户所为。当启用了审计时，角色的被审计事件包含担任该角色的原始用户的审计 \fBID\fR。
.sp
.LP
角色不能担任其自身或任何其他角色。角色没有层次。不过，权限配置文件（请参见 \fBprof_attr\fR(4)）是分层次的，并且可用于实现与分层角色相同的效果。
.sp
.LP
可以使用 \fBsu\fR(1M)、\fBssh\fR(1) 或某个支持 \fBPAM_AUSER\fR 变量的其他服务来执行角色担任。成功的担任需要角色验证和成员身份。角色验证可能需要用户口令或角色口令，具体取决于角色的 \fBuser_attr\fR(4) 条目中 \fBroleauth\fR 属性的设置。缺省情况下，需要角色的口令。通常向角色分配配置文件 shell。按照惯例，在标准 shell 的名称前添加 \fBpf\fR 来指定配置文件 shell，例如，\fBpfbash\fR。角色分配是在 \fBuser_attr\fR(4) 中指定的。
.SH 示例
.LP
\fB示例 1 \fR样例输出
.sp
.LP
\fBroles\fR 命令的输出具有以下格式：

.sp
.in +2
.nf
example% \fBroles tester01 tester02\fRtester01 : admin
tester02 : secadmin, root
example%
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误。
.RE

.SH 文件
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBauths\fR(1)、\fBpfexec\fR(1)、\fBprofiles\fR(1)、\fBrlogin\fR(1)、\fBssh\fR(1)、\fBsu\fR(1M)、\fBauth_attr\fR(4)、\fBpasswd\fR(4)、\fBprof_attr\fR(4)、\fBshadow\fR(4)、\fBuser_attr\fR(4)、\fBattributes\fR(5)
