Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/svcprop.1
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates.保留所有权利。
.TH svcprop 1 "2011 年 8 月 23 日" "SunOS 5.11" "用户命令"
.SH 名称
svcprop \- 检索服务配置属性值
.SH 用法概要
.LP
.nf
\fBsvcprop\fR [\fB-fqtv\fR] [\fB-C\fR | \fB-c\fR | \fB-s\fR \fIsnapshot\fR] [\fB-p\fR [\fIname\fR/]\fIname\fR]... 
     {\fIFMRI\fR | \fIpattern\fR}...
.fi

.LP
.nf
\fBsvcprop\fR \fB-w\fR [\fB-fqtv\fR] [\fB-p\fR [\fIname\fR/]\fIname\fR] {\fIFMRI\fR | \fIpattern\fR}
.fi

.SH 描述
.sp
.LP
\fBsvcprop\fR 实用程序输出服务配置系统信息库中的属性值。属性可通过 \fB-p\fR 选项和操作数选定。
.sp
.LP
如果不带 \fB-C\fR、\fB-c\fR 或 \fB-s\fR 选项，\fBsvcprop\fR 将访问有效属性。服务的有效属性是其直接附加属性。服务实例的有效属性是以下属性的联合：该实例\fB正在运行\fR的快照的复合视图中的属性，以及该实例直接附加属性的复合视图的非持久属性组中的属性。有关属性编写的说明，请参见 \fBsmf\fR(5)。如果不存在\fB正在运行\fR的快照，则改用该实例的直接附加属性。 
.SS "输出格式"
.sp
.LP
缺省情况下，如果选定单个属性，每个属性的值将显示在单独的行中。空的 \fBASCII\fR 字符串值用一对双引号 (\fB""\fR) 表示。\fBASCII\fR 字符串值中的 Bourne shell 元字符（包括 '\fB;\fR'、'\fB&\fR\&'、'\fB(\fR'、'\fB)\fR'、'\fB|\fR'、'\fB^\fR'、'\fB<\fR\&'、'\fB>\fR\&'、换行符、空格、跳格、反斜杠、'\fB"\fR'、单引号以及 '\fB`\fR'）通过反斜杠 (\fB\e\fR) 引用。
.sp
.LP
如果选定多个属性，每个属性将显示在一行中。每行包含一个属性定义符、属性类型以及属性值（如上所述）。这几项由空格分开。缺省情况下，如果提供了一个 \fIFMRI\fR 操作数，则属性定义符由属性组名称和属性名称中间加一个斜杠 (\fB/\fR) 组成。如果提供了多个 \fIFMRI\fR 操作数，则属性定义符是一个规范的 \fIFMRI\fR。
.sp
.LP
如果访问控制禁止读取属性值并且 \fB-p\fR 选项没有明确指定属性或属性组，则属性的显示就像没有任何属性值一样。如果 \fB-p\fR 选项指定了一个或多个属性或属性组名称，并且访问控制禁止读取任何属性值，则会生成错误。
.sp
.LP
标准错误流将显示错误消息。
.SH 选项
.sp
.LP
支持下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 14n
.rt  
使用直接附加属性，无需编写。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 14n
.rt  
对于服务实例，使用其直接附加属性的复合视图。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 14n
.rt  
选择多属性输出格式，将完整的 FMRI 作为定义符。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIname\fR\fR
.ad
.RS 14n
.rt  
对于操作数指定的每个服务或服务实例，选择 \fIname\fR 属性组中的所有属性。对于操作数指定的属性组，选择 \fIname\fR 属性。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpg\fR/\fIprop\fR\fR
.ad
.RS 14n
.rt  
对于操作数指定的每个服务或服务实例，选择 \fIpg\fR 属性组中的 \fIprop\fR 属性。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 14n
.rt  
静默。不产生输出。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIname\fR\fR
.ad
.RS 14n
.rt  
对于服务实例，使用 \fIname\fR 快照的复合视图。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 14n
.rt  
选择多属性输出格式。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 14n
.rt  
详细。对不存在的属性输出错误消息，即使同时指定了 -q 选项。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.RS 14n
.rt  
等到指定的属性组或包含指定属性的属性组在输出前更改。
.sp
该选项仅在指定了单个实体时有效。如果指定了多个操作数或者一个操作数与多个实例匹配，则会输出一条错误消息并且不采取任何操作。-C 选项是隐含的。 
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIFMRI\fR\fR
.ad
.RS 11n
.rt  
服务、服务实例、属性组或属性的 FMRI。
.sp
可以通过指定实例名称或服务名称的结尾部分使用实例或服务的缩写形式。属性和属性组必须由完整的 FMRI 指定。例如，以下给定的 FMRI：
.sp
.in +2
.nf
svc:/network/smtp:sendmail
.fi
.in -2
.sp

以下是有效的缩写形式：
.sp
.in +2
.nf
sendmail
:sendmail
smtp
smtp:sendmail
network/smtp
.fi
.in -2
.sp

以下是无效的缩写形式：
.sp
.in +2
.nf
mailnetwork
network/smt
.fi
.in -2
.sp

FMRI 的缩写形式还未确定，因此不应在脚本或其他永久性工具中使用。如果一个缩写与多个实例匹配，每个实例都需要运行 \fBsvcprop\fR。
.RE

.sp
.ne 2
.mk
.na
\fBpattern\fR
.ad
.RS 11n
.rt  
一种通配模式，与系统信息库中的服务和实例的 FMRI 匹配。请参见 \fBfnmatch\fR(5)。如果一个模式与多个服务或实例匹配，每个服务或实例都需要运行 \fBsvcprop\fR。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示单个属性的值
.sp
.LP
以下示例显示了 \fBsystem/cron\fR 服务的 \fBdefault\fR 实例的 restarter 属性组中 state 属性的值。 

.sp
.in +2
.nf
example%  svcprop -p restarter/state system/cron:default
online
.fi
.in -2
.sp

.LP
\fB示例 2 \fR检索是否启用了服务
.sp
.LP
是否启用服务由服务的 \fB-general/enabled\fR 属性决定。该属性可立即生效，因此必须使用 \fB-c\fR 选项。

.sp
.in +2
.nf
example%  svcprop -c -p general/enabled system/cron:default
true
.fi
.in -2
.sp

.LP
\fB示例 3 \fR显示属性组中的所有属性
.sp
.LP
以下实例显示了 Solaris 缺省安装时，\fBnetwork/ntp\fR 服务的每个实例的 \fBgeneral\fR 属性组中包含的所有属性：

.sp
.in +2
.nf
example% svcprop -p general ntp
general/package astring SUNWntpr
general/enabled boolean true
general/entity_stability astring Uncommitted
general/single_instance boolean true
.fi
.in -2
.sp

.LP
\fB示例 4 \fR验证属性是否存在
.sp
.LP
以下示例验证了服务 identity 的所有实例的 \fBgeneral/enabled\fR 属性是否存在。

.sp
.in +2
.nf
example%  svcprop -q -p general/enabled identity:
example%  echo $?
0
.fi
.in -2
.sp

.LP
\fB示例 5 \fR等待属性更改
.sp
.LP
以下示例等待 \fBsendmail\fR 实例更改状态。

.sp
.in +2
.nf
example%  svcprop -w -p restarter/state sendmail
.fi
.in -2
.sp

.LP
\fB示例 6 \fR在脚本中检索布尔属性的值
.sp
.LP
以下示例在脚本中检索布尔属性的值：

.sp
.in +2
.nf
set -- `svcprop -c -t -p general/enabled service`
code=$?
if [ $code -ne 0 ]; then
        echo "svcprop failed with exit code $code"           
        return 1
fi
if [ $2 != boolean ]; then
         echo "general/enabled has unexpected type $2"
         return 2
fi
if [ $# -ne 3 ]; then
          echo "general/enabled has wrong number of values"
          return 3
fi
value=$3
\&...
.fi
.in -2
.sp

.LP
\fB示例 7 \fR在脚本中使用 \fBsvcprop\fR
.sp
.LP
以下示例获取服务属性的值，并将其用于脚本 (\fB/usr/bin/Xserver\fR)：

.sp
.in +2
.nf
fmri=$1
prop=$2
if svcprop -q -p ${prop} ${fmri} ; then
     propval="$(svcprop -p ${prop} "${fmri}")"
     if [[ "${propval}" == "\"\"" ]] ; then
        propval=""
     fi
fi
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
指定的命令行选项无效。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBinetd\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsvc.startd\fR(1M)、\fBservice_bundle\fR(4)、\fBattributes\fR(5)、\fBfnmatch\fR(5)、\fBsmf\fR(5)、\fBsmf_method\fR(5)、\fBsmf_security\fR(5)
