Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/userattr.1
'\" te
.\" 版权所有 (c) 2010，Oracle 和/或其附属公司。保留所有权利。
.TH userattr 1 "2010 年 7 月 15 日" "SunOS 5.11" "用户命令"
.SH 名称
userattr \- 输出授予用户或角色的属性值
.SH 用法概要
.LP
.nf
\fBuserattr\fR [\fB-v\fR] \fIattribute_name\fR [\fIuser\fR]
.fi

.SH 描述
.sp
.LP
\fBuserattr\fR 命令在标准输出中输出为属性 \fBattribute_name\fR 找到的第一个值。如果未指定用户，则将从进程的实际用户 ID 中选择用户。属性名称即 \fBuser_attr\fR(4) 和 \fBprof_attr\fR(4)中定义的名称。对分配给用户的配置文件使用 \fBprofiles\fR(1) 命令。对分配给用户的授权使用 \fBauths\fR(1) 命令。搜索顺序是先搜索用户的 \fBuser_attr\fR 项，然后搜索用户的配置文件。
.sp
.LP
如果未将属性 \fIattribute_name\fR 分配给用户，则对于任何错误，\fBuserattr\fR 都会返回\fB非零\fR退出代码。否则，\fBuserattr\fR 会返回\fB零\fR退出代码。
.sp
.LP
\fB-v\fR 选项可额外输出找到属性的位置。
.SH 示例
.LP
\fB示例 1 \fR使用 \fBuserattr\fR
.sp
.in +2
.nf
example% userattr lock_after_retries root
no
.fi
.in -2
.sp

.SH 文件
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
接口稳定性请参见下文。
.TE

.sp
.LP
退出代码是 "Committed"（已确定）。\fB-v\fR 选项的输出不是接口。
.SH 另请参见
.sp
.LP
\fBauths\fR(1)、\fBprofiles\fR(1)、\fBpolicy.conf\fR(4)、\fBprof_attr\fR(4)、\fBuser_attr\fR(4)、\fBattributes\fR(5)
