Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man1/zonename.1
'\" te
.\" 版权所有 (c) 2004，2011，Oracle 和/或其附属公司。保留所有权利。
.TH zonename 1 "2011 年 3 月 16 日" "SunOS 5.11" "用户命令"
.SH 名称
zonename \- 输出当前区域的名称
.SH 用法概要
.LP
.nf
\fBzonename\fR 
.fi

.SH 描述
.sp
.LP
\fBzonename\fR 实用程序输出当前区域的名称。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的描述，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBzlogin\fR(1)、\fBzoneadm\fR(1M)、\fBzonecfg\fR(1M)、\fBattributes\fR(5)、\fBzones\fR(5)
