Arquivotheca/solaris11/usr/man/man/usr/sunos/man/ja_JP.UTF-8/man1/edit.1
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 1989 AT&T
.TH edit 1 "2004 年 6 月 11 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
edit \- テキストエディタ (ex の初心者ユーザー用の変形版)
.SH 形式
.LP
.nf
\fB/usr/bin/edit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] 
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fR\fIn\fR] [\fB-C\fR] 
     [+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/edit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] 
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fR\fIn\fR] [\fB-C\fR] 
     [+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg6/bin/edit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] 
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fR\fIn\fR] [\fB-C\fR] 
     [+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.SH 機能説明
.sp
.LP
\fBedit\fR ユーティリティは、コマンド指向エディタの使用を望む、初心者のユーザー対象に推奨されるもので、テキストエディタ \fBex\fR の変形です。このエディタは、次のオプションが自動的に設定され、\fBex\fR とまったく同じ様に動作します。
.sp
.ne 2
.mk
.na
\fB初心者\fR
.ad
.RS 19n
.rt  
\fBON\fR
.RE

.sp
.ne 2
.mk
.na
\fBレポート\fR
.ad
.RS 19n
.rt  
\fBON\fR
.RE

.sp
.ne 2
.mk
.na
\fB表示モード\fR
.ad
.RS 19n
.rt  
\fBON\fR
.RE

.sp
.ne 2
.mk
.na
\fBマジック\fR
.ad
.RS 19n
.rt  
\fBOFF\fR
.RE

.sp
.LP
\fBedit\fR の使用を始めるにあたり、役に立つ簡単な説明を次に示しますが、\fBCRT\fR 端末を使用している場合には、画面エディタ \fBvi\fR について学ぶ方をお勧めします。
.sp
.LP
既存のファイルの内容を編集する場合は、シェルに対し、コマンド \fBedit \fR\fIname\fR で始めます。\fBedit\fR は、そのユーザー編集用のファイルのコピーを作成してユーザーが編集できるようにし、そのファイル内の行数および文字数を表示します。新規のファイルを作成する場合も、コマンド \fBedit\fR にファイル名を付け、\fBedit \fR\fIname\fR で始めます。 この場合には、エディタは \fB[New File]\fR と表示して、このファイルが新規のファイルであることを示します。
.sp
.LP
\fBedit\fR コマンドのプロンプトは、コロン (\fB:\fR) であり、エディタを起動した後には、このコロンが表示されていなければなりません。既存のファイルを編集する場合は、\fBedit\fR のバッファ (編集中のファイルのコピーの名前) に何行か入っています。編集開始時には、\fBedit\fR はファイルの最終行を現在行とします。\fBedit\fR のコマンドのほとんどは、対象行をユーザーが指定しないかぎり、現在行を対象とします。したがって、\fBprint\fR(\fBp\fR と省略できます) を指定し、キャリッジリターンを入力すると (これは、\fBedit\fR のすべてのコマンドの後に必要です)、現在行が表示されます。現在行を \fBdelete\fR (\fBd\fR) で削除すると、通常、ファイル中にある次の行が 新しい現在行として表示されます。\fB\fR最終行を \fBdelete\fR すると、新しい最終行が現在行になります。
.sp
.LP
空のファイルに入力したい場合、または、新しい行を追加したい場合は、\fBappend\fR(\fBa\fR) コマンドを使用します。このコマンドを実行 (\fBappend\fR の後に、キャリッジリターンを入力 ) した後は、\fBedit\fR は、ドット (\fB\&.\fR) だけからなる行を入力するまで、端末から入力行を読み取ります。入力行は、現在行の後に追加されます。入力した行の最終行が現在行になります。\fBinsert\fR(\fBi\fR) コマンドも \fBappend\fR と同じ様な働きをしますが、入力行は、現在行の後ではなく、前に挿入されます。
.sp
.LP
\fBedit\fR ユーティリティは、バッファ内の行に行番号を付けます。先頭行が、行番号 1 になります。コマンド \fB1\fR を実行すると、\fBedit\fR はバッファの先頭行を表示します。このときに、コマンド \fBd\fR を実行すると、\fBedit\fR は先頭行を削除し、2 行目を 1 行目とし、現在行 (新しい 1 行目 ) を表示して現在どこにいるかわかるようにします。\fB\fR一般には、現在行は常に、その直前のコマンドの対象となっていた行です。
.sp
.LP
\fBsubstitute\fR (\fBs\fR) コマンド \fBs\fR/\fIold\fR\|/\fInew\fR/ を使用すると、現在行の中のあるテキストを置き換えることができます。 この場合、\fIold\fR には置き換えたい旧文字列を指定し、\fInew\fR には \fIold\fR と置き換えたい新文字列を指定します。
.sp
.LP
\fBfilename\fR ( \fBf\fR) コマンドは、編集中のバッファ内の行数を表示し、このバッファに変更を加えた場合には \fB[Modified]\fR と表示します。バッファを変更した後は、\fBwrite\fR (\fBw\fR) コマンドを実行してファイルの内容をセーブすることができます。\fBquit\fR (\fBq\fR) コマンドを実行すると、エディタを終了することができます。\fBedit\fR を起動したけれども、そのバッファに変更を加えなかった場合は、\fBwrite\fR コマンドを実行してファイルに書き込む必要はありません (ただし、実行しても問題はありません)。バッファに変更を加えた後で、ファイルに書き込まずに \fBedit\fR を \fBquit\fR コマンドで終了しようとすると、メッセージ \fBNo write since last change (:quit!overrides)\fR が表示され、\fBedit\fR は次のコマンドの入力を待ちます。そのバッファを書き込む必要がない場合は、\fBquit\fR コマンドの後に感嘆符 を付けて (\fBq!\fR) 実行してください。バッファは廃棄されて復元不能になり、シェルに戻ります。
.sp
.LP
\fBd\fR および \fBa\fR コマンドが使え、ファイル内の行を示す行番号の指定ができるようになると、必要とするあらゆる変更を行うことができます。ただし、\fBedit\fR をもう少し頻繁に使用する場合には、少なくとも、他に 2 、3 のコマンドを覚えておいたほうが便利です。
.sp
.LP
\fBchange\fR(\fBc\fR) コマンドは、現在行を入力行に変更します。\fBappend\fR の場合と同様、ドット (\fB\&.\fR) だけからなる行を入力するまで、複数の行を入力できます。\fBchange\fR では、変更したい行の行番号を指定して、複数行を変更することができます。\fB3,5c\fR のように指定してください。同じ方法を使って、複数行を表示することもできます。 \fB1,23p\fR と指定すると、ファイルの先頭から 23 行目までを表示することができます。
.sp
.LP
\fBundo\fR (\fBu\fR) コマンドは、直前に実行したコマンドにより変更されたバッファを、元に戻します。したがって、\fBsubstitute\fR コマンドを実行し、その結果が望んだものではなかった場合、\fBu\fR コマンドを実行すると元の行の内容が復元されます。\fBundo\fR コマンドを使って \fBundo\fR コマンドを取り消すこともできます。\fBedit\fR は、コマンドがバッファの複数行を対象にした場合、警告メッセージを表示します。\fBwrite\fR や \fBquit\fR などのコマンドは、取り消しできないので注意してください。
.sp
.LP
バッファ内の次の行を見たい場合は、キャリッジリターンを入力してください。複数の行を見たい場合は、キャリッジリターンの代わりに、\fB^D\fR (コントロールキーを押しながら、\fBd\fR を押します) を入力してください。これによって、\fBCRT\fR に画面半分の行が表示されるか、または、ハードコピー端末に 12 行が出力されます。\fBz\fR コマンドを実行すると、前後のテキストを見ることができます。現在行がテキスト表示の中心に表示され、最後に表示される行が現在行になります。\fB\&''\fR を入力すると、\fBz\fR コマンドを実行する前の現在行に戻ることができます。\fBz\fR コマンドには、他にもオプションがあります。 \fBz-\fR は、元の現在行を最後の行とする 1 画面分のテキスト (または 24 行) を表示します。\fBz+\fR は、現在行の次の 1 画面分を表示します。1 画面分より少ない行数で表示したい場合は、\fBz.11\fR と入力すると、現在行の直前の 5 行と直後の 5 行が 表示されます (\fBz.\fR\fIn\fR と入力すると、\fIn\fR が奇数の場合は、現在行が中心となり、全部で \fIn\fR 行が表示されます。\fIn\fRが偶数の場合は、現在行を中心として、\fIn\fR\fB-1\fR 行が表示されます)。他のコマンドの後に行数を指定することができます。たとえば、コマンド \fBd5\fR を使用すると、現在行と、現在行から数えて 5 行目まで の、合計 5 行を削除することができます。
.sp
.LP
ファイル内で何かを探す場合には、行番号がわかっていれば、行番号を使用することができます。ただし、行の挿入や削除を行なった場合には、行番号は変わっているので、これはあまりあてになりません。ファイルの前方および後方に文字列を検索することができます。/\fItext\fR/ という形式のコマンドを使用すると ファイルの先頭の方に向かって \fItext\fR を検索でき、?\fItext\fR?を使用するとファイルの最後の方に向かって \fItext\fR を検索できます。検索がファイルの終わりに到達しても \fItext\fR が見つからなかった場合は、ラップして元の場所まで検索を続けます。この検索の便利な機能に /^\fItext\fR/ という形式の検索があり、これは、行の先頭にある \fItext\fR を検索します。同様に /\fItext\fR$/ は、行の終わりにある \fItext\fR を検索します。どちらのコマンドも、最後に付ける \fB/\fR または \fB?\fR を省略することができます。
.sp
.LP
現在行を表す記号名として、ドット (\fB\&.\fR) があり、これは行の範囲指定の際に最も便利です。\fB\&.,$p\fR のように指定すると、現在行から、ファイルの最終行までが表示されます。ファイルの最終行に移動するには、最終行を表す記号名 $ を使用して参照することができます。したがって、コマンド \fB$d\fR は、ファイルの最終行を削除し、現在行は変わりません。行参照では、算術式も使用できます。たとえば、\fB$\fR\fB-5\fR は、最終行の前の行から数えて 5 番目の行を表し、\fB\&.+20\fR は、現在行の次の行から数えて 20 番目の行を表します。
.sp
.LP
現在行を見つけるには、\fB`.='\fR\| と入力します。テキストのある部分を、ファイル内またはファイル間で、移動またはコピーする場合に便利です。コピーまたは移動したい行の、最初と最後の行番号を調べます。10 行目から 20 行目を移動する場合は、\fB10,20d a\fR と入力すると、これらの行はファイルから削除され、\fBa\fR という名前のバッファに入ります。\fBedit\fR には、このようなバッファが、\fBa\fR から \fBz\fR まで 26 個あります。バッファ \fBa\fR の内容を現在行の後に入れるには、\fBput a\fR と入力します。これらの行を別のファイルに移動またはコピーする場合には、行をコピーした後に \fBedit\fR (\fBe\fR) コマンドを実行します。このとき、\fBedit chapter2\fR のように、\fBe\fR コマンドの後に編集したい別のファイルの名前を指定します。削除しないで行をコピーする場合には、\fBd\fR の代わりに \fByank\fR(\fBy\fR) を使用してください。1 つのファイル内だけで移動またはコピーする場合には、名前付きバッファを使用する必要はありません。たとえば、10 行目から 20 行目を ファイルの末尾に移動するには、\fB10,20m $\fR と入力します。
.SH オプション
.sp
.LP
次のオプションは、\fBex\fR(1) 内で \fBset\fR コマンドを使用することによって、オン/オフを切り替えることができます。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 25n
.rt  
暗号化オプション。前述の \fB-x\fR オプションと同様ですが、唯一の違いは \fBex\fR の \fBC\fR コマンドをシミュレートする点です。\fB\fR\fBC\fR コマンドは \fBex\fR の \fBX\fR コマンドに似ていますが、読み取られたテキストは、すべて暗号化されていると仮定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 25n
.rt  
LISP プログラムの編集用にセットアップします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 25n
.rt  
エディタまたはシステムのクラッシュが 原因で保存されたファイルの名前をすべて表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 25n
.rt  
読み取り専用モード。読み取り専用フラグが設定され、ファイルの不慮の上書きを防ぎます。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fI filename\fR\fR
.ad
.RS 25n
.rt  
エディタもしくはシステムのクラッシュが発生した後で、\fIfilename\fR が示すファイルを編集します。 (クラッシュが発生したときにバッファの中にあった \fIfilename\fR のバージョンを回復します)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fI tag\fR \fR
.ad
.RS 25n
.rt  
\fItag\fR が示すタグを含むファイルを編集します。そのタグが 定義されている地点が編集開始地点となります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 25n
.rt  
\fBvi\fR を使った編集の画面表示を開始します。単に \fBvi\fR コマンドを入力しても同様に実行できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 25n
.rt  
冗長。\fBex\fR コマンドが標準入力によって読み込まれる場合に、その入力を標準エラーに反映します。シェルスクリプト中の \fBex\fR コマンドを実行する場合に役に立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 25n
.rt  
暗号化オプション。これを指定すると、\fBedit\fR は、\fBex\fR の \fBX\fR コマンドをシミュレートし、ユーザーにキーの入力を求めます。このキーを使って、\fBcrypt\fR コマンドのアルゴリズムに従い、テキストを暗号化したり、暗号を解除したりし ます。\fBX\fRコマンドは、読み取ったテキストが暗号化されているかどうかを判別します。また、一時バッファファイルも \fB-x\fR オプションに対して入力したキーの変形バージョンを用いて暗号化されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fIn\fR\fR
.ad
.RS 25n
.rt  
デフォルト時のウィンドウサイズとして \fIn\fR を設定します。これは、低速の回線でエディタを使用するときに役に立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+\fR\fIcommand\fR | \fB-c\fR\fI command\fR\fR
.ad
.RS 25n
.rt  
\fBcommand\fR で示したエディタコマンドを冒頭に実行して編集処理を開始します。通常は、検索または位置指定用のコマンドが用いられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\(mi\fR | \fB-s\fR \fR
.ad
.RS 25n
.rt  
ユーザーへのすべての対話型フィードバックを抑制します。編集スクリプト実行時に役に立ちます。
.RE

.sp
.LP
\fIfilename\fR 引数は編集対象の 1 つまたは複数のファイルを示します。
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.SS "/usr/bin/edit"
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fB属性タイプ\fR\fB属性値\fR
使用条件system/core-os
CSI有効
.TE

.SS "/usr/xpg4/bin/edit"
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fB属性タイプ\fR\fB属性値\fR
使用条件system/xopen/xcu4
CSI有効
.TE

.SS "/usr/xpg6/bin/edit"
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fB属性タイプ\fR\fB属性値\fR
使用条件system/xopen/xcu6
CSI有効
.TE

.SH 関連項目
.sp
.LP
\fBed\fR(1), \fBex\fR(1), \fBvi\fR(1), \fBattributes\fR(5), \fBXPG4\fR(5)
.SH 注意事項
.sp
.LP
暗号化オプションは、セキュリティ管理ユーティリティパッケージで提供されていますが、米国においてのみ使用可能です。
