Arquivotheca/solaris11/usr/man/man_sparc/usr/share/man/ja_JP.UTF-8/man1m/prtdscp.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH prtdscp 1M "2006 年 4 月 25 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
prtdscp \- \fBDSCP\fR \fBIP\fR アドレスの表示
.SH 形式
.LP
.nf
\fBprtdscp\fR [\fB-v\fR ]
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-h\fR
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-d\fR
.fi

.LP
.nf
\fBprtdscp\fR [\fB-v\fR ] \fB-s\fR
.fi

.SH 機能説明
.sp
.LP
\fBprtdscp\fR は、Domain to Service Processor Communications Protocol (\fBDSCP\fR) リンクに関連付けられた \fBIP\fR アドレスを表示します。引数を指定しない場合、\fBprtdscp\fR は、\fBDSCP\fR リンクの両端の \fBIP\fR アドレスを表示します。\fB-s\fR または \fB-d\fR オプションを使用すると、それぞれサービスプロセッサまたはドメインサイドのどちらかの \fBIP\fR アドレスを個別に表示できます。
.SH オプション
.sp
.LP
次のオプションがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
冗長モード。プログラム内の進捗状況に関する追加の詳細情報を標準エラー出力に出力します。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
ヘルプ。プログラムの使用法の簡単な概要を出力して、終了します。その他のコマンド行引数はすべて無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
ローカルドメインの \fBIP\fR アドレスのみを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
リモートのサービスプロセッサの \fBIP\fR アドレスのみを表示します。
.RE

.SH 使用例
.LP
\fB例 1 \fR両方のアドレスを表示する
.sp
.LP
次の例では、ローカルドメインの \fBIP\fR アドレスとリモート \fBSP\fR の \fBIP\fR アドレスの両方を表示します。

.sp
.in +2
.nf
\fB# prtdscp\fR
Domain Address: 192.168.103.2
SP Address: 192.168.103.1
.fi
.in -2
.sp

.LP
\fB例 2 \fRローカル \fBIP\fR アドレスを表示する
.sp
.LP
次の例は、ローカルドメインの \fBIP\fR アドレスを表示します。

.sp
.in +2
.nf
\fB# prtdscp -d\fR
192.168.103.2
.fi
.in -2
.sp

.LP
\fB例 3 \fRリモート \fBIP\fR アドレスを表示する
.sp
.LP
次の例は、リモート \fBSP\fR の \fBIP\fR アドレスを表示します。

.sp
.in +2
.nf
\fB# prtdscp -s\fR
192.168.103.1
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件T{
system/domain-service-processor-protocol/sparc-enterprise, SUNWdscpu.u
T}
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBattributes\fR(5)
