Arquivotheca/solaris11/usr/man/man/usr/share/man/man7/ibmf.7
'\" te
.\"  Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ibmf 7 "16 Aug 2011" "SunOS 5.11" "Device and Network Interfaces"
.SH NAME
ibmf \- InfiniBand Management Transport Framework
.SH DESCRIPTION
.sp
.LP
The InfiniBand (IB) Management Transport Framework provides the mechanisms for IB management modules to communicate with other InfiniBand management modules such as the Subnet Administration process.  It also provides helper functions such as Subnet Administration Access (SAA) for commonly performed operations.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/misc/ibmf\fR
.ad
.RS 29n
.rt  
32-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/misc/amd64/ibmf\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/misc/sparcv9/ibmf\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel misc module (SPARC platform only).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface StabilityConsolidation Private
_
Availability system/io/infiniband
.TE

.SH SEE ALSO
.sp
.LP
\fBibtl\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Version 1.1\fR
.sp
.LP
\fIwww.infinibandta.org\fR
