Arquivotheca/solaris11/usr/man/man/usr/share/man/man7/SDC.7
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH SDC 7 "25 Nov 2009" "SunOS 5.11" "Device and Network Interfaces"
.SH NAME
SDC \- System Duty Cycle scheduling class
.SH DESCRIPTION
.sp
.LP
The System Duty Cycle (\fBSDC\fR) scheduling class is used for some CPU-intensive kernel thread workloads. Like the \fBSYS\fR class, it cannot be used for user processes.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability Private
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
