Arquivotheca/solaris11/usr/man/man/usr/share/man/zh_CN.UTF-8/man5/grub.5
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. 保留所有权利。
.TH grub 5 "2011 年 4 月 6 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
grub \- Solaris 上的 GRand Unified Bootloader 软件
.SH 描述
.sp
.LP
Solaris 操作系统的当前发行版附带了 GRUB (GRand Unified Bootloader) 软件。GRUB 由自由软件基金会开发并提供支持。
.sp
.LP
GRUB 手册概述（可从 \fBwww.gnu.org\fR 访问）对 GRUB 进行了介绍：
.sp
.LP
简单地说，引导装载程序就是在计算机启动时最先运行的软件程序。引导装载程序负责装入控件并将其传输到操作系统内核软件（如 Linux 或 GNU Mach），而内核又会初始化操作系统（例如，GNU [编辑注释：或 Solaris] 系统）的其余部分。
.sp
.LP
GNU GRUB 是一种十分强大的引导装载程序，可通过链式装入的方式装入各种免费以及专用的操作系统。GRUB 设计用于解决引导个人计算机的复杂性问题；该程序和此手册均与 GNU 计算机平台紧密相关，但将来可能会解决移植到其他平台的问题。[编辑注释：Oracle 已将 GRUB 移植到 Solaris 操作系统。]
.sp
.LP
灵活性是 GRUB 的主要特点之一；GRUB 可识别文件系统和内核可执行文件格式，这使您可以随意装入任意操作系统，无需记录内核在磁盘上的物理位置。因此，您只需指定内核的文件名以及内核所在的驱动器和分区即可装入内核。
.sp
.LP
在 Solaris 计算机中，x86 平台上支持 GRUB。Solaris 附带的 GRUB 软件新增了两个实用程序，它们未在开源分发软件中提供：
.sp
.ne 2
.mk
.na
\fB\fBbootadm\fR(1M)\fR
.ad
.RS 19n
.rt  
用于管理引导归档文件以及更改 GRUB 菜单。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstallgrub\fR(1M)\fR
.ad
.RS 19n
.rt  
从磁盘装入引导程序。
.RE

.sp
.LP
在 Solaris 手册页中对这两个实用程序进行了介绍。
.sp
.LP
除了 Solaris 特定的这两个实用程序之外，在 GRUB 手册中还对 GRUB 软件进行了介绍，可从 Oracle Web 站点获取该手册的 PDF 版本。\fBgrub(8)\fR 开源手册页也可从该站点获取。此手册页对 GRUB shell 进行了介绍。
.SH 另请参见
.sp
.LP
\fBboot\fR(1M)、\fBbootadm\fR(1M)、\fBinstallgrub\fR(1M)
.sp
.LP
\fI《Installing Oracle Solaris 11 Systems》\fR
.sp
.LP
\fI《Oracle Solaris Administration: Common Tasks》\fR
.sp
.LP
http://www.gnu.org/software/grub
